{"reviews": ["Świetny owocowo palony zapach, chlebek, ciemna czekolada. Z wyglądu niemal czarne z ładną ciemno beżową pianą.…", "Bottle from Connolly's Wine Merchants entitled '2021 Merry Christmas Happy New Year'. Pours quite thick black with moderate beige head. Aroma of malt, cinnamon, dark fruits, nutmeg. Taste of malts, molasses, Christmas spice, dark fruit, some roast in the finish with a slight coffee and herbal bitterness. Good beer although could have been even better. I just feel it might be missing something to bring it all together.", "On Tap at Shakespeare's, Sheffield 17/12/2011 Big caramel aroma. Dark coloured and rich on the palate with some alcohol present. Bitter with a hint of dryness in a treacle malt finish.", "Аромат во многом со специами, особенно корица, есть какие то нотки от темного шоколада, возможно немного трав. Цвет почти черный, есть тонкая пенка. Вкус неплохой. Снова наиеки на темный шоколад с какой то ягодой. Уже много специй, включая корицу и присыпку для пироженого, но без сладости и даже с сухостью. Есть травы от хмеля при глотке. В целом приятный зимний эль.", "Bottle at home, 13th January 2022.  Pours a dark brown.  Aroma is spice, cherry, chocolate, malts.  Taste is spice, cherry, quite easy to drink, interesting, medicinal.  Good", "(2021) zapach intensywny, okrągły, toffi, lekka melasa, słody, tostowane nuty, dobrej jakości praliny, słodka czekolada, lekkie czerwone owoce, w tle dobrze ułożony alkohol. całość dobrze zgrana. kolor czarny, pod światło ciemnoczerowny, klarowny. piana brązowa, średnio obfita, mało trwała. w smaku intensywne, ciemno palona kawa, nuty palone, czerwone owoce i jagody, żurawina, goji, wytrawne śliwki, drewno, lekkie nuty wytrawnego rumu, przypalony tost, bardzo wytrawna melasa. całość bardzo dobrze zgrana. goryczka dość spora, palona, kawowa, alkoholowa, czysta. w ustach lekko rozgrzewające, ale zaskakująco pijalne. nasycenie wysokie", "2021: black; roasted malt aroma with spicy notes; dry, roasted malt flavor with cinnamon and nutmeg spice notes; some raisin and dark fruit notes; medium bodied", "1.5 bottle @ home\nQuite a Christmas feel on the nose. Definitely sweetish with some bitter herbal undertones. Medium-bodied, bitter towards the end.", "Bottle poured into a shaker. Cola brown color with a fizzy tan head. Aroma is chocolate, cinnamon, caramel, nutmeg. Initial taste is roast, cinnamon, spices, herbal. Fades to a pepper. Body is light-medium. Carbonation is sharp. Nice.", "Dark pour with a thin tan head. Malty aroma with berries and Christmas cookie spices on the tongue.", "Kalendarz adwentowy 2021/12 Edycja piwa 2021\n\nDużo karmelu i suszonych owoców (od jabłka, przez morele po śliwki), mieszanka przypraw jest trudna do zdefiniowania, trochę odmienna od naszych, bardziej ziołowa i wytrawna niż korzenna... Znam ten smak z jakiegoś bodaj Hiszpańskiego piwa, ale nie pamiętam nazwy :( Piwo raczej wytrawne, acz są słodkie akcenty. Jak na styl spora, ziołowa goryczka.", "Dark beer, thick head. Smells malty with spices. Cloves and cinnamon. The Christmas smell. Flavour follows suit. Loads of spice up front, malt, some caramel, a hint of chocolate. A touch of boozy warmth. Very drinkable. A proper Christmas beer.", "barwa czarna. piana kremowa. aromat ciemne slody przyprawy. smak piernik, kawa, ciemne słody. wysyceni ok. goryczka srednia", "Pić świąteczne (i to jakie!) piwo w maju to trochę profanacja, ale dopiero co nabyłem. \nCzarne. Bez prześwitów. Piana spora, jasno brązowa. Dużo średnich oczek. Stabilna. Przy drugim nalaniu drobniutka. Aromat korzenny, piernikowy. \nCzekoladowo chlebowe. Lekki kawowy kwasek. Delikatna goryczka. Bardzo starannie dobrane dodatki. Żadnych indywidualnych harców. Wszystko ze sobą pasuje, nic nie wystaje. Chyba najlepsze ze świątecznych z jakimi miałem do czynienia.", "On tap at Bigby's Pour House in Addison, IL. served to a snifter showing a black/brown hue, with a finger's width of light tan froth, and doily-like spots & spray as lacing. The aroma was roasted, cocoa, slight dark dried fruit, a touch of treacle, and some dryness to the nose. Medium+ bodied, with low carbonation, the taste was similar notes, with decent alcohol presence, and low toast & roast bitterness. Kind of a stout-like brew, without the hefty maltiness.", "Doft av mörkt bröd. Mörk vätska med tjockt beige skum. Smak av vörtbröd, jäst, choklad. Fyllig, lätt bitter smak.", "Dark brown colour, small head. Aroma is cocoa, some clove. Light sweetness, light bitterness. Light body, medium carbonation. Easy to drink, good.", "Dark brown. Thick tan head. Aroma is sweet malt. Taste is sweet malt, brown sugar, sweet with a little bitter. Ok.", "Aromat piernikowy, przyprawowy. W smaku bardziej w kierunku black ipa. Fajne palone z wyraźna goryczka. Czuć też świeżość i ziołowość. Dobre.", "Mörk mahogny med tunt fint beige skum. Doftar maltigt, lite kryddigt, muscovadosocker och toffé. Smaken fyllig, söt, lite kaffe och lakrits. Eftersmaken lite söt och besk, kaffe och lakrits, kryddig på slutet.", "Liquide marron foncé avec mousse courte. Nez malté caramel et légèrement épicé. En bouche, c'est une attaque légèrement torréfiée sucrée qui débouche sur une belle amertume de fèves de cacao torréfiées avec une impression très soyeuse dans la bouche. Il s'agissait ici d'un release de 2017.", "Dark brown with thin creamy foam\n\nCaramel, coffee, sweet malt, darker milk chocolate, pine and slight sweet cocktail Sherry\n\nCreamy, tangy, dark coffee with sugar, nice malt and some citrus note.  Toasty, with long slight hoppy finish.", "2020: Pretty Coke-like with sweet malts and spices. Medium carb. Some light bitter dark chocolate. Not overpowering.", "7.0% black in colour with a nice brown head, a sweet plum aroma the taste is bitter sweet with a hint of licorice.", "Väl utjäst IPA. Karamell knäck o lite pomerans men ganska avhuggen. Karaktär av gamla skolan ale men med tendens åt jul och dess vört. Vört grov o kornig. Bitterheten gör ölet, den sitter som en smäck långt efteråt.", "Copenhagen 3/12 2020. 35,5 cl bottle from Meny, Østerfælled Torv, Kbh. Ø. As “Merry Christmas Happy New Year 2019 Ale”. Big pine tree on the label. \n\nPours clear but very dark brown with a red hue. Small off-white head. Settles as thin and flimsy remnants of foam unable to cover the surface of the beer. No lacing. \n\nAroma is medium intense with a sweet slightly spicy odor mingling with light tart notes. Toffee and caramel. Hints of nuts. Light scent of tart berries. \n\nMedium strong carbonation. Slightly thick, oily, lively and tingling texture. \n\nFlavor is medium intense with a fairly strong sweetness followed by a moderate bitterness. Aftertaste is sweet and lingers for a while. Finish is caramelly. \n\nIf a Christmas beer is all about being toffee-like and pleasant this one hits the mark.", "2019 Vintage bottle. Sweet and rich aroma of molasses, brown sugar and dark fruit. Pours with a dark brown colour and mid-sized light brown head. Minimal carbonation. Malt forward flavour with notes of spice, dark chocolate, pepper and dark fruits. Full bodied. Sweet malt finish. Good Christmas ale.", "A festive brew and pretty strong. I like it more than the regular anchor steam beer. Slight malty slight hoppy smell. Smooth like the other steam beers but with more bitter malty bite.", "2020 / 7.0% / 40IBU / Pours a pitch black with a small foamy tan head. Moderate aroma of roasted malts. Medium body with some oily lacing. Smooth with a slightly dry dark cocoa taste and some light spices. Enjoyable with a pleasant lingering aftertaste.", "A 355ml bottle, 2018 vintage, 6.9ABV, from Little Leeds Beer House a year ago & stored in my cellar. Pours brown with a white head. Aromas & tastes of caramel, licorice, spices, herbal, pine & malt. Medium body. Spiced malty finish. Very enjoyable", "355 ml bottle, 2019 Vintage. 6.9 % alcohol. Dark reddish amber colour with a thin lightly tanned head. Sweet aroma with caramel malts, spices, liqourice, fruits, herbal hoppy notes. Taste is sweet. Medium bodied. Slightly drying finish with spiced notes and hops. Nice Winter Warmer.", "Bière qui était auparavant en american strong ale, passé maintenant en \nflavored, ce que doit être assurément une christmas.\nLe niveau abv de mon exemplaire intitulé \" merry christmas 2017 \", \nétait de 6,7 % .. ce qui est un peu mieux que le 5,5 indiqué sur le site,\nmais ce qui n'en fera jamais néanmoins une american \" strong \" .. on est ok.\nCette édition était la 43 ème de \" our special ale \", différente chaque année.\nAu menu malt d'orge et de blé. \nEpices certainement puisque \" flavored \", mais ce n'est étrangement pas \nindiqué sur l'étiquette.\nMon exemplaire allait donc sur ses trois années de réalisation.\nCouleur marron intense aux reflets noir, et opacité forte.\nMousse brun moyen, crémeuse, stable à 3 mm.\nArômes de cannelle, bois de cèdre, bois de santal.\n1ère bouche veloutée, à l'entame très épicée, à l'équilibre aléatoire.\nArrière-bouche qui introduit poivre blanc et pointe de muscade.\n2ème bouche qui n'est pas du tout à l'équilibre, on est dans l'excès.\nArrière-bouche qui parvient quelque peu à niveler, mais par le bas !!\nLongueur qui continue ce nivellement, sans grâce particulière.\nJambes finement huileuses, longues.\nLevure correcte.\nAlcool beaucoup trop faible pour une christmas, bien que l'âge l'aide un rien.\nFinale sans étonnement.\nCONCLUSION : n'oublions pas que cette bière est un \" one shot \" et donc\nles cotes rassemblées sous le même nom n'ont absolument aucun sens ..\nOn ne peut tirer aucun enseignement de pareille statistique !!\nUn ami avait apprécié l'édition 2016 .. comme quoi, les années se suivent \nmais sans se ressembler ..  (6/3/5/3/9)", "Deep copper colour, tall and durable foram. Sweet smell of roasted bread. Distinc spicy note on the tongue, anis stands out. Very deep, roasty, melanoidine malty taste. Dried fruit deepen the sweetness and give it a noble taste.", "Bottle @ DØE Køge. Appearance: pours clear brown with ok off-white soapy head and lacing. aroma/taste: barley, bread, brown sugar, light dried fruit, light liquorice, light cocoa, grass, light citrus, light cinnamon and light spicy notes. palette: strong malty and light  spicy aroma, average carbonation, medium body, medium sweetness, balanced by a light to medium bitterness, average duration and a watery texture. Overall: tasteful winter ale", "2018 edition. Brown color, beige head. Aroma of anis and pine. Quite bitter taste, with notes of anis, roasted barley and liquirice. A bit to bitter for a Christmas ale, lacks sweetnes.", "Parece una Barley Wine, pero más suave. Notas de palo cortado en nariz y de madera y dátiles en boca, con un punto ácido claro y un amargo algo astringente que la equilibran muy bien. Carácter cálido. Interesante.", "mørk brun, treaktig, tørket frukt, krydret..................................", "Overwhelming banana aroma, spices gives a feeling of artificial flavour. To sweet.", "1.5 litre bottle of the 2019 Edition with friend in Newport Beach. Pours a chestnut brown with a very thick, light brown head. Aroma of caramel and spices. Taste is caramel with notes of nutmeg and cinnamon with hints of ginger and orange. Good bitterness to offset the sweetness of this delicious Christmas Ale. Mouthfeel is OK, but a little thin. This is a pleasant and well-made beer.", "2019 edition. Dark amber or even coppery beer with nice beige head. Aroma of caramel, some hops (?). Very malty, moderately sweet with a bit bitter aftertaste.", "330ml glass bottle dated as best before xx/xx/xxxx. From Whole Foods Market, Kensington. Served having been out refrigeration for about 15 minutes into a tumbler. \n\nDeep dark brown, almost touching black. A small finger and a half tan head. Dissipates quickly. \n\nThe aroma is heavily malt driven, molasses, caramel, confectioners sugar and dark dried fruit. Some limited apple. \n\nThe taste is sweet and heavily malty. Dark fruit and molasses. Easily drinkable, similar to a English strong ale. Fruit cake-like. Flavour balance not present but does not diminish the enjoyment.\n\nSweet in the mouth. Lingering malty, molasses tastes. An unexpected amount of carbonation that is fairly lively. \n\nOverall, from the small haul of holiday ales I got this festive season, this one is my favourite but also the simplest. A very good beer.", "Bardzo fajnie przyprawowe, ale nie słodkie - wytrawne. Sporo suszonych owoców, lekko może karmel. Pełne, gładkie, nisko wysycone. Ale przede wszystkim przyprawowe i wytrawne.", "Courtesy of Wojtek from @Carmen24. British ale notes, caramel, molasses, nice dry notes. Easysipping post-Christmas table decoration.", "24-12-19 // bottle at home. From Maruhn. Rich malty. Toffee. Dried fruits. Nice.", "Brown color, medium sized beige head. Aromas of caramel, dried fruit, wood, nuts and candi sugar. Taste of malt, dried fruit, alcohol, nuts and brown sugar.", "Sample from bottle at Holiday Beer Fest. Poured brown/dark amber, off white head. Aroma of spice, caramel, ginger. Taste was mild bittersweet, caramel, hops, spice.", "Color negro con reflejos rojizos, opaca. Espuma marfil de dos dedos de espesor y corta retención. Aroma a maltas tostadas, ceniza, leve vino tinto que se va intensificando conforme gana temperatura. Sabor en esa línea, el vino parece más afrutado, como con frutos rojos no bien definidos, leves notas herbales, final medio dulce y ligero amargor herbal, medianamente alcohólica al atemperar. Textura semioleosa. Carbonatación baja.\n\nEsperaba bastante más, hacia la segunda mitad de la cata pierde mucha, casi toda, la chispa, se vuelve plana y aburrida. También esperaba más cuerpo.", "Color marrón my oscuro, con destellos rojo rubí a la luz, opaca. Dos dedos de espuma blanco marfil con buena retención. Aroma discreto a malta tostada, ligeros madera quemada, vino tinto y coca cola. Gusto a malta tostada, ligero pino, notas de vino tinto y madera, amargor medio. Cuerpo medio/bajo. Cerveza con muy buen aspecto pero que se queda corta en nariz y boca, me esperaba mucho más.", "Bottle. Bier Huis, Ossett. 2019 version. Definitely had this before. Must have been pre my RB days, so 2012 or earlier. Who cares? Clear, deep ruby red. Fine halo of light tan. Nose has Christmas cake fruits. Treacle. Notes of fudge chocolate truffle. Taste is dry, vinous and fruity. Light chocolate bitterness. Medium body. Fine, brisk carbonation. Moderate bitterness to finish, with the cake fruit thing lingering nicely.", "Keg at the Star and Garter, Bromley. Copper coloured pour with a beige head. Bonfire toffee,dates,figs,red apple, very nice nose. Taste of red apple,nuts,sweet spice, dried fruit,toffee. Tasty Christmas brew.", "Light brown color with a malty and spicy aroma.  Taste is subtlety sweet with a floral crispness, some winter cookie spice.", "0,355 l bottle from Systembolaget Nödinge. Beer is ok with some flavours in aroma and taste.", "#3515, vintage 2018\nHazy, copper, small white head. Aroma of spruce, juniper, alcohol, needle leaves, nougat, pralines, raisins, almonds, liquer. Taste is neutral to dry, lightly bitter, caramel, juniper, needle leaves, resiny, baked orange, dark chocolate, pralines, noughat, dark fruit, raisins, pomegranate, touch of vanilla, licorice. Medium to fuller body, high carbonation. \nVery rich flavored winter ale. Perfect.", "Pours clear dark mahogany with a three finger, beige head.  Aroma hops, molasses and light roast.  Taste is brown sugar, moving to light nutmeg, roast and hops.  Finish is nutmeg, roast and hops.", "Bottle 0.355l, vintage 2018. Lightly cloudy, copper colored. AROMA- dark fruit jelly, dark berries, dark grapes, pine, Hašlerky. FLAVOR- dry, moderately bitter, Hašlerky, pine, dark fruit. Medium to fuller bodied. \nVery good.", "Bottle from Systembolaget. Pours a amber colour beer with a medium head. Malty with notes of dried fruits, cinnamon and ripe banana. Dry finish.", "Couleur rousse très sombre, carbonation légère, bulles fines qui disparaissent vite.\nSenteur miel, thym, épices, herbacées avec de légères touches de réglisse sèche.\nPalais rond avec une pointe de caramel, parfums de résineux, fruits rouges, la réglisse sèche se précise, malts torréfiés avec une forte amertume en arrière plan, goût fumé, légère pointe de chocolat amer, arômes de muscade, de cannelle et de vanille.\nAssurément complexe, elle est agréable à boire en ne laissant pas présager un quelconque degré d'alcool, parfait pour accompagner un plat de viande rouge mais manque toutefois du petit plus qui en fait une bière d'exception, pas le meilleur cru qu'on pourrait attendre d'une brasserie comme Anchor.", "Bottled 0,355L. Dark amber/reddish color, moderate creamy white head of medium duration, lively and bubbly impression. Moderate heavy and sweet malty aroma, light aged and vintage fruits aroma, red riped fruits, alcohol. Moderate sweet and heavy malty palate, oily texture, warm and mellow impression, soft carbonation.", "Keg at the Euston Tap in 2013. Dark brown with an offwhite head. Aroma of citrus, herbal notes, coriander and brown sugar. Some roasted malt notes in the flavour, with resinous hops. Really nice bitter linger.", "12 oz bottle from 2018 season pours a clear chestnut brown with moderate beige head that lingers and leaves a bit of lacing.  Aroma is unusual:  anise, cloves, and some berries are all present.  Taste is slightly sweet and spiced, with some bitterness in the finish. Body is medium with a slightly syrupy mouthfeel.  Yes, it's weird to try a Christmas beer in mid-August, but this one aged well and is much easier to drink than Swedish glogg.", "espuma beige bastante cremosa que permanece bien, color marrón rojizo con burbuja muy fina brotando durante la cata, aroma dulce en nariz, sabor con notas maltosas con regusto agradable.", "Dark brown pour. Tones of licorice, alcohol, roasted malts. Not sure what to think of this beer, it tastes like ale - stout cross over", "Edycja 2018.\nWygląd: Barwa miedziano - rubinowa, przejrzysta z lekką opalizacją. Piana średniej wysokości, drobnopęcherzykowa koloru ecru, opada do ostatniej warstwy nie pozostawiając lacingu. \nAromat: Słodycz słodowa, miód, melasa, jasne toffi i karmel, tosty, skórka chleba oraz waniliowy akcent. Estry w postaci jabłka, nuty kandyzowanej skórki pomarańczy. Całość uzupełnia kwiatowość chmielowa z lekkimi iglakami, cytrusami.  \nSmak: Niestety w porównaniu do aromatu dosyć pusty. Na pierwszy plan delikatnie wysuwa się chmiel, tuż za nim słodowość i estry. W ustach półwytrawne, półpełne, zwiewne. Treściwość w stronę niskiej, wysycenie niskie. Goryczka średnia, żywiczna, średnio - krótka. Finisz wytrawny, żywiczny z nutą skórki jabłka. Pojawia się również delikatne ciepełko alkoholowe. \nOgólnie: Przyjemny aromat, w smaku niespodziewanie wytrawne i zarazem pustawe. Całość bez specjalnie charakterystycznych nut.", "Edycja 2018. Śliczna pianka. Słodki, słodowy aromat z nutami chmielowymi w klimatach cytrusów, białych owoców, iglaków. Niskie nagazowanie; piwo wodniste i gładkie fajne. Goryczka spora, ale zbalansowana - przyjemna. Troszkę brakuje smaku: poza goryczką jest lekko słodowo i chmielowo. Cytrusowo.\n\nPodsumowanie:\nNie jest to typowe Xmas ale - ale piwo jest bardzo fajne.", "Bottle.  2012 edition, opened 2019.  Dark chestnut color with a minimal tan head.  Bubbly.  Very sweet nose with spices and molasses.  Similar flavor. Not terribly interesting, falls flat.  Could be the age.  Not sure.", "01/28/2018 7/4/8/3/15 3,7/5 0,355l bottle, Vintage 2018, from Damian Bottle Shop, Pours almost clear dark amber to brown liquid, medium creamy tan head, Aroma: typical citrus resiny \"Anchor\" nose, lemon peel, slightly spicy, subtle caramel, slight roasted malt notes, earthy, Taste: light to medium sweet, medium bitter, light sour, lemon peel, citrus, resin notes, roasted malts, slightly caramel, spices, herbal earthy finish, Palate: medium body, soft to average carbonation, slick mouthfeel, long earthy lemon peel roasted bitter aftertaste, Overall: very good, although expected slightly more. Enjoyed.", "12 fl oz bottle, 2016 Xmas Ale. Pours dark brown. Raisin, cinnamon, clove, anise, Christmas pudding, dried cherry, dried fig, prunes. Medium body. Tasty.", "ola del flasski best indas handi very nicci des klostrasis derra weltis van dfes kluser", "De botella en el Irlandés (edición 2018). Color caramelo tostado, notoria turbidez, espesa corona de espuma blanco marfil. En nariz sorprende el maravilloso olor resinoso, fresco y floral, combinado con recuerdos dulzones a especias, ciruelas y uvas pasas. En boca es carbonatada, se detecta con cierta facilidad el alcohol, toques a malta tostada y un amargor muy curioso, que le da un toque redondo y fresco, la resina muy presente. Excelente winter ale.\n\nEdit versión 2019 en botella: aroma más tostado y menos resinoso que la versión anterior. En boca es menos resinosa, más tostada y chispeante. Sigue conservando la esencia de la Christmas Ale. Muy rica.\n\nEdit versión 2020 en botella: una vuelta de tuerca completa, muy oscura con bonita corona de espuma beige. Aromas a regaliz y especias, recuerda al Jäggermeister. En boca es sedosa y licorosa, fuertes sabores a regaliz, especias tipo clavo y nuez moscada, hollejo. Retrogusto a regaliz. Rica.", "Pecan, caramel nose. Clear tea, medium head. Toffee, pecan, subtle hint of coconut. Medium body, easy carbonation.", "This years version of the Christmas ale has to be among the best.  For 2018 we have a very dark amber/light brown brew with a decent head that hangs on.  The aroma is spice with some burgundy wine but the flavor is all over that map with some fruit, spice, pine, and more.  Very interesting brew this year and hope they keep this up for years to come. (some of the ones in the past was not all that great.)", "It pours light brown with deep reddish hues. The head is tan with excellent head retention. The aroma starts off with a bit of spiciness and toffee. As it warms there are some dark cherry notes. There are also additional pine notes in the background with bread crusts. The flavor is highlighted by the spices and the malts. The malts resemble toffee and bread. There are some piney notes in support with dried cherry. It has a moderately full body with a somewhat dry finish. Overall, it is a malty and spicy beer just perfect for the New Year.", "A very nice Christmas ale. Full of dark rich malt, a little fruitiness and spice. Feels very warming on a winter’s night.", "Pours clear brown with beige head. Ok persistency.  Malt dominates the aroma. High bitterness with additional spices. Piney, Resiny hop flavor, a hint of spices in the aroma/flavor. Base beer is closest to American strong ale with some spices. A good Xmas beer", "I only get around to this brew every few years.  2018 is especially good.  Wonderful balance of malt, spices and hops.  Just a great fireside supper.", "bottiglia 355 ml 2018 edition, 6.9 % ABV, schiuma fine pannosa beige persistente, color mogano limpido, al naso lieviti spezie zucchero di canna pino note erbacee, in bocca lievito caramello spezie zucchero di canna, lieve acidula, corpo rotondo, carbonazione moderata, amaro accentuato piacevole e lungo nel finale. Una birre delle feste fresca molto piacevole. 27.12.18", "Aromat żywica, estrowosc. Smak troche czerwonych owoców, mało słodyczy. Fajne", "Pours muddy brown with a thin tan head. Aroma of malt mixed with a variety of spices. Taste has a malt backbone accented by herbal notes, sage and grassy notes. Palate includes a mix of spices, as though it is a very light take on a belgian. Interesting beer.", "Bottle left by BelgianBeerGal for us to enjoy at Christmas. Hazy brown. Spices, raisins, some toffee. Not bad.", "2018:\nAroma: caramel, toast, piney, herb, some orange peel\nAppearance: clear dark brown with a one-finger tan head.\nTaste: caramel, toast, pine, nutmeg, some citrus, medium-high bitterness, medium-low sweetness.\nPalate: medium-high body, medium carbonation, dry finish, medium-high alcohol sensation\nOverall: spicy flavors blend in well. nice choice for a winter night.", "Nice, bright aroma, pine, sweet malts, fruit, and spices. Hazy muddy brown, which changes to a dull ruby with a back-light.  Relatively short, light tan head,  dropping fairly quickly, leaving some stringy lacing and a very bubbly cap and ring. Initial taste is dry, but it becomes sweet right away. Feel is medium. A nice flavor; lightly spiced, tastes like a Christmas tree (fresh and airy, but not resiny), a slight bitterness in the middle and finish. The overall taste is nicely malty with a dry finish and aftertaste. Light touch with the spices, flavor of  fruits, with also a light touch with the hops. Piney in the evergreen sense, less so in the resin sense.", "I preferred last years offering to be honest,but this is still nice.Quite sour tasting,but decent,and anchors signature bubblegum flavour stays true.", "2018 versie : Zoetig. Kruidig, zoethout/ziltig. Wat karamel zoet en vol genoeg. 2017 versie er achteraan gehad....die is veel beter. 3.5 punten voor deze.\n\n2017 versie: Kruidenbitter achtig. Vol... spicy. Beetje koffie en choco. Deze geef ik 4 punten! Zeer goed! Veel voller en meer roasty.", "12oz bottle.  2018.  Pours a bronzed brown with a tiny off-white head - nice color but a weak head/head color.  Aroma is caramel, nuts, spruce, fig, licorice, toast, some cocoa, slight bubblegum, and a little berry.  Taste is caramel, nuts, dark fruit (fig with just a little bit of plum, I think) licorice, light pine, earth, roast, and toffee.  A little bitter nutmeg lingers.  Medium body.  Moderate+ carbonation.  Sticky, slightly syrupy mouthfeel.  Not into the taste on this one, but the aroma is very nice.  ABV is listed as 6.9% on the bottle.", "edycja 2018 Zapach: cytrusowe, żywiczne, cukierkowe, estrowy, lekko kwiatowy, umiarkowanie intensywny i na świąteczny ALE dobry. Smak: czerwone owoce, przyjemna umiarkowana dosyć długa fajna goryczka, lekka karmelowość, nuta palona i lekka cytrusowość na finiszu. Całkiem przyjemna piwo świąteczne bez męczących goździków czy innych nachalnych dodatków.", "2018 version, 355ml bottle from Cotteridge Wines. Pours clear dark copper brown with an off white head. Aroma: rich malts, caramel, brown sugar, herbal hints. Taste: moderate to heavy sweet & light to moderate bitter, rich malts, dark fruits, candy sugar, christmas spices, hoppy hints. Medium body, average carb, lightly warming sweet-ish finish", "Bottle, Anchor Brewing Merry Christmas Happy New Year 2018, 6.9%. Color: Clear copper, off-white head. Aroma: Malt, caramel, herbal notes. Taste: Malt, caramel, sugary, subtle notes of dark fruit, notes of herbs like coriander and nutmeg. Floral notes. Slightly candy-like but not in a bad way. Medium sweet, moderate bitter and slightly sourish. Somewhat more bitterness at finish, with hints of coffee. Smooth mouthfeel. Below average carbonation, above medium body. Pretty easy drinkable, yet a nice winter warmer. Let Christmas come...", "12 oz bottle, labeled \"Merry Christmas and Happy New Year\". Smells of malt and coffee. Dark brown in color. Tastes of malt, coffee, with a touch of bitter. Has a chocolaty and coffee finish. Kind of like a stout, but not as thick.", "Taste was nutmeg, cinnamon, dark fruit, malty, raisins, and bready. Dark reddish brown in color. Smells of cinnamon and nuts.", "Bottle from Wegman’s, clear dark orange brown.  Caramel aroma, toasted malt and dark fruit taste.  Malty finish with hops underneath.", "2018 edition 6.9%. Perfume aroma, which reminds me of a fragrant fruit such as Yuzu.  The flavour is rich, purfemy, malty and has a lot of caramel as well as coriander, notes of cinnamon and nutmeg.  Very sweet,  sugary finish. This is a heavy, quite fruity ale which justifies its winter release", "Miedziane piwo o średniej pianie, która pozostaje do końca w formie pierścionka przy brzegu szkła. Aromat karmelowy, leśny, trochę truskawek i cytrusów. W smaku lekko karmelowe, przyprawowe, leśne. Goryczka średnia. Ogólnie całkiem udane piwo świąteczne,ciekawsze niż większość, gdzie tylko przyprawy czy miód lub ewentualnie czekolada.", "Bottle pour. Caramel and prune aroma. First sip has notes of grape and bubble gum. Fades quickly to bitterness and to me is a overboiled but that is Anchors approach. Once the bitterness goes the malty aftertaste is good.", "12oz bottle. 9/24/18 bottle date. Appearance:    deep brown with ruby red highlights. Clear, with great lacing. \nAroma:  Rich toasted malt and bread crust and some light nuttiness. \nTaste:  Strong toasted malt and bread crust maltiness. Caramel shows up on the backside with a touch of tartness, almost black cherry like. Bitterness is moderate. \nMouthfeel:  Medium bodied with a moderate carbonation. \nFinish:  Malt forward on the finish with some lingering toast, along with some light tartness\nOverall:  A Malt forward, toasty, caramel flavored ale with a heavier body for a nice winter warmer type flavor without the high alcohol. Beautiful ruby red color", "An american, brown / black Spice Beer with light brown head. Aroma is caramel, light liqourice, light coffee, light berries. Taste is bitter. Starts sweet and dry finish.", "Aroma of caramel, malt, fruits and hints of chocolate, dried fruits and pine. Dark brown with a tan head, Meium + sweet and medium bitter. Medium + body with average carbonation. Overall a OK brew. A bit unbalanced, but still fairly drinkable.", "As Anchor Brewing Merry Christmas Happy New Year 2017, 6.7% ABV.\r\n\r\nBottle, 0.355l. Deep ruby, almost black pour. One finger creamy brown head, long lasting. Thick lacing as it goes down. Strong malty herbal nose, caramel, cake, notes of cocoa and herbal liquor.\r\n\r\nMedium body, soft carbonation. Regular texture, slightly prickly. Roasty bittersweet taste and aroma. Aroma of caramel, toffee, candy and cake. Roasty. Herbal liquor, slightly boozy. Bubblegum aftertaste, drying mouthfeel. Medium to long finish, mildly bitter and dry.\r\n\r\nOverall, quite tasty. Rich and fairly complex, this is one quality brew.", "barwa ciemnego bursztynu. W aromacie piernikowe przyprawy, cynamon, goździki. W smaku bardzo ziołowe, przyjemne", "Malty, sweet, slightly roasted, dark fruit, some alcohol. Pitch black color with small sized brown head. Sweet malty taste, biscuity, cake, boozy. Medium body, soft carbonation. Nice chocolate aftertaste. //bottle from Pivoteka, 2017 version", "Wersja 2014\r\nPiana drobna powoli opada, zdobi szkło. Kolor ciemny z mętnymi rubinowymi prześwitami. Aromat świeże czerwone owoce truskawka granat, nuty korzenne cynamon, anyż, piernik, przyjemny. Smak, wytrawne, czekolada, przyprawy korzenne aż ostre w smaku. Generalnie dziwne zaskakuje wysokim odfermentowaniem i brakiem jakiejkolwiek słodyczy. Dobre, pachnie ciekawiej", "2017 version. Bottle from Pivoteka. Lost rating from April 13th. Very dark brown body, blackish, with a lasting tan head. Full malty aroma, sweetish and nutty. Malty taste, again dry and full, light bitterish touches, just vagueliy herbal/piney, ending a bit watery. Okay beer, expected more.", "Version 2017.\r\n\r\nRobe noire surmontée d'une belle mousse beige bien persistante et crémeuse. Arômes, fumés, réglisse, café, fruits noirs, épices. Goût fumé, chocolat, café, réglisse, épices, fruits noirs. Les épices (je dirais canelle, muscade, clou de girofle) restent en bouche avec le fumé. Texture plutôt crémeuse, carbonatation fine.\r\nBon dosage des épices, bonne bière de Noël.", "Version 2017 dégustée, une bière très sombre avec une mousse couleur caramel. Des parfums légèrement chocolat et des saveurs torréfiées, un peu amères, très agréables en bouche tout comme la texture. Je pensais presque boire un stout.", "This is sort of like a dark lager, but has some characteristics of a porter and dunkel. Appears a dark dark brown, but isn't very heavy. I am tasting chocolate, caramel, and coffee malts....maybe a little toffee too? All those nice holiday spices with what appears to be spruce, but only mild. A light hop finish to balance it all out. An all-around solid brew.", "Mörkt brun, nästan svart. Plommon i doften. Choklad, rostad säd i smaken. Rätt torr, måttlig beska på slutet.", "Arômes d'épices et de chocolat léger. Robe sombre et mousse légère et persistante. Attaque sur des épices, du caramel et du réglisse. Langueur légèrement alerte sur du houblon. Pas mal !", "From 16 ounce Prowler bought at Liquor Shed bought at Liquor Shed in Casper. 2017.\r\n\r\nPours near black, tiniest bit of red hues. Great head of foam with good lacing. \r\n\r\nSmells of nutmeg, almost like what you get with a pumpkin beer, bananas, cloves, roasted malt.\r\n\r\nTaste has the nutmeg, cloves, bananas, kinda roasty, very low level of bitterness. Very tasty. \r\n\r\nGreat mouthfeel, easy drinking, excellent from this mini Growler. Bottles won't be coming so I am glad Jacob got some and put it on the Growler station.", "Bottle. Pours very dark ruby with a minimal head. Aroma of Christmas spices, gingerbread. Taste is dry with a noticeable bitterness. Flavors slight red fruit, orange peel, slight dark malt? Medium body, slick texture, high carbonation.\r\nNah, it just didn't do it for me, though I'm not a fan of the style, I guess.", "Arômes de caramel, vanille, réglisse rouge.  Robe brune foncée et opaque. En bouche, légère amertume liée à la torréfaction.", "Aus der Flasche 2016-01 getrunken. Nicht wirklich meins, spannend war nur der deutliche Kakaogeschmack.", "Talking of the 2017 version, it tastes very similar to Anchor Porter, to me, except a little stronger. The extra strength gives it a bit more alcohol on the nose. It has wheat in it but I can't detect that difference from the porter. It's an intense drink, this, with strong hoppiness added to the alcohol, yeast, and coffee flavours. There's a touch of sweetness in it, but not enough to stop it being a harsh one, in my opinion. Good but challenging.", "Pours a very dark brown, almost black with a big, mocha head. Aroma is sweet milk chocolate, some subtle spice. Taste is some sweet chocolate, spice up front, leading to an even spicier middle, some fruitiness, ending lightly bitter Medium to low carbonation, medium to full bodied. Very nice!", "2017 version at 6.7% abv. Pours opaque black with a huge light brown head that shows good retention and very nice lacing. Aroma shows a clean mix of roasted malts and coffee, slight toffee and spiciness. Overall not so complex, but very clean and quite strong. Taste follows the aroma with a good balance of sweet and bitter notes and a slightly bitter, dry finish. Roasted malts, coffee, and a plesant warming/spicy feel. Medium bodied with low to medium carbonation, overall quite soft in the mouth. In short, a well made robust porter with a delicate warming/spicy feel. Nice one.", "Feb 2018 - 355ml bottle at home in Richmond as 'Anchor Brewing Merry Christmas Happy New Year 2017', 6.7%, BB Sep 2019. Pours an opaque black with a huge foamy brown head that leaves thick streaky lacing. Aroma is yeasty and metallic and also cocoa, little fudgey, milky coffee, chocolate digestive biscuit. Body is rounded, smooth with soft carbonation. Taste is malty, dates, raisins, little metallic, yeasty, breathy figs and nutmeg, mixed Christmas spice. Carbonation is soft in mouth but a little gassy on the stomach. Quite a tasty beer on the whole. Good. (7-4-6-3-14=3.4)", "Fles 35,5cl thuis. Bitter, redelijk krachtig maar ook zoettonen, pruim, licht drogig. (5-2011).", "2016 version. Sweet aroma of spices. A lot of stuff in the kind of candied tangerine, ginger bread, cinnamon rolls and cardamon. Very pleasant at all. Dark brown-ish in the glass with a medium head. Taste is semi dry with notes of orange fruit peel, some albedo, spicy back with cinnamon. Finish is bit roasty, beer is minimal overcarbonated, but still different than the other xmas beer stuff.", "Bottle, 355 ml, courtesy of JFK10000. Shared with him and Max. Dark brown, medium beige head. Chocolate, bit spicy, caramel, sweet, medium bodied. Bitter finish.", "2015 bottle. All reviews lately are 2016 and later. No date on bottle, except for the 2015 on the label. Shame. If it’s different each year then my thoughts are redundant. It’s pretty good. That’s all I got.", "Czarne z czapą beżowej piany. Dość duże wysycenie, piwko syczało sążnie przy nalewaniu. W aromacie mix biszkoptu, anyżu i mieszanki przypraw. Gładki posmak z nutą przyprawowej ostrości na finiszu, pozostawia po sobie garbnikowy posmak, będąc jednocześnie słodkawe.", "Sunday, January 14, 2018. 2017 Bottle, 355mL. 6.7%. Purchase (\"La Cervoiserie\", @Poitiers, FR). Home. A black opaque beer with a big beige foamy head ; average retention ; ok lacing. Roasted, cinnamon(+), caramel notes, prune notes, some licorice. Light sweet, light dry refreshing spicy, bitter note. Medium body, thin texture, soft gaseous, dry refreshing spicy finish. Overall, correct ; slightly disappointing.", "Anchor Christmas ale fra 2014, drukket januar 2018. Har altså ligget 3 år i kælderen. Vinøs, næsten sherryagtig i næsen, lakrids og blomme. Går igen i smagen, sammen med lidt grannål fra humlen. En dejlig juleøl der ikke er spor klistret eller sød. Flot øl. \n\n---Rated via Beer Buddy for iPhone", "Aromas of dark dried fruits (plum, black currents); winter/pumpkin pie spices (nutmeg,cinnamon, clove, allspice) aromas are clear but not overwhelming.\r\n\r\nColor is black; even the edges are very dark brown. Medium sized tan head. \r\n\r\nTaste is fairly dry and fairly bitter. \r\n\r\nMedium bodied; carbonation is somewhat lively. Finish is fairly long, with dried fruit, winter spices, carbonation and a dry finish.\r\n\r\nOverall this is a pretty good beer. It has some complexity with spice, roasted flavors, dried fruits; the overall dryness and lively carbonation work well with beer.", "Aroma: spicy and herbal, nutmeg.\r\nAppearance: Brown color and creamy head.\r\nTaste: spicy, nutmeg, roasted dark malts, spruce, cola, herbal, rather dry.\r\nPalate: medium body and medium carbonation.\r\nOverall: no idea what should I expect. A decent beer.", "2017 edition. Darker than expected. A little thin but tasty. A bit spicy, quite bitter. Decent depth. A good but not stunning effort.", "Aroma of cola, roasty malt, licorice, holiday spices.  A brown color, fairly clear but dark, and with a frothy, brown head. The flavor was medium sweet.   Medium body, smooth, creamy texture", "2015 Edition. 355mL bottle BBE: 08.2017. Served in a tulip glass @ 16ºC. Pours a deep, dark, almost black body with a medium, tight, creamy, tan head giving complete coverage with moderate lacing. Medium intensity aroma, dominated by a rich, sweet, caramelised, treacle toffee smell, and livened by plum, pine needles and bran flakes. Hints of liquorice. To taste, a suggestion of fruity acidity is replaced by a lasting, medium burnt toffee sweetness, savoury notes and dry oak. Medium bodied with a creamy finish, medium-high carbonation and a soft liquorice candy finish. An interesting beer in great condition, just dominated a little too much by a treacle toffee flavour. Otherwise flawless. Cheers and a Happy New Year to Craig for the bottle.", "2017. 6.7%. Black. Mineral sweetness.mild chocolate.Taste is roast char. Acidic bitter. Bordering astringent. Acidic stout like. Minerally bitter. Like a dubble , stout but more stout or heavy Porter. Doubt I would care for a sixer of this.", "2016 bottle. Dark appearance with light brown foam. Taste is burnt, twiggy, spicy, liquorice. Decent but I expected a bit more.", "Bottle of 2017 vintage, bought at Best One, Bedford, drunk at home. Rich dark brown with purplish hue. Opaque with a wisp of khaki head. Spruce, allspice, oak, a touch of molasses. Bittersweet taste with earthy hops asserting at the end. Woody and slightly astringent finish with liquorice and medicinal herbs in the aftertaste. Highly carbonated. A brilliant beer.", "Bottled 355ml. -from Pivoteka Zagreb as Anchor Christmas Ale 6.7%ABV. Almost black coloured, medium sized pale beige head, chocolate and alcohol in the nose. Moderate sweet malty, caramel, light chocolate, cardammome, touch of caramel and cinnamon with mild spicy finish. Nothing more nothing less than ok.", "Bottle. 6.7%. Best before end 08.19. 2017 version. Pours a dark reddish chestnut brown, with a tan head. Great lacing. Sweet, slightly tart, dark fruit aroma. Note of berries/cherries and a light spicy note. Malt in the background. Hint of licorice as it warms. Flavour is dark fruits with a light, dusty overtone, and a licorice bitterness. Spices in the background. Roasted, bitter finish. Notes of coffee and spices. Mild alcohol burn. Lingering grassy note. A wee bit too much carbonation. Overall good, but a bit cloying. 29.12.17.", "(noire stout, nez stout & agrumes confits, bouche stout à tendance IPA, forte, pour un noël masculin !)", "Moderate malty aroma. Brown in color with massive long lasting light brown head. Taste is malty with moderate spice notes", "Wyraźne aromaty przyprawowe, korzenna, trochę aromatów słodowych, opiekanych, melanoidnowych. W smaku lekka pełnia, trochę słodyczy, również sporo przypraw, trochę nut słodowych, goryczka średnia, lekko opiekana. Dość smukłe.", "8 mois avant DLC. Brune presque noire. Ni carbo ni mousse. Arôme agréable de cerise/caramel et malts grillés. En bouche, caramel,  malt grillés,  cacao, et houblonnage herbacé. Pointe café également avec pas mal d'épices.  Je trouve l'ensemble déséquilibré et le houblonnage qui prend trop de place. Pas enchanté pour cette bière qui est pourtant bien notée.", "2017 edition. Black with nice lacy head. Nice velvety body, chocolate almond with some sweetness. Smooth and great in winter.\n\n---Rated via Beer Buddy for iPhone", "14/20 really enjoyed the wackiness of this beer - very unusual taste - ale with almonds, quite malty but with sweetness.", "2017er Flasche, tolles Design, ich liebe die Idee mit den jährlich wechselnden Bäumen. In der Nase Röstmalz. Im Trunk frisch, würzig, dann mittig Röstmalz. Supergut trinkbar, dürfte aber gern mehr Bumps haben.", "Great aroma out of the bottle. However, the first sip is pine-heavy. The after taste is a bit reminiscent of an English bitter. Malts take a back seat this year.", "12 oz bottle. Pours dark, dark brown with a big micro-bubble tan head with lots of lacing. Scents of coffee, chocolate and malt. Nice big malty coffe and taost tastes. Some sweet with a slightly sharp short balanced finish. Dry mouthfeel and medium carbonation. I like it. Ho ho ho.", "Botella de 2017. Color marrón oscuro, casi negro, opaco, con capa de espuma marrón de tres dedos de grosor y buena retención. Carbonatación media. Textura oleosa y ligeramente efervescente. Aroma a Coca-Cola, especias, metal, chocolate negro. En boca hay recuerdos de Coca-Cola, dark fruits, muchas especias, clavo, canela, cardamomo, jengibre, chocolate negro, ligerísimo licor al final del trago, con algo de amargor. Postgusto especiado. Bien pero tampoco me dice demasiado. 6/4/7/3=13................................................................................................. Botella 2018. Color ámbar, rojizo si le da la luz, translúcido, con capa de espuma de un blanco ligeramente amarillento de dos dedos de grosor y muy buena retención. Bonito lacing. Carbonatación media visualmente. Textura acuosa con chispeo. Aroma a caramelo, terroso, cobre, algo floral muy de fondo. En boca hay caramelo, tierra, cobre, recuerdos florales y herbales. Escaso dulzor. Escaso amargor al final del trago. Caramelo y tierra en regusto y postgusto. Cumple como Amber Ale pero tampoco ilusiona. 6/4/6/3=13.", "2017 version.  Bottle from Blue Max, Burnsville, MN.  There is a small off-white head and medium lacing. Sweet and spicy aroma. Thin dark brown.  Fruit taste with hint of winter spice and pine. Mild hop finish. Just a slight \"piney\" note to make this a fine Christmas selection.", "Bottle 2017 vintage @ 6.7% from Bier Huis, Ossett and drunk in hotel, Wakefield after the annual Christmas family gathering. Black beer with medium tan head. Aroma of liquorice, dark malts, toffee and dark fruit. Taste is spice, Sweetish dark malts, dried dark fruit, liquorice and molasses. Medium bodied. Very good.", "Hælder mahogni amber, med tyk off white skum. Klar væske \r\nDufter af pine, og er præget af mellemristet kaffe i smagen. \r\nDer er en fin humlet bitterhed\r\nmedium body, lidt for tynd, average carbonation, fin kaffeish finish\r\n\r\nFin øl til at nyde foran pejsen,", "Little head and medium lacing. Sweet and spicy aroma. Thin dark brown aroma. Tart fruit taste with hint of winter spice. Mild hop finish", "Aromas a tostado y canela y cacao\nBien aspecto caoba oscuro espuma persistente\nEn boca compleja cacao torrefacto y especiada \n\n---Rated via Beer Buddy for iPhone", "kinda watery, but then a weird miz of sweet tart and somewhat bitter at end. licorice, cocacola, spices", "medium mokka coloured head, black coloured body, fruity pine tree peach like smell, some sweet malts brett yeasts like taste dark malts chocolat like taste", "0.33 l bottle shared with Anna Bog. Thanks! Dark brown, lasting small tan head. Spicy aromas, roasty, nutty, chocolate. Dry. Nice use of spices. Medium body, moderate carbonation, light finish. Tasty.", "Black in color with a dark reddish brown hue. A calico colored head of creamy foam on top. A perfect blend of wintery spices like cinnamon, clove, and dried citrus fruit. Drinks like a black IPA with some roasted barley and a perfect finishing pine forest hop revelation. Christmas on a dreary night is what this ale speaks of. Beautiful, dank, and dark.", "Pours jet black with a browny white head.  Nut and spice aroma. Coffee taste. Very nice ale", "Dark brown to black colored, medium+ frothy tan head, not all that lasting. Aroma is of malt, dark chocolate, roasty, spices, aniseed?, toasty, bit bready. Taste is medium sweet malt, chocolate and roasted malt, spices, toasty, some caramel, bready, licorice, light orange peel?, medium roasty bitterness, dryish finish. Medium bodied, soft+ carbonation, bit creamy. \r\n(bottle 2017, Pivoteka, Zagreb)", "I thought this was a very nice winter seasonal. The warm spices and the rich base beer worked together well. I got lots of clove and some allspice which made me want pumpkin pie or cranberry sauce to go with it.", "Bottle from systembolaget. Aroma is deep and thick but no overall master flavour. The apperance, dark with a lovely stout like coffee style fizz. The taste is much darker than most christmas ales, more like a stout. Smoke, dark malts, burnt wood charcol. Not a massive fan of this ale/stout hybrid flavour.  (5/12/17)\n---\nBottle from Systembolaget. Wasn't aware I had had this before. Ah well. Sweet lakrits in the nose. Lovely apperance with a lasting foam. Sweet lakrits and malt in the taste. Some cola in there. Much preferred this time round, a nice rather unique tasting christmas beer. 2.9 to 3.2.", "2017: Dark, almost black colour with a tan head.\nAroma: liquorice, some caramel, malt, earthy notes, some wood and spices. \nTaste: liquorice, salt, roasted malt, plums, a little cacao, some sweetness.\n\n2018: Dark brown, creamy head. \nAroma: spices, caramel malt, plum, marmalade. \nTaste: spices, liquorice, roasted malt, some caramel malt. A little watery.\n\n2019: Dark colour, almost black. Creamy head.\nAroma: caramel, brown sugar, spiced, plums,  malt.\nTaste: spices, burnt malt, brown sugar, liquorice, molasses, some pine.\n\n2020: Black colour, creamy tan head.\nAroma: spruce, caramel, cream, bark,some molasses. Wow.\nTaste: bitter roasted malt, coffee, some dark chocolate, spruce, brown sugar, some banana.", "Smell is of tobacco...some chocolate maybe...dark malt mostly...taste is dark malt with a light bitterness...some complexity...lightly bitter finish...meh..had at casual pint with Megan, John and the young crew 12/1/17 to 12/4/21 the recipe changes year to year apparently so I'll try and keep a running score...'17 rating a 2.9...'21 rating: smell is like warm sweet cinnamon, but taste is quite different and unique...seems like a mix of sweet cinnamon, black pepper and medium roasted malt...complex, flavorful, mouthfeel just a bit empty... definitely not sweet..just lots of spices..only gave palate a 1 point boost...had at home on a lazy Saturday the day after Liz cooked a wonderful vegan broccoli and pasta dinner with chibada(?) Bread and bruschetta 🥰🥰 and bought me a meteorite!! Pandemic still carries on amongst the unvaxxed with ~778k US deaths...", "C-. Pours a dark brown color with khaki head. The after taste is not pleasant.", "A spice beer bug hiding more depth than your typical pumpkin offering. Ginger cinnamon and fennel come through with notes of molasses and other dark fruits, and the roasted male holds up to those additions nicely. Not my personal favorite, but really well done for a spice. Only misstep is they could have brought mire hoppy pine bites in with the right finishing hops. \n\n---Rated via Beer Buddy for iPhone", "2017 bottle. A bit of a pleasant surprise, not as heavily spiced and overbearing as most Winter Warmers, more herbal and dry than a liquid gingerbread cookie. Seems hoppier than the last OSA I drank--granted, it was several years ago--and comes across far more invested in bright green pine, anise, and juniper notes (maybe spruce tips) with an underlying malt sweetness that mixes caramel-slathered bread with mild hefe hints of banana and clove. Finishes bready and bittersweet. Definitely grows on you as it warms. Good year to buy a sixer.", "12floz bottle, 2017 edition (I didn't bother to check to convert date code to mm.dd.yyyy format), $1.75 unit cost, mug glass. I've had this beer many times through its releases. Sometimes I've even aged a few for a year to no detrimental nor incremental affect on quality (spice notes tend to smooth out, never went beyond a year). Well as with previous editions, this beer is similar - dark with a moderate amount of tan head, notes of cardamon, cinnamon, toasted malt, black licorice prevail in aroma and taste, all set to brown porter base that is medium in body. I'm detecting more of the spice notes than in prior experience. I chalk it up to my impression at the moment, which is to say less favorable than other times. Reviewed as 3.6, but this could fluctuate based on past/future experience and circumstances as much as +/- 0.5 points (this can be said for many beers, but this one especially). All that be said, I consider this to be a good holiday beer that I once considered to be an exotic beer.", "2016 bottle. Big light browned head, but fast flattering.\nNose : dried fruit, liquorous, alcohol\nAroma : dry roasted malt, mid malt\nLight bitter, dry, thin body\nAlmost flat.", "Butelka V.2016 trochę wyleżana. Jednak za każdym razem jest podobnie... pierwszy łyk i w uszach pojawia się u mnie \"Jingle Bell Rock\" Bobbiego Helmsa. Magiczny koc w kratę owija mnie od stóp do pasa a telewizor zamienia się w skwierczący ciepłem kominek. Jedno z moich ulubionych piw zimowo/jesiennych.\r\nNiech już będą święta!", "Our Special Ale pours a very dark brown color with a frothy beige head of short to medium life span. If the head had dissipated a little more slowly, this brew would have been very beautiful. The bouquet is somewhat savory and has notes of prunes, pine, and Worcester sauce while the malt has the aroma of fruit bread, which carries over to the sweet attack. The well balanced mid-palate is less savory than the nose suggests and the layered mix of dried dark fruits, roast, and pine resin notes is very pleasant. It leaves a long finish with notes of German dark bread crust on the palate. Damn, this is good beer.", "Botella 33 cl en el Lúpulo Oviedo diciembre 2011. Edición 2010. Fcpref 09..2012. (r2111). Maltosos muy especiados, recuerdos de anises y algunos enebros. Cuerpo medio fino, espumoso. 5.5 vol suaves. Original.", "2015 vintage. Pours mahogany from the bottle. The crown is thick and frothy. Aroma is toffee, red berry, port wine. Taste is a bit tart, mildly bitter, spicy, oddly void of sweetness given the aroma, weird. Body approaches being medium, but also oddly thin at times. Interesting, but it failed to grow on me.", "2009 vintage. Intense plums and dry cake. Bready grainy body with dry dried fruits - cherries and plums, Round with no bitterness and a moderate sweetish malty aroma in the and. Very round, but probably too long matured.", "2016 bottle, 12C. Very dark brown with a light tan head that fades to a coat. Aroma of strong bread, brown sugar, dried banana, spices - mace, nutmeg etc. Spices are by no means domineering. A bit lighter bodied than expected. Only a little sweet with bread, dried fruit and spices before a modestly bitter finish. Very nice with subtle depth, but hoped for a little bit more grunt for 6.5%", "Vintage 2016 Bottle from saveur Bière. Warm summer nigth and winter beer.. It works! Exellent complex dried fruit aroma, winter spices taste. Good", "Popped the cap and unleashed a real spice bomb of an ale. It borders on a dense perfume aroma with no traditional ale scents present. A course, thick body with a thin finish. This was a bottle from the 2016 vintage, 6.5% ABV. Maybe 2016 was a bad recipe but I don’t anticipate buying this again.", "Malt blend gives off that dry fruit and molasses. Comes through with the festive spirit. Gets better when warms up a bit.\r\n\r\nReviewed - A Brew With You, Ep. 64", "Bottle 2010 - pours brown with tan head - nose and taste of molasses, toffee, caramel, spice - medium body", "Birra dal colore scuro, schiuma beige, fine e non persistente. Al naso sentori di caffe, malto tostato, caramello e spezie. Al palato moderatamente corposa con note di caffe, toffe e coriandolo. Nel finale rimane dolce e abbastanza stucchevole. In ogni caso una buona birra.", "[as Anchor Brewing Merry Christmas 2016 Happy New Year]\nBottiglia. Il gusto al naso ritrova liquirizia, orzo tostato e speziato. L’intensità olfattiva è elevata e la persistenza olfattiva è apprezzabile. Il cappello di schiuma abbondante ha una lunga persistenza e finisce con pizzo lungo il bordo del bicchiere. La grandezza delle bollicine è media. Il colore è scuro impenetrabile. Il corpo è strutturato non pesante. Il dolce è medio e l’amaro è medio: non si surclassano. L’intensità gustativa è elevata e la persistenza gustativa è buona. Il gusto è piacevole. Il finale è pulito. Il retrogusto è di media intensità. Sul palato si depositano impressioni di caramello, miele, agrumi, frutta secca e pino. VARIAZIONI: Plus, as Anchor Brewing Merry Christmas 2018 Happy New Year (A. 7, A. 5, T. 6, P. 4, O. 3.3). Bottiglia. Territorio olfattivo dominato dal sottobosco. L'olfatto viene stimolato in maniera elevata e l'esistenza olfattiva è apprezzabile. Il cappello di schiuma ha una buona tenuta. La grandezza delle bollicine è medio-fine. Il colore è scuro impenetrabile. Il corpo è pieno. L'amaro è contenuto. La forza gustativa è elevata. La continuità gustativa è buona. Al gusto vengono donati toni di caramello, miele, frutta secca, pane tostato, erba e agrumi. VARIAZIONI: Plus, as Anchor Brewing Merry Christmas 2019 Happy New Year (A. 7, A. 5, T. 7, P. 4, O. 3.5). Bottiglia. Al naso l'aroma rimanda allo speziato. La finezza olfattiva L'intensità olfattiva è elevata, permanendo in maniera sufficiente. Il manto birroso superiore è caratterizzato da una schiuma color marrone chiaro che resiste abbastanza. La grandezza delle bollicine è medio-fine. Il colore è scuro impenetrabile. Il corpo è pieno. L'amaro non è invadente. La forza gustativa è elevata e la durata è buona. Il gusto è piacevole. Le sensazioni boccali finali risultano di birra beverina. Il retrogusto è intenso. Al gusto vengono donati toni di caramello, miele, crosta di pane, frutta secca, agrumi, frutta disidratata, liquirizia e spezie. VARIAZIONI: Plus, as Anchor Brewing Merry Christmas 2020 Happy New Year (A. 6, A. 5, T. 7, P. 4, O. 3.4). Bottiglia. Il gusto al naso rimanda all'orzo tostato e al floreale. L'intensità olfattiva è normale e l'esistenza olfattiva è sufficiente. Il mantello birroso superiore è caratterizzato da una schiuma dalla scarsa tenuta. La grandezza delle bollicine è a grana fine. Il colore è scuro impenetrabile. Il corpo è pieno. L'amaro è nella media. La forza gustativa è elevata e permane in maniera sufficiente. Le sensazioni boccali finali risultano di birra beverina. Il finale è secco e pulito. Il retrogusto è intenso. L'aroma in bocca porta i segni di caramello, miele, cioccolato, caffè, liquirizia, nocciola, frutta secca, pane tostato, un accenno di resinoso, agrumi, erbe aromatiche e frutta disidratata. VARIAZIONI: Plus, as Anchor Brewing Merry Christmas 2021 Happy New Year (A. 8, A. 5, T. 7, P. 4, O. 3.5). Bottiglia. Il naso riconosce indizi di orzo tostato e di fruttato. La finezza olfattiva è molto elevata ed elegante e l'esistenza olfattiva è sufficiente. Il manto birroso superiore color marrone castagno resiste poco. La grandezza delle bollicine è a grana fine. Il colore è nero come la pece. Il corpo è strutturato. L'amaro è medio. La forza gustativa è elevata e la persistenza è buona. Il retrogusto è intenso. Al palato prevalgono impressioni di miele, frutta secca, agrumi, lampone, mirtillo, erbe aromatiche, frutta passita, mandorla fresca, cuoio e spezie.", "Not a fan of overspiced brews, but this one is very nice. Rich maltiness, caramel, bubble gum, pine, light cocoa, cinnamon, dark dried fruits. Moderate sweetness with moderate to light bitterness\r\nWell balanced, quite interesting.", "Rocznik 2016. Zapach średnio intensywny, lukrecja, przyprawy, suszone owoce, karmel. Kolor ciemnobrązowy, klarowne. Piana niska, drobna, szybko znika. W smaku umiarkowana słodycz, średnia pełnia, pierniki, cynamon, przyprawy, karmel, suszone owoce, paloność. Goryczka niska, wysycenie średnie.", "Always a fan of the anchor Christmas brews. Rich and malty with a solid blend of spices, lots of cinnamon, nutmeg, and sharp lay bitter hops to lend some zing.\nEarlier Rating: 11/17/2012 Total Score: 4.3\nAnchor’s 2012 iteration is a solid outing from the brewery. The same bitter backbone and pungent aroma. Heavy on the spice, esp. nutmeg, but also has some caramel and bread in the flavor. Tried at the Burger Stand in November, 2012.\nEarlier Rating: 2/18/2017 Total Score: 4", "Bottle 1.5L poured to wine glass \r\nAppearance: Amber with medium off white head, minimal lacing\r\nAroma: Malty\t\r\nTaste: Bitter, very good follow through\r\nMouthfeel: creamy, a bit over carbonated\r\nOverall: Very good beer\r\ndrank: 1/8/2017", "Butelka 355ml. Alk 6,5% z 2016roku. Kolor ciemny, nieprzejrzysty, piana solidna trzyma się dobrze ale mogłaby trochę dłużej.Aromat mocny, lukrecja oraz wszystkie aromaty piernika, smakuje wyśmienicie, wysycenie bardzo dobre, słodkie w smaku, bardzo dobre piwo chociaż nie przepadam za edycjami świątecznymi.", "35.5cl bottle poured into a snifter on 1-Feb-2017. Dark brown with a medium sized beige coloured head. Aroma of sweet malt, spices and cocoa, Medium body and carbonation. Taste of chocolate, vanilla, ginger, nutmeg and cinnamon. Light bittersweet malty finish. Enjoyable seasonal.", "Poured a clear dark brown with a frothy off white head. The aroma is grainy malt, alcohol, dark fruit, some yeast. The flavor is moderate sweet, with a healthy dose of spices, earthy and organic. Rich and smooth, some dark fruits, and hop bitter, with a slight smoke hint. Medium heavy bodied with average carbonation. A real nice ale.", "(Tap) clear, bright dark reddish amber colour with a small brown head; aroma of milk chocolate, hint of jam, then roast and chocolate liqueur; smooth palate; balanced flavour with a long, light bitter finish", "Anchor’s Xmas ale never disappoints and 2016’s vintage is no exception. Less malty with less fruit cake character, this one is earthier and smoky, not unlike a wee heavy, but with a healthy dose of wintry spices. Ginger and clove stand out. Dark fruits and lightly sour raisins in there too. Rich but tempered by a sprightly fizz that works well in context. Sampled through a Fizzics, a creamy sweet malty body was bolstered by the treatment.\nEarlier Rating: 12/3/2007 Total Score: 3\nUtterly unique and a fascinating quaff. A very pretty beer to behold pouring a dark mahogony and capped with a resilient rocky tan head. The nose is sweet and roasty, not unlike a porter, but there is also a dollop of molasses and perhaps maple thrown in. The flavor is much the same with molasses and licorice playing a strong part in the finish. Blindfolded I would have pegged this as some sort of gruit ale. I love an adventuresome brew and Anchor certainly had some fun here. Inspiring!\nEarlier Rating: 2/2/2017 Total Score: 4", "Highly bubbly with a strong rich head. Notes of dark fruit, bread, yeast, toasted nuts. For the winter beer drink\n\n---Rated via Beer Buddy for iPhone\nEarlier Rating: 12/29/2005 Total Score: 3.9\nMore on the fruity side and less on the X-mas side of taste. Still very good though. Taste a little tart with with fruit. Mild Chocolate notes. \r\nA real pleasure to drink", "355ml bottle, thanks Marduk! Almost black, dark brown with very small beige head. Aroma is sweet, gingerbread, cinnamon, nutmeg, some coffe beans. Taste is bittersweet, cinnamon, some hopiness, spruce. Long aftertaste with chocolatey, resinous notes. Quite lively carbo, medium bodied. Drinkable ok brew, but nothing special.", "355ml bottle - thanks Marduk!\n\r\nSickly sweet aroma, some solventy aspects. Dark. Molasses, spicy, erm, what and why? This is no \"our special ale\", this is an amateurish immitation. Dry harsh finish.\nEarlier Rating: 6/22/2007 Total Score: 4.1\nKeg (Gallows Bird, Espoo)\n\r\nReally dark, almost black, tight cappuccino head. Huge aroma - dark fruits, spices and ginger. Huge, but wonderfully well integrated range of tastes. Dark fruits, raisins, plenty of chocolate malt, burnt caramel, and some tantalising spices - some not out of place in a christmas pudding. Anchor’s best ever beer (so far...) (8-4-9-4-16=4.1)\n\r\nRerate: Bottle 2007, drunk 2010-01 (7,4,8,5,15=3.8)\n\r\nReally mellowed, rich, spices also mellow. A proper non-gimicky winter ale. Lovely smooth palate,carbonation soft. Finish delicately burnt, but very liquoricey. BCs well.\n\r\nRerate: Bottle 2010, drunk fresh (7,4,7,4,14=3.6)\n\r\nSweet spicy aroma, very spicy - cakey. Deep red, small ring head.. Spicy - woh!!! mint! Full and roasty body, but the mint comes through so much. Full palate, sweetly smooth, crisp carbonation. Finish has roasted choco. Very drinkable, packed full of flavour. Refreshing. Good, but possibly weak compared to prior ones. Too light?", "355ml bottle. Clear very dark brown color. Medium size, yellowish head, stays. Sweetish, spruce, fruity, malty and some plastic in aroma. Sweet, caramel, toffee, spruce, some heat in taste. Spruce, tar and some caramel in aftertaste. Fizzy carbonation. Sweet and sticky and tarry brew. Drinkable brew.", "Dark beer, A lot of gingerbread. Very Christmasy beer. Dark red brown. Aks aks puff ram.\nEarlier Rating: 11/15/2012 Total Score: 3.4\nPours red tinted amber. Whole wheat flour and ginger aroma. Tastes.like straight mile gingerbread cookie. Strong bite and creamy mouthfeel. Good if you want desert but I haven’t even eaten dinner yet. Aww, its good anyway.", "A beer of understanding I have not finished or not finished d’agradar MHA. I found the little balanced, long way in the mouth, low density water, little gas. A beer correct but does not repeat.", "Voici une belle surprise avec cette Merry Christmas 2016 Happy New Year de chez Anchor. Même si le titrage alcoolique est un peu faible (6,5% Abv) pour une bière hivernale et que celui-ci aurait gagné à être augmentée pour renforcer la puissance de la bière, celui-ci est bien utilisé pour résultat une bière harmonieuse, juste et agréable. L’étiquette présente une approche un peu différente des classiques, avec une nouvelle année sous le signe de la renaissance et du symbole de l’arbre pour le solstice d’hiver. Je vais être plus terre à terre et m’intéresser à notre breuvage qui doit être avant tout festif ! En verre, notre Anchor, présente une belle robe d’un brun profond et se pare d’une multitude de fines bulles la rendant des plus gracieuses. Une mousse beige, nappe convenablement la bière de 3 à 5 mm d’épaisseur. Le nez est très beau se portant sur la cerise, le pruneau et le café sur de jolies notes épicées de réglisse et de cannelle procurant une sensation de vin chaud. L’attaque sur le malt, le caramel et le réglisse est un peu en dedans mais prépare bien l’entrée en matière de l’amertume qui est douce sur des notes de café. L’arrière bouche s’intègre quant à elle parfaitement bien, soyeuse sur des arômes de cerise et de candi. L’ensemble est très chaleureux et parfaitement homogène. Le final laisse quant à lui s’exprimer des notes de cherry avec des belles variations autour de la réglisse. La longueur, malgré les 6,5 % Abv est très correct. En conclusion, il s’agit ici d’une très belle bière qui brille par son équilibre. Avec un peu plus de puissance et un brin de complexité en plus, je ne serai pas resté sur terre...je serai monté sur le pin!", "Poured a deep brown color with an off-white head. Mild roast aroma with some hints of spice. Medium bodied, rich flavor with some spiced character; holiday bread is a good comparison. Quite nice.\r\n\r\nNotes: Magnum bottle shared by PJ at our brew session, Jan ’17\nEarlier Rating: 12/11/2012 Total Score: 2.7\nd that mostly settles off.  Aroma is like a spiced roasted lager. Tastes the same way with some vegetable and rd apple notes.  Not my favorite.", "Twelve ounce bottle of the 2016 edition at my niece’s house (thanks, Darci) on December 24, 2016. Almost opaque ruby/brown color, nice sweet/spicy aroma with some earthy notes, fine flavor like the nose but with what tastes like a liquefied spruce tree (in a good way) thrown in. Great stuff.", "15 Jan 2016, bottle. dark brown and foamy head. nose is dark brown banana bread. med body and mildly fizzy. banana bread up front, banana lingers, burnt dark bread comes out toward the end. sweet up front and mildly bitter at the end. nice. \nEarlier Rating: 4/18/2011 Total Score: 3.4\n27 Nov 2014, bottle. 2014 vintage. dark ruby. nose is spiced up front with caramel malt backbone. med body and fizzy. has a very burnt malt element, there is a sharp spice i can’t place. decent. \r\n\r\n(7 3 7 3 14 = 3.4) 16 nov 2013, bottle. 2013 vintage. Dark ruby/brown. Nose is gingerbread. Thin body and moderately fizzy. Ginger and lightly toasted molasses cookies. Nice. \r\n\r\n(7 3 7 3 14 = 3.4) 5 Dec 2011, bottle. 2011 vintage. dark ruby, clear, no bubbles, thin foamy head. aroma is ginger and toast. not as gingery as 2010, nor is there as much chocolate. but it does seem quite similar. med body and fizzy. ginger is there but not as prominent even as in the aroma. there is a tart/teeth on edge malty flavor, and some burnt toast. just okay. \r\n\r\n28 Nov 2010, bottle. 2010 vintage. (9 3 8 3 15 = 3.8) dark ruby brown colour, clear w/ a couple bubbles. great ginger nose w/ some spicy (ginger) kick. wow! i like this. a ginger beer w/ a dark chocolate element. thin/med body and too fizzy and needs more alcohol. i like that i’ve never had a beer like this before. ginger and dark chocolate. awesome!", "Bottle \r\nAroma-caramel, honey\r\nAppearance-black, hazy, tan foam, \r\nTaste-medium bitterness, medium sourness, light sweetness, \r\nPalate-medium body, sticky, average carbonation, long finish, \r\nOverall-very good", "355ml bottle. Dark brown beer, small beige head. Nose is cloves, cinnamon, nutmeg, mild roast. Flavor is similar ti the nose, but with more cinnamon and cloves, some malty acidity and chocolate notes. Fairly dry finish. Lighter palate than expected, but it’s also less interesting than expected. It’s not bad or anything, just lacks that certain je ne sais quoi.", "Bottle at home. Deep brown almost black colour small brown head disscipates fast. Nose is faint banana, clowes, and other spices i can’t wrap my head around. Taste is spicey, low bitterness low sweetness, spices and banana in the aftertaste. Fast finish. Light body. Nice banabread like desertbeer.", "Botella 33cl Tercer Tiempo Tienda (Santander) Sabor tirando a caramelo, muy especiada y bastante alcoholica para la graduación. \r\nBebida nuevamente en su version 2017 el día \r\n30/12/2017", "Bottle from Whole Foods Kensington High Street, London. A dark brown/black coloured pour with a medium beige head on top. Roasty, malty, spice, Christmas cake aroma. Tastes similar, roasty, malty, spice, Christmas cake, cinnamon, slightly sweet. This was very enjoyable indeed. I’ve had many of these over the years and have never been blown away but the 2016 version is very good.", "Bottle. Pours a brown color with white head. Brown sugar, molasses, slight spice, slight banana aromas. Molasses, slight spice, slight banana, slight caramel malt flavors. As always, a solid beer, but a style that I’m gradually moving away from.", "Botella de @Vivalabirra, Oviedo 02/01/2017 BBD:08/18\r\nColor negro, sabor especiado, notas tostadas, cuerpo medio.\nEarlier Rating: 12/11/2016 Total Score: 3.8\nBotella, 09/12/16 Como Marry Chrismas 2015. BBD: 2017\r\n Color marron oscuro, aromas especiados, sabor dulce especiadada, rica.", "2018 - Bottle @ 6.9%\nRocky off white head stayed well on a deep mahogany coloured still body.\nBerry, Christmas cake & candied fruit aroma.\nMedium body thinning to the back, smooth with prickles down the throat.\nSweet berry, sweet grape, spices, liquorice, dark chocolate & cocoa tastes.\n\n2016 - Bottle @ 6.5%:\nLight beige head soon left a cover on a near black still body. \nSweet nutty aroma.\nMedium body feel, well carbonated - clean on the palate. \nThis has lots of malts, nutty flavours, spice, hints of cinnamon - tangy on the back. Good Christmas flavours.", "Shared 12 oz. bottle. Pours almost black with a beige head. Aroma and taste of roast, chocolate, nutmeg, Christmas spice. Good.", "1.5L magnum bottle.  Pours a dark mahogany with a thick and fluffy khaki head.  Toffee, caramel, cinnamon raisin bread, light grains, and plenty of wintry spices in the aroma.  Thin to medium-bodied and pretty smooth on the way down.  Toffee and cinnamon raisin bread upfront in the taste.  Toasted grains follow.  A hoppy bitterness at the end.  Wintry spices throughout.  This version is a little more hop forward than in previous years.  A holiday tradition of mine.  Pretty tough to find this year too.  Not sure why this year has its own listing either.\nEarlier Rating: 12/21/2005 Total Score: 4\nBottle.  Bottled on:  10/04/05.  A clear ruby pour with a thick mocha head that leaves some lace.  Lots of cinnamon and nutmeg along with some anise, cocoa and caramel in the aroma.  Pretty nicely balanced with a solid malty base and a bit of bitter hops in the finish.  Medium to thin-bodied.  Lots of fresh cinnamon sticks and spices are upfront.  Cocoa and some coffee follow.  Starts off sweet, then mellows nicely.  Anchor’s best, year after year.", "Bottle (from SIP). Pours dark brown with beige brownish head. The head stays for a second. Aroma is spices, cola, sweetness, malt. Flavor is sweet and bitter, spices, cola, malt, some roast. Finish is dry-spicy bitter. Overall: good.", "Bottle. Pours an opaque dark brown with a thin beige sift foamy head. Aroma is of caramel, dark fruits, raisins, figs, nuts, warm spices, ginger. Taste is of caramel, figs, raisins, blackcurrant, toffee, ginger, plum, nutmeg. Soft foamy mouthfeel, soft to medium carbonation.", "Earlier Rating: 12/30/2016 Total Score: 3.8\n12 oz bottle, thanks brenn79. Aroma is cola, dark bread crust, vanilla, spices (nutmeg, cinnamon I think, clove possibly). Pours dark brown with red highlights and a one finger beige head with decent retention. Taste starts out lightly malty sweet before some significant herbal hop bitterness kicks in; finishes with a faint tartness. Spices are there in flavor, but they’re a bit vague. This seems a lot better than previous years. I know the alcohol is higher, and I don’t remember it ever having this much hop presence before. I wonder what else changed.\nEarlier Rating: 11/14/2011 Total Score: 4\n12 oz bottle. 2011 bottle. I rated this yesterday on paper. Thanks Brenn79. Pours mahogany with ruby red highlights. Has a medium beige head that collapses in a couple of minutes. Aroma is minty, dark fruits, other unidentifiable spices. Tastes like minty gingerbread. Sweet and meaty with a lightly dry bitter finish. Average carbonation with a somewhat thin body. Very Christmasy. Tasty.", "Bottle from Fountainhall Wines. Pours dark, dark brown with a creamy light tan head. Smells of sweet malt and demerara sugar. A treacle-sweet taste with mild bittering malt. Moments of caramel. It has a smooth silky mouthfeel with gentle carbonation. This is a sweet, easy drinking brown ale. Nice and mellow. [re-rate 2017 bottle]. Pours dark brown with a fluffy tan head. Very nice looking indeed. Nose has chocolate, treacle, dried fruit and a ligh caramel. Flavours are similar with a little aniseed noted. It has a smooth feel with a light effervescence. It’s easy drinking that gets better as it rests. A malt chocolate sweetness with enough fresh light fruit to prevent it being cloying. Nice festive brown ale. (Re rate 2018). Fresh and piney yet spiced and malty. They've got the Christmas beer covered.", "butelka. czarne, bez refleksów, średnio obfita drobnopęcherzykowa piana utrzymująca się do końca picia. aromat: będzie słodko! lukrecja, brązowy cukier, piernik, ciemne słody. w smaku pełne, ale nie ulepkowate, nasycenie w punkt, słodycz dominuje. mega dobra edycja’16", "Aroma: lots of malt, molasses, with a little nutmeg and ginger; basically smells like a christmas cookie Appearance: extremely dark amber with creamy offwhite head that lingers; Taste: follows nose with a little too much spice; needs a bit more malt and hop to counterbalance; Palate: medium body with long, spicy finish; Overall: okay but probably won’t get again.", "Not too much aroma but nothing bad, some caramel. Taste rich toast and bread with some sweetness. Poured real dark with good tan head. Finished caramel like.", "Pours inky black with frothy coffee colored head; tobacco and dark chocolate on the nose; spicy hoppy finish.", "1.5 liter magnum bottle shared by my brother-in-law, thanks Scott! Dark brownish with beige head. Aromas of malt, toasty notes, caramel. Tastes of nutty notes, caramel, malt, slight dark fruit. Medium body with a dry finish. Solid.", "Pours clear dark brown. Aroma is malty, sweet, spicy, fruity. Taste is sweet, malty, slightly fruity.", "From a giant bottle, shared with friends. Dark and stout-like, hinting a lurking monster. The baseline is a definitive rich roast and darkly toasted grain. Then there’s an artistic layer of Christmas spices, a bit of nutmeg, maybe a little cinnamon. (#6471, 12/24/2016)\nEarlier Rating: 1/3/2010 Total Score: 3.1\n2009 version, bottled. Dark and murky with an oozing head of tight foam. The aroma is intriguing -- spicy, yet belying a sweet cooked sugar underbelly. This drinks with an equally odd counter balance of a super-sweet base, tinged with tickles of herbs and spices. I think now I ought to have laid this down for a while. (#3785, 1/3/2010)\nEarlier Rating: 12/25/2016 Total Score: 5", "Bottle from Real Ale Store, Newark. Deep ruby to black colour with tan head. Stewed fruity aroma and and taste. Thick body.", "Tap at Cherry Reds, Birmingham. Poured a clear dark brown with a frothy off white head. The aroma is grainy malt, crisp alcoholic red berry fruit, some yeast. The flavour is moderate sweet with a rich, smooth, sweet fruit, hop bitter, light alcohol, light spice palate. Medium bodied with average carbonation. A real heart warming Christmas ale.\nEarlier Rating: 12/20/2014 Total Score: 3.4\nTap at The Beer Temple, Amsterdam. Poured a reddish brown with a frothy white head and some broken lace. The aroma is rich spicy over ripe red berry fruit. The flavour is moderate bitter sweet with a light veggie mineral light fruit palate. Medium bodied with soft carbonation.", "Bottle from Systembolaget. Dark brown with small head. Molasses, dark malt, herbs, red fruit. Tart with berries, apple, malt. Long, sour finish.", "On tap. Thick dark colour with long lasting beige head. Aroma: Very light notes of vanilla, whiskey barrel and caramel. Not the most aromatic one. Taste: Light sweet start with lots of barrel (wood) taste and a bit soapy too (juniper berry?) with a full bitter mouthfeel. Not my favourite combination. Medium body with soft carbonation. Long sopay finish. Not my cup of tea.", "Bottle from Cotteridge Wines; dark brown pour with a big frothy light tan head, aroma has sweet molasses and some winter spicing, taste has rich sweet malts, dark fruits, quite heavy spicing of nutmeg, pine essence, cinnamon and the like, creamy mouthfeel, could get you pissed.\nEarlier Rating: 11/26/2013 Total Score: 3.5\nBottle from Cotteridge Wines; dark mahogany red pour with creamy tan head, caramel and spice aroma, taste has caramel, hint of roasted malts and a big undercurrent of Christmas spices, nutmeg and cinnamon jump out.", "So what are the changes in this edition of this annual beer that allow it it’s own entry, when the last 11 version are all lumped together? Don’t get me wrong...Anchor comes right out and says the recipe is tweaked EVERY year, but as a different entry isn’t allowed every year, why THIS year?\nDark brown pour from the bottle with a tan cap. I only had one this year, after a 6 pack plus usually a pint on tap being a yearly tradition. The one I got was not quite the molasses backed Christmas tree in a bottle I so love. Smooth as usual but actually was a touch thinner it seemed. It was still good, but the spices were a touch off and it was like someone was imitating Anchor’s beer. With the plethora of beers available, while I enjoyed it, it was less than the usual low 4, and I decided to pass on more.\nEarlier Rating: 9/5/2014 Total Score: 4.3\nA favorite spiced beer and favorite Christmas beer, year after year. Nearly 6000 beers in, and I’ve never had another that comes close to the unique mix of spices and herbals and malt that is Anchor OSA.\nFukin stupid that a beer that is obviously not the same every year is lumped together.  3.6-4.3 and everything inbetween.\nStill lame the admins deem this the same beer yearly when it is not.  Oh well..thats's why I'm on untappd", "Earlier Rating: 12/21/2016 Total Score: 3.8\nTaps coffee brown with a thick buff head. Aroma delivers roasted malt plus cloves, cinnamon, and a snip of nutmeg. Bold flavor presents cloves, woody, roast malt, nutmeg, cinnamon and a litle molasses for a very enjoyable winter beer. Mouthfeel offers typical body but lively fizz and a nice woody and spicy finish. Whatever you celebrate, may it be merry!\nEarlier Rating: 12/6/2008 Total Score: 4.4\nHad the 2008 version. This one pours a dark chocolaty opaque brown with a fine-bubbled tan head. Rich, malty aroma has strong hints of spice. Flavor is strong and mouth filling, malty, very spicy, with a solid undertone of unsweetened chocolate. Texture is smooth and a little syrupy so it goes down well.", "Piana znikoma, dość szybko ucieka. Kolor piwa wpada w brązowy, z rubinowymi przebłyskami. W aromacie grają nieokreślone przyprawy, trochę piernika, trochę więcej banana, troszkę czerwonych owoców. Jest przyjemnie, tylko, że niezbyt intensywnie. Wysycenie średnie do wysokiego, trochę denerwuje, bo sprawia, że piwo wydaje się bardziej wodniste i sprawia, że Special Ale traci na zawiesistości. Pustkę na finiszu zastępuje lekki karmel, a dalej czerwone owoce. Podczas dłuższego posiedzenie nasycenie oczywiście spada, a w piwie ujawnia się gumowata (jak w scotch ale), karmelowa słodowość. Pije się to na prawdę okej, fajna odskocznia od zawalonych przyprawami polskich odpowiedników.", "Aroma has caramel, banana, dried fruit (dates, raisin), spices (cloves, cardamom), even gingerbread malt, and resin and spruice hops. Very dark brown, almost black color with a frothy brown head. Medium sweet taste with light bitterness and saltiness. Full bodied, creamy and thick texture, soft carbonation and slightly bitter finish. Decent, very x-massy, with a hoppy backbone.\nEarlier Rating: 12/20/2016 Total Score: 3", "Poured from the bottle into a pint glass to drink. The beer had a dense brown color with a dark ruby red hue with a very large and creamy tan head with excellent retention, cling, and lacing. Its aroma featured pine and spices with perhaps some cinnamon and nutmeg, and a light presence of cereal and grain hops. The taste had a pleasant, subtle sweetness with a touch of caramel and bread, but mostly featured a modest bitter spice and light hops tones. The body was quite smooth and creamy, with average carbonation and life, and a good mouthfeel.", "W aromacie goździki, pierniki, imbir, świątecznie na podwalinie ciasteczkowego słodu lekko wpadającego w czekoladę z orzechami. W smaku podobnie, przyprawowo, goździkowo, świątecznie, raczej niezbyt słodko, dobre proporcje i pijalność. Udane. \nEarlier Rating: 12/16/2013 Total Score: 3\nBardzo ładny piernikowy aromat, niezbyt słodki, poparty palonym słodem. Ale w smaku... kompot z suszonych śliwek, taki wigilijny. A ja tego smaku nienawidzę. Będąc rzetelnym smak dość oryginalny, wytrawne, stosunkowo lekkie jak na piwo zimowe. Uberświąteczne piwo.", "Bottle from Vessel Beer Shop, Plymouth. Pours dark mahogany with a good sized tan head. Aromas of alcohol rich fruitcake and molasses. Flavours of dark malts, chocolate and dark fruits. Amazing mouth feel. Lovely dry bitter finish. \nEarlier Rating: 12/18/2016 Total Score: 4", "Earlier Rating: 12/17/2016 Total Score: 4.1\n12 oz bottle, surprised this year got a new entry- Pours very dark brown with a large light tan head that holds nicely that leaves a rootbeer like rocky head. Aroma is cocoa, cinnamon and nutmeg, toffee and caramel. The taste is cinnamon and nutmeg, toffee is prominent, along with caramel, some sort of nuts, the hops impart a dry medium bitterness, smooth, rich and pretty tasty.\nEarlier Rating: 11/12/2011 Total Score: 4.1\n12 oz. bottle- Pours very dark red with a two finger creamy dense tan head, beautiful looking beer. The aromas is wow Christmas spice, cinnamon, clove, peppermint or mint, allspice, it  totally smells like Christmas. The flavor is weird, not as in your face with the spices although are still noticeably there, finish is bitter, but malty as well. Body is actually thinner than expected, carbonation is soft. Overall a nice departure from the flooding of somewhat boring winter warmers, I could drink more than one. Santa should get a glass of this instead of stupid milk!", "Rich brown ale aroma. Cocoa, slight pine hop, Xmas cookie spice, malt and I’m getting some hazelnut. Very dark brown color with a large light brown head. The taste is just the same as the aroma with more spices present in the aftertaste. Hardly any hops, just a trace at the end. Great palate - just dense enough, silky and very easy drinking. This was ok, let it warm up before drinking.", "I’ve been drinking Our Special Ale since 2008 and this is th best so far. Almost clear dark brown with some hazing, off white head which dissipates to nothing. nose is sweet, treacle, pine, ginger, clove, dried coriander, basically five spice. Taste is sweet, spicy, dried coriander, pine, ginger, cinnamon, nutmeg. It’s got more sweetness than usual. Really really nice. Will buy a couple more.\nEarlier Rating: 3/20/2011 Total Score: 3.9\n2009 bottled version. Pours dark brown. Slight head. Aroma is complex. Roasted malt, pine kernels, Christmas spice, bit of citrous at the back. Flavour is rich with toasty malt, citrous, pine, spice. Nice combination of unusual flavours. Mouthfeel is fairly thin, so schwartbier rather than British Christmas ale, porter or stout.\r\n\r\n2012 - nose is malty pine needles, slight menthol, earthy, cinnamon. Taste is malty, caramel, cinnamon, pine needles, menthol. Body is a bit weak, but it’s nice. Would rate it 3.8.", "Pint from decanter wine bar in leeds. Dark winter fruits on the nose, appearance wise it’s black. The taste is complex and challenging, again the winter fruits come to the fore with the inevitable coffee. Strong but very moreish.", "Nice roasted dry cocoa bean with a hint of piney hop come through the smell. Deep brown with frothy soap bubble head. Dry char lets a light spice and a fragrant fruity pine come through. A little soapy mouth feel.\nEarlier Rating: 12/26/2015 Total Score: 4.5\nBig roasted flavors to the nose. Deep dark brown with light head but lasting head. Really smooth intro fades to a slight spice in the finish. Good doesn’t get you too Christmasy.", "Earlier Rating: 12/10/2016 Total Score: 2.7\nPours a dark brown with brown head. A malt based aroma with caramel. A watered down and sweet caramel taste with raisins. A sweet caramel and dark fruit malt aftertaste. \nEarlier Rating: 12/24/2013 Total Score: 3.6\nPours a dark black with a thick light brown head. A mix aroma of dark fruit, Christmas spices, and some malt. Taste is light with a mix of fruit, spices including cinnamon and nutmeg, malt, some raisins and light coffee. A light aftertaste. Overall a good Christmas beer which I purchased in a 51oz bottle.", "Really enjoyed this one. Often Xmas brews are too boozy and sweet. This one has malty fruitiness but also nice crisp bitterness. A good one.", "2016 edition on tap @Lawendowa 8 Gdańsk (Dec 2016)\n\r\nVery spicy aroma full of cinnamon, nutmeg and plentiful others. Some molasses and caramel also present. Taste is sweet and very weak bodied, feels watery and that was a disappointment.", "12oz bottle from the state store \n\r\nPours clear dark brown with a small beige head, light lacing. Aroma of toasted malts, cinnamon, nutmeg and pumpkin spices. Flavor of dark fruit, nutty, caramel, bready and spices \n\r\nOk, but I wouldn’t recommend it. \nEarlier Rating: 12/13/2010 Total Score: 3.4\n2009 bottle shared at the SLC holiday tasting \n\r\nAppearance: Dark brown with a medium off-white head and good lacing \n\r\nAroma: Pine and brown sugar \n\r\nTaste: Pine and dark fruits \n\r\nVery nice", "2006 bottle thanks to Douglas.\r\n\r\nA: Pure black with a cappuccino head.\r\n\r\nN: Cola, all-spice, pumpkin malt, minerality, oxidation, some toffee, and a good amount of clove.\r\n\r\nT: Sweet and a bit spicy.\r\n\r\nM: Medium body, no alcohol, soft carbonation.\r\n\r\nO: Still going. This has aged decently, though I wouldn’t let it go any farther before consuming lest it fall apart.", "Score: 7 / 4 / 7 / 4 / 15\n\n2017 vintage: Dec. 12th 2017, 355 ml bottle from BeerLovers, bb 09-2019.\nMore dark bread in the taste than previous versions I've had. Lots of well integrated spices. Score raised from 3.6 to 3.7\n\n2016 vintage: Dec. 12th 2016, 355 ml from BeerLovers, bb 08-2018.\nDark copper-brown body, with a big, creamy, lacing, dark beige head.\nAroma of nuts, dark bread, dried fruits, spices, some banana, some cocoa.\nTastes of dark bread, cocoa, spices, dried fruits, roasted nuts, some toast, some liquorice.\nMedium, oily mouthfeel, with an average carbonation.\nFinishes smooth, roasty, a bit dry, toasty, bready, a bit spicy, with cocoa and some roasted nuts.\n\nNice one. Smooth and well balanced, with a well hidden alcohol. Less spicy than previous Anchor Christmas Ales I’ve had, but with interesting dark bready and medium roasty notes instead. I’m just missing the last bit of character maybe, while it still is a pleasant, dark winter ale.\n\n2014 vintage: 12/16/2014, 355 ml bottle from Ammersin 5 Vienna.\nDark copper body, with a medium, creamy, beige head.\nAroma of yeast, christmas spices, dried fruits, some chocolate.\nTaste follows this pretty much, with some more subtle bitter hops.\nQuite full, creamy mouthfeel, with an average carbonation.\nFinishes very spicy, quite dry, a bit bitter hoppy and slightly sweet malty.\n\nNice! Not my favourite Anchor beer, but a nice christmas beer, quite unique, with lots of spices. Lacks the last bit of character though in my opinion.", "Opaque black pour with a small beige head and fair retention. No lacing. Soft dark malt flavor with a light spice taste. Smooth mouthfeel with a warming finish.", "Dark copper brown pour with a profuse mocha tan head. Nose shows spice and burnt sugar with prune juice and dried fruit. Some light oxidation and grassy/earthy notes. Flavor is a touch sharp with some dry and bitter spices. Dark fruit and some caramel. Medium body. Meh. \nEarlier Rating: 11/6/2011 Total Score: 3.5\nDark garnett brown pour, black in the glass. Two fingers of sticky tan head.  Very interesting nose, notes of star anise and licorice with sweet malt and birch syrup and a hint of herbal hops.  Flavor kind of falls flat, needs body and background character for the spice profile.  This beer as it is is a white canvas for spices as opposed to a beer whose character is supported by spices.  Needs more going on than \"natural flavors\".", "Årgång 2015. Halvsöt och aningen alkoholbemängd doft. Julkryddor och kavring, även en släng av kaffe.\r\nHelt svart brygd med ett snabbt avtagande skum som lämnar en snygg hinna.\r\nSmaken är mustig och kombinerar kaffe och beska i början, därefter kakao, aning vanilj och muskot. Torr avrundning.\r\nFörvånansvärt tunn kropp och en välavvägd kolsyra.", "Bottle from Whole Foods Market in Redwood City, CA. Aroma is cloves, cardamom, nutmeg, raisins, spiced breads. Taste is cloves, raisins...great balance of spice and sweet (without being too cloying or overwhelming). Very festive. \nEarlier Rating: 11/11/2014 Total Score: 3.7\nFormat: Bottle from Whole Foods in Redwood City, CA\n\r\nAroma: Cloves, cinnamon, burnt sugar, light pine\n\r\nTaste: Mild sweetness up front, then earthy hops and a tangy sweetness left in the mouth \n\r\nPalate: Tingly carbonation, light body\n\r\nOverall: A solid option for those who enjoy the seasonal autumn / pumpkin beers", "Rami Rami is drinking a Merry Christmas & Happy New Year (Our Special Ale) (2016) by Anchor Brewing Company at Konstruktorska Business CenterCola, galka muszkatulowa, migdaly, przyprawy jakiejs jeszcze, szuszone owoce a la kompot wigilijny kapke... Wanilia... Dziwne ale ciekawe i dobre. Niewiele ciala, gladkie, slodkie\nRami Rami: Cynamon? Jakies zelki anyzkowe?\nRami Rami: Lukrecja?\nRami Rami: Ryli dziwny ten aromat\nRami Rami: Troche sztuczny\nRami Rami: Ale fajny \n\nOcena potraktowana skryptem do przeliczania ocen (uzgodnienie UT/RB).", "12oz bottle. Darkest brown color with a thick lasting tan head. Aroma is more porter like, less spiced than usual, anise, molasses. Nice flavor, slight sweetness, dark chocolate, anise, slight bitterness. Big hints of Anchor Porter in this one. Some nutmeg and cardamom. Medium bodied and very smooth. Solid as usual. I like this take on it.\nEarlier Rating: 2/4/2009 Total Score: 3.7\nBottle at The Bruery, 2008 vintage. vertical with 2001 and 2002 vintages.  Dark amber color with an off-white head.  Aroma of roasted malt, nutmeg, ginger, cloves, and cinnamon.  Flavor is the same, malty with spices, not quite as mellow as the oldies but good.  Medium-full body.", "Bottle. Loose mocha head. Deep mahogany body. Oak, cinnamon, sour cherry, black male, brown sugar, pine, yeast. Belgian style bittersweet. Dry finish. \nEarlier Rating: 11/23/2011 Total Score: 3.8\nBottle. 2011 vintage. Reddish brown with a medium tan head. Rich red fruits, malt, alcohol, spice, nutmeg, gingerbread, treacle, licorice, red wine. Sweetish, not really any bitterness. Dry finish.", "Barwa brunatna, piana intensywna, szybko opada.\r\nAromat suszonych owoców i kakao.W smaku lekko słodkawe, melasa, suszone owoce, niuanse gorzkiego kakao. Goryczka średniej wysokości, o przyprawowym charakterze.", "Earlier Rating: 11/30/2016 Total Score: 4.1\nA bottle from Bar Eleven near Tai Power station, drunk at home. Aroma: nutty, malty. Appearance: opaque dark brown, respectable tan head. Palate: full-bodied and thick. Lightly carbonated, very complex at the end. Taste: delicious, malty, almost buttery. I like it, a successful seasonal offering!", "Botella. Cerveza de navidad. Tostada ligera y algo especiada. No mucho alcohol y fàcil de beber.", "Earlier Rating: 11/27/2016 Total Score: 2.9\nVery nice pour and nice deep dark color. Flavors are not the greatest with a slight hoppy bitterness. Will not be getting again. \n\n---Rated via Beer Buddy for iPhone", "Treated as a winter warmer, this was poured into a mug.\r\nThe appearance was a dark brown close to black color with a great looking two finger white to off white foamy head. Slowly dissipates. Mild stringy lacing.\r\nThe aroma leads with malty rich milk chocolate, and then subtle dark chocolate. Some graham cracker, subtle cinnamon, and vanilla also make a decent presence, ends with some dark fruits and brown sugar.\r\nThe flavor leans to the sweet side combining all of those notes of the aroma. Nicely blended aftertaste of all of those components of the aroma into the finish.\r\nOn the palate, this one sat about a light to medium on the body. Nice sturdy \"winter\" body. Moves malty sweet over my tongue. Rich and smooth.\r\nOverall, well done as always by Anchor, looking forward to age several of these. However, it’s too malty as an American Strong ale. I think it’s mislabeled. It should be a Winter Warmer.\nEarlier Rating: 8/11/2014 Total Score: 3.9\n2012 bottle reviewed in December of 2012 (sorry for the late review).\r\nThis was initially poured into a pint glass but later had in a snifter. The only differences I noticed was the head was a bit messier and spottier along with the smells lasting just a tad longer in the snifter than the pint glass. Here’s the rest.\r\nThe appearance was a murky brown color (honestly, it kinda reminded me of brown sludge). Anyways, no hit, because I work with sludge from time to time, I guess I’m just too used to it. One finger white foamy head dissipated in both glasses at a nice pace.\r\nThe smells bitter cocoa bean, sweet licorice with a light ginger, and cinnamon and then allowing a decent allspice to come in.\r\nThe taste was sweet, slightly bitter and having a decent Christmas spice to round things out a bit. Eventually an earthiness does come out.\r\nOn the palate, this one sat right at a medium on the body. Sessionable, I was hoping, but showing a decent sipping quality about it.\r\nOverall, though the recipe almost always seems to vary every year, I can almost never pass this up year after year.", "Very good. The nose is so rich, so fruity, so complex. Really smells like a much heavier brew, so an excellent weekday brew. Taste is great as well, but there it reveals the relatively low alcohol a bit. Nonetheless, excellent!", "I det närmaste svart med ljusbrunt, tätt, medelstort skum. Maltig doft med inslag av russin, julkryddor (kardemumma, kryddnejlika) och lite dova apelsintoner. Fyllig maltig smak med torkad frukt (russin, dadlar), lite apelsin och kardemumma och kryddnejlikor, fin sötma som balanseras av en lite avslutande beska av riktigt mörk choklad. En suverän julöl, smakrik med trevlig kryddighet och fin balans mellan i sötman.\nEarlier Rating: 12/15/2015 Total Score: 3.5\nMycket mörkt rödbrun med medelstort, beiget skum. Doftar mörk limpa, pomerans, russin och kryddor. Rostad smak, lite choklad och mörk kola, russin, lite kryddor. Doftar väldigt gott men smaken är lite tunnare än förväntat, dock en riktigt trevlig julöl.", "Pours black with frothy tan head. Aroma dark chocolate and clove. Taste medium sweet and a little umami. Palate medium body, sticky texture, soft carbonation, long finish. Overall a Christmas Beer likely to appeal to those who like it sweet, those who don’t like it sweet, and those who like everything in between. A safe bet for everyone I reckon.", "Bottle (labeled Christmas Ale 2016); pours dark brown with a beige head; aroma of spices, molasses, and malt; taste is sweet with spice, caramel, molasses, and malt; finish is dry with some spice", "Hatalmas, tartós, barna hab, sötétbarna szín. Édeskés, fűszeres illat. Pörkölt malátás, karácsonyi fűszeres, de szerencsére nem vitték túlzásba, egész jó lett. Közepesen szénsavas, enyhén kesernyés, egy picit lehetne testesebb. Könnyed karácsonyi sör, nem rossz, de nem is nyűgözött le.", "One of my favorite beer! Pours gold colour beer with a medium head. Well-balanced!", "Jouluinen haju, väri syvän tumman ruskea, valkoinen vaahto. Maku hieman vetinen, mutta karvas. Haju makua parempi.", "12 oz pour into tulip. Dark, opaque, moderate tan head. Nose is spiced, sweet, gingerbread. Palate is creamy and smooth. Taste echos nose with a dry, bitter finish. Maybe a little flat taste, though.", "Bottle. Dark amber color. Aroma: malt, caramel and wine, spices. Similar taste: sweet and spicy, carmel, malt, a little watery.", "Incredibly soft mouthfeel makes this a delightful brew! Pours nearly black w/ a big foamy tan head w/ spotty lacing. Has some nice Christmasy spices in the aroma that draws you in. The taste carries some of these spices but it’s a touch thin which kind of waters down the flavor. The light body is actually quite enjoyable tho! Solid beer!", "2014 version. Classy; pretty impressive amount of spices atop a caramel malt nose: allspice, pine, gingerbread, star anise, juniper? Who knows. A “flat coke” signoff. Little thinner than, but reminds me of, Kerkom’s \"Winterkoninkske\" beer – a good thing. Sweetness is balanced out with a slight bitterness (that sort of light end typical of, say, Porterhouse Brewery). I know this is going to sound very “Waitrose” (up-market UK supermarket), but it does remind of the year Heston Blumenthal did mince pies with pine sugar; maybe it’s the Christmas thing.", "Pours deep with medium beige head. Nose is malts and whisky. Aromas are toasted malts, herbal hops, whiskey and woody notes. Low carbonation, medium body. Medium earthy finish.", "Bottle at desk in work . From beer hawk. A dark black / caramel brown coloured pour with a lasting light tan head. Aroma is liquorice spiced spruce tips, woody nutmeg, brown sugars, christmas spice. Flavour is composed of bitter black liquorice, chared wood, spruce and pine needles, some jammy fruits, apricot. Palate is medium bodied, medium sweet, powdery highish carbonaton, semi drying. Decent for a SHV.", "Dark nutty color with a fine tan head. Looks nice. Ok intensity in the aroma. Medium (+) body and an average carbonation. Tad sweet and a moderate bitterness. Bready, some spices, fruity and toffee.\n[Bottle (as Christmas Ale) from Gundersen]", "as always wonderful cinnamon nutmeg and gingerbread aroma with a caramel note also..dark brown no light passes thru with tan filmy head and lacing..taste a little more hoppy(pine) than apparent in the nose with the abovementioned cinnamon ginger flavors as well burnt malts and smoke apparent as well surprisingly dry finish..light-medium bodied long dry finish with a coka cola like aftertaste this isn’t my favorite one could use more sweetness and is even slightly harsh,still unusual and tasty though, a hop fan may rate this higher (2015 batch)", "Bottle from Cocktails, Littleborough. 2013 Christmas Ale version. Dark reddish-brown with a thick frothy head. Includes plenty of dark malt, which is lightly spiced, with hints of roasted malt, but mainly sweet.", "355 mL bottle. Dark brown pour bordering on black. couple fingers of light tan head, large uniform bubbles, reduces to to a thin ring / cap.Interesting aroma, spice, licorice and blueberries. Taste is more caramel and spice with a fairly strong roast bitter finish. Medium to fine carbonation with a thin body. The strong roast finish says sip but palate says gulp, otherwise pretty darn good.", "2015 The beer is dark even black when you pour it.\r\nThe foam is beige with large bubbles.\r\nSmells against some little, and the taste is less than I expected.\r\nBut the malt is there and some brödighet.\r\nThe scents here are darker but still a bit tame.\r\nA little dark bread, raisins, dark syrup.\r\nFind some chocolate, vanilla, caramel, nuts and a little Christmas spices.\r\nA little malt and hops dull, maybe some coffee.\r\nAt first sip, the whole beer a bit smaller than expected, a little more tasteless and dropped character.\r\nIs a roasted flavor, the bread will find fairly quickly, with hints of raisins.\r\nAre some sweetness by the vanilla, chocolate, caramel, malt.\r\nAre some Christmas spices, cardamom, nuts, slabbe coffee.\r\nA little more carbon dioxide than I thought with it disappears quickly, a little bitter at the end.", "2015 Draft @ Concourse, LAX. Slightly sweet aroma. Black color with dark reddish highlights, and tan head with good lacing. Slightly sweet, malty flavor, with slight bitterness. Med bodied. Overall a pretty good holiday beer.", "33cl bottle. Dark brown color. Brown medium head. Medium bitterness, low to medium sweetness. Aroma is roasted, herby, woody, leaves, fruits.", "Bottle 0.355l from Only Good Beer Budapest Hungary.Taste at home Belgrade Serbia.25.12.2015.Merry Chistmas.Pour it dark color with small dark head.Aroma blueberry.Taste of molasis,dark black fruits,licorice, skunky.Interesting spice finish.", "The aroma has both rich caramel malt and piney hops; taste is pleasantly sweet; palate is smooth. Great winter beer!", "Bottle 2014 merry Christmas. Reddish brown, minimal head. Liquorice in aroma and taste, herbs, and sweets. Strange brew, it’s like a bit oxidated, some cherry or madera like flavours. not good though.", "Poured from bottle 2015 dark brown with a nice cocoa color head. Aromas of licorice dark chocolate and spice. Taste is caramel spice and a slightly thin mouth feel with a nice roasty finish.", "Anchor Merry Christmas & Happy New Year 2015 is one great present. Dark pour with a thick off-white head that lasts. Aroma of caramel. Taste is spices and caramel with a smooth finish. Very tasty. Get this gift while it lasts!", "Drank 27-1 in Malden with Marieke (working on my new year’s resolutions ;)). Taste is fine, pretty complex. Has a nice finish, winterbeer like. Bit thin though.", "Si presenta ambra molto scuro con riflessi rossi. Schiuma beige compatta  molto persistente. Al naso caramello, spezie, dark fruits. Gusto speziato, tostato e ingresso secco. Piuttosto dolce. Corpo medio e carbonazione medio bassa. Interessante natalizia.", "12 oz. 2011 bottle tasted on 2016-01-22. Pours a deep ruby red color with a finger thick tan head. Aroma is heavy of spices, wood and a little bit of alcohol. Medium body, taste is interesting. A combination of malt and spice but I can’t put my finger on just one thing. Finish is more of the same. A complex beer.", "Bottle shared. Just odd in every way. Some debate as to whether bottle is infected and it’s a drain pour. Spice and fake wood notes dominate. Malt profile is somewhat sweet  but oddly bitter finish.  Did not drink.", "Don’t know how to rate this since it changes every year and I know it’s been different in the past (and thought I rated it). This is the 2015 version. Very dark brown with malty, woody aromas and an extremely tenacious foamy tan head. A bit of charred malt and light dark and semi-sweet chocolate in the flavor. Medium bodied and a bit watery. Nice roasty finish. Not the best version, but still a tasty winter brew.", "Refrigerated 12 oz. 2015 brown bottle poured into a glass. Opaque dark brown with small beige head. Aroma is nice spice, medium body, low carbonation, and some small-bubble lacing. Taste is caramel malt, spice, some and herbal hops. Classic rich tasting brew.", "Dark pour with a thin head. Aroma is light with a little spice and grain. Medium bodied. Taste has some spice to it. Yeasty finish. A little chocolate as well.", "Version 2015. Un liquide brune foncée avec une superbe mousse. Un nez et une bouche qui goute et sent le chocolat épicé. C’est très épicé mais fort agréable. Peut faire penser à la Résolution avec plus de corps. Très bonne.", "Dark brown color with ruby hints, frothy brown head. Aroma has fermented fruits, dark sugar and molasses. Taste is also fruity but without the fermented part. Really balanced, just the finish is slightly bitter and roasty. Body and carbonation are medium. Overall it’s an easy drinking, tasty winter ale.", "Bottle pour into nonic pint glass. Aroma is sweet dark fruits, cherry, brown bread, with some chocolate. Appearance is very dark reddish brown--virtually opaque--with finger-width light brown head that dissipates fairly quickly to ring with fair lacing. Taste is sweet dark fruits and molasses with a bit of roasted bitterness and hint of chocolate at the finish. Palate is light-bodied with thin, somewhat slippery texture, average to lively carbonation and light, dry, bitter finish. Overall, the secretiveness of the ingredients only adds to the allure of figuring out what it tastes like. This is quite good, for any season, but does evoke the holidays well. Get it while the gettin’s good!", "Bottle. Pours a dark brownish color. Aroma and taste are spices, fruit, and some honey.", "Nez: Malt fumé, chocolat, cannelle\r\nBouche: Chocolat, fumée, fruits noirs, cannelle, épicée\r\nRien de transcendant mais elle est vraiment très agréable.", "Bottle (2015) @home. Pours dark brown almost black with a good thick and creamy tan head. Spices on the nose cinnamon and slight aniseed, also some chocolate, quite malty, dark roasted fruits. Taste is toasted malts, dark chocolate nice bitter finish with a slight almost not there sweet kick.", "Very dry and not at all sweet for such a dark beer. Very rich mouthfeel. Powdery bitter cocoa and cardboard. A slight sourness in the after taste. Not much complexity. I’m really surprised by how bad this one is based on this usually great brewery, the ratebeer ratings, my like of malty dark beers. Could it have been a bad bottle?! Almost worth retrying just to find out.", "Bottle thanks to Saeglopur? . Dark brown body with tan head. Aroma is nice caramel malts with some roasted malts. Taste is dried fruits with nuts and malts. Aftertaste is nice balanced between roasted malts bitterness and malty sweetness and hints of spices", "Bottle, pours dark brown, near black, with a beige head. Spicy, malty and nutty aroma. Dark bread, nutmeg, chestnut, clove. Taste is sweet with a decent bitterness, with burnt dark bread crusts, fudge, walnut, nutmeg, cinnamon, dry leaves, white pepper with the pepper getting more pronounced in the lingering spicy finish. Oily texture, somewhat light bodied, soft carbonation, dry finish. The overload of spices is distracting.", "Brown pour with minimum head. Smell is nutmeg and cinnamon and lots of cloves. Basically a Christmas cookie. But it also smells really sweet malty. And... the flavor is too sweet/malty for me. The spices don’t shine in flavor like they do in aroma. Oh well.", "Bottle @ home from 2015 - Saveur-Biere.com - Color: deep dark black beer with no carbonation and medium brown head. Smell: roasted malt and caramel domination. Raisin and plums notes. Wood and barrel finish. Taste: light body soy taste very strange with caramel and licorice notes. Plums finish. Sweet. Aftertaste: licorice and caramel. Soy finish. Not my style.", "Good holiday beer. Dark brown color. Medium-sized , beige head . Aroma of caramel, plums , spices . Malt and spices in taste , pleasant hoppy bitterness at the end.", "Bottle.\r\n\r\nA- Chocolate covered cherries, black licorice, spices, dry cocoa.\r\n\r\nA- Dark brown color, dark liquid, light brown head.\r\n\r\nT-Light tobacco, black licorice, chocolate, dark cherries, spices.\r\n\r\nP- Medium body, average texture, average carbonation, rich dry finish.\r\n\r\nO- Not what I wanted it to be but as it changes each year I guess expectations have to change with it. At points, it seemed to lack any aroma or flavor at all and felt dry and musty.", "As Anchor Christmas Ale at Spuyt in Amsterdam. Creamy, light beige, dense head over a very dark burgundy coloured beer. Aroma of cocoa powder, coriander seed, nutmeg, dried orange peel, some coffee grounds, hazelnut, rosehip tea, aniseed, cloves. Restrainedly sweetish onset of dried fruits and raisins, dried banana, subtle seaweed-like umami accent, medium carbo, soft caramelly maltiness with toasted and nutty edges, some peppery hops in the finish along with retronasal aromatic spices (aniseed, nutmeg, coriander); toasted malt bittersweetness lingers a bit and mouthfeel remains a bit powdery, like most of Anchor’s dark beers. Not the most remarkable Anchor creation perhaps, but a nice winter warmer in any case.", "2014 version: aroma is raisins dipped in toffee sauce with malts and dusty hops. Taste contains figs, raisins and slight nutmeg. It’s really weak in the taste, and disappears really quick in the aftertaste. Dusty hop profile.", "Couleur noire, bonne mousse beige. Nez caramel, malt toasté et chocolat avec notes houblon légèrement fruité. Gout malt noir, malt tourbé, caramel cuit, reglisse fraiche, épices avec note grillée et baton de réglisse en fin de bouche. Bon corps. Superbe pour 5.5c°", "29-12-2017; bottle; at home (bought at Saveur Bière, as part of their December 2017 discovery box). Rating is from the 2015 edition, updated with the 2017 edition. 2016, 2018, 2019 and 2020 editions are also enjoyed.\nThis beer is a true christmas and new year special. When I think of a beer for this period, I think of a dark heavy strong beer. This beer definitely has the looks of a dark heavy strong beer. The color of the beer is dark brown, almost black, on first sight. When seen with a light behind it, a beautiful ruby red color is revealed. Lovely. On top of the beer a nice layer of light brown soft foam is formed. Foam retention is quite nice. A nice soft drape stays for quite some time. Not bad.\nThe beer has a nice smell. The smell is quite strong and very special. At first, I smell a little roasted barley aroma, together with a nice licorice and anise aroma. After a lot of sniffs, the smell started to remind me of HP sauce or brown source. Both the sauce and this beer have a bittersweet smokey aroma, with a little sour touch of vinegar. This little sourness is nice, but i definitely need to get used to it. It is quite special, and I don’t really know if I have ever tried a beer like this. Hops give a nice earthy aroma and I also smell some pine. Maybe pine tops have been added to the beer. I also smell some nice spicy yeast notes. All in all, quite a nice beer. \nThe taste is pretty much the same as the taste. I taste the same roasted barley flavor and the licorice/anise flavor. There is also this HP sauce flavor, but not as strong as in the smell. Again, the little sourness is something i need to get used to, but it is quite nice. Hoppy pine and earth notes and spicy yeasts finish the beer. It is nicely balanced. It is something different than usual. I like it. The spices give the beer just that interesting touch it needs. They don't overwhelm the natural yeast beer flavors or aromas. \nThe palate of the beer is nice. The beer has a nice amount of gas in it. Body is surprisingly light and the texture a bit thin, but not to thin. For a beer this dark, it is smooth and light. Carbonation is medium. The finish of the beer is nice. It has some nice bittersweet spices, liquorice and pine. A very nice beer, just like I expected and hoped it would be. A nice christmas beer indeed.", "Bottle of 2015 - dark brown pour with a decent head and faint aromas of sweet tobacco and sherry.\nIt is quite thin and carbonated in the mouth like a dark lager, with some dark sugar notes, but doesn't really pack enough punch to deliver the festive flavours it promises... There is also a metallic aftertaste that detracts a bit - I have had this in previous years and enjoyed it much more, so maybe this was just a weaker batch. Not bad, but not great; will look forward to a return to form in 2016.", "Interesting beer. Lots of fig, plums, and molasses in the aroma. Very chewy and sweet. It tastes like a big oatmeal raisin cookie. Lots of sweetness, with bit hints of molasses, chocolate, nutmeg and spice. Not quite a stout but totally full of complexity and flavor. Definitely a great holiday beer.", "Dark pour, two fingers of nice tan head. Nose is dark fruit and spice. Bittersweet. Middle is woody, spice, and dark malt with a medium mouth feel. Finish is unsweetened coco. Not flashy, but delicious.", "Pours a dark brown color with excellent lacing. Has very nice head retention as well. Tastes malty and of the usual winter spices. A nice Xmas beer!", "Pours dark brown with a medium frothy tan head. Aromas of chocolate, spiced bread, molasses, fudge, cardamom, cloves, burnt chestnuts. Taste is quite roasted, spicy and aromatic. Mouthfeel is medium bodied with medium carbonation.", "355ml bottle, 2015 version. Almost black with tan head. Aroma of sweet dark malts, cardamon, christmas spices, sweet black bread and cocoa. Taste is slightly medicinal herbal, black bread, classical Christmas spices, coffe and slightly burnt roasted malts. Medium mouthfeel, medium carbonation and roasted herbal aftertaste.", "Dark brown, dissipating head. \nMedium body, moderate flavor, flat mouthfeel eith low heat, carbonation and acidity, avg length but unappealing finish. \nBitter, dry, low acidity. \nSmoky. \nNothing I like. \n\n---Rated via Beer Buddy for iPhone", "2015 edition. Bottle. Dark ruby-black color with thin tan head and lacing. Nose has roasted malt, ginger, clove, nutmeg, and other spices. Roasted malt with some chocolate upfront. Some bitterness in the middle followed by vanilla and nutmeg--much like eggnog--in the long, creamy finish. Body is a bit thinner than expected. \n\n---Rated via Beer Buddy for iPhone", "Smells a bit like this spiced wine I once drank (mixed with a weak porter). Pours a dark brown that is almost black. Taste burt malt at the back. Upfront is a bit of coffee, a bit of cocoa, and some slight berry sourness. Also holiday spice. It is not that balanced of a beer. A bit of a mess. The ending reminds me of a cold bitter coffee. Thin, watery body.\r\n\r\nNot much of a fan.", "Bottle from systembolaget \r\nBlack deep brown, off white head.\r\nAroma of coffee, caramel candy.\r\nFizzy, bitter, taste coffee grapefruit, not so nice", "thanks final.\r\ndough, raisin, herbs, coffee, caramel, toast, black, hazy, tan foam, medium sweetness, medium bitterness, medium body, creamy, soft carbonation, unbalanced", "2015. Pours black with a tan head. Aroma was pleasant, but I wish it would have carried over to the flavor. Burnt nuts with a piney and bitter finish. More like a meh porter than a Christmas ale. Didn’t particularly care for it.", "The 2015 is very gingerbread and holiday spice tasting! It is relatively light tasting for a darker beer.", "2015 vintage. Pours a deep brown on tap with fluffy tan head that leaves moderate lace. Aroma of nice spice and chocolaty malt. Taste follows, even more on the malt, like a holiday spiced cookie, gingerbread goodness. Really nice.", "2015 edition. From cervezasespeciales. In Teku glass. Watching Sons of Anarchy 3x03. Odd taste and smell, like some kind of tree. Cant say that I liked it. Avg 2.0 (4/3/2/3/8)29 Jan 2017. 2016 edition. From Elcervecero. In Teku glass. After dinner. Much better than last year. Winter spices very well integrated, balanced, notorious but not overwhelming. Very christmasty. The more I drank of it the more i liked it. Avg 4.\n\nFrom Tercertiempocervezas. In Teku glass. With Marcos Conde cheese. Playing Duke Grabowski. Peculiar and pleasant spicy/herbal profile that fits well in its chistmas and tree themes, feeling smooth, soft and delicate. Avg 4\n\n2018 Edition. 28 Nov 2918. En Cerveceria Internacional. En shaker. Almorzando, con ensaladilla de gambas y chicharos. Maltosa y acaramelada, con una carga de especias navideñas muy bajas pero una agradabilisima sensacion en boca,suave y amargor bien ajustado. Avg 4.1\n\nEdicion de 2019. 27 Dic 2019. De Labirratorium. En copa Teku. Tras partido de futbito. En cena, con burger de ternera, y luego jugando a Blasphemous. El especiado de este año es muy suave, y no tiene el perfil herbal de otros. No disgustara a nadie aunque tampoco llegar a destacar. Avg 3.5\n\n27 Dic 2020. Edición de 2020. De Labirratorium. En copa Teku. Jugando a Tell me Why. Tiene su puntito navideño, si, con un especiado con recuerdos a hojas de árbol que sin resultar nada desagradable la verdad que tampoco es que diga mucho", "2015 vintage. Aroma of nuts, cinammon, some other spicey, juniper, some piney. Pour black with light brown head. Flavour of nuts, some fruits like strawberry, cinammon, piney bitter finish. Light, watery smooth. Medium finish, dry.", "Donkerbruin. Bruine kraag. Kruidig bier met pompoen? Weinig body. Ben er niet kapot van.", "Pours black with a thick, foamy white head. The aroma is spicy, sticky pine like. The taste is a spicy, cough syrup and pine. I have to say I really like this. I?d be into buying a few more of these.", "Bottle. Pours a dark brownish color. Aroma and taste are spices, fruit, and some honey.", "0.355 l bottle from ’De Bierkoning’, 2015 vintage (best before September 2017). Clear, very dark red to black with a thin, frothy, slowly diminishing, brown head. Sweetish, slightly roasty, fruity-malty aroma of raisins, dates, overripe banana, dark chocolate and almond. Sweetish, slightly roasty, fruity-malty taste of overripe banana, raisins, dark chocolate, coffee and nuts, followed by a short, roasty and slightly bitter finish with more dark chocolate and coffee. Medium body, slightly creamy mouthfeel, soft carbonation. Nice winter/christmas beer, although a bit faint and not too complex.", "355ml bottle as “Anchor Christmas Ale 2015” bought at The Bottle Shop in Sai Kung.\r\n\r\n\n\nLooks: Deep blackish browncolour; One and a quarter finger head with crumpety beige foam which lasts for 90 seconds; Excellent good sticky lacing with localized slight carbonation.\r\n\r\n\n\nAroma: Fragrant full dark malt, with caramel, strong toffee, light plums, traces of cinnamon, cream, very light coffee, light molasses and biscuits. Spicy aroma comes through as beer warms.\r\n\r\n\n\nTaste: Close to light sweet dark Ale malt, with roasted chestnuts, nutmeg, very light cinnamon, burnt caramel, toffee, dark fruits, light molasses, dry biscuits, yeast, lemon, light bitter hops and grass. \r\n\r\n\n\nBody: Mid to light body. Thin and dry palate.\r\n\r\n\n\nMouth Feel: Like a Porter with richer dark malt, in a watery background. Slightly burnt caramel, toffee and light fruitcake dominate, followed by apparent nutmeg and light plum. Sweetness is moderate, so does lemon wuth very dry biscuity yeast to round. Okay. \r\n\r\n\n\nHoppiness: None in nose. Fair lemon and grass in taste.\r\nBitterness is light for a lasting, light astringent caramel malty finish.\r\n\r\n\n\nAfter Taste: Very dry. Light spicy and fairly bitter to mouth.\r\n\r\n\n\nComments: Sounds like the spirit of Xmas means all things being light and easy, and so does this one - aroma is literally light as feather, taste is saved by very solid caramel malt with subtle nutmeg and dark fruits with bare-bone lemony hoppiness. Easy drinking alright, but I want something more exciting come Xmas. Unimpressive.\r\n\r\n\n\nP.S. Thank you Admin for the “Saeame Street: Feist sings 1,2,3,4” video fro my #1234 ratings : )", "From bottle, pours dark brown with a medium, frothy light brown head. Aromas are caramel and malt, nuts and spice. Flavors add raisin notes and more spices. Medium bodied. Honestly I was expecting more from this (based on the appearance?), almost like the alcohol should be a tick higher to give it more backbone. Still, an enjoyable colder weather brew.", "Dark brown color with beige head. Aroma of malt, caramel, nutty and spices. Taste of molasses and spicy.", "On tap. Pours a dark cola brown, very foamy. Aroma somewhat muted, kind of a bitter, herbal note. Flavor is sweet, herbal, and piney. Palate a bit harsh. Not impressed this year.", "This is one of my seasonal favorites and 2016’s ale is among the best in class. Pours dark mahogany but clear with a rich tan head. Molasses and ginger notes are strongest on the nose and palate. I five a hint of feral nose and there might be a slight umami flavour add well. Yummy...Santa, I need a case of this.", "Bottle 33cl, a dark beer with good head. Nose is on toasted malt and toasted caramel, spices. Aroma is on dark caramel, licorice, burnt caramel, anise, toffee, dark lager notes, nutty, burnt spices, good.", "Spicy ale which aroma hints towards amber ales. It pours a dark glass and is rather enjoyable.", "Wersja 2014. Piana kremowa, drobna i trwała, ładny lejsing. Barwa mahoniowa, klarowna. Aromat słodki, głównie karmel, suszone owoce, miód i cukierki werther’s original na równym poziomie. W smaku wbrew pozorom nie jest słodko, raczej pół słodko - na podstawie z karmelu i toffi czuć anyż, koper włoski, przyprawy korzenne, kandyzowane owoce, syrop klonowy... Goryczki i alkoholu brak. Nagazowanie nieco poniżej średniego. Dość wodniste w odczuciu. \r\nZbyt lekkie, zbyt rzadkie, jak na taką ilość przypraw, piwo bożonarodzeniowe. Brakuje tu słodyczy, gęstości i mocy... Dodatkowo anyż i toffi w połączeniu nie wypadają najlepiej.", "Updated for 2016 bottle. Pours a dark olive brown with a low light tan head, good lacing. Spicy nose of cinnamon, clove, nutmeg matched by sweet doughy malt, a hint of anise. Lovely balanced flavour from front to back of cookie dough and spices. Nothing is fighting and it stays full, much improved over last year which was over-spiced and watery at the backend. Medium feel and very smooth over the palate. Gentle and excellent.", "dark brown with a quick off white head. nose is weak and slightly spiced with a touch of brown sugar. flavor is basically a generic brown ale with a pinch of nutmeg and a little spicing. short finish. not very impressive in any way", "2013. Bottle from Van Alsem. 2013. Lots of spices, piney, coffee, cocoa. A bit watery and bitter. Backlog from 2014/03/11.", "Appearance: nearly solid black with only faint ruby highlights, one finger of rocky tan head, good retention and spotty lacing. (3/5) Aroma: toffee, molasses, coffee, dark chocolate and fruits, spices, woody spruce. (7/10) Taste: moderate sweet, moderate bitter. (7/10) Palate: medium-full slightly oily body, moderate carbonation, lingering slightly sticky finish. (4/5)\r\n\r\nDefinitely an interesting winter warmer style of brew. Lots of traditional midwinter spices and dark, molasses-y malt give it a lot of the “fruitcake in a glass” character I like to see in these ales. There’s more than a hint of spruce, which makes me think they might actually incorporate spruce tips into the brew, but it’s not overwhelming or medicinal. (14/20)", "Bottle 2015. Pours black with ruby highlights and small tan head. Nose is maple, vanilla and nutmeg. Taste adds some dark fruit. Good.", "I didn't take any extra notes when I tried this beer for the first time but I'm gonna try it again and update my comments.\n\n---Rated via Beer Buddy for iPhone", "Beer tasting @ Havregatan 151120. Bottle (355 ml) from Kihoskh, Copenhagen. [ Vintage 2006 ]. Malty and caramely with lots of dried fruits, woody with spicy and some light liquorice notes, medium sweet and a bit flat, medium body with an oily texture. The finish is dry and woody with dried fruits.", "2015 edition bottle. Aroma of maple, toffee, capucino, vanilla and cinnamom and some malts. Nice dark brown colour, head vanishes fast. Flavours are a bit porterlike, but also a bit watery. Lots of cinnamom, maple and malts. Sweet, maple/toffee aftertaste. Ok for what it is.", "2015 version out of bottle from brewers droop, Bristol. pours deep dark ruby with an orange brown thick persistent head. Aroma is warming with doughy spice like light cinnamon, there is an earthy character against the soft roast nature and possibly spruce notes. The flavour has a dry, nutty roast/char flavour which is balanced by a silky texture. There are subtle spice notes here. Toward the back of the tongue there is a liquorice flavour reminiscent of my early homebrew but much cleaner and later,, some doughyness is perceived in the flavour. Overall, some great flavours and certainly a multifaceted beer though i would say the dough character is somewhat overwhelming some other aspects of the beer. Very nice, though.", "Pours a dark brown with ruby glints where light comes through. A large brown-khaki head forms and retains well. Prune, brown sugar, and a little coffee are noted in the nose. I like the way this drinks--a soft, moderately thick fashion. Muted sweet prune fruit, light sorghum, and some of that homebrew recipe in a box characteristic are all noted in the flavors. Reminds me of a British Porter.", "Pours a dark brown almost black color. Aroma of roasted malt. Taste is slightly nutty with a good dark malt flavor. Easy drinking with a lightly dry finish.", "Flaska. Dofter av kryddnejlika, malt, karamell och vörtbröd. Smakinslag av kryddnejlika, ingefära, karamell och apelsinskal. Något tunn i kroppen.", "Over the years, people have put their brains and palates to work trying to figure out just what the hell Anchor’s Christmas Ale is flavored with. Enough secrets have been leaked over the years you could probably figure it out after enough time on the internet. However, it’s more fun not to know. Besides, the formula changes from year to year, anyway. The 2015 release is dark brown with shades of mahogany. It has candy notes redolent of dark fruit (especially plum), toffee, bittersweet chocolate, licorice, molasses, and spices (cinnamon & nutmeg). While this is a malty brew, I was happy to note some fresh and lightly citrusy hops. The comparison is probably cheesy, but trying to guess at Christmas Ale’s components is like shaking a holiday present and trying to figure out what’s inside the box. Shit, that was lame. I’m becoming a sentimental, foolish bastard.", "Flaska från SB. Mörk rubinröd, brunsvart vätska med mörkbeieget halvt finger tjocker skum som lägger sig. Sötsur och maltig doft av russin, torr choklad, hubba-bubba tuggummi, råglimpa, pumpernickel. Även en aning lakrits, kaffe och en nypa julkryddor. Medelstor, halvtorr kropp; inleder något större för att sedan lägga sig ganska kvickt. Kanske en aning för mycket kolsyra. Ganska kraftig för sin låga alkoholhalt. Inleds med kaffe, fudge och en del mörkrostade toner - gränsar nästan till en stout! Kanske en aning ekfat och enbär. Sötman tillbakahållen i jämförelse med aromen. Efterbeskan är främst kaffe. Helt ok!", "2015 bottle purchased in CO. I pick up pick up chocolate, raisin, herbal and licorice notes. I’ve been trying it since 2007 and feel this is one of my favorites. I liked the 2007 a lot and feel this is very comparable. Hard to be 100% sure without the ability to try them side by side. I’ll hunt down a case of it.\r\n\r\n2016 bottle purchased in CO.  Pours black with tan head.  Aroma is malty herbal with hints of raison, prune and licorice.  Taste is sweet and herbal like the aroma with a bitter licorice prune finish.  I try it every year and while i like it i like the 2015 better.", "Let’s split this between the 2014 and 2006 batches...cheers Craig. \n\nDark Chestnut brown, wee bit of cloudiness and a decent light tan ringed head. Nose is very pungent cinnamon, warming spice and soft nuttiness. Initial taste is lean sweetness, soft warming choc and builds to a light herby ess. Dense enough carbonation and sticky mouthfeel. Finishes clean spicy roast and lingers spicy good times.", "2014 bottle. Pours dark brown with no head. Aroma is raisins, toffee, malts. Taste is raisins, toffee, earthy hops, dust and slight spice.", "Bottle 2014 - Light brown colour, nice creamy tan head with lacing. Aroma of raisins, gingerbread, cloves, honey and some resinous hops. Taste is dried fruits, ginger, cinnamon, honey with citrussy hop finish. Medium to full body, average carbonation. Not my favourite style, but i appreciate the balance, roundness and complexity. Nice christmas beer.", "355ml bottle at Beer Station, Xiamen on 8 Sept 2015. Pours dark brown/black with an off white head. Aroma of Belgian yeast, saison type aromas, dried fruit and medicine. Taste of a little roast and toffee.", "2014. Aroma is ginger, figs or some other dark fruit, nutmeg, malt. Appearance is a foggy reddish brown with a light tan head. Taste is figs, ginger, nutmeg, disappears very quickly. Mouthfeel is a decent carbonation but the flavor is very light and leaves immediately, which I suppose isn’t horrible. Overall, this beer is well past its prime yet somehow I doubt I would enjoy it more fresh.", "12oz bottle dated 2014. Finings-laden dark mahogany color, low tan foam. Sweet spice nose. Nutmeg, pine resin, cinnamon, raisin, clove, toasted wood & more notes in the tongue. Full- body and medium+ carbonation.", "355ml bottle at home, from Appellation Wines, Dalry Road, Edinburgh, spicy, toffee aroma, brown, thin bubbly beige head, no lacing, sweet spicy, malty, viscous", "12oz bottle shared with mr_h. Almost black, big foamy head. Leafy treacle aroma. Flavour of cinnamon and other spices. Sour aftertaste. Not my sort of beer.", "WYGLĄD: Barwa brązowa, zmętnione. Piana średniej wysokości, drobna.\r\n\nAROMAT: Średnio intensywny. Przyprawy korzenne, słody i nuty żywiczne (leśne).\r\n\nSMAK: Słodowe z przyjemnie rozgrzewającymi przełyk przyprawami. Goryczka wysoka, zalegająca.\r\n\n\r\n\nWersja 2016\r\n\nButelka z datą : 08-2018\r\n\nAROMAT : Średnio intensywny. Dominuje słodka różowa guma balonowa ewentualnie różowa wata cukrowa . W tle skórka od chleba oraz nutka anyżu.\r\n\nSMAK : Dosyć słodko, nie ulepkowato. Analogicznie do aromatu.  Wysokie nasycenie. \r\n\nWYGLĄD : Barwa Piana obfita, drobna, ładnie zdobi szkło (lacing).   \r\n\nOGÓLNIE : Inne niż wersja z 2015 roku, moim skromnym zdaniem lepsza. Teraz czekam nie wersję 2017...dopłynie do Polski?\r\n7*4*7*4*14/15", "2013 Version- Pours a very dark brown mahogany color with a thick tan head on top. Smells of mellow spiced fruit, toffee, molasses, pine resin, and gingerbread. Dry, spiced, somewhat gingerbread-y flavor. A little tart fruit, spruce, bitter chocolate, orange peel, and faint maple. Medium body, creamy texture, with a slickness that sticks to the tongue. Definitely better as it warms up.", "Light brown lasting foam and a delicate aroma of fig, plum and roasted malt. The taste varies over hard roasted malt, a little hazelnut, fig, dried dark fruit (prune / raisin) candied and dark bitter chocolate. It is without doubt a very delicious ale with clearly Belgian touch. It signals Christmas with large ’C’ and tastes determined by more than 5.5% alcohol as the label says. The bitterness is gentle, yet present, and put a beautiful end to the many flavors that bombards the taste buds to a degree almost become too violent. Now one should not complain when a brewmaster pampers with all its artist, but less hard roasted malt, less heavy fruit hues and easier fullness had also dressed this great ale. Semi-dry aftertaste.", "Poured from a 12 oz bottle into a pint glass.\r\nAroma- Malt and spices, real pleasing\r\nAppearance- A reddish-black with a small off-white head\r\nTaste- Once again the malt and spices are present. this time they are in the flavor and they deliver: very nice\r\nPalate- A medium bodied beer with moderate carbonation.\r\nOverall- An excellent version of a winter warmer", "355ml bottle v2012. Dark brown color with light beige head. Malty aroma, spicy, nutmeg, some cinnamon, dark dried fruits, light chocolate and licorice, caramel. Sweet and light bitter taste like aroma. Medium oily body with soft carbonation.", "2014 bottle, deep brown beer, good almond head, good lace. Aroma cinnamon, raisin, molasses, coffee. Taste is cinnamon, rootbeer, coffee, cloves. Palate a little light, but ok, carbonation nicely subdued. This should be mulled, I think, or done as a flip.", "355ml bottle from 2014, still available at Systembolaget Söderhallarna. Dark brown with a creamy, compact, tan head. Great aroma, cinnamon, pine, cherry, there are many scents and it is difficult to distinguish them. Smooth mouthfeel, medium carbonated. The taste begins with caramel and spices, cinnamon, prunes. Finish with fresh green pine needles.", "Color café, muy oscura... Espuma escasa. Fuerte aroma a canela, chocolate y lupulos. Cuerpo ligero y baja efervescencia. El sabor sigue al aroma, muy muy sabroso y equilibrado, apareciendo además toques de uva, y destacando por encima de todo las especias, pimienta, mucha canela sobre todo en el postgusto. Muy buena.", "2014 Bottle: This one pours a cloudy, dark amber color. There was a finger of a light tan head. Some lacing. Good nose. Malts, holiday spices are the most predominate. Getting some dark fruits also. The taste is very good. Very rich malt body, with just a bit of sweetness, Subdues holiday spices, maybe some orange, a touch of earthy hops. Very Nice!", "2014 version. On draft and the 2 L bottle. Dark brown with one finger head. Aroma of pine, spices (nut meg). Really well done and different from the more cinnamon christmas beers.", "Old rating. Enjoy this one when I get it round the season. Dark tan. Pine, vanilla, earth, clove, spices. Medium bodied and not overly spiced.", "Appearance: light tan head, the beer is a very nice brown color that's transparent around the edges, some maroon hues in there\nAroma: caramel malt, spicy, maybe a bit of lemon, potpourri \nTaste: spicy, some sweet caramel malt, even some bitterness on the finish\nPalate: lively carbonation, slight bitterness on the finish, medium mouthfeel \nOverall: this beer does remind me of Christmas, pumpkin pie, potpourri, warm spice are all in there, this is the 2014 version\n\n---Rated via Beer Buddy for iPhone", "17.2.2015. Spicy nose. Flavour has cloves, ginger, cinnamon, sugar candies, dark fruits. It really is spiced beer. Decent in small amounts.", "Piwo kupione w Piwo Regionalne Katowice na Mariackiej. Edycja na 2014 rok. Ciemne piwo z rubinowymi refleksjami. Piana ?adnie budzi szk?o, chocia? jest obecna tylko w postaci kr??ka. Przyprawowowy aromat - go?dziki,cynamon, ga?ka muszkata?owa, any?(chyba) i jaka? mniej s?odka przyprawa. Smak to jeden wielki festiwal przypraw. Jest piernikowy ale same piwo jest wytrawne. Poza przyprawami w tle czu? lekk? ciasteczkowo?? od s?odów. Bardzo z?o?one i bardzo dobre piwo.", "Toffee, gingerbread, licorice, hints of alcohol, bitter coffee finish. Does have most qualities of a classic xmas brew, but somehow a bit unbalanced, specially by Anchor standards.", "Backlog, Christmas 2014. Bottle. Dark brown with two finger tan head, dissipates quickly leaving some lacings. Wonderful aroma of pine needles, vanilla, spices, liquorice, malt. Taste about the same with a dry finish. Medium body, light to medium carbo.", "Keg at Brewdog Camden. A slightly hazy deep brown colour with a thick creamy beige head. Aroma of roasted malt, aniseed, caramel and nutmeg. Taste of roasted malts, herbs, spice, liquorice and nutmeg. Light bodied and a watery texture. A crisp, herbal finish. Little thin but nice flavours.", "Poured from bottle to lager glass a bottle brown with huge tan head that lasted. Plenty of tan lace. Aroma was a wonderful spice infused malt that was not overbearing. Really a nice change from the pumpkin spice bombs of the fall. There were notes of spice, vanilla, malt, and clove in the taste. Well done and something that changes a bit year to year and I look foward to it.", "This is an ale I look forward to every year. This is dark and malty and perfect in the cold. This is great looking and smells amazing.", "Almost pure black with a decent head. A bit malty and bitter, quite nice. Fairly fizzy.", "12oz bottle from Masuyo’s Liquor in Asagaya. Poured into a shaker pint. Deep rich brown color (almost black) with a nice tan medium-sized head. Strong malt aroma with hints of vanilla, coffee, coriander, spruce and pine. Balanced on the palate but tends to lean toward the resiny, piney side. Chewy maltiness and oily mouthfeel. Starts out slightly sweet on the palate then swings toward a sticky, dry finish with the resiny flavors and cinnamon and nutmeg lingering.", "2014. One of my earliest good beer experiences in 2010. Anyway enough nostalgia. This is a little over spiced, or under malted. Either way it’s trying to be bold without any trousers on. It’s still great though, just a little more booze and something to tame and have a comforting hand on the shoulder. Nice lacing.", "Brownish frothy medium head, diminishing. \r\nAroma is prune, ripe fruit and toasted malt.\r\nRedish dark brown. Clear medium body.\r\nTaste is roasted malt, spicy (cinnamon, ginger), citric, prune. \r\nOily texture, medium carbonation.\r\nAftertaste is slightly acid with dry bitterness.", "Amazing head retention! very dark porter brown color. First impression of a bitter vanilla bean, not in bad way. Almost a smoky vanilla. Also good medium/full body hops are earthy and a hint of spruce or pine finish. Not a lot of aroma some malt aroma.", "Fles bij het fust gekocht uitgeschonken donker bruin met een crème schuimkraag. Geur is wat typisch groente met cacao.smaak is als een Belgisch donker met daarbij wat drop en iets laurier. smaken sluiten in mijn beleving niet echt goed op elkaar aan.", "2013 bottle. Dark ruby. Different to earlier years w more pronounced spruce or some other similar notes. Good solid Xmas beer. \n\n---Rated via Beer Buddy for iPhone", "Drank on Feb 2 2015. 2014 vintage bottle. Thanks Jo. Aroma : cinnamon, spices, herbacy, veggies, sugar candies with a background of roasted malt. App : dark brown reddish with small beige head. Taste and palate : medium body, medium sweetness, a tad watery, finish is dry, sweet and a tad bitter. Overall : not bad but didn’t really enjoy the herbal and vegetable aroma and taste. Thought it was weird. Body is even on the limit of being thin, IMO body of this kind of beer should be full. 12oz will be enough.", "Beautiful beer, clear dark black brown, ample foamy tan head. Smells lightly of cloves, nutmeg, roasted rice, like rice Crispies, or puffed rice you find in some green teas, some honey. Hint of spice, hint of bitterness, sweet body, but far from overwhelming. Nice balanced, mildly chewy mouthfeel. A touch of oiliness. Lightly carbonated. Sort of watery finish. Overall quite excellent.", "How: bottle Appearance: almost black, small tan head. Aroma: spice, cocoa, coffee, soap Palate: soft carbonation, medium body.", "Dark brown colour with a creamy large head. Aroma of nutmeg, bbq-spice, thyme and some burnt sugar. Taste of spices and caramel malt with some orange. A hint of bitterness and a smooth mouthfeel. Some dark dired fruits.", "Karamel kleurig bier met een witte schuimkraag die snel verdwijnt. Smaak zoet (karamel)kruidig ricola( de gele zak) snoepjes. Geur kruidig. Gedronken met Bryan.", "In bottle (2012); nice beer. Pours a dark brown, very think head ... taste of cocoa and some caramel, and spicy notes coming out as it warms up. Not quite in the class as Belgium Christmas ale’s but a good beer none the less ... I would buy again for sure", "Draft sampler pours brown with a tan head. Aroma of malts, caramel, toffee and spice. Taste is cinnamon, malts and nutmeg.", "355ml bottle, 2014. pours a brownish ruby with quite a large cream coloured head. aroma is spices, malts and caramel. taste is alright... spices, cloves and prunes. not really my thing at all though and difficult to finish.", "355 ml bottle. -2013version.\r\nAppearance: redish dark brown, with a offwhite creamy head, good retention and thin but good patterns of lacing.\r\nAroma: Ginger , sweet malts,cinnamon,nutmeg.\r\nTaste: Ginger malts, the spices and then ginger and a hint of chocolate.and roasty bitterness in the aftertaste. Odd Sweetness. (sweet, but not cloying sweeet)Odd taste.\r\nthin-medium body, soft carbonation.\r\nOdd brew, and the taste is not for everyone, but I like how it stands out and brings something new, allthough lacking some refinement.in the taste profile.", "Bottle. \r\nPitch black pour, small tan head. \r\nSweet grapey nose, with a lot of spice. A note of red wine. Taste is the same, but with a slightly sour note. \r\nMedium body, soft carbonation.", "Opaque brown, mid sized head/retention. Acutely prominent aroma consisting of malt, vanilla, caramel, and much cinnamon and nutmeg. Mid bodied and creamy. Unique taste. Initially smooth caramel and malt with some mild spice, followed by a slightly bitter and sour combination of cocoa and spice. Interesting but not outstanding.", "ENG: 12fl. oz. from Liquor Mart in Winnipeg, poured into a glass. I am drinking a \"Happy New Year 2014\" labeled version, which have \"best before\" date 11/2016, looks strange, but maybe that’s the real such long term. Color is very dark brown - almost black, very clean. There was just a little yellow-brownish head which disappeared at once. No saturation. Very sweet aroma of ginger and caramel malts. In turn, cloves are most present in taste, but also spices, ginger and malt, with hint of champagne alcohol and maybe sweet coffee in the background. Some mild caramel/roasty bitter aftertaste - very nice, not arrears. This beer is not fascinating, but it’s decent. The aromas and taste are mild, and maybe that’s due to the 2014 version (so one year old). /////~~~~~///// !!! /////~~~~~///// PL: Butelka 12fl. oz. kupiona w Liquor Mart w Winnipeg, przelana do szkła. Jest to wersja z etykietą \"Happy New Year 2014\" z datą przydatności 11/2016, co wydaje mi się dość dziwne, ale może rzeczywiście to piwo ma tak długi termin przydatności. Kolor jest bardzo ciemno brązowy, niemal czarny z delikatnymi prześwitami. Bardzo klarowny. Piana ciemnożółto-beżowa, podczas nalewania ledwo się utworzyła i szybko zniknęła. Znikome nasycenie. Bardzo słodki aromat imbiru oraz karmelu. Z kolei w smaku zdecydowanie bardziej daje się odczuć goździki, później imbir i inne przyprawy, słodycz, z domieszką szampana / alkoholu, może nawet słodkiej kawy gdzieś w tle. Lekka goryczka karmelowo / palona w posmaku - przyjemna, nie zalegająca. Niestety to piwo nie zrobiło na mnie jakiegoś szczególnego wrażenia, jakiego spodziewałem się po piwie tego typu. Niemniej jednak piwo jest pijalne, delikatne. Aromaty i smak były bardzo dleikatne, co może mieć znaczenie, jeśli ta butelka faktycznie jest z przed roku (co można wywnioskować po etykiecie z 2014).", "Appearance is medium tan head with brown color. Aroma is relatively sweet. Taste is sweet malt with hints of spice. Overall not the greatest winter beer - not enough to it.", "355ml bottle at home. Somewhat reddish pale dark brown with a medium off-white head. Medium body with moderate carbonation. Quite bitter with some sweet tones. Malts, clove, caramel, brown sugar, some chocolate and red fruits. A decent winter brew.", "33cl @ bottle. Birra natalizia del birrificio di San Francisco. Scura, speziata e pure leggera grazie al poco alcol presente. Davvero buona.", "A great holiday ale. Pours a deep black with a tan head. Smells amazing, cloves, licorice and herbs. Taste is quite herby, with a bit of herbs and some hops in the finish. Had in the bottle.", "Bottle:\r\nDeep, red-brown with a solid light brown head.\r\nCaramel malt, nutmeg, cinnamon aroma.\r\nTaste is the same....cinnamon is nicely presented without overkill.\r\nCreamy, sweet, ..festive.\r\nVery tasty.", "25cl on tap @ Only good beer, Budapest.\r\nBody is dark brown,\r\nHead is large, rocky, beige, fully lasting, excellent lacing.\r\nNose is herbs,\r\nAroma is spicy, roasted, caramel, light ash, herbs, light resin.\r\nTaste is light sweet, medium bitter, light sour.\r\nFinish is average lasting light sweet, medium hoppy and roasty bitter.\r\nMedium body, sticky texture, average carbonation.\r\nFine, interesting, feels like a porter and schwartz beer mixture with spices and herbs.", "Bottle, can’t remember where. Pours almost black, small off-white head. Aroma is mostly cinnamon with some herbs. Flavour is smooth, lots of cinnamon and caramel malts, some herbs to soften it and make sure it isn’t too sweet.", "Pours dark brown with a tan head. Aroma is malt and spice. Taste is thin malt with some spice.", "Currently I am updating my ratebeer with al the beers I drank but was too lazy to rate at the time. I give the scores I gave back than. If I drink the beers again I might re-rate them.", "Bottle. Cinnamon, nutmeg, and caramel malt aroma. Brown with small head. Sweet nutmeg, cinnamon, and creamy caramel malt flavor. Very pleasant.", "12 onz Bottle thx Heather and frank A: red fruits, dark caramel, licorice, brown sugar, minty/cinnamon app: dark brown beige head and excellent lacing t/p: med body with moderate long bitter finish. O: OK. Interesting aroma lacking some body/mouthfeel. I guess I prefer bigger Xmas beer.", "Bottle from Beer Dock, Crewe. Pours dark ruby with a feint off white head. Plenty of spice, well carbonated. Easy drinking. This is what a Christmas beer should taste like. Very good.", "2014 holiday version. Plenty of spice worked well into the maltly (caramel and biscuit) ale. It’s easy to get this wrong - particularly when not done in a barley wine. But they don’t. Well balanced against the sweet malt I get cinnamon and nutmeg. Evokes those holiday images a la Proust.", "2014 edition caramel, coffee, licorice, brown, brown foam, light sweetness, slick feel,", "On tap 5 oz. taster at Lures in Crownesville, MD. \n\nClear, but very dark mahogany with a small khaki head and fair lacing. \n\nAroma of spices, caramel, bread, plums and raisins. \n\nTaste of dark fruit, cinnamon, ginger, nutmeg, pepper and caramel. \n\nMedium body and medium carbonation.\n\n---Rated via Beer Buddy for iPhone", "Mörkbrun vätska med liten brun krona.\r\nÅterhållsam doft med lätta kaffeinslag.\r\nLätt kropp och liten smak. Syrlig och \r\nTämligen smaklös. Lättdrucken och \r\nSmakar inte illa på något vis men tråkig.", "355 ml bottle. Pours a dark brown with a reddish hue and a large tan head that laces. Spicy aroma with caramel and roasted malt. Sweet and spicy flavours of cinnamon, nutmeg, ginger, caramel and roasted malt with a dry finish. Medium body with an oily texture and soft carbonation.", "Poured from a 12 oz bottle purchased as a chilled single from Wholefoods, Fremont CA. Very dark ale. Little carbonation nor head. Spice upfront, and rich caramel malts. I get this beer, not my favorite but respect the brewer’s efforts. Would like to try on draught.", "ginger bite, floral, resin, spruce, herbs, earthy, caramel, bread, hay, cough drop, ginger, cedar, red, hazy, frothy, white foam, lightly bitter, lightly ginger, light body, medium bite, soft carbonation, creamy,", "Flaska SB Mönsterås. Sequioa fantastiska träd h201912ar en liten i trädgårde2n. Luktar som efter ett regn i Kings canyon and Sequoia nat park. Blir inte lätt att vara objektiv här...Riktig riktigt julöl. Inte kara2019mellmalt mm Funkar ej med choklad och osten får vila sig. Vinner på att inte vara under 10 c. +3 p för etiketten. Finns inga skogar att jämföra med....\r\n2016 (2015 som också dracks var 2014 pga SB-misstag).\r\nNåväl känns lite beskare än vanligt. Men välbalanserad.\r\nändrar inte betyget.\r\n20171222 men 2016 års. Tappat bort fyllighrt givetvis. Komplex smak tänk nejlika fikon inte full russin.\r\nFrisk torr svårbetygsatt. Gillar den\n\n20191223 En annan hårväxt. Mild försiktig. Lite drag av lager. Bra julöl. Ändrar inte betyget.\n\n20201223 Drack en Andechs db innan blir lite orättvist. Lite tunn. Tydlig Tuja. Bra till osten, dadlarna och pepparkakorna.\n\n20211224 Eftersom SB har då svårt med allt är detta 2020. Sequoia förpliktade. Inte uppfyllt. Lagrig nästan vattnig. Skall nog drickas färsk.", "Pours reddish-brown with moderate beige head. Tastes of malt & spices - ginger, cinnamon and others. Malty but thin and easy to drink. Not smokey, that’s a plus. Good for the style, but not my style.", "Bottle. Very dark ruby. Aroma of winter spice and dark fruit. Plum and raisin notes. Very high carb with a thin mouthfeel. A little sweet on the finish. Decent. ---Rated via Beer Buddy for iPhone", "Deep reddish brown pour out of the giant bottle, with a sudsy, tan head. Aromas of malt and spices. Flavor is a bit of the same, with some funk mixed in, but nothing too off putting. Damn, this is a big ass bottle.", "Aroma is fig, cinnamon, spice and caramel. Light plum and raisin notes. Taste is a very sweet spicy body with a very pale bitterness. A sweet spicey body to the end. Appearance is a very dark clear amber with a medium pearl head that retains well.", "2014 bottle to Nonic pint. The pour is a deep reddish brown with a decent head that doesn't last too long. The aroma is spicy and malty. The taste is spicy and malty and a bit funky. The finish is clean and bright. Nice little beer from Anchor. Looking forward to next years version. \n\n---Rated via Beer Buddy for iPhone", "2014 version in 12 oz. bottle from fridge to glass. Christmas hard candy type smell with what seems to be seasonal spices but also could be herbal. The color appears to be copperish with a light tan medium head with very little lacing. Medium sweetness to a light sourness that is taste explosion of almost a potpourri type hint that leaves it actually hard to describe. Finishes nice on the palate and makes you ready for what you might taste next. Merry Christmas and thanks for providing a unique tasting experience each year. \r\nNice sequoia drawing on the label this year! Nothing like a good seasonal with taste and meaning.", "Spiced, dark malty, syrup of the fragrance. The flavor of the butter, syrup and some yeast too. Weak bitterness in the aftertaste that fills the mouth for a long while. Okay beer to drink. Follow me @ Kung av öl @ Facebook for more pictures and ratings.", "2014 version on tap at Yard House Waikiki 221214. Nice Christmas beer with some spice in the nose. Mild brown colour with a tan head and nutmeg flavour.", "2014 flaska. Mörkbrun öl med kaffefärgat skum. Kryddig maltig doft med en söt god smak. Lagom styrka. Gillas!\n\n---Rated via Beer Buddy for iPhone", "Bottle from Systembolaget. Aroma is malty and spicy. Pours almost black with a small beige head. Taste is smokey and has some roasted malts. Palate is a bit oily. Overall a decent beer, not very tasteful though.", "Pours a dark deep brown with a brown-white 1 finger head that lingers. Aroma is a sweet dark fruit/cherry with notes of vanilla and spice. Taste is of spice and bread with a light bitterness that finishes smooth and doesn’t last long. Mouthfeel is slick and refreshing. This is definitely a great beer to relax to on a winter day and all the flavors and aromas combine to hit the mark", "Een volle, zoetige en kruidige geur en dito smaak. Duidelijke aanwezigheid van hop. Ideaal om mee te stoven, maar vooral om te drinken. (2014-versie.)", "2010 Version on tap at Roman's Pub. Foamy pour, but what was left didn't last long. Dark brown color, muted smells of dark fruit. Taste follows along, a lot of plum flavor. That original hop presence is gone, and the finish is dry. After 4 years, it mellowed significantly. Very enjoyable. \n\n---Rated via Beer Buddy for iPhone", "2014 draft. Aroma is spice with some darker malt. Appearance is a very dark brown with a lasting tan head. Taste is very earthy malt with the spice coming through. Palate is spicy. Overall, a solid beer. Well done.\n\n---Rated via Beer Buddy for iPhone", "Ruby brown with excellent frothy light brown head. Earthy. Mild bitter. Fair roasty. Very modestly spiced. Dry. Interesting", "(Anchor Our Special Ale (2005 and later)) Bottle 355 ml at home, 2014 vintage, served into a snifter, ABV 5.5% \r\nDeep brown red colour on the body with a tall and thick tan head, with good retention, leaving medium lacing on the glass.\r\nAroma of spices, sugar, light caramel.\r\nSweet taste with caramel, spices on the finish, toffee and a long bitter aftertaste. \r\nMedium body with soft carbonation and a slightly sticky palate.\r\nVery good.", "Ruby with a cream head. Nice sweet fruity aroma. The taste is caramel with bitter fruitiness. Some toffee and mixed spice. Tasty stuff.", "Anchor Christmas Ale -- Mörkt orange-brun med ett orange-latte färgat skum. Doft: Bränd hallon sylt, körsbärs godis, honung, sött bröd, kryddor. Smak: Kryddor, jäst, lager, damm, malt, gammalt godis med frukt smak, lite avslagen Fanta, ginger ale, kardemumma.", "355 ml bottle. Dark amber with small off-white head disappearing very fast. Aroma and flavour of spices, yeast, raisin, gingerbread.", "On tap at Hawidere. black color, good, compact long lasting head. smells like vegetables and spices, cloves and pumpkin. medium body, aromatic spicy, tastes of pumpkin, light sweetness / light to medium bitterness, which seems to come both from hops and malts. the combination of sweet and bitterness with the spices doesnt work for me at all. too weird for me.", "Bottle. Dark cola with a thick off white head. Aroma is mostly ginger. Taste adds some weird earthiness. Thin and strong carb. Not good.", "Pint pour of fairly deep brown, with a thin tan head. Nose is Christmas,\r\nSome spices of nutmeg, brown sugar, molasses. Flavor is molasses, some Christmas spices, nutmeg and ginger, like a gingerbread man, but not a gingerbread house.... A sassy gingerbread man. She’s a sassy one... A sassy gingerbread man-woman. It’s a transvestite. A delicious transvestite gingerbread individual. Anyway, it’s a solid beer.", "As Anchor Christmas. Poured deep reddish brown with a frothy tan head. Aroma of cinnamon,, liquorice, dark fruit. Medium body, flavour as the aroma, fairly heavy going.", "Bottle. Surprised I havent rated this one yet! Pours clear hazel, medium tan head, dissipates quickly, good lacing. Aroma is heavily spiced (out the wazoo, it says in my notes), Belgian yeast, dark fruits, figs and raisins. Flavor is medium sweet and very light bitter, less spiced than aroma suggests, but still pretty overt. Medium body, high carbonation.", "2014 version. Lots of chocolate and spice. Tastes like a gingerbread cookie or really spicy kruidnoten. Dark. This could be a really good dubbel if there was more alcohol and carbonation.", "Bottled’ Poured out into me Chimay goblet . the nose on this reminds me a bit of rochefort - sorta  chocolate dark raisin spice atmosphere ..then ginger bread ,nutmeg or some shit like that  ; Khaki head above ruby is almost a 5 score . dranks sweet and spicy ; holiday spice in there .. aint as good as the aroma but is pleasant . if this had more booze it would be a mother . Im giving a point extra ...this is a really cool Christmas beer.", "2014 vintage...pour is black with a nice creamy head...super sweet on the nose...nutmeg malt and other spices...mouth is the same with bit of ginger mixed in...weird beer but it works for the holidays...spices really stay on the palate a long time...again weird!", "Poured from bottle, clear dark copper with low head. Aroma strong and complex, notes of caramel, butter, apricot and glühwein. Taste is equally complex malty sweet with little or no bitterness. Odd one...", "2014\r\n\r\nServing: from bottle--purchased at The Beer Junction.\r\n\r\nAroma: moderate malt and floral aroma.\r\n\r\nAppearance: very small, light-brown initial head with no lacing and fully diminishing longevity. Dark-red/light-brown body.\r\n\r\nTaste: lightly sweet initial flavor and lightly sweet, roasty finish with average duration.\r\n\r\nPalate: medium bodied with watery texture and lively carbonation.\r\n\r\nOverall: okay.", "Pours dark with a small head, aroma is spice star anise, cardomom, christmassy mulled wine spice. Nice balance between malts and spice.", "Pours a dark brown body with a thick head. Discrete malty aroma. Rich and nice taste of malt and spices.", "Merry Christmas Happy New Year 2013. Meget mørk brun med et holdbart lysebrunt skum. Portvinsagtig duft med tørret frugt og en helt uventet tynd og tør smag. Let syrlig med en antydning af lakrids og en let bitter eftersmag. Ikke nogen stor øl.", "Dark ruddy brown with a small off-white head. Dried fruit and spice aroma. Medium body. Nicely balanced flavour with spices, including ginger and nutmeg, sitting beside brown bread crust malts.", "A dark, spicy ale with a hint of nuts. I tried the 2014 vintage and disappointed in it given its high rating here.", "Had the 2014. Brown copper pour. Tan thick head. Sugary and creamy brown sugar and sweet. Flavorful obviously. Good. Poured from a bottle at Delilahs Christmas tasting.", "November 13, 2014. Bottle at home. Deep ruby red with a small tan head Aroma is spicy with juniper, pine needles, caramel and black berries. Taste is medium sweet caramel and dark berries with a dry spicy and light bitter finish. Smooth medium bodied with soft carbonation..", "Flaska från SB. Underlig doft som luktar kryddbod och parfym. Smaken är likadan. Nä tvi. Julens klart vedervärdigaste öl.", "Na ecie rocznik 2013. Aromat przyprawowy - korzenny, cynamonowy, cukierkowy, czuć piernik. W smaku - cherry, bombonierkowe - baryłki z likierem cherry, słodkie, korzenne, goryczka niska, na finiszu wyraźny kompot z suszu co czyni to piwo najbardziej świątecznym jakie dotąd próbowałem.", "A nice aroma with hints of chocolate, raisins, vanilla and nuts. A very subtle liquorice tone.\r\n\r\nAlmost wine-red to brown-red in apperance, with a white head that quickly disipates.\r\n\r\nA light taste of raisin, liqourice, chocolate and brown sugar, with traces of vanilla and bread.\r\n\r\nLight body, thin texture, soft carbonation and a relativly short finish.", "Bottle. Dark brown pour with a bubbly tan head - surprisingly dark, looks kind of like a stout. Some christmas spices in the aroma; a bit like a ginger snap, with notes of nutmeg, molasses, caramel. Flavour is malty, some molasses and caramel with a blend of holiday dessert spices, some fruitcake notes. A little lighter bodied than it looks, but tasty and definitely interesting.", "12oz bottle from Giant Eagle in Upper Arlington. Dark brown pour with thin beige head. Aroma of dark fruit, christmas spice, little licorice. Tastes are roasted malt, herbal, clove, cardamon, raisins, little citrus. Soda vibe. Interesting.", "Flaska från systemet - Doftar verkligen jul och lite parfym. Färgen påminner om julmust och med vitt skum. Har en tydlig smak av jul med men tyvärr smakar den parfym med.", "355ml bottle. Dark brown body with a large, slightly tan, head. Lacing. Spices, licorice, bread and a hint of roasted elements. There's a touch of something that reminds of Underberg...\n\n---Rated via Beer Buddy for iPhone", "355 ml bottle. Clear amber with white head. Smell is sweet caramel with fruit and liqurice. Taste is sweet caramel malty with juniper and berries. Semi dry with medium bitterness and medium carbonation.", "Tråkig och tunn smak.   \n\n---Rated via Beer Buddy for iPhone", "From a magnum bottle. Near opaque brown with fizzy head. Chocolate biscuit nose. Sweet juniper taste. Smooth finish. Another great day at the in-laws.", "This is certainly one of the more interesting beers I’ve ever had. Pours a dark iced tea color. I couldn’t figure out what I was smelling at first.. But after a while I deduced that it was tree sap and pine needles with a mild but persistent dose of anise. Sweetness up front with anise and a pine bitterness at the end. Very unique and quite good.", "This is an enjoyable festive Christmassy ale. Spicy and bold. This one is unique and I would think with it’s color and spice it ages well over time.", "2015\r\n\r\nPoured into my CBC Teku while doing some late night writing... Seems like a good enough reason for a break.. Pours almost black with a picture-perfect dark tan head with great lacing.. Lighter than expected spicing on the nose makes me happy.. Dry-ish dark malts are punctuated by the sweet spice notes... Flavor is also pretty dry across the board with some dusty cocoa and dry toast, perhaps a little watery.. I guess the spicing this year, mace, ginger and nutmeg??? Thought noticeably less pronounced than any recent year in my memory.\r\n\r\n2014\r\n\r\nPicked up 4x bottles at the COOP but it will hit all the bottleshops, enough to drink one cellar a few to keep my vertical going. Poured into my FW goblet... 1/2\" dark tan head atop a very clear deeeep ruby/walnut brew. Nose is traditional sweet spice, cinnamon, nutmeg, mace? Dry maltiness does little to help bloom the bouquet.. Sorta watery on the palate, not much malt to carry and deliver and leaves a sorta dry/dusty spiciness on the finish. Okay... Glad I got this finished for the year.", "Tastes like plastic, cloves, cinnamon, and slight caramel and smoke. Very gross combination and very bitter after taste.", "12oz into a 6oz sample glass. Pours a mild chocolate brown. Fun, chewy granola, amber, fluid red grape rasin aroma. Dark fruits prevalent. Taste of figs, raisn, dates, amber waves, and malty riches. Solid hearty drinking brew, love the low key aspect of it. Fluid, righteous, and satisfying. Nice beer for the season.", "@ Nedre Mölla 17/11-14. Bottle from Systembolaget. Aroma: Christmas spices, fruity, notes of caramel. Taste: Christmas spices, fruity. Body is medium, the finish is medium dry and medium bitter with notes of christmas spices.", "This special ale is easy drinking. Merry Christmas happy new year 2014. If I drink a few more of these it it'll make for a very happy night even though Christmas is a little ways away still. \n\n---Rated via Beer Buddy for iPhone", "Season 2014/15 version. Dark brown. Tan head. Interesting aromas, juniper, spruce lingering above a kola induced malt. Medium bodied, medium bitterness, slight sweetness. Hints of juniper and spruce. Fresh yet dark enough to fit the season. Interesting, with a lot of taste going on!", "Svart med litet ljusbrunt skum. Doftar och smakar lite juligt med inslag av enbär!? Ok men inte mer", "Dark copper color. Beige head. Medium to thin body. Dry, some bitterness. Some odd aroma I can’t really define. Malty taste.", "It pours like a coke in color, with a handsome, frothy, quarter-inch head. It smells like Christmas in a bottle: eggnog, fruitcake, allspice, nutmeg, and vanilla curd are complemented by piney, herbal hops. Very inviting. The mouthfeel is medium to light, velvety with adequate carbonation. The taste is primarily bitter from the hops, with a spicy, orange-pelt sweetness rounding it out towards the end. It’s good, but it does not deliver on the promises the nose made. I generally like my Christmas-season beers a lot stronger, darker, stickier, and sweeter, but I enjoyed this.", "Pours deep dark brown with a finger of light tan head. Aroma of malt, caramel, toffee, light citrus, light butterscotch, not very Christmas-y but nice. Taste is light to medium sweet with quite heavy burnt butter flavors, especially in the lingering finish. Light body with soft carbonation.", "Gingerbread aroma. Gingerbread spice taste, with hints of satsuma orange. Lots of wort flavored bread also. Quite dry. Heaps of Christmas in this bottle.", "355ml brown Christmas 2014 themed bottle, poured into a Tulip glass. Appearance is opaque nearly dark nearly black copper colour with a medium sized beige frothy head, that reduced fast leaving some lacing. Aroma of caramel, spices . Flavours of caramel, spices, herbs and syrup loaf. Taste is light-medium sweet and medium bitter. A good Christmas beer, perfect level of sweetness and a pleasant mix of flavours.", "Nä tvivale som min mor hade sagt. Visst, väldigt julig, viss stjärnanis, men det gör var INTE bra. Fick hälla ut resten. Victor, undvik denna ölen !", "Flaska från SB. \nDjupt rödbrun vätska med fint brunt skum.\nDoftar härligt kryddigt och fruktigt. \nMycket fyllig, sött och krydda. \nLite tunn kropp kanske, men inte så det stör. \n\n---Rated via Beer Buddy for iPhone", "May be my favorite Christmas ale. Nice dark color. It's got notes of nutmeg and fruitcake. Nicely carbonated and velvety. Yum! Best offering from anchor \n\n---Rated via Beer Buddy for iPhone", "Bottle brew dog Sheffield. Brown slight head. Aroma cinnamon nutmeg dried fruits taste same Xmas cake in glass body tad thin. Good stuff", "Bottle from brewdog bar, sheffield. Dark brown with no head. Aroma is cinnamon, other spices and roasted malts. Taste is warming and tasty, malty and slightly smoky. Tingly carb and quite thin.", "Bottle 33 cl. Year 2012. Deep red, With a ok offwhite head. Dark fruit aroma, anis, spices and light chocolate sence. Lighbittersweet With a soft dark fruit end.", "OK, maybe THIS is my final beer rating of 2012. Bottle courtesy of Ken, thank you sir! Very dark brown color, small tan head. Aroma of pleasant Christmas spice. Taste is nutmeg, cinnamon, allspice. Decent.", "Transfer from BA review on 12-2-12-\r\n\r\n Poured from bottle into pint glass\r\n\r\n Appearance – The beer is poured a brown color with reddish hues shinning through. A huge tan head is present upon pouring. It has great retention, eventually fading to give a good level of lacing.\r\n\r\n Smell – The aroma is sweet of cherry and some roasted brown bread aromas. Mixed with these aromas are spices of cinnamon and nutmeg with a god dose of pine hop. Rounding it all out is a light nut smell.\r\n\r\n Taste –The taste begins with a roasted brown bread and light nut taste with a very small amount of toffee sweetness. A light dark fruit soon replaces the toffee. While the sweet taste changes, overall the sweet remains light throughout the taste. More roast flavors develop at the middle of the taste. These combined with an increasing spicy taste of cinnamon and nutmeg. At the end a good presence of pine and earthy hop come to the tongue. These create a green hop taste to linger on the tongue which mix with the spice and roast flavors to leave a slightly bitter roasted flavor to linger on the tongue.\r\n\r\n Mouthfeel – The body is a on the slightly thicker side with a carbonation level that is on the lower side. They are rather good for the hop, roasted, and spice flavors of the brew and while only at 5.5 % make it more of a sipper then traditional brews of similar strength.\r\n\r\n Overall – Not a bad more bitter and roasty winter ale. While I traditionally prefer something with a little more sweetness in a winter warmer, this beer has a nice blend of flavors and feel which are nice for the drier tastes.", "Every year during the holiday season, Anchor Brewing releases their Merry Christmas/Happy New Year seasonal ale. Each year they tweek their recipe and put a different tree on the label. \n\n---Rated via Beer Buddy for iPhone", "Vintage from 2011. Bottle from vinmonopolet. Pours colabrown with weak 1/2 cm foam. Aroma of old bitter christmas chocolate, sweet liqorice and some herbal tones. Taste of light chocolate, rounded liqorice, like old pannetone cake, some harder herbal tones but still balanced and rounded pretty good. Some warming tones but a very balanced beer. \r\n\r\nA cool beer but that said im not a big fan of herbal beers. Make me think of Fernet that i dont like", "50.7 oz magnum is 2008 vintage. Pours a dark brown with lasting beige head and thick lacing. Aroma is bittersweet chocolate and an amazing spice profile: cardamom, cinnamon, nutmeg, and slight ginger. Flavor is same with balanced spice complexity to include above with a resinous pine note. Medium bodied, soft carbonation, and pleasant bitter pine finish. This aged well.", "Bottle into small tulip. \n\nPours a deep managing with a thick (almost creamy) mocha-colored head. \n\nSweet malty notes on the nose with hints of raisin. \n\nDrinks with strong carbonation and a bit of roasty malts but overall uneventful. It does have that wintery vibe too it (especially on the finish) bit I'm not sure I'd reach for this again. \n\n---Rated via Beer Buddy for iPhone", "Bona cervesa, bastant equilibrada i gustosa.\r\nBuena cerveza, bastante equilibrada y sabrosa.", "Botlle 33cl. Pours reddish dark brown with thick tan head that quickly dissipates. Aroma of spices and hops.", "The pour produced a tall thick and creamy meringue like head. It was light tan in color and long lasting which made for lots of sticky lacing on the glass. Under the head lies a very deep dark liquid with dark burgundy hues. It has a nice aroma of nutty roasted malt with spices like clove and nutmeg. There is a firm hop presence as well that adds a spruce like pine character. There is a solid roasted barley and mildly sweet bready/nutty maltiness with a pleasant level of clove and nutmeg spice notes. This complemented and balanced by mellow hop bitterness and flavor notes of fresh cut spruce pine. The spice and piney notes linger on well into the slow fading finish.", "Anchor Christmas 2011: Sötét, barnásvörös színe van a tetején egy vastag, krémes és szűnni nem akaró, bézs színű habpaplannal, valamint fás, pörkölt és enyhén füstös aromája. Igen intenzív pörkölésű, határozottan füstös és erősen komlós ízvilág jellemzi, melyet megtámogat egy réteg étcsokoládé bársonyos jelenléte is. \r\n\r\nAnchor Our Special Ale 2013: A 2011-es verzióban emlékezetem szerint a pörkölt malátás jelleg domborodott ki, az idei főzet azonban már a fűszeres jegyek jelenlététől hangos mind illatában, mind ízében. Talán csak a színe maradt változatlan, egyébként pedig egy gyönyörű téli köntösbe öltöztetett, ánizsos illatokkal megspékelt, kerekded és édeskés, bársonyosan sima medvecukros zamatokkal átitatott itallá vált az idei évre.", "A nice winter ale with deep and complex flavours of nutmeg, other spices, raisins and more. While enjoyable, not a beer I would have many of in one sitting, but would have many of in many sittings.", "The Anchor Merry Christmas, Happy New Year pours a dark brown color with a frothy tan brown head that doesn’t linger too long. The aroma features a lovely mixture of raisin, cranberries, cinnamon and pine. The flavor is cranberry, cinnamon, pine and molasses. Overall this is a very solid brew.", "Botella de 35,5 cl, adquirida en Cerveceria Internacional. Color ambar oscuro. Sabor a malta, caramelo, afrutado, herbal y dulce.", "Bottle. Obviously a bit of difference between the vintages, but the general impression is more or less the same year after year. Pours dark amber with a finger thick off white head. Aroma is roasted malts and caramel and cocoa, as well as a herby symphony of cloves, juniper, cardamom and sweet Christmas bread. Full body with soft carbonation. Flavour is sweet, with dark roasted malts, cocoa, coffee and kandi, as well as herby anise and cloves giving a long spicy finish.", "Pours a nice dark brown color with tan head. Dark fruit, spice, and some fig on the nose; all follow onto the palate. Finishes with some sweetness. A good winter warming beer.", "2005 bottle, opened solo in 2014. Why do I do this to myself ? ffs. Puts deep molasses brown. Obviously no head. Aromas of fig, brown sugar, dark fruits. Taste is thin, slightly oxidized, but surprisingly flavorful. Fruit, Brian sugar, lightly bitter. A bit of wood and maple syrup. Not bad for a decade old almost.", "12 ounce bottle. Pours a nice dark red-brown with a four inch tan head. Taste is of roasted malt, caramel, fruit, prunes, spice, pine and hops. Lots of flavor. Deep aroma that is similar. Has a decent body. Very easy to drink and incredibly enjoyable.", "Aroma of malt, dark fruits, spices such as clove, nutmeg, cinnamon, you name it. Flavour is very herbal and sweet. I’m generally not a big fan of spicy winter ales, but this one is alright.", "Black pour with inch of healthy beige head. Aroma of belgian yeast and blue spruce and cherry, pine hops and cream too, toffee, coriander, cinnamon, angostura bitters. Overall a creamy, boch-y beer aroma with cherry or banana. Lively carbonation, leaves teeth filmy/dry. Flavor is strange, definite strong syrupy pine/spruce, sour, malty chocolate too, cinnamon and coriander. Richteous and compelling beer.", "about as perfect a beer for me as you could get. especially when aged a few years, this beer is in my top 5. what can i say? the dark fruit and spice of this is awesome. mulled wine and nutmeg aroma with a body that tastes a lot like plum, dark cherry, cinnamon and sugar. just the right bitterness to balance. this beer ages very well and the aging will mellow out the piney bitterness and let more of the dark fruit flavors come through.", "Bottle from Csak a Jó Sör. 2013 edition. Aroma raisins, plum, cola. Interesting. Clear dark brown colour. Taste is intensely spicy. Tart sourish spruce, dirt, clove, light cinnamon. Does not work very well with me.", "pours hazy almost cloudy brown, red tint, with a small light beige head showing some retention and lacing. caramel and nutty/fruity maltiness, coriander, aniseed, cinnamno, coffee, other bitter herbs - sort of like a popular italian bitter liquor, fruitiness - cherries and other berries, hint of sweetness. moderate carbonation, light body - oily, dry bitter grassy-earthy-peppery-very spicy finish. o-k.", "355ml. Bottle. 2013\n\r\nPours dark ruby brown with tan head. \n\r\nAroma raisin, dark fruits, spice, toffee, cinnamon. \n\r\nTaste fruity sweet, some bitters. \n\r\nMouthfeel bit creamy. \n\r\nNice brew.", "2013 merry Christmas and happy new year brew.\r\n\r\npours a dark mahogany with a very large khaki head, and good lacing.\r\n\r\nsmell is of spice, malt, toffee, and dark fruit.\r\n\r\ntaste is sour, malt, spice, and some hops. ends tart and slightly bitter.", "Barwa: brązowa, pod światło rubinowa. Piana kremowa, początkowo obfita, drobno pęcherzykowa, oblepiająca szkło. Wysycenie średnie. \r\n\r\nAromat: wreszcie aromat piwa świątecznego - słodki i przyprawowy. Wyczuwalny cynamon i goździki, choć browar zaprzecza, że ich używa. Obecne także karmel, pierniki i ciemne słody. Zdecydowanie przyjemny. \r\n\r\nSmak: raczej niezbyt pełny. Gorzka czekolada, pierniki, przyprawy, spieczone ciasto, lekka goryczka. O dziwo praktycznie nie słodki, wytrawny. \r\n\r\nAnchor Christmas Ale pojawia się cyklicznie od 1975 roku. Tajny jest jego skład, który zmienia się corocznie, podobnie, jak etykieta (zawsze zdobi ją drzewo - niekoniecznie świąteczne). Zmienna jest również zawartość alkoholu. W tym roku piwo nie jest zbyt mocne i przekłada się to na smak. Nie spodziewajcie się zatem tutaj jakiejś bomby czy eksplozji smaków, bowiem jest ono raczej zbalansowane. Dla mnie brakuje trochę ciała i słodyczy, ponieważ tak wyobrażam sobie piwa świąteczne. To moja pierwsze podejście do Anchor - Christmas Ale i mimo pewnych zastrzeżeń chętnie spróbowałbym go w przyszłym roku w kolejnej wersji.", "Dunkelbraunes Bier mit schöner Schaumkrone. Geruch sehr röstmalzig, winterliche Gewürze. Geschmack röstmalzig süß, Karamell, Gewürze.", "Bottle poured a clear brown hue w/ a large frothy tan head. Moderate to bold spicy aromas. Initial flavor is moderate sweet w/ a light bitter finish. Tastes are vanilla, rye, malts, and Grahm cracker. Medium bodied w/ a dry tanin finish.", "Bottle, pours a really dark brown. Spiced up aroma. Tastes of xmas spices, notably cinnamon and ginger, some bitterness on the back end."]}