{"reviews": ["Flarra ölprovning med Peter. Denna relativt torr och smak av jordgubb och lite smultron. Välgjord \nEarlier Rating: 5/27/2015 Total Score: 2.9\nRostfärgad dryck som doftar klassiskt engelsk Ale. Det var längesedan jag Kände denna doft. Ja smakar lite rik fyllig Ale från England med inslag av lite amerikanska toner. Kola åh mjuk krämig i munnen. eftersmake lite sötma godis. Nja mesig öl säger jag.", "Flarra hos P.N. Doft av rusin vanilj o lite the!! Smakar russin  o viss fatlagring. Toffee o mycket torrhet. God o lång smak! En härlig amerikansk barley wine!", "bottle. medium brown pour with a beige head that has good retention. The aroma features brown sugar, toffee, and wet soil. The taste moderately bitter with c hops ( I guess), also in the flavor I get dark fruits, raisins and dates, and earthy-bitter hops. The palate is a bit lighter than I prefer, but still quite accommodating. Overall: Decent, paired well with some extra toasty cheez-it.", "This is a nice barley wine beer but there are better examples. It's really bitter and tingy on the tongue. As with a great deal of US beers it's about overload on the ingredients and see what we get. Glad I found a bottle.", "Feels a little aged and oxidized. Otherwise it’s like a light barleywine that you’d find nowadays, but defines the style in terms of the fig flavour. Beer temple ams", "color: marron oscuro, espuma blanca persistencia media.\nolor: alcohol, madera, caramelo,\nsabor: amargor medio, muy licorosa, carbonatacion media, cuerpo intenso,", "Colore prugna, schiuma bassa, beige, poco persistente.\nAl naso frutta sotto spirito, in bocca biscotto e liquore.", "Old notes from 09-07-14. 330ml bottle, ABV 9.4. Pours a light brown with a off white foamy head. Aromas & tastes of grapes, figs, dates, candy, caramel, touch of cinnamon & very present strong alcohol. Might be very well made, but lost on me as I think this is one of my least favourite styles of beer.", "Coup de chapeau à la brasserie Anchor qui réalise ici un très beau Barley Wine avec un alcool somme tout modéré du haut de ses 8,8 % qui est à la fois riche aromatiquement mais également très bien équilibré permettant finesse et caractère. Le visuel est sur une robe couleur bronze sans mousse. Le nez est sur une bonne complexité avec raisin, figue, datte, candy, caramel et une touche de cannelle. Belle intensité sur l'attaque avec un alcool posant bien les arômes et un Barley Wine jouissant d'un excellent équilibre malt/houblon. Les arômes reprennent ceux d'un nez sur de belles variations. La deuxième bouche gagnant en intensité impressionne avec un alcool en retro donnant ce petit plus de caractère, alors que l'arrière bouche plus amère donne un bon contraste. Le final est quant à lui plus sobre mais sur une bonne longueur. Je ne m'attendais pas à une telle prestation, que je salue.", "On tap from Barley Cargo, Athens. Dark brown - reddish colour. Heavy malty and fruity aroma, very bitter.", "Reddish brown with a frothy head.\nGrainy smell with a strong molasses note and some nutmeg. Predominant malty taste with a strong alcohol note.", "Historical tick which I am adding as a rate so that I can see the impact it has on my stats. 500 Beers To Try Before You Die. Whole Food?", "Sweet somewhat floral or piney maybe even citrusy brew which is a nice barleywine specimen. Carbonation notable. Good sipper for a hot day. Not tart or sour.", "Dulce con una buena dosis de amargor Enel lateral de la lengua. Esperaba algo que fuera más dulce. No está mal", "Bevuta in bottiglia da 33.\nAroma gradevolmente dolciastro, con note di vaniglia, perché ci sono! Prevalenza di malto.\nColore fra il rubino e il dorato scuro, forse bronzo con riflessi rubino. Buona schiuma. \nAmaro e dolce bilanciati. Nota di marsala.\nfPr", "Uklar mørk amber med offwhite til lyst beige skum. Aroma malt plomme. Smak malt plomme lim (ikke spør, det smakte bare rart). Mystisk øl som ikke falt veldig i smak, det var noe rart som jeg ikke finner ord. Delt med DjOeye", "Aroma; plummy hops, syrupy strong malts. Look; fawn head on rose mahogany body. Taste; almond malts, plummy hops, spiced fudge, wood juice, and finish is strong. Feel; strong body n low co². Overall; it`s nice. [bottle tasted@ Hamna&Beer apr2020]", "Barwa miedziano brązowa, silnie opalizująca. Piana beżowa, wysoka i trwała. Zbudowana z drobnych pęcherzyków, ładnie zdobi szkło.\nW aromacie nuty słodowe, orzechowe, jest trochę suszonych, ciemnych owoców. W tle nuty ziemiste i tytoniowe.\nSmak to jak wcześniej słodowość, nuty ciemnych i czerwonych owoców, ponownie trochę tytoniu i akcentów ziemistych. W smaku zachowany pozostał doskonały balans słodowej słodyczy, goryczki, o zabarwieniu ziemisto tytoniowym i delikatnej kwaskowej nuty owocowej. \nAlkohol idealnie schowany. Wysycenie niskie. Piwo jest bardzo gładkie i miękkie, Ciało wysokie o teksturze syropowej. Posmak długi, słodowo owocowy.", "Masser af tyngde, aroma af harpiks, træ og en anelse caramel. Nærmest frisk i smagen. Full body, low carbonation, intet hoved og helt mørkebrunt dense væske. Greasy feel.", "11-03-2020; bottle; at home (bought at Saveur Bière, as part of their March 2020 discovery box).\nThe looks of the beer are all right. The colour of the beer is a nice coppery reddish-brown. The beer is pretty clear, but it has a slight haziness. On top of the beer a nice layer of soft, almond colored foam is formed. The foam layer looks nice and creamy. Foam retention is average. Some nice lacing is left on the glass.\nThe aroma aroma of the beer is very nice. It is quite special and interesting. The malts give some nice strong aromas. There are nice loads of caramel and some toffee. Also a touch of toast. Besides this there are nice aromas of tobacco and plum, and dried fruits. Also the aroma of alcohol and some oak. It has the typical aromatic warmth of a Barley Wine. Besides these warming more heavy aromas, there are the hop aromas of citrus, orange marmelade, some pine. It is a nice contrast with the malts. Fruity and a bit piney, both light and robust. The result is a bouquet filled with a lot of different aromas, that are very harmonious together. Very nice.\nThe taste of the beer also is very nice. Sweet malts go together with bitter hops and sour fruity notes. The heavy sweetness of the malts and the fruity notes is balanced by nice strong hop bitters and fruit sours, making it well balanced. It sure doesn't taste too sweet. \nThe palate of the beer also is nice. It has a full body and very smooth texture, with a creamy touch. The sugary sweetness gives it quite some body. The carbonation is low, but some of the sour fruit notes give it that tingle. The finish is very nice and long. It is filled with rich alcohol and malt sweetness, but mainly these lovely hop aromas. Filled with citrus and some pine; it makes for a very special beer. Different than most Barley Wines I've ever had. Good one.", "Voroses barna szin, minimal hab, ami gyorsan el is illan. Az illata mennyei! Edes gyumolcsos. Izben is utos. Edes gyumolcsos, mazsolas, enyhen szilvas, konyakos beutes. Nem stilusom, de remek sor.", "0,35l bottle. Pours cloudy brown with off-white head. Aroma of malt, caramel, resin and pine, dark fruits, brown sugar. Taste is strong, malty sweetness, bitter hops, caramel, resin, brown sugar. Hoppy finish. American barleywine for sure.", "Media pinta @ Líquidos almacén de cervezas. Color ámbar oscuro, turbia. Espuma color crema abundante, buena retención. Corona fina. Aromas a lúpulos americanos, notas afrutados. Sabor intenso, caramelo, licorosa, amargor al final.", "Cerveza de color marrón claro con algunos reflejos rojizos con una cabeza gruesa de color beige que se retuvo bien y dejo un bonito patrón de encaje.\nAroma a caramelo, malta tostada con un ligero toque a fruta seca y lúpulo.\nSabor moderadamente dulce, el caramelo y la malta afrutada te golpean de inmediato, el lúpulo presta una presencia muy apreciada, el acabado es seco y frutales.\nEn general, una cerveza muy gratificante, la recomiendo.", "Red brown body with a creamy and dense beige froth. Scents of molasses, dried fruit and grass. The taste follows the aroma. Molasses, malt, grass and licorice. Typical sweetness of the barley wines, including in the aftertaste. Amazing beer.\n\n---Rated via Beer Buddy for iPhone", "Reddish-brown color, foam shades, tan-white, nice but moderately durable. Wonderful aroma. Dried fruits, raisins, hoppy, but also malty. Sweet, cognac, yet round. It has an extraordinarily full-bodied taste, raisins, honey, malt, but with hops and roasted-malt, it has an outstanding sweet-fruity-cognac, bitter taste. For me, this is the perfect dessert beer. It resembles lighter double-bock. Lots of aftertaste, lots of dried fruit at every point of the tongue. Alcohol feels a little bit, but it does come at a disadvantage.\n0,355 bottle.\nVörösesbarna szín, hab árnyalatos, barnásfehér, szép, de közepesen tartós. Csodás illat. Aszalt gyümölcsös, mazsolás, komlós is, de malátás is. Édes, konyakos, mégis kerek. Íze kiemelkedően testes, mazsolás, mézes, malátás, de a komlókkal és a pörkölt -sok - malátával kialakult egy kiemelkedő édes-gyümölcsös-konyakos, mégis \"sörös\", keserű íz. Számomra ilyen a tökéletes desszert sör. Világosabb dupla-bakokra hasonlít, csak felső erjesztésűként teltebb, összetettebb. Rengeteg utóíz, rengeteg aszalt gyümölcs a nyelv minden pontján. Az alkohol picit érződik, de nem válik hátrányára.Extrán ajánlom, persze csak a stílus kedvelőinek.", "Amber color, the foam quickly leaves.\nNose. a kind of mixture of hop and malt Fruit notes. some wine.\nTaste. The body is dense with soft carbonation. The taste is sweetish, a little fruit, a little port, a light bitterness. Great Barley Wine.", "AROMA: Aroma muy maltoso: Notas muy altas de alcohol con un dulzor evidente y sin acidez. Notas maltosa a pan y lúpulo con tonos cítricos del variedades del Nuevo Mundo. APARIENCIA: Cerveza de color marrón transparente. Espuma cremosa de persistencia media-alta. Cantidad de espuma media y color crema. Deja \"piernas\". SABOR: Cerveza maltos acon notas de pan y caramelo que la dotan de una gran suavidad. Alcohol muy notable sin llegar a ser desagradable. Equilibrio maltoso pese al amargor del lúpulo. Sin acidez ni aspereza. Lúpulo herbáceo. SENSACIONES EN BOCA: Cremosa, suave con elevadas notas de alcohol. Poco o nada eferevescente. Final intenso que permanece en boca dejando un sabor agradable a alcohol. Cuerpo alto y sin astringencia. IMPRESIÓN GENERAL: Excelente cerveza, muy agradable y con una gran exactitud estilística.", "# 548; 12/2016. Výrazný, plný pivo. Karamelové tóny, hrušky se skořicí, v dochuti čokoláda, karamel, černý rybíz. Povedené.", "On tap at Craft Room, Opatovina, Zagreb. Cloudy amber to copper, small lasting off-white head. Aroma is malty, caramely, spicy, zest, cinnamon, lots of dried fruit, such as apricot or raisin, some alcohol. Very smooth, quite thick and sticky. Fine malt quality. Slightly resembling a brandy. Toasty notes. Ripe fruit, dried fruit, prunes, fruit liqueur - pear or prunes. Alcohol present, somewhat boozy, somewhat harsh alcoholic finish with a spicy touch. Strong and warming. Full body.", "It pours deep amber with slight clouding. It has an off white head with low head retention. It has a strong malt and fruit character to start with in the aroma. There are notes of dried cherries and toffee. There are marmalade elements to it with alcohol that is noticeable. It is sweet initially with plenty of malt from toffee to some bread. The dried cherry flavors are also strong with some marmalade and low sherry like qualities. It is full bodied with a fairly high level of bitterness to it. The alcohol is noticeable but not hot. Overall, it has strong malt flavors with fruit and is sweet, but not getting into the cloying arena.", "Bottle from Beers Of Europe. Clear amber body with a beige head. Steady carbonation. Faint lacing. Aroma of honey, lemon and banana bread. Flavour of marmalade, menthol and mashed strawberry. A sweet, hop-heavy Barley Wine. You can tell with just a sip that this is a big beer, absolutely packed full of malt and hops.", "0.335l bottle from Csakajósör. Red-brown opaque body, beige head, not very persistent. Aromas of dried fruits, caramell and nuts. Taste is dominantly sweet. Well, very sweet. But at the same time full of complexity, coming from various dried red fruits and nuts. Mild carbonation, alcohol warmth is strong. Mild bitterish aftertaste. Great beer, harmonic, complex.", "Vierte en color ambar-melaza, con turbidez por frío que desaparece al atemperarse. Espuma de café muy persistente.\nCon el carácter típico de una Barley Wine, destacan las notas de amontillado en nariz y de vermouth en boca, con buena intensidad y complejidad en ambos sentidos. Gran cuerpo y carácter cálido. Buena también como copa. Muy recomendable, aunque hay que saber lo que se va a beber.", "Ciemnobursztynowa piana, ładna piana, delikatne zmętnienie. Przyjemny aromat, nuty tostowe, opiekane, trochę toffi. W smaku słodkie, ale nie za słodkie, toffi, karmel, kontrująca goryczka, delikatny alkohol.", "Butelka 0,355.\n\nWygląd: herbaciane, lekko opalizujące, piana drobna, trwała. \n\nAromat: lukrecja, przypieczona skórka chleba, miód wrzosowy. \n\nSmak: jest słodko, goryczka w szybkiej kontrze. Ciekawy posmak cukierków ziołowych, trochę Lukrecji. \n\nUnikalny barleywine, alkohol niby niski jak na styl. Piwo z charakterem, romansuje z belgijskimi triplami.", "Bouteilles 35,5cl\n\nMousse : Fine voile blanc cassé\n\nCouleur : Robe intense orangé sombre à ambré. \n\nNez : Bouquet chaleureux houblonné et intensément fruité de cerise et épices de fin d’année\n\nBouche : Attaque superbe houblon amer, dès la 1ere bouche enrichi par un fruité tant intense que délicat cerise confite, fruits noirs, prune. Corps malté poursuivant sur le fruité et superbe houblon biter. Chaleur alcoolisée en fin de bouche bien dosée et parfumée aux fruits de fin d’année (Cerise, épices, …). Longueur houblonnée, sucrée, épicée….\n\nAvis : Superbe strong ale puissante maltée, fruité et épicée, très gourmand, sans défauts, la cerise donnant un air de Barley/Brandy délicieux.", "Bottle shared at Monyo. Pours copper with white head. It’s somewhere between a traditional, English style BW and a more modern, American iteration of the style: it’s as malty and herbaly hoppy as the first, but shows the bitterness and resinous hoppy character (mainly in the finish) of the latter. Medium bodied with low to normal carbonation.", "Keg at the Euston Tap in 2013. Clear deep amber with an offwhite head. Aroma is malt bomb, with dark fruit, brown bread and slight Oxo notes. Flavour is malty again, but the sweetness is offset with light roasty bitterness and a hint of hop bite.", "Bottle from Alko. Clear dark brown with tan head. Oak, booze, dark berries, barley. Smooth with plum, dark molasses, a hint of oak and sirup. Smooth and sticky with a long, sweet finish.", "29.05.2015\nAR: Sirup, Cream Sherry, Hopfen, Portwein, karamelisierter Zucker, kräuterig, medizinisch, überreife Früchte, Zitrus\nAP: klares bernstein\nTA: süss, fruchtig (rote Marmelade), Portwein, Hopfen, Zitrus, medizinisch, süss, Zitrus, überreife Früchte", "Bursztyn, piania niska z obwolutą. Aromat miodu, toffi, palonego karmelu. W smaku słodyczka, toffi, miód, chlebowość, delikatna paloność z tyłu. Dosyć gładkie. Mocno ok.", "Draft at beertemple. Aroma of sweet toffee, dates, malt, caramel and raisin. Taste has sweet caramelised malt, raisin, dates, caramel and bitter pine. Nice.", "Bottles from Terre De Boissons, Centre Commercial Cite Europe, Calais, France; York Beer & Wine, 28 Sandringham St, York; De Bierkoning, Paleisstraat 125,1012 RK Amsterdam, Netherlands; Binns, Darlington.\n\n2019 Vintage: Drank in 2019. Hazy copper coloured with a thin white head. It has a plum, dried fruit and spicy fruity flavour with a wine-whisky, vanilla and oak finish. Excellent!", "Barwa bursztynowo-brązowa, lekko zamglone. Piana średnia, trwała, z lacingiem.\nW aromacie dużo suszonych owoców, miód, karmel, brązowy cukier, zioła.\nW smaku podobne nuty, intensywne, słodkie, z wysoką goryczką, trochę podobne do Komesa. Gładkie, z lekkim, przyjemnym alkoholem.\nŚwietne piwo.", "I have been trying to describe this very distinctive flavor. Yes, this beer has a fruity, sweet aroma, but the flavor is separate and distinct from the aroma. What comes to mind is burning oak in the fireplace, or perhaps piles of leaves in late autumn. It’s that kind of beer. \n\n---Rated via Beer Buddy for iPhone", "Pours a bronze color.  One finger tan head.  Clear, filtered.  No lacing.\n\nAroma is malt malt malt.  Candy sugar, brown sugar, vanilla, touch of oak.  Maybe touch of bourbon.  Caramel.  Touch of resin.  Burns the nose.\n\nTaste is surprising, despite strong aroma.  Sweet.  Brown sugar, vanilla and alcohol.  Bourbon perhaps?\n\nMouthfeel is medium full bodied.  Not as heavy, rich, or thick as I would expect.  Could I go so far as to call it a session Barleywine?\n\nOverall it is excellent.  Boozy yet approachable.  I would buy it again and recommend it.", "Een heerlijke barleywine van Anchor. met 9,4% alcohol, een biertje waar je het warm van krijgt. Niet te zoet, niet te bitter maar precies goed.", "Bottle with expiry 04-2019. Dark amber colour, minimal head, fair lacing. Aroma is lots of red fruit, also honey, toffee, citrus hops. Heavy sweetness, light bitterness. Not too sweet. Very pleasant mouthfeel, sticky texture, but does not feel cloying, pleasant sensation from bubbles. Well balanced. Very good! Probably the best barley wine I have tasted.", "355ml bottle (BBF: 03/2020, 9,4%)  from Yeme (Tomasikova street) in Bratislava.\nF: huge, tan, long lasting.\nC: dark coppery to brown, clear.\nA: malty, mellow fruity, caramel, dried fruits, bit vinous, some berries, herbal touch.\nT: rich sweet malty base, mellow fruity, caramel, bit toffee, red berries, herbal, decent bitterness, bit citrus peels, spicy, bit warming alcohol, nice balanced, medium to full body, soft carbonation, enjoyed.", "Botella 0,355l Color marron oscuro-rojizo.Espuma de color beige,fina,mediana,resistente.Aroma ciruela seca,fritos secos,caramelo,malta tostada,frutal.Sabor dulce con notas de ligero amargor,fuerte,malta tostada,ciruela seca,frutos secos,caramelo,especias.", "Ich mag wirklich keinen Barleywine, aber dieses Barleywine Style Ale finde ich gut. Es ist eine wahre Aromenbombe nach einem ganzen Obstkorb ohne das leidige Kirschliköraroma. So trifft sich Pflaume, Ribisel, Apfel, Mango, Maracuja, Ananas und noch allerlei, ohne aber den Ale-Charakter zu verraten. So tritt die Hopfigkeit ein guter Partner zur Fruchtigkeit auf. Auch auf tiefgründige Malzaromen, sogar ein paar holzige Geschichten muss man nicht verzichten...und keines der Einzelkonstrukte spielt sich unangenehm auf sondern harmoniert mit dem Gesamtkonzept.", "Color marrón rojizo con espuma media marrón claro que desciende rápidamente con buen residuo. Aroma a maltas tostadas, frutos secos, frutas oscuras fermentadas y notas a brandy, madera y vino. Sabor a brandy, cognac, madera y frutas fermentadas (ciruela, pasas, uva) con notas a galleta, especias, barrica y yogur. Gusto agrio con dulzor bajo y amargor medio, regusto añejo y de madera de larga duración. Textura semi-oleosa, cuerpo medio y carbonatación medio-alta. Una Barley Wine de sabores licorosos tipo brandy, madera de barrica y de poco dulzor con un toque agrio de fermentación que recuerda a algunas sour/wild o lambic.", "Bottle at home, from Biervana, Munich, 20th January 19.  Pours a dark chestnut brown.  Aroma is caramel, burnt malts.  Taste is sweet, with some bitter character, caramel, burnt sugar and dark fruit.  Nice one.", "0,355 l bottle.  This beer taste strangely, luckily in a good way :) Thanks a lot to the brewers.", "Smell of oak, rum, syrup. Bronze colour, beige head. Aroma of oak, syrup, rum, spices, some roasted malt. Lively carbon, oily palate. Sweet, slightly bitter. Nicely balanced.", "Butelka. Bardzo ładny balans żywicznej chmielowości i słodowości. Pije się to z przyjemnością, z każdym łykiem piwo się łądniej otwiera.", "This vibottle has some age to it, BBE is 02/2017. A crystal clear deep red body with a light brown ring of foam along the edge of the glass. Nose has a strong sweet aroma of prunes, figs, caramel, molasses and gingerbread dough. Flavor is heavily sweet but a rather strong and firm bitterness balances it out nicely. The lingering aftertaste is definitely quite bitter. Low carbonation and rich but easy drinking mouthfeel. Very nice classic barleywine.", "12 oz bottle reads 9.4% ABV. Pours clear chestnut with a two finger, beige head. Aroma is dried fruit, caramel and light roast. Taste is plum and caramel, moving to banana, roast and light hops. Finish is light hops. A good barley wine.", "Clear reddish-brown color with nice white head which disappears quickly. Nice aroma of dark fruits, sweet malts, hint of alcohol. Taste has lots of dried fruits, berries, combined with malts and hops. Overall well balanced beer and easy to drink", "Bottle, BB 04.2020. A good old-school BW, caramelly/toffee-y with a slight earthy dryness and kinda resinous bitterness; the body lightish, rather easy-drinking for 9.4% (as opposed to the 8.8% listed here), even though the alcohol starts to show after a while as it's warmed.", "Ruby red clear beer with nice slightly beige head. Aroma has caramel malts, resin, piney hops, dried fruit and lots of malts. Taste is sweet with caramel malts, full malty tones and resin, piney hop punch in the end. Fullish body and low carbonation. Barley Wine is life.", "How: bottle\r\nHead: one finger, off white. Dissipates quickly.\r\nColour: deep red/ brown.\r\nAroma: caramel, red fruits, \r\nTaste: full body, \"little carbonation\", diffirent notes of caramel, fruit cake, bread, warm, long sweet aftertaste.", "From backlog. 0,3 litre Bottle from Vinmonopolet Hamar. Brown with offwhite head. Malts, hops, toffee, and booze.", "Bottle 355ml at home. BBE 4-2020. From Alko. Pours brown,  beige head.  Malts, dried fruits, resin, caramel, toffee, boozy. Full body,, slick oily texture, average carbonation. \n\nOriginal rating 9-3-7-3-14 from bottle 355ml at home 2011-05-11.", "Donker bier met donkere smaken. Mist voor het type bier in mijn opinie veel diepgang en een groot gebrek aan ''bijzondere'' aroma's. -backlog de BierApp-", "Full-bodied and sweet with berries and ripe fruits, nicely sticky on the palate.", "An american, brown Barleywine with low head. Aroma is caramel, hops, light liqourice? light cloves? Taste is bitter. Vineous.", "Robe d'un brun profond et col chamois bien crémeux.\r\nNez extraordinaire : beaucoup de fruits secs (raisins et dattes), malt torréfié et houblons. La liqueur finit par l'emporter.\r\nBouche puissante: caramel, café, cognac... Finale sur une amertume longue qui rend le tout très équilibré malgré l'alcool bien présent qui donne toute la chaleur et la longueur superbes de ce barley wine.\r\nUn délice!", "355ml bottle. Reddish brown with a minimal white head. Sweet caramel arom, that’s also surprisingly hoppy, flavour is toffee, apple, spice, sweet but not overly so", "Color marrón rojizo, translucida, do dedos de espuma, burbuja uniforme, color amarillento, perfecta retención. Aroma y gusto en la misma linea, dilce, caramelo, pasas, miel, moscatel, madera, brandy, Porto,un punto de amargor al final del trago, muy sutil, y el alcohol te deja la boca calentita. Textura acuosa/oleosa. Barley Wine de manual, muy buena, no es la mejor pero si que sube la media, que dentro de este estilo hay muchas cervezas que son un sinsentido.", "Aus der Flasche (bbe 06-2018) im 2018-08 getrunken. Da dieses Ale schon etwas länger in der Flasche war fand ich es jetzt richtig klasse. Vor Jahren hatte ich ein frisches mal probiert wo mir der Hopfeneinfluß zu stark war. Nun hier bei diesem hat sich die Hopfenbitterkeit den Aromen vom Malz, etwas süsses Karamell und eine ganz leichte dunkle Frucht.", "Barley, caramel, hops in aroma. Dark red with quickly disappeared head. Sweet, barley, caramel, dried fruits. Full body, light carbonation.", "Dark red beer, thin filmy head. Rich, wine-y fruit aroma. Taste is.... wonderful. Rich fruit, malt, caramel, bitter grassy hop. A warm, boozy finish to a hearty, tasty, rich, smooth fruity barley wine. This doesn't have the hit-in-the-mouth big flavour in the way of some of these but it's a delicious, velvety thing.", "Bottle at home from the Beerhawk bar. Well chilled with a good pour and a very appealing deep, dark chestnut colour in the glass. The taste was that of a clinically well made barley wine. Huge sweet malts, a smooth mouthfeel and no sign whatsoever of the alcohol. There were no rough edges and I suppose that is my complaint; if you could call it that. It is so well made that it has very little character and could almost be described as soulless. I have had this thought drinking other beers from the brewery, but maybe I am being too harsh as this is still a benchmark beer.", "Een robijnrood bier met een stevige kaki schuimkraag die netjes inzakt en na een korte tijd tot een dunne laag het hele glas bedekt.\r\nGeur: Hop, citrus, mout, abrikoos.\r\nSmaak: Vol en fruitig, bitterheid van de hop, zoet, olie achtig en warm alcoholisch.\r\nMond: Jammer dat je het toch een keer moet doorslikken, daarna even bijkomen en meteen weer een nieuwe hap uit dit heerlijke vocht nemen. Eindigt droog en aangenaam bitter.", "09-2018 Aromat słodki, słodowy, miód karmel, babka piaskowa, przyprawy, chmiel. Nagazowanie duże. Ładna beżowa piana, klarowne o koloru herbaty. Smak bardzo dobrze wyczuwalna słodowość przełamana wyraźną chmielowością. Poza tym wyczuwalne chlebowe nuty. Gumowate pełne, ale gładkie, nie czuć alkoholu, finisz goryczkowy. Ogólnie przyjemne się to pije", "Appearance Clear copper brown, almost no head \n\r\nAroma Liquorice, dried fruits, booze, brown rum, fruity esters, caramel, dates \n\r\nTaste Very sweet, low bitterness \n\r\nBody Full, slick, low carbonation, warming alcohol sensation", "Pours a deep red, good amount of very dense yellowish-tan foam. Aroma is too faint to really characterize, for some reason. Taste is malty and sweet, caramel, dates or plums or something, and citrus fruit, with an alcohol burn to it and a bitter hoppy finish.", "Dark amber colour. Has a boozy brandy-esque nose. Taste of brown sugar, toffee, peppermint candy, red apples, raisins, apricots. Finish is sweet with some light hop notes. Pretty good, but not a patch on some other Barley Wines I've tried.", "Deep ruby, clear, small beige head. Aroma: dry black fruit, burberry, candy. Medium body. Slightly yeasty and metallic on the end. Gret though", "0,355l from Firmabier, current Beer Republic, BBF being in last September. Pours brown, light red color with medium head. Aroma of sweetness, sugar, caramel, malts, fruitiness, alcohol. Medium plus body, light bitterness, more on the sweet side. Quite dry, warm alcoholy finish. Sweet and a bit boozy barley wine, but is quite nice overall, I enjoy these kind of slow sipper ales quite much.", "Прекрасный барлик. Плотный, сбалансированный, карамельный, фруктовый, пряный...дальше продолжать?) Думаю не стоит. Мои настоятельные рекомендации", "Extraordinaire bière. Liquoreuse, amère, ronde, complexe, fruits secs et noix...magnifique", "8.8%- I found this to be a bit too sweet. They are calling it \"barleywine-style ale\"....on the lighter side for a true barleywine. Light brown reddish appearance. Not that much carbonation which gives it a smooth, flatter mouthfeel. Flavor has some potential if balanced a little better, but either way was tasty.....just thought the sweetness could be toned down a bit. Maybe adding a bit more hops to the recipe would help? I have been liking Anchors beers, but will be looking elsewhere for my \"barleywines\".", "W aromacie melasa, kandyzowane owoce, nuty utlenienia, słodko i przyjemnie. Z wyglądu rubinowe z beżową pianką. W smaku kandyzowane owoce, figi, grejpfruty, cukier trzcinowy, słodkie, syropowe z goryczkową kontrą. Degustacyjne, dość ciężkie, gęste, deserowe, ułożone. Bardzo smaczny, wzorcowy barley wine", "Kleistą landrynę wynurzamy z dziegciu. Przymulające wielowymiarowo. Nigdy tego nie polubię.", "Bottled. I have had this beer a few times already. Dark amber color. Head vanished quickly. Fantastic aroma of malt, caramel, dark fruits, ginger, plum marmalade, Christmas spices, red wine. Taste mirrors the aroma. Fantastic barley wine style beer.", "Bottle from SB. Copperish amber color. Aroma is caramel, malt, a bit of dark fruitiness, grassy. Soft mouthfeel, fruity sweetness, mild bitterness. Balanced stuff, good mix.", "Excelente calidad precio, espuma densa de gran retención, densidad media baja con bastante carbónico, olores a frutas pasas, uvas y caramelo, sabor semidulce a pasas y de escaso amargor, una barley wine muy equilibrada que gusta incluso a los no muy cerveceros, la tendré siempre en mi bodega.", "Mörkt brun mot röd. Söt doft. Smak av choklad, dadlar, fikon o nötter. Måttlig beska bryter sötman på slutet. Mycket gott!", "I've got to come down hard on this beer because it's not that easy to drink and it's so damn dry and hoppy. There are some initial great flavours of rich coffee chocolate cake and that kind of thing, but Chimay does this sort of thing much better and the alcohol is much better integrated. This was a bit of a burden to drink, and I like strong drinks like whisky, but this was something of the worst of all worlds for its genre.", "bottiglia 355 ml, 8,2%, schiuma fine color beige/giallo media persistenza, color mogano limpido, al naso malto uvetta sotto spirito caramello spezie, in bocca è liquorosa intenso malto uvetta frutta candita zucchero di canna vino passito, corpo strutturato, leggero tostato, carbonatazione piatta, dolce con amaro deciso lungo nel finale. La mia prima Barley Wine. Molto buona 02.03.18", "Fles 35,5cl thuis. 9,4%. Krachtig, zoetig, hoppig, scherpig, whiskytonen. (4-2013).", "Brown reddish colour, creamy head. \nAroma: spices, fruit, orange, caramel, some mint, some vanilla, dried figs, fresh. \nTaste: caramel malt, vanilla, cream, some tart fruits, brown sugar, plums.", "Dark amber with a small off-white head. Aroma is port wine, malt, dried fruit, butterscotch, vanilla and walnut. Taste is medium sweet and moderate bitter with lots of thingt going on. Caramel, syrup, dried fruit, citrus, toffee and bread.", "A really well-balanced barleywine, always a go-to. Doesn't have the murky appearance and excessive hop stickiness of many other American barleywines. Quite a treat when it has aged, though the floral hoppiness is nice when it is fresh.", "Klar bernsteinfarben mit kleiner, weißer Schaumkrone. Angenehm malziger, fruchtiger Geruch. Geschmacklich malzig süß, fruchtig mit spürbarer Präsenz des Hopfens. Langer malzig-fruchtiger, nur leicht bitterer Nachgeschmack. Mittlerer Körper mit aktiver Kohlensäure. Ausgezeichnete Balance zwischen Ausgewogenheit und Aromentiefe mit gut eingebautem Alkohol.", "Pours caramel brown with medium beige head. Aroma is raisin, caramel, toffee, some citrus, fruits, some alcohol, apples, cinnamon, pie. Taste is toffee, citrus, caramel, lemon pie, roast, bitterness, some alcohol, light hops, toasted bread, some pie. Superb beer!", "1 finger beige head.\r\nDark maroon coloured beer.\n\r\n\nAroma is fresh red grapes, fig marmalade, vanilla and slight 'round' oak.\n\r\n\nTaste is fig marmalade, raisins, brown sugar, light barrel notes and dried dates with some more 'uplifting', slightly citrusy hops at the back to counter out the heavy dried fruity notes.\n\r\n\nMouthfeel is very soft with a perfect, medium-low carbonation. Medium bitterness. Sticky and rich. Easy to drink.\n\r\n\nOverall: No wonder this is a classic beer. Very good Barley Wine, feels very English for being American, but that's a plus in my book. Quite low in ABV for the style, but jam-packed with flavour. Very drinkable for the style aswell and not too heavy. Great stuff!", "Djupt brunröd med stort krämigt ljust skum. Doft av söt malt, alkohol och vanilj. Smakar stort och sött med liten beska. Trevlig.", "12 oz bottle served in a goblet.\r\nHazy copper colored body with a decent head and a bit of sediment. \r\nPartially hidden alcohol. \r\nLightly sweet, Medium-light body and carbonation.", "Pours a clear amber with thin head and average carbonation. Big malty aromas; caramel, molasses, dried fruits, raisins and strong alcohols. Taste is rich, fruity, chewy, a great sipping beer with just enough hop presence to prevent the malt sweetness and richness from becoming too much. Great barley wine.", "Bottle@home, from Beer Republic. Strong, earthy nuances of toffee, bit sour dark fruits and barley. Balanced. Medium taste spectrum and long aftertaste with malty dark fruits. Medium body with medium carbonation. Overall, organic even a bit funky but still slightly simple.", "Pours a murky, oxidized rust color into a British dimpled mug with a prodigious lather. Aroma is ripe and and malty. Elements walnuts and burnt sugar. Finish is quite bitter, licorice and barley detected. Definitely benefited by cellaring, creating a smoother and longer palate overall. This is a burly, working class pub style ale. Solid proper...cheers Anchor Steam!", "Amber - red colour, medium off white head with medium retention. Nice lace.\r\nAroma of raisins, red fruits, chocolate notes, dough,\r\nMedium to full body, creamy nutty rexture. Medium carbonation..Dry finish, hops are noticed.\r\nTaste of red fruits, chocolate, licorice, caramel, nuts, wine.\r\nGood barley, though I'd like them stronger.", "Aroma: Ripe tropical fruits, caramel, dried figs, rasins. Appearance: Dark copper, rather clear. Dense, abundant head, leaving nice lacing. Taste: Sweet: caramel, figs. Bitter finish. High bitterness, a bit lingering. Full body, medium carbonation. Alcohol hidden.", "Suszone owoce, miód, cytrusy, karmel, alkohol. Treściwość średnia z lekkim plusem, trochę likierowej słodyczy. Średnia, krótka goryczka. Średnie do wysokiego wysycenie - niepotrzebne to, trochę drażni. Ogólnie smaczne i nieprzechmielone, jak mają w zwyczaju niektóre polskie interpretacje tego stylu.", "A nice dark amber/dark red, still slightly transparent. Thin layer of white head that still leaves nice lacing. Quite strong and interesting aroma shows caramel malts, sugar, estery fruitiness and slight alcohol warmth with a resinous/grassy background. Taste follows the aroma closely with sweet malts (caramel, slight honey), some residual sugary sweetness, estery fruityness. Overall surely sweet but nicely balanced by alcohol warmth and by resinous/herbal bitterness in the finish. Medium to dense in body with average carbonation, overall quite soft in the mouth. Complex enough, nicely balanced and easily drinkable with a not too high abv for the style. Good stuff.", "Thursday, November 30, 2017\t11:18 PM\t\r\n12 ounce bottle poured to wine glass (no bottled on nor drink by: 7AG marking on bottle)\tSight: dark brown, minimal medium tan head, very hazy\t\r\nSmell: Malty, very fragrant\t\r\nTaste: low bitterness, low sweetness, very good\t\r\nMouthfeel: lively carbonation, creamy, long follow through, sweet, then bitter aftertaste\t\r\nOverall: Very good beer", "Clear orange brown pour with a thin layer for a head. Sweet roasted malts, toffee, caramel, butterscotch, honey, peppermint and mildly hoppy for aroma. Pretty sweet stuff, moderately bitter. Full mouthfeel and soft to medium fizzies. Mouth smackingly sweet, but my oh my, what a treat.", "330 ml bottle best before 09/2017. Pours medium brown reddish, small head, not long lasting. Pear, wine grapes, liquor, brown sugar, some whiskey malts, dark cherries. Very balanced taste, malty sweetness with a dry bitter finish. Full bodied, soft to low carbonated, creamy texture. Alcoholic warmth. Very nice.", "Barwa ciemno miedziana, piana niewielka.\r\nAromat śliwek, rodzynek, fig, troszkę miodu, karmel.\r\nW smaku suszone czerwone owoce, karmel, śliwka. Delikatnie słodkie, delikatne kwaśne, z delikatną goryczką. W smaku fantastyczne. Trochę brakuje ciała a alko całkowicie ukryte.\r\nSuper pifko.", "Farbe: rotbraun mit cremigem beigem Schaum. Geruch: malzig, alkoholisch, würzig. Geschmack malzig, leichte Süße, etwas alkoholisch. Aromen von Kirschen, etwas Marzipan und holzig. Dazu eine schöne dezente Bitternote. Tolles Bier!", "Superbe robe rubis/ambrée profond qui rappelle un peu celle d'une Samichlaus. Belle mousse également avec une belle teinte ivoire. Le nez est déroutant car on a dans le même temps une bière aux accents de Barley Wine, de Tripel et d'Imperial IPA. Le côté gourmand est très présent, avec des notes de sirop d'érable et de miel très claires, des notes de noisette, de caramel, de chocolat à la fleur de sel, de banane, d'ananas, de mangue, de pêche, de fruits rouges, de baies, de figue, de réglisse, de myrtille... De belles notes florales viennent compléter le tout. Très beaux arômes donc pour ce Barley Wine avec un côté houblonné assumé. En bouche, texture suave, liquoreuse, presque huileuse, beaucoup de corps, de beaux sucres résiduels, un alcool très expressif et surpuissant, une petite amertume bienvenue sur ce type de produit. En rétro-olfaction, flaveurs de bonbon arlequin et de chocolat au lait ainsi que de noix fraiche en arrière-goût. La carbonatation est relativement correcte pour un Barley Wine. Sur les gorgées suivantes viennent se greffer d'autres flaveurs inattendues, comme le bois légèrement brûlé, le café très torréfié, la mélasse, la chicorée. L'alcool est vraiment à la hauteur (8.2% sur mon exemplaire, 7 mois avant sa date) et pousse de toutes ses forces. L'amertume et les sucres se prêtent à une belle compétition au palet sur la longueur, pour finir par une sorte de match nul. En attendant, ils participent pleinement au final tandis que les goûts maltés jouent les arbitres. Une fois de plus, ce petit côté bonbon qui revient par petites touches. En conclusion, un Barley Wine très typé, très original et complexe mais néanmoins extrêmement bon. Superbe pioche que cette Old Foghorn qui mérite la meilleure des notes, et ce sera ma première Américaine à y parvenir ! Bouteille 35.5cl, Boissons du Monde, Saint-Egrève.", "Strong malty aroma with hints of cherry liqueur, dried dates, figs, ripe banana. Full body and very low carbonation. Taste: lots and lots of malt, caramel, cherries, dates, some wine and bitterness. Again malt, sweetness and bitter in the long after. Amazing ale overall but a bit to sweet for my taste.", "Piwo kultowe, ikona. Jeden z najbardziej znanych wyznaczników stylu. Dla mnie to również pierwszy kontakt z piwem Anchor Brewing. Piwo ma barwę ciemnobursztynową, jest klarowne, po przelaniu do szkła wygląda jak mocno zaparzona herbata. Odróżnia je od niej jedynie piana, która dla mnie jest w wyglądzie Old Foghorn jedynym minusem. Piwo przy nalewaniu mocno się pieni, robi sporo szumu, piana jest pomarańczowa, dość obfita, zbudowana ze średnich i nawet dość dużych oczek, szybko opada, po kilku chwilach zostaje po niej tylko pierścień przy brzegach, śladów na ściankach brak. W aromacie jest mocno słodowo, przez to wręcz słodko. Czuć nieco alkohol, ale nie jest nieprzyjemny, lekko piecze w nozdrza, przybiera jakby likierowy charakter, słodycz obecna w aromacie jeszcze podbija to skojarzenie. Jest też trochę cytrusów, choć nie grają tu istotnej roli, raczej stanowią tło. W smaku... jak dla mnie nie jest dobrze. Nie jest też bardzo źle, ale sporo lepszych Barley Wine z Polski miałem okazję pić. Przede wszystkim wyraźny alkohol i tu już w nieco nieprzyjemnym spirytusowym tonie. Jest lekka kwaskowatość, tak w typie cytrusowym. Brakuje goryczki. W pierwszym akordzie jest słodko, w drugim dołącza wspomniana kwaskowatość, a na końcu to alkoholowe pieczenie w przełyk. Fajnie dzieje się w posmaku, są tu nuty suszonych owoców, może nie śliwki, ale brzoskwinie, daktyle, figi już jak najbardziej. Wysycenie niskie, widocznie piwo rozgazowało się podczas nalewania, kiedy to powstało dużo piany. Jak to często bywa w przypadku piw z \"wagi ciężkiej\", w miarę picia wydaje się coraz smaczniejsze i coraz więcej jego zalet dostrzegam. Jedną z nich jest goryczka, której na początku mi brakowało, a później, kiedy już alkohol trochę uderzył do głowy, pojawiła się może niewysoka, ale jednak wyraźnie się zaznaczająca goryczka w ziołowym typie. Cieszę się, że spróbowałem tego klasyka, ale nie zrobił na mnie wrażenia.", "(my first barley, claque, robe cognac, nez pineau frais, fin de bouche calva-mère, moût, bois, miel, amande, lasts)", "From Mar 2006\r\n\r\nPoured from bottle(room temp) a dark gold with very little head of foam at first but it grows into about a 1 inch layer that dissipates slowly but stays for the entire session.\r\n\r\nThe smell is very fruity with some malt notes also hitting my nose.\r\n\r\nThe taste is *very* malty sweet at first sip with some strong fruitiness(major plum notes) that I mentioned in the smell. Subsequent sips give me more of the malt but it's not as sweet and the hops start to do their bit making for a better balance than you'd think after the initial taste. Oh, and it's quite warming for the 8.8%abv this BWSA carries so 1 of these and I'll be done for quite a while.\r\n\r\nBottom line: A good, malty interpretation of an American BWSA that I will pick up from time to time because it *does* seem to break away from the mainstream. I recommend it.", "Small ass bottle..( old notes from August 2017 @ the \"pro brexit , please get a visa BBq) my friend Seamus from northern Ireland with dup sympathise suggested to some eu citizens @ said summer bbq that brexit was about social liberty and an argument occurred. I agreed with Seamus..I sat back with a bottle of this and let them bicker. Headless and murky piano brown brew. Nose of dark fruit, booze and caramel. Tastes the same, like chunky booze melting my brains. I think this was too young and hote.", "Sticky sweetish beginning. Grain, smooth mild sugars, deep and thick with lots of sugary grain.", "0,355 l bottle Cellar aged at home: BB 2015 \r\nbrown, red, hazy, frothy, brown foam, butterscotch, woody, floral, dried fruits, caramel, alcohol, leaves, heavy cloying sweetness, lightly bitter, full body, oily feel, sticky, soft carbonation, long finish,", "Copenhagen 28/9 2017. 35,5 cl bottle from Meny. Little Chubby bottle. Very botanic label with Corn Ears and some hops laying around. Pours clear amber with a red hue and off-white bubbly head. Settles as thin patchy and flimsy layer of foam. Aroma is intense and bitter-sweet with the sweetness in the front seat. Sugary caramel intermingling with strong, sourish notes. Figs and hints of sherry. Soft carbonation and medium thick palate. A little sticky. Flavor is heavy sweet and vinous. Light sour bitterness and a little spiciness. Aftertaste is sweet and boozy. Sweet, heavy, vinous brew with spicy after taste.", "Bottle at home. Clear deep amber color, white head. Malts, tofee, caramel, good beer", "Rather good Barley Wine. Pours a nice glass of thick brown beer. It's sweet has an interesting hoppy aroma and is overall highly enjoyable.", "Keg at the brewery. Reddish brown. Nose is sweet malty, red berries, caramel. Tastes malty, sweet caramel, red fruits, some hops.", "12oz bottle. Pours mahogany with a small light tan head. Aroma is plum, toffee, honey, caramel, and toast. Taste is toffee, plum, light roast, some vanilla, fig, caramel and brown sugar. Medium-full body. Medium - but not assertive - carbonation. Oily mouthfeel. [700th rating]", "Bottle 0.355l. Cloudy, deep amber colored. AROMA- honey and caramel, very pleasant alcohol, tones of cinnamon and clove. FLAVOR- just slightly sweet, alcohol, pleasant caramel. Full bodied. \nTasty.", "#1621\nBottle. Hazy red to amber body, smal yellowish head. Aroma of star anise, cinnamon, alcohol, clive, malt. Taste is lightly sweet, lightly bitter. Caramel, alcohol, touch of spiceness. Fuller body, medium carbonation. \nOK, but a bit disappointment.", "Color marrón tirando a rojo. Poca espuma, blanca y duradera. Aroma dulce, a malta yo diría que caramelizada, y sabor a frutas, de donde creo reconocer las pasas. El sabor lo he notado igual, muy dulce. Final un poco amargo, pero casi nada. El alcohol es inapreciable. Muy recomendable.", "W aromacie na początku ananas, pomarańcza, potem rodzynki, miodek. W smaku jest dosyć landrynkowo, drugie skrzypce gra tu taka chlebowość. Brakuje trochę ciała, ale piwo naprawdę fajne.", "From Decervecitas. In Teku glass. Playing Thats Mahjong, then Cannon Defenders. Toffee and figs. Good aroma but in mouth the alcohol is too much noticeable for such an ABV. Bbf this month (my fault). To repeat fresher", "brown body and white foam. Vanilla and citric flavours. Citric and malty taste.  High carbonation and low alcool.", "Good barley-wine. Not as intense as we all think it has to be. Aroma is typical barley wine-ish, a little bit just its watery(i guess,asi remember)", "Very good beer. Subtle tastes. Slightly sweet, but not overly so. Very enjoyable. \n\n---Rated via Beer Buddy for iPhone", "12oz bottle at home. Clearish amber brown with a thin off-white head. Caramel, bread, sweet malt, plums, oranges, resiny hops. Full bodied. Sweet malt, fruit and spice in the warming finish. Maybe a little lighter and fresher than some other BWs. This is just awesome - delicious.", "Bottle from Damian. Pours dark amber with little head, aroma of plums, sweet. Rich barley taste, plums, dark fruits, rather heavy, very pleasant, medium sweet, long barley wine, sweet finish. Very nice", "Botella 33 cl en el Lúpulo Oviedo diciembre 2010. Fcpref 04..2011. (r2238). Tomada en varias ocasiones. Color oscuro con espuma beige. Sabores intensos acaramelados ligeramente tostados y quemados. Maltosos dulces. Cuerpo medio a intenso con buena sensación alcohólica desde el principio. 9.4 vol. Muy valorada en su momento. Bastante buena para repetir sin duda.", "Kersenhout rood van kleur. Stevig schuim. Mooi caramel van smaak. Licht gehopt. Aangenaam zoet", "335 ml bottle at Getränkefeinkost Lüneburg. This bottle has 9.4% vol. Pours with a clear ruby-brown color and a small white head. Nice nose of rasiins, sweet malts, dried fruits, molasse, vanilla and old barrel wood. Taste is much more dry than exxpected. The fine aroma of the nose gets a liitle bit lost. Taste is fruity, with some burnt sugar, some herbal flavors and a slightly bitter (tannin) dry finish.", "17/20 loved it, different taste, malty sweetness, really well balanced, very boozy but also makes you want to drink more", "Przyjemny aromat. Owoce, lekka cierpkość, kandyzowany cukier. \r\nJest trochę nut chmielu. \r\nCałość pachnie dość ostro, estrowo. Jest lekki alkohol. \r\nPóźniej się układa. Jest nuta owocowa, lekko słodka. \r\nPachnie jak dobre barley wine. \r\nW odczuciu lekko likierowe, geste. Nie jest mocno wysycone. \r\nTrochę kwaskowe w smaku. \r\nJak dla mnie mogło być bardziej gęste, więcej ciała.", "Bottle from AJ’s Beer Warehouse. Aroma of dark fruit esters, caramel malts.", "12oz bottle from De Bierkoning, Amsterdam and poured into a snifter on 4-Aug-2017. Clear reddish amber with a thick beige coloured head. Aroma of sweet malt, fruit and hops. Full body and medium carbonation. Taste is sweet fruit, dominated by burnt banana and caramel. Medium spiced with a sweet, light bitterness to the finish. A heavy dessert beer.", "Lasissa sameisen ruskea. Tuoksuu voimakkaasti, mukana mm. toffeeta, taatelia ja luumua. Maku on makea, mutta ei liiaksi. Amerikkalaistyyliin mukana on myös humalaa, mikä tuo tasapainoa.", "Bottle. Thick and tasty. Both sweet and bitter. Not my favorite kind of beer, but this is very drinkable.", "Pours dark copper with a lively beige head. Aroma is caramel, fruits.. Nothing special. Flavor is sweet as candy. Caramel, apples... Nice bittersweet touch near the end. Bit of a mild barley wine if you ask me. Guess some ageinig would do well to this brew.", "Best barley wine I’ve ever tried. Very well balanced. Dried fruits and roast notes, not too sweet or alcoholic. Awesome!", "Keine Perlen, wenig Schaum, aber schönes klares Rotbraun im Glas. In der Nase Beeren, Holzfass. Im Trunk süß, Cognac, Beeren, Kirschen, Holzfass. Keine Spur zu alkoholisch. Praline. Herrliches Aromaspiel auf der Zunge. Langer Abgang. Teuflisch gut trinkbar. Granatenstark!", "Thick, rich and creamy. Notes are breadcrumb, dried apricot, molasses, caramel, tar. Malt goodness, amazingly well balanced. Definitely world-class.", "Flasche 0,355l (ABV: 8.2%): Mahagoni, klar, mäßig stabiler mittelporiger beiger Schaum; würzige + sehr süße Nase, dunkle/eingelegte Früchte, Backpflaumen, Rumrosinen, Datteln, leichte fruchtige Säure, Malz, Malzzucker, dunkles Karamell, leichte Röstaromen, dunkle Schokolade, Trockenfrüchte; fruchtiger + kräftig würziger Körper, kräftige Süße, dunkle/eingelegte Früchte, Trockenfrüchte, Hopfennoten, Röstmalz, Malzzucker, dunkles Karamell, cremig, deutliche Kohlensäure, Röstaromen; angenehmer fruchtig-würziger Nachgang mit Hopfennoten", "355ml bottle from Naples supermarket pours deep amber with tiny tan head. Aromas of toffee, hops, grass and sugar cane. Flavours of caramel malt, molasas, raisins, sugar syrup and herbal characters. Great texture and depth hide the alcohol well. A really balanced barley wine with plenty of character.", "bottle, 8.2%, red-ish dark amber, clear, small, off white head.\r\nfruity, malty, honey, raisin.\r\nnice bitterness to balance the sweetness, medium body, a bit to thin for the sweetness.", "355 ml bottle, 8.2% ABV. Pours a clear dark amber with an off-white head. The aroma is malty, honey, caramel, toffee, dark fruits an an underlying hoppiness (herbal, pine) with some noticeable alcohol. Full body with a very low carbonation, a medium sweetness and a light bitterness. The flavor pretty much follows the aroma is dominated by the sweet maltiness - caramel, honey, molasses, brown sugar, spices - while the citric and herbal hops are nicely balancing the brew.", "Bottle: 355 ml, Price: 0,89 eur \n\r\nNesužavėjo . . . . . .", "Butelka, 03.2018. W aromacie miód, karmel, czerwona porzeczka. W smaku jest karmel i miód, ale są złamane dosyć sporą kwaskowatością, też jakby czerwona porzeczka, na końcu, dopiero po chwili pojawia się lekka goryczka, bardzo krótka. Kolor czerwono miedziany, bardzo klarowne, piana średnia kremowa, niezbyt trwała, ale jak na barley wine i tak dosyć obfita. Wysycenie trochę za wysokie, przez co piwo sprawia wrażenie lekkiego i niezbyt gęstego, alkohol bardzo dobrze ukryty w smaku, po ogrzaniu lekko wychodzi w aromacie.", "Pours red/brown with a creamy tan head. Aroma is caramel, apple schnapps, peppermint. Taste is malty sweet, lots of caramel, with a fruity twang. Turns warm and bittersweet at the finish. Overall a complex mix of flavors. Full-bodied, rich, creamy palate with a mild carbonation. Very good, although I can’t quite make up my mind how high to place it. \r\nRe-rate: overall similar impressions. Noticeable apple in the fruity tang. 4.0", "Kept this bottle in my basement for a pretty good while; picked it up sometime in Feb 2015! After more than two years in the chilly, dark cellar this is just about one of the best libations to ever play upon my tongue. A little smoky and a little oaky, with amazing malt/hop combo, it doesnt get much better than this. Stellar effort, keep em coming, Anchor!", "Bottle; pours dark amber with an off white head; aroma of caramel, dried fruit, honey, and a hint of spice; taste is sweet with caramel, honey, dried fruits, and a hint of vanilla; finish is dry and sweet; very good", "My 2000th rating. 12 ounce bottle. Tawny reddish copper color topped by a small creamy beige head. Rich toasted malt nose hints a dark dried fruit, vanilla and herbal hops. First sip offers sweet malt flavor with notes of raisins, caramel, figs, vanilla and brown sugar. rich and complex. As it warms, it becomes soft and bittersweet with a touch of maple syrup. Warming alcohol notes in finish. for todays standards, this may seem tame as Barley wines go. However, it is a very good example of the style.", "Miedziane, klarowne piwo o średnie pianie, która redukuje się do zera. Aromat bardzo przyjemny, słodki, miód, rodzynki, toffi, delikatny alkohol. W smaku słodkie, gęste, oleiste, miodowe, owocowe,toffi, ziołowe. Goryczka wysoka ziołowa. Ogólnie uwielbiam takie piwa, słodkie, gęste, ułożone skontrowane fajną, mocną goryczką, jedno z moich ulubionych piw, bardzo przypomina mi Quatro od Pinty.", "Clear amber, small offwhite head. Aroma has caramel, notes of dried fruit. Sweet malty flavour, caramel and alc warmth.", "...........................................................................\n\n---Rated via Beer Buddy for iPhone", "Bottle. Clear red colour, firm tan head, good lacing. Aroma of dried and crystallized fruits, raisins, caramel, light notes of honey. Taste is heavy- sweet and medium- bitter, caramely and bready base, lots of candy fruits, raisins, dried fruits, slightly herbal finish. Body is medium to full, texture is oily, carbonation is average. Great, sweet, fruity and complex example of the style.", "Pite z butelki. Piękna barwa, jasne, rubinowe. W zapachu mocne nuty chleba, słodów, rodzynek i miodu. W smaku to samo. Słodkie, gęste, treściwe i bardzo smaczne. NIestety nie nazwę tego Barley Wine, gdyż moja butelka zdecydowanie różni się od innych przedstawicieli tego stylu. Powiedziałbym, że bł to Imperial Bock, co mi bardzo zasmakowało. Super piwo.", "Ocena na podstawie numerycznych zapisków z degustacji piwa w multitapie. Wersja z butelki 0,355L", "Butelka. Piana niska, kremowa, drobnopęcherzykowa, szybko opada do obwódki, koronkowanie słabe. Barwa miedziana, klarowne. Aromat intensywny, słodki, słodowy, rodzynki, winogrona, suszone figi. Goryczka średnia, alkoholowa. W smaku słodowe, estrowe, lekka kwaśność, lekko alkoholowe. Pełnia średnia plus, nasycenie średnie.", "Phenomenal all-around beer, doesn’t fall in the nauseatingly sweet trap of many barley wines, a slight smoky plot in the overall fruity taste narrative provides the requisite complexity", "Butelka 330ml (BB 03.2018). Klarowne o miedzianej barwie z cieniutkim kożuszkiem piany w kolorze ecru, całkiem trwałym choć tylko symbolicznie zdobi piwo. Aromat słodki, ciężki, słodowy, karmelowy w odczuciu podobny do aromatu miodu pitnego. W smaku słodkie z wyraźną, średnią do wysokiej, ziołową goryczką na finiszu, który stanowi bardzo dobrą kontrę dla słodyczy. Piwo jest oleiste, wyraźna słodycz delikatnie oblepia wargi a samo piwo dość mocno rozgrzewa od przełyku do samego żołądka choć alkohol jest dobrze ukryty. Niskie nasycenie i słodycz nadają piwu pełnię przez co pije się je powoli, delektując każdy łyk. Bardzo dobry, słodko-goryczkowy barley wine.", "Beautiful, complex EBW cellar aged for 3 years. Deep copper color with a light hop nose still present. Malt base is sweet and complex with a refined hop finish.", "I’m appreciative that a commonly available brewery has seen fit to consistently produce an English style Barleywine. And it happens to be a very good one that is attractively priced. Malty, fruity, rich with a subtle hop background.  Wonderful, oily mouthfeel.  Old Foghorn seems to get lost in the shuffle of higher priced 22oz English bw - but it’s a solid, high quality Barleywine with a pleasing malt forward character. When seeking out English Barleywines you can’t go wrong with this choice. Drinking a March 2016 bottle, in March 2017 = smooth, sublime, delicious.", "Pours deep amber, clear, tan low head. Fruity aroma, dry plums, cherries, some malts, honey, toast, alcohol. Medium sweetness, medium sourness, low bitterness. Medium body, supprisingly big carbonation, thick. Good price/quality ratio.", "33cl bottle purchased @ La caisse de bières. Un barley wine très équilibré avec une belle amertume en final.", "Kolor coś między bursztynem a burgundowym, klarowne, piany praktycznie nie ma. Pachnie czerwonymi owocami, rodzynkami, karmelem, drewnem. Świetny \"słodki\" aromat. W smaku, suszone owoce, karmel, czerwone jabłko, goryczka na finiszu. Jak dla mnie mógłby mieć mniejsze wysycenie, ale i tak jest spoko.", "Bottle from Taniguchi. Served in my Anchor Steam glass it is a crystal clear ruby-amber-brown with a beige head. The aroma is stone fruit while the taste is raisins, figs, caramel wafers and toffee. A classic American barleywine that suits the season well.", "Bottle 355ml. Clear dark ruby with minimal head. Rich aroma full of malts, toffee, honey and raisins. Really sweet with light bitterness. Alcohol is \r\ncovered by sweet aroma. Good and rich barley wine, but was too sweet to me.", "From 33cl bottle at Vor Bier&Bar, Gijón, Spain. Pours hazy orange brown with low foam. Aroma of rich in caramel, honey, dried fruits. Body is medium with low carbonation. Taste is mostly sweet, with nice bitterness coming through. Finish is moderately long.", "Bottled at Clubhouse BFD bottling event. 2012 vintage. Pours ruby color, off white head. Aroma is vanilla, fig, cinnamon, some dark fruit, cherry, and citrus. Flavor is cherry, fig, plum, citrus rind with a bitter finish. Very full bodied. Never had this, but this 2012 vintage is excellent.", "Piwo skonsumowane. Ocena na podstawie retrospekcji w celu uzupełnienia profilu.", "Bottle. Clear Ruby Red in colour. Very Malty; caramel, toffee, candy sugar, toasted bready malts, vanilla. Very fruity; citrus-orange, dark fruits. Hoppy; spicy, piney resinous hops. Sweet. Viscous, oily and slightly syrupy. Very smooth; not at all harsh; rather subtle. Beautiful malt/fruit/hop balance. Enjoyed this a lot. Nice beer! (2008)", "A bottle from Privado in Guting, drunk at home. Aroma: lovely fruity cake [specifically Dundee...?] Appearance: clear, reddish brown, minimal tan lacing. Palate: medium-bodied, oily, soft carbonation, long fruity finish. Taste: extremely well balanced, not too sweet - a plus point for me - a quality product.", "Bottle. Pours Amber with thick tan head. Aroma is sweet malty with dark fruits. Taste is sweet malty prune, cherry and plum notes with a sweet malty fruit finish. Wish i would have grabbed more of it now.", "Bottle, 0.355l. Clear dark ruby pour with virtually no head. Rich on the nose; malty sweet, herbal, boozy, lots of caramel.\r\n\r\nMedium to full body with slick and oily texture. Soft carbonation, quite lively on the tongue. Mostly sweet taste with a touch of alcohol bitterness. Aroma is heavy malt, caramel and toffee, brown sugar, liquor. Syrup. Herbal, bready. A bit peppery. Notable alcohol presence. Very rich, nicely balanced. Might be too sweet for some. Regular finish. Slight hops in the aftertaste, nice.\r\n\r\nOverall, delicious.", "Mooi diep amberkleurig bier met dikke romige crèmekleurige schuimkraag die langzaamaan inzakt. Aroma en smaken van confituur, aardbei, beetje mout, ahornsiroop, kersen(likeur). Mooie warme, licht zoetige, afdronk. Zoet maar zeker niet té zoet, heel mooi in balans. Topper !!", "Aromat toffi, karmelu i przypalonego tosta. W smaku klasyczne karmelowe barley wine, aczkolwiek z wytrawnym posmakiem owoców leśnych i ziołowoscia chmieli. Dobre klasyczne barley wine.", "Bottle from la caisse de Bieres. Pours a very flat head with dense but elegant malts. Clear amber colored body. Nice density of round malts and blooming hops; not aggressive on alcohol or roasting. A easy drinking barley wine.\n\n---Rated via Beer Buddy for iPhone", "2004 bottle thanks to puzzl. Poured clear dark amber with no head. Aroma sweet caramel toffee burnt sugar. No carb med bod. Taste sweet juicy dark fruits", "2004 bottle on NYE thanks to Charule. Pours a clear Amber golden brown. No head. Completely flat. Aroma is oxidation and dark fruits. Tastes caramel.", "Dark amber with medium head. Aroma: cookies, malt, pineapple, some caramel. Taste is moderately sweet with medium body and bitterness, some metallic notes, probably from hops. Surprisingly drinkable and well balanced but less complex than i expected.", "35,5cl bottle at home. Appearance: dark amber with low, off-white head. Aroma: caramel, raisins, banana. Taste: high sweetness and medium bitterness. Notes of caramel, raisins and some spice. Palate: medium bodied, sticky texture and medium carbonation. A bit to sugarry. Not much else to distinguish.", "Honey,rich malt character,complex sweetness,full body,caramel.There is some bitterness but overall sweet.Maybe a little bit more on the sweet side.", "12 oz bottle shared by ebone1988 for the motherfucking book. Sigh. The pour is a darker ruby colored light brown with a thinner colored light tan head and a couple spots of lace. The aroma is really sweet. There is a lot of caramel and a light fruitiness about it. This isn’t really like any other Barleywine that I’ve had. There is almost a sweet potato thing happening and a strong brown sugar. The flavor is very similar. It’s not the best thing by any means. Lots of sweet molassess and sweet sugar without a lot or malt shining through. This is really interesting, but not that good. The mouth feel is thin and watery with a lack of carbonation and a lingeringly sweet and sugary finish. This isn’t that great at all. Damn book.", "Bottle shared with koleminer20, for the book. Aroma is caramel, toffee, sweet, some pine, booze, eh. Appearance is reddish brown, clear, light brown head. Taste is caramel, toffee, some pine, sweet, brown sugar maybe, different. Mouthfeel is medium body, light carbonation, caramel aftertaste. Overall, different. Drinkable but not great.", "Czerwonawe, rubinowe z przeciętną białą pianą, ulatnia się dość szybko. Zapach złożony, wyraźne estry, trochę landrynki, cukier, kwiaty, melasa, toffi, trochę chleba. W smaku jest bardzo zbalansowane i dość grzeczne, spokojne, nic nie wyrywa z butów, goryczka dość niska. Słodkie, wyklejające aczkolwiek nie do przesady, pełne, wysycenie niskie. Bardzo delikatne rozgrzewanie. Złożone i przyjemne, ale brakuje jakiejś kontry, czegoś charakterystycznego.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "Lovely Barley variant! Very sweet and syroppy, but also a IPA-flavour to it.", "I bought this bottle at Amstein, St-Légier. I drank it yesterday at home. I was tired but it is the kind of beer that you become again happy in this unfair life. The color is copper/orange, middle/low carbonation, thin foam. The taste is perfect, powerful at the tongue and through the throat. It is malty, grape sugar, caramel, plum, some cynamon and there is a nice touch of hop at the final and we don’t have this impression to get 8.8 degrees of alcohol.", "12 ounce bottle into snifter, bottled 3/27/2013. Pours lightly hazy deep reddish copper color with a nice 1 finger fairly dense light khaki head with good retention, that reduces to a thin cap that lingers. Light spotty lacing clings around the glass, with a fair amount of streaming carbonation retaining the cap. Aromas of big raisin, plum, cherry, fig, apricot, apple, date, caramel, brown sugar, toffee, toasted brown bread, light molasses, herbal, floral, and yeast/toasted earthiness. Damn nice aromas with great balance and complexity of dark/bready malt, fruity yeast, and light earthy hop notes; with great strength. Taste of big raisin, plum, cherry, fig, apricot, apple, date, caramel, brown sugar, toffee, toasted brown bread, light molasses, herbal, floral, and yeast/toasted earthiness. Light herbal/spicy bitterness on the finish; with lingering notes of raisin, plum, cherry, fig, apricot, apple, date, caramel, brown sugar, toffee, toasted brown bread, and yeast/toasted earthiness on the finish for a good bit. Damn nice complexity, robustness, and balance of dark/bready malt, fruity yeast, and light earthy hop flavors; with a great malt/bitterness balance, and zero cloying sweetness after the finish. Medium carbonation and medium-full bodied; with a creamy and slightly slick/sticky balanced mouthfeel that is nice. Alcohol is very well hidden with minimal warming lingering after the finish. Overall this is an excellent English barleywine! All around great complexity, robustness, and balance of dark/bready malt, fruity yeast, and light earthy hop flavors; very smooth and easy to drink for the ABV. A very enjoyable offering.", "BOTTLE. Crimson pour with quick fading head.. Sweet toffee, malt & candy nose.. Sweet caramel/toffee malt throughout, some heavy hop bitterness in middle, finishing almost as fruit cake.. Sourced RW", "Pours amber brown with medium large beige head. Aroma is caramel, yeast, raisins, bread. Medium full body. A minor alcohol presence. Flavor is quite tasty up front, sweet bread and dried fruits and caramel. Unfortunately the finish does not quite live up, somewhat less complex and harsher. Nonetheless quite good.", "Mocno miedziana barwa. Piana niska i szybko ulatująca choć to raczej normalne w tym stylu. Aromat słodowy. Delikatna goryczka. Super zalepek. Fajne piwo do sączenia na jesienne wieczory", "Bottle. Pours dark, cloudy orange. Smells of sweet caramel, malt, fruit. Sweet, heavy taste, medium bitterness. Very good and a well done barley. Enjoyable.", "Dark red. Rich aroma and flavour, with malt, caramel, fruity esters and spicy hops. Full, sweet taste, and a dry finish with low bitterness and a bit of alcohol. Full and rounded body. Overall, a great barley wine. Beautiful, rich, tasty, harmonic, and very drinkable. Not cloying at all.", "One of my favorite beer! Pours gold colour beer with a medium head. Well-balanced!", "Belle couleur brune/orange, belle mousse qui finit sur un léger col persistant. Au nez, ça schmeck principalement le pruneau et le fruit sec. Pas excessivement sucrée en bouche, pas très amère, pas trop alcoolisée, arômes portées sur la prune et les fruits secs, un peu sur la peau d’orange amère. Une barley qui ne va pas dans l’excès et qui se boit bien.", "Magnifique robe cuivrée, mousse minimale. Nez caramel, toffee, fruits confits, prune, liqueur. La bouche est sucrée et amère, toffee, marmelade, prune, finale sur des houblons herbeux. Le corps est liquoreux et dense, la longueur interminable. Fabuleuse bière, chaleureuse, un vrai régal.", "0.355 l bottle from ’REWE Budnik & Homberg’ at 9.4% abv, best before August 2016, presumably two years old. Clear, dark mahogany with a medium large, frothy, almost stable, beige head. Sweetish-malty, slightly fruity aroma of caramel, molasses, raisins, prunes and a touch of licorice. Very sweet, malty and moderately fruity taste of caramel, molasses, raisins, prunes, candied cherries, figs and some licorice, followed by a long, quite bitter, rather warming, pleasantly alcoholic finish. Medium body, slightly oily and a bit effervescent mouthfeel, average carbonation. Heavy, moreish and intense but quite well-balanced and tasty brew, maybe a bit too alcoholic. Should be a good winter warmer, and it held up very well in the cellar!", "- schöne rot-braune Farbe mit leichter Schaumbildung\r\n- sehr schöne Aromen nach Malz und Trockenobst machen sich\r\n in der Nase breit\r\n- die Kohlensäure ist für diesen Stil passend dosiert\r\n- geschmacklich ist alles in harmonischer Balance \r\n- Hopfen, Malz und süße Früchte stehen in perfektem Einklang\r\n- selbst der Alkohol hält sich dezent im Hintergrund\r\n- im Abgang gewinnt der Hopfen dann leicht die Oberhand und \r\n ruft einem in Erinnerung, dass es sich hier um ein Bier handelt\r\nFazit: Ein fantastisches Barley Wine mit einem sensationellen\r\nPreis- / Leistungsverhältnis", "33cl bottle. Wow. Peaches, fresh apricots, caramel, vanilla, pears, watermelon, raisins. Pours a deep garnet with a frothy off white head. A full body with a sticky mouthfeel. Very smooth and complex. Top 5 for sure.", "Bottle 355 ml. Amber color. Aroma: floral, fruit, a bit of citrus, raisins, dried apricots, sweet white wine. Taste: sweetest nectar, maple syrup, candies, toffee, raisins, candied fruits, jellies, sweet white port wine and orange peel.", "Thick dark amber brew... very short lasting off white/yellow head and almost no lacing.\r\n\r\nAroma is toward the malt side of things .. caramel and toffee with only slight whiffs of citrusy hops.\r\n\r\nDark malt flavors mingle well with caramel ... very light dried fruit and more hop flavor than the aroma. Mouthfeel is on the light side for West Coast Barlewines... Carbonation is light but everpresent.", "Aroma: Floral, licorice, red berries, roast malts Appearance: Brown, amber, clear, low carb,light beige head, medium lace, Taste: Licorice, chocolate, wood, roast, sly dry sweet bitter finish", "33cl bottle at home. Pours a mahogany colour with an off-white head which rapidly diminishes to a creamy layer. Aroma of candy sugar, caramel, prunes, alcohol, malt, plums. Taste is medium sweet, medium bitter with a warming finish. Notes of caramel, plums, candy sugar, coffee, cocoa beans, strawberry. Texture is syrupy, medium to full bodied with low carbonation.", "Piwo bardzo ułożone.Klasyczny profil słodowy, przyjemne toffi w smaku. Nic tu nie wystaje. Po prostu pije się normalnie, bez zachwytu, ale z przyjemnością. Bardzo proste piwo. Chyba tak ma to wyglądać.", "Clear deep amber with a nice steady dark tan head. Strong aroma of toffee, toast, dried fruits, spice, hints of chocolate and strawberry and resin. Strong sweetness is almost matched by bitterness and acidity. Body is lighter than expected, nice round alcoholic warmness. Very palatable. Dangerous!", "355ml at the Head of Steam, Durham. Dark amber with virtually no head. Sharp aroma, almost vinegar-like, with a curious hint of tequila. Faint herbal flavour, with tannic and decayed floral notes; somewhat cloying.", "Bottle, 355 ml, courtey of and shared with JFK10000. Pours unclear orange, small beige head. Malty, dried fruit, toffee, spices. Quite sweet with bittersweet finish. Full bodied.", "Some fruits like dried apricot and plums. Taste is just a bitter-sweet mess! Second swing and a miss from Anchor for me.", "Ruby colour, clear, almost no head, high (too high) carbonation. Vety weak aroma: some malty notes, cereal. Full body, heavy cloying sweetness, Flavour sweet malty, some dry fruits. Bit of alcohol on finish, but also nice hoppy bitterness and flavour.", "Bottle. Almost no head but very strong carbonation, dark amber. Big malty, fruity, caramel and toast flavor, a bit alcoholic. Sweet and medium bitter. Maybe a bit too much bitter for me in that type (barleywine), but I think it?s classical for American Barleywine. But when it?s malty, I prefer it not too bitter.", "Brownish pour with minimal head. Aroma is sweet dark fruit and some floral i did not expect in a barley wine. Taste followed nose less the floral. Minimal alcohol and not sticky at all.", "Dark ruby color cleer beer, low tanned head. \r\nVery sweet, caramely aroma. Caramel, hint of red wine, toffe, molasses\r\nTaste: high sweet, light bitter. Caramel, hint of toffe, hint of wine, hint of something like iron? (again). \r\nPalate: medium body as for barley wine. Low carbonated. Not as sticky as I’m used to with barley wines. Well hidden alcohol.\r\nOverall: pretty classic barley wine. Good, but expected more.", "G: Nice/Barrel/Wein/Hopfen/Americano T: Süß/Schmeichelend/Malz/Hops/Low Alcohol Taste NH: Nicht sehr lang, dafür aber ausgewogen und sehr rund. Der Barley Wine für die Grillparty ;). 355ml Flasche von BEYOND BEER in HH. 4-5 Euro.", "dark brown, rather clear, minimal foam; caramel, dark fruits, some spices? and alcohol; medium+ sweetness and bitterness; full body, quite thick feel, softly carbonated, long bittersweet finish;\r\nOverall: very nice sipper, balanced, well-made, no flaws", "Typical american barleywine. Heavy innthr malts, sweet, well hopped and thick. Well balanced. Very nice.\n\n---Rated via Beer Buddy for iPhone", "0.355 bottle. Clear, brown color with a crimson tinge and a small, off-white head. The aroma is composed primarily of dark fruits, caramel, and figs with a malty backbone. Taste is also relatively fruity, caramel features prominently again, sugar and raisins make a first appearance. A full body, a creamy texture, and an average carbonation. The finish introduces molasses and is a tad off with its bitterness level; after such an intro I expected something better. Overall the beer is good, obviously it does have shortcomings but let that not overshadow its merits.", "Brun/röd med stort smutsvit skum. Doftar och smakar russin, och torkad frukt. Bra öl!", "Bottle. Dark amber color with minimal head. Aroma has dark fruits, some alcohol and caramel. Taste is sweet fruity with long nice aftertaste that has some minor bitterness. Flavors of caramel, dark fruits, berries, raisins. Smooth and tasty one.", "How: Bottle.\n\r\nWhere: Systembolaget.\n\r\nAppearance: Amber colour with an off-white head.\n\r\nAroma: Malt, dried fruit, alcohol, raisin, caramel.\n\r\nBody: Full body, low carbonation.\n\r\nFlavour: Dried fruit, alcohol, caramel, raisin, plum.", "Amber and somewhat hazy with a creamy off-white head. Complex aroma with subtle notes of bananas, pears and sugar cookies. Full-bodied with a sweet, complex character. 3 years old and the hops have really mellowed. Delicious.", "Bottle\r\nAroma-floral, fruits, alcohol\r\nAppearance-ruby, clear, white foam, \r\nTaste-medium sweetness, medium bitterness, medium sourness, \r\nPalate-medium body, sticky, soft carbonation, long finish, \r\nOverall-very good", "Barwa rubinowa, klarowne. Piana opada do obrączki, piwo pięknie oblepia szkło. Zapach kokosowy, waniliowy, nie za wyraźny. W smaku doskonałe, 33,3% goryczka, 33,3% słodowość, 33,3% kwaskowość, świetnie zbilansowane.", "Bottle from dusty...decent taste....not as much caramel as normal...good but not great...", "Caramel brown..decent 1 finger head..nose is figs,honey, molasses, trace of teriyaki sauce..mouthfeel is alright with some full coating and warmth from the almost 9 percent.honey n booze comes through the most here.quite smooth and decadent", "Barley wine bastante bueno. Cuerpo medio. Poco gas. Tiene un aroma que tira a dulce, igual que el sabor que deja al final.", "355ml bottle at abv 10% bought at HK Brewcraft in Central.\r\n\r\n\n\nLooks: Translucent amber brown colour with bits of yeast particles; Less than one-quarter finger head and residual soapy white foam which fades in 15 seconds; Good good sticky lacing with zero carbonation.\r\n\r\n\n\nAroma: Fragrant and sweet Amber malt, with strong alcohol, moderate Brandy, strong plums, dark fruits, caramel, strong toffee, floral, sugar, earth, spices, yeast and light lemon.\r\n\r\n\n\nTaste: Mid to strong sweet full Ale malt, with strong caramel, very strong sticky toffee, dark fruits, alcohol, fair liquorices, floral, sugar, spices, lemon, quite strong bitter hops and grass.\r\n\r\n\n\nBody: Full body. Thick and smooth palate.\r\n\r\n\n\nMouth Feel: Rich Amber maltyness in a fairly oily but smooth background. Strong sweet sticky toffee up front with strong plums and assorted darks fruits. Very sweet but not cloying. Good floral with notable spices. lemon to round. Kinda simple but very nice! \r\n\r\n\n\nBooze: At abv 10% it’s alcoholic but not abrasive, only slightly Brandy-like with very low knock-on. Excellent!\r\n\r\n\n\nHoppiness: Floral, earth, spices, and light lemon in nose, and the same but stronger in taste; Bitterness is quite strong for a lasting, close to high astringent sweet bitter malty finish.\r\n\r\n\n\nTaste: Fairly dry. Sweet, boozy and bitter to mouth.\r\n\r\n\n\nComments: As Barley Wine, this one fits all the attributes as rich, smooth, toffee-ish, alcoholic, dark fruity and sweet. What’s more, it’s also finely tuned with moderate liquor-ish taste (much lesser than most Strong Belgian Ambree), nice sweetness, and smart spicy citrusy hoppiness. Very suitable for beginners of the style as well as tasters. A very nice sipper to have!", "Turbid brown/red with creamy off white head. Really nice roasted malt and caramel aroma. Smooth taste with a lot of malt sweetness and a well balanced alcohol warm feeling. Very good barley wine.", "355ml bottle. Clear dark red with two finger beige head. Aroma of pine cones, caramel, rich malts, toffee, grapefruit, citrus and slightly burnt brown sugar. Taste is warming with rich malts, caramel, dried fruits, faint pine and grapefruit, citrus and lightly roasted coffee. Medium yet incredibly smooth mouthfeel, light carbonation and filling slightly roasted caramel aftertaste.", "Riktigt tjusig rödaktig, nästan lite hallonfärgad, klar vätska med fluffigt beiget skum som lämnar rester på sidorna. Nötig, brödsirap, lönnsirap, maltsötma men även ett lätt humlebett. Något större kropp, lätt bubblig. Smak av kola, lönnsirap, torkad frukt som avslutas i fint humlebett som balanserar upp sötman fint. Även lätt strävhet av ekfat i avslutningen. En fin, något lättare barley wine som ändå behåller tyngden.", "Pours hazy brown with a thin line of white head. Aroma; dades, figs, dried dark fruits, vanilla, some booze and caramel. Taste; Dried dark fruits, figs, vanilla, caramel and malt.", "Świetne piwo. Ma przyjemny aromat owoców z odrobiną wanilii w tle. Wygląd jest ok - fajna barwa i słaba piana. Smak natomiast to największa zaleta tego piwa - jest mega pijalne i świetnie zbalansowane. Sięgnę po nie jeszcze nie raz...", "Pours clear deep ruby with a small tight dark cream head fading to a film. Aroma of caramel, overripe apple and pear, dried berries, marzipan, a bit of fruitcake/nuts. Palate rather sweet with layers of caramel, candied apple, raisins and other dried berries, toasted nuts, Bristol Cream. Finish dries slightly with alcohol heat and a touch of bittering hops. Medium bodied, slick, quite soft carbonation. Drinks more in the English style compared to modern heavily hopped barley wines, it’s smooth and well balanced though not so punchy. Must have been quite something when first debuted though.", "Sötaktig och knäckig, torkad frukt och viss syrlighet från citrus. Medelbeska.", "Bottle from systembolaget. Pours Brown with dark beige head. Caramell and fruits both in smell and taste. Quite sweet. The fruit comes forward more at the end.", "Flasche (355 cl) vom Bierzwerg. - Goldbraun, leicht trüb. - In der Nase harziger IPA-Hopfen über schwerem Karamelmalz. - Antrunk schwer toastmalzig-süß aber nicht klebrig sondern komplementär ergänzt durch kräftige aber runde aromatische Hopfenbittere: bittere Orangenmarmelade, zarte Tabaknote, etwas Harz. Nur mild rezent, sehr schwer, fast ölig, mit deutlichem aber gut eingebundenem Alkohol (Anklänge an Weinbrand). - Schön malzig-schweres Starkbier mit sehr aromatischer „amerikanischer“ Hopfung, enorm rund und weich trotz stattlichen Ethanolgehalts. Große Klasse!", "Közepes, tartós, sűrű bézs hab, félbarna szín. Ilata nem túl markáns, maláta, citrus és némi karamell keveredik benne. Íze édes égetett cukorral és némi alkoholossággal indít, majd karamell és pici citrus bújik elő, a komló keserűjével karöltve. Szénsavas, de még nem pezsgős. Utóíze enyhén kesernyés, inkább némi konyakosság az uralkodó. Testes, nehéz sör.", "355ml bottle. Pours a hazy ruby colour with a medium, short lived, tan head that leaves spotty lacing. Sweet aroma of overripe fruit, caramel malt and alcohol. Sweet flavour of caramel malt, overripe fruit, brown sugar, light spice and warming alcohol with a dry, bitter, hoppy finish. Medium body with a thick, oily texture and soft carbonation. Pretty nice.", "Pours a lovely dark amber colour with a tan head. Malty hoppy aroma with hints of dark fruits and caramel. Sweet malty fruity hoppy flavor with hints of caramel. Warming malty and bitter aftertaste. A nice barley wine.", "Glowing Amber off white pillowy head looks great in the glass rich mouthfeel sherry marzipan Christmas pudding would go great with a cigar nicely done.", "Botella, @La Barrica 13, Candas, 16/03/16. BBD:06/2017\r\nColor ámbar, sabor caramelo, dulce, cuerpo medio, alto.", "355ml bottle into an ’Arrogant Bastard Ale’ glass at home on 6th March 2016. Lightly tanned foam blanket sat on top of a deep red body. Malty nose and front, sweet molasses rule this beer although there is a distinct hop twang to the brew as well. Most enjoyable, my sweet tooth liking this very much. Rich, deep, wine like depth to the body and texture, pleased I managed to try it at last (been looking for some time).", "Bottle shared at home. Dark amber colour with a small white head. Nose is strong raisin with some zest. Taste is mild sweetness with torokmez, kakasosnyaloka and selyemcukor. Sry..", "Bottle from Jane’s Beer Store, Mountain View. Caramel and raisin aroma. Buttery caramel taste. Good.", "27-Feb-2016-0,33L Flasche @ MühlenBar. Kupferrot, klar, cremefarbener Schaum. Aroma : Malzig, Toffee, Rosinen. Antrunk Malzig, Trockenpflaume, gegen Ende leicht zitrisch. Gut.", "12 ounce bottle poured into a tulip glass. The beer is a dark mahogany color with a thick head of beige foam. Strong retention. The aroma has nuts, molasses, fig, and raisin. Fairly sweet with a lot of dark fruit character going on. The molasses is near a horehound note. Some woody notes do come through as well. Thick mouthfeel with soft, subtle carbonation. Big body. Delicious beer.", "Bottle. Pours slightly hazy darker amber with small yellow head. Aroma: caramel, toffee, hay, rasin, candys, acetone. Taste is medium to heavy sweet, caramel, toffee, candy, brown sugar, wine tones, Medium to full body. Sweet finish. Easy to drink. Nice one.", "butelka, warka do 6 2017. bursztynowe, z niewysoka, ale bardzo ladna, gesta, kremowa piana. aromaty... o dziwo na przedzie mocne, owocowe estry, glownie ananas, pomarancza, figi, jakies tropiki. czuc tez ewidentnie ta cukierkowo-chlebowo-toffi slodycz charakterystyczna dla stylu. brzmi to niby prosto, ale i jedna i druga warstwa bardzo zlozona, fajnie grajaca ze soba. W ustach jest geste, lepkie, troche syropowe, ewidentnie slodkie i - tu zaskoczenie dla mnie - tez ewidentnie kwaskowate. o dziwo - dosc rzeskie, nie to moze, zeby pic jedno po drugim, pod rzad, ale jednak szybko znikajace z pokala. goryczka nie jakas duza, ale wystarczajaca, by kontrowac slodkosci roznorakie. oczywiscie w trakcie picia, w smaku czuc rowniez to, co w aromatach. ewidentnie super piwo, sprostalo swojej badz co niebadz klasycznej legendzie.\n\nOcena potraktowana skryptem do przeliczania ocen (uzgodnienie UT/RB).", "Bottle, 12 fl oz, O’Connor’s, Uppsala. Decent, sweet, smooth, little carbonation.", "WYGLĄD: Barwa miedziana, klarowne. Piana drobna, wysoka, trwała. Pięknie zdobi szkło.\r\n\nAROMAT: Intensywny. Karmel wymieszany z czerwonymi owocami (żurawina, borówka, porzeczka, czereśnie). W tle nuty ziołowe.\r\n\nSMAK: Absolutna dominacja karmelu. Nieznaczny posmak owoców. Goryczka średnia, krótka. Alkohol dobrze ukryty, delikatnie rozgrzewający przełyk. Odczucie \"zaklejania ust\".\r\n\nOGÓLNIE: Zacny klasyk. Nie zawiódł moich oczekiwań. Ponadczasowy Barley Wine.", "Refrigerated 12 oz. brown bottle poured into a snifter. Clear Amber with small beige head. Aroma is caramel malt, medium body, low carbonation, and little lacing. Taste is caramel malt.", "Truly an American classic. Deep garnet pour with a minimal eggshell colored head. Lots of fruity esters, caramel for days, cake, earthy hops, touch of booze. Flavors were full of dark fruit, caramel, cherries, roasted nuts. Lingering bittersweet finish with a viscous and slick mouthfeel. Super balanced, slight heat in the finish, sweetness held in check. So good. Can’t imagine the response when this was first brewed. Classic.", "Strutturata e luppolata, ma mette in risalto la dolcezza dei malti. Aromi di frutta, calda e pastosa.", "It pours out with a substantial head, and has a dark amber colour. The Aroma is dense with the malt notes leading to a fruity spice at the end. Texture is silky smooth, like velvet or good champagne. Perfect carbonation and excellent mouth feel.\r\n\r\nTaste is complex and rather interesting. Perhaps a little intense over the bottle but at first you get a wonderful depth of flavors. From the alcohol content at the front followed by a treacle finish. Maybe a little on the sweet side. Its not perfectly balance although some dry hops come through.\r\n\r\nIt has a wonderful kick and excellent alcohol warmth. This is a very good beer and excellent value. A bottle is plenty enough though. I would share it.", "Bottled, 355ml, aged 6.5yrs from York Beer & Wine, York. Amber to copper with off white head. This proved to be a smooth, rich and luscious beer that had aged really well. Certainly wine like in a rum soaked dark prune like way, warming with just a hint of caramelisation towards the back of the palate. Some sweetness, but just enough. There are malt biscuit and old leather notes. Oh yes, very good.", "Sympathique petite barleywine avec des notes de miel, caramel, prune et une amertume assez légère. La consistance est un peu huileuse ce qui en fait une bière relativement lourde (classique pour une barleywine). Peu de bulles et une relativement bonne longueur en bouche. Assez agréable dans l’ensemble.", "0,33l bottle. Dark copper colour with quickly disappearing tan head. Aroma: Honey, walnut, almond with nutmeg, vanilla and caramel. Complex. You can smell it from a distance. Taste: Has a full malty start with spicey pastry tones, with very slight tarty vibe and a green/hoppy/bitter mouthfeel. Has a warming liquorish tone but fresh at the same time. Medium/full body, medium carbonation. Long bitter and sweet finish. Very good barley wine.", "Bottle. Pours a rich ruby red with a fading off white bubbly head. Aroma of red fruits, raspberries, strawberries, pine, caramel. Taste is of pine, citrus, grapefruit, caramel, red fruits, burnt bitter finish. Light oily mouthfeel, medium carbonation.", "Bottle 0,355l. Dark redish color with a big foamy top. Caramel, light roast, sweetness in the aroma. Taste has notes of fruits and light bitterness at finish. Full body mouthfeel. Really enjoyed this one!", "335ml bottle. dark brown with ruby reflections, big tan head. \r\nsweet plums and medical alcohol aroma.\r\ntaste of plum’s liquor with roast malty dry final. sweet fruity hops aftertaste.\r\nfull body, oily texture.", "Ok this is a great intro to barley wines for the uneducated. You get the ale with a hint of prune. It's as if I ate an ale soaked prune. Good stuff. Not strong. Not boozy. Definitely not over powering. Like I stated a great intro to the style. Barley wines can be too boozy and hot and dried fruit like. This is not any of that. It is pooping the cherry of an ale drinker to the barley wine style. \n\n---Rated via Beer Buddy for iPhone", "Hazy mahogany brown color, beige head. Caramel syrup nose, wood, fruity notes. Heavy sweet taste, caramel, malty, alcohol, hint of grass. Medium to full body, soft carbonation, oily texture. Too boozy and sweet.", "Bottle. Clear beautiful ruby red color, thin fine head. Full nose, first sweet malt, heavy caramel, then some fruity estery notes, bubblegum, wow. Balanced taste, sweet but with a ethanol counterpart, light sourness and light bitter. Malty, warm aftertaste. Full body, low carbonation.", "Pours a cloudy bourbon color with a rich, smooth beige head. Fruity, toffee, somewhat alcoholic nose. Moderately thick with some gaseous carbonation. Circus peanut fruitiness with toffee flavors.", "Kolor: miedziany, klarowny.\n\r\nPiana: obfita: drobnopęcherzykowa, trwała.\n\r\nZapach: słodowy, karmelowy, likierowy, chmielowy, owocowy, żywiczny, aromaty ciemnych owoców.\n\r\nSmak: pełne, aksamitne, spora słodowość, likierowość, nuty ciemnych owoców, karmelu, melanoidyn, goryczka w kirunku niskiej.\n\r\nWysycenie: w kierunku niskiego.", "Butelka 0,355l Kolor bursztynowy z błyskami rubinowymi, piana średnia, ładnie się trzyma. Aromat słodowy, cytrusy i owoce. Smak whisky, karmelu i owoców z przewagą cytrusów.Łagodny alkohol i dobre nagazowanie, aromat i goryczka wzorcowe. Super piwo.", "Rating #1425 - 31.12.2014 - Beer #7 in @beerblast #Beermas. Nut brown pour, bubbly head, not much lacing. Aroma is a cascadey punch, alcohol, pastry dough Taste is an alcoholic blast, lots of hoppy bitterness tempered with a ton of citrusy, malty sweetness on the palate. Just a big bold beer for flavour-lovers. Awesome.", "Bottle - Vintage 2011 - Nice caramel sweetness with some sweetness. Clearish copper with a beige head. Sweet, caramel, lightly oxidized and fruity. A bit thin, but nice.", "Ouwe touwen en teer in de zon op ’t dek van een ouwe trekschuit. Backlog from 2015/04/06.", "Full flavored with a clear dominance of syrup and malty sweetness with hints of dark chocolate.", "Bottle. Clear dark brown colour and a relatively stable off-white head. Aroma rich malty, toasted and nutty with some dried fruits and esters. Very balanced in taste, showing rich malty character combining with citrusy piney hoppiness, all in bold intensity. Easy drinking with alcohol hidden well. Very good.", "Aroma:\n\n\nSweet, belgian yeast, ripe fruit, malts.\n\n\n\n\nAppearance:\n\n\nTurbid amber/brown beer with a medium thick off-white head.\n\n\n\n\nTaste/Palate:\n\n\nSlightly sweet and very fruity, intense hops and mild spices.", "I didn't take any extra notes when I tried this beer for the first time but I'm gonna try it again and update my comments.\n\n---Rated via Beer Buddy for iPhone", "Shared bottle. Pours is clear amber with thick persistent white head. Aroma of grapes, spruce, caramel, floral and sweet, barrique very promising. Taste is medium sweet, some bitter notes, carmel and grapes on tongue. Heavy body, oily texture, flat carbonation, light long bitter and heavy sweet finish. Overally bit sweet but awesome and well ballanced beer anyway. I’m not a big fan of anchor brewery but this one is superb.", "Bottle from The Bottle Lab, Leek. Pours a clear deep amber colour with a thin off white head. Aroma of molasses, toffee, fruitcake, a little liquorice, some raisin, slight prune, subtle orange, slight brown sugar, maybe whisky and spicy hops. Taste of molasses, toffee, fruitcake, raisin, some prune, slight brown sugar, whisky, a little vanilla, orange, liquorice and spicy hops. Full bodied and a sticky texture. A warming, spicy, toffee finish. An extremely complex, flavourful beer. Like a whisky or a brandy more than a beer. A gorgeous, warming barley wine overall.", "In short: drinkable cake beer.\r\nAroma: tarta, pie, plum and peach,\r\nAppearance: dark orange, with creamy foam.\r\nTaste: medium sweet and very light bitter and sour.\r\nPalate: grass/citronella finish.", "Big frothy and beige head, slowly diminishing until it disappears. Clear reddish (ruby) dark amber. Complex, sweet aroma (candy sugar), very ripe fruit (apricot and citrus), spicy with some hoppynes. It tastes sweet (molasses), warm, ripe fruit (prune), toasted malt, wine wort and hoppy with a spicy and bitter fruityness finish. Medium carbonation. A very enjoyable discovery for me!", "Mörkt rödbrun med medelstort skum. Fantastisk doft med stor maltighet, fikon dadlar och russin, pomerans och apelsin, kryddor. Smaken är rik och fyllig med sötma från torkade frukter - dadlar, fikon russin - fruktighet av apelsin och pomerans och en skön kryddighet, liten eldighet och allt avslutas med en liten väl balanserad beska.\r\n\r\nEn toppen-barley wine, smakrik och välbalanserad och alldeles underbar.", "From 0,355l bottle, BBD: 07 2017 Pours clear amber red to brown liquid, medium frothy tan head, Aroma: candied fruits, sweet, malty, cane sugar, caramel, whiskey, wooden notes, red fruits, citrus, warming alcohol, Taste: medium to heavy sweet, light to medium bitter, light to medium sour, citrus, lemon grass, orange, peach, raisins, caramel, Palate: medium to heavy body, oily mouthfeel, average carbonation, long sweet warming aftertaste, Overall: excelent beer, enjoyed.", "330 mL bottle. Generally clear deep amber pour with some residue floating about. Tall foamy, pale beige head, good retention. Malt aroma, toffee, brown sugar, spiciness, rum, some alcohol. Taste follow with the malt theme of course, sweet, rich, warming. Slightly sticky body, minimal carbonation.", "pours a dark copper with a medium tan head. aroma is caramel malt with a hint of floral hops. thick heavy mouth feel. taste is rich toasted malt, then a light hop bitter. Long warming finish with a little bitter linger. Good strong beer.", "35,5 cl. bottle @ home, bought @ Mitra, Tiel.\r\nHazy light brown with an off-white head. Malty aroma with some hops. Malty and fruity taste. Slightly boozy which also gives some alcohol warmth. Great beer.", "Colore marrone, schiuma cremosa.\r\nOdore fruttato, malto caramellato, liquoroso, pere, fichi, frutta matura.\r\nSapore dolce, caramellato, fruttato; liquorosa, corposa, calda; finale amaro a smorzare il dolce, che rimane il sapore predominante. Da meditazione.", "- A naughty Granny’s dream: good blend of rum baba, caramel and high alcohol.\r\n- Nose: Slightly bready/salty caramel; rum baba cake, amplified by mucho alcohol.\r\n- Body: sweet. \r\n- Finish: sweetish, with a little hop; not sure if slightly underweight for ~9%, or if just nicely balanced.", "Bottle shared pours a dark orange with off white head. The aroma is dark fruits, biscuits, toffee, sweet malts. The flavor is medium to heavy sweet malts with dark fruit notes a bready biscuit flavor and toffee, solid all the way around. Not as rich and deep as done others but very good.", "Nez assez houblonné pour une barley wine, fond fumé, peu de caramel.\nEn bouche : plutôt légère, sensation lactée, petite rondeur plutôt subtile. Fond houblonné genre dry-hopping (herbal).\nÀ 8,8% abv, et vu ces caractéristiques, est-ce encore une barley wine ?", "Bottle - A bit hazy, deep copper colour with lacing, creamy tan head. Mostly malty sweetness in the nose, toffee, biscuts, red fruits and resinous hops. Taste of caramel, honey, oak, dried plum with rich malty notes. Resinous hoppy tase in the finish. Full body, thick texture, average carbonation, slight alcohol warmth. Massive, comlex barleywine, highly recommended.", "0.355l bottle. Clear ruby body with a beige head. Aroma of caramel, reisins, orange peel and booze. Taste of caramel, orange zest, reisins, plums, booze and floral hops. Nice beer, but the alcohol could be a bit less obvious.", "Amber coloured beer with off-white head. Aroma of caramel and toffee. Taste of molasses, sweet malt and pine hops.", "Bottle shared at Leighton’s place. 25/08/2015. Thanks to Leighton. Clear reddy / amber coloured pour with a halo of off white head. Aroma is sweet toffee, mint apple, toffee. Palate is medium sweet, full airy carbonation, velvety. Flavour is composed of medium sweet, full layered sugars, toffee and dried apple, , pine needle hops, nice and chewy. Lovely barley wine.", "Clear amber with a very fluffy vanishing head. Caramel, toffee. Very sweet and brandy like. Too sweet.", "Piana skromna, po chwili brak :P\r\nBarwa ciemny bursztyn, zmętnione, spora ilość drobinek, pochodzenia białkowego.\r\n\r\nAromat słodki, słodowy, karmelowo/toffi, jest dużo owoców, ciemnych owoców, ale jest też odrobinę pomarańczowe i brzoskwiniowe.\r\n\r\n\r\nW smaku jest alkohol, rozgrzewający przełyk i poniżej aż do żołądka, ale jest to bardzo miłe uczucie. Jest słodkie, owocowe, lekko winne ale słodko winne, później słodowe, chlebowe, karmelowe.\r\n\r\nWysycenie średnie, pełne jak cholera, można wręcz gryźć, oleiste, goryczka średnia z owocowo alkoholowym finiszem.", "Nicht besonders intensives Aroma nach Alkohol, Malz und ganz schwach nach Lösungsmittel. Geschmack auch relativ alkoholisch und vergleichsweise bitter.", "Farbe braun und kaum durchsichtig. Geruchlich eher unauffällig. Im Geschmack süß und bitter. Mit Noten nach Pfirsich und Kirschen.", "2010 bottle thanks to Leighton. It pours clear deep red - brown with a thick beige head. The nose is bitter-sweet, oily, toffee, fruit cake, light spice, candied peel, stewed orange, honeysuckle and peach. The taste is rich, bitter - sweet, toasty, varnish, piney wood, peach, nectarine, tangy marmalade, light alcohol boost, tannins, fruit cake and leather with a slick finish. Medium - full body, fine carbonation and oily mouth-feel. Great balance and high drinkability. Very tasty indeed.", "Bottle shred in London - sourced from the Euston Tap. Vintage 2010. Pours a compelling clear copper with a creamy tan head. There’s a hearty dose of pine in the nose, dried citrus, orange, crusty bread. Medium sweet flavor with some graham crackers, ripe berries, oily pine, a bit of toffee, orange peel. Full bodied with fine carbonation. A little chewy. Warming finish, oily, with rich citrus, light earthy and piney bitterness, toasty bread. Solid.", "Malt, candy, spices, caramel. alcohol, sweet. A very easy drinking barley wine with full body and a long finish. Very long.", "Bottle. Amber colour, clear. Aroma caramel, salty, nuts, mollasses, hops. Taste sweet, caramel red fruits, mollases. Alcohol in taste. Good one.", "Bottle from hop hideout, sheffield. ruby red with a white head. Aroma is fig and cola. Taste is sweet and bitter. Full bodied with oily mouthfeel and mild carbonation.", "W aromacie suszone owoce, śliwki, karmel, typowy BW. Barwa bursztynowa, ale pływa sporo brzydkich farfocli. Piana niewielka, chociaż jak na BW to średnia. W smaku także suszone owoce i karmel, ale jest też kontra chmielowa, jest zauważalna goryczka miedzy niskim a średnim poziomem, odczucie w ustach średnie ku pełnemu, wysycenie średnie (jak na BW, to ku wysokiemu). Rzeczywiście bardzo dobry balans między słodyczą a goryczką i chmielowością. Bardzo dobre, ale nie wybitne. Jednakże przy swojej cenie i dostępności - na pewno warto.", "Drank with Liedewij while talking 11-8-2015. Liked this beer very much. It is quite rich. It grabs you and does not let go. Very sweet, alcohol, complex and compelling. Liked it very much.", "Kopparfärgad med ett stort skum som sakta sänker sig. Sötsyrliga toner i både doft och smak. Skulle legat till sig, är nu lite stickig\n\n---Rated via Beer Buddy for iPhone", "Draught. Pours amber with creme head. Aroma of malts, caramel, pine, flowers. In taste sweet, caramel and malty with hoppy notes. Full bodied, strog bitterness in the finish. Solid classic BW.", "Bottle from Erzbierschof Zurich. Brown-redish, muddy color. Beige head. Smell of sweet malts, dark fruits, liquorice. Taste is slightly metallic, dark berries, sweet, malty, plums, boozy. Definitely a lot of alcohol. Good beer.", "Drink cold: 8-10°C\r\nEye: pours a murky amber to ruby color with a rather quickly dissipating beige head and medium carbonation.\r\nNose: fruity licorice. Prunes and red grapes and different berries. Almost a bit belgian style like; caramel and/or maple-syrup\r\nMouth: a hint of carbonation, foamy and a bit metallic and a potpurri of fruits/berries (fruitcake or tarte)\r\nPalate: yeasty, sweet licorice, sweets, nuts, cranberry and pomegranate\r\nOverall: plus: very drinkable and as enjoyable as a belgian beer; downside: a bit metallic or alcoholic in the taste.", "Amber, moderate head. Nose of syrup, resin, grass. Medium to full body. Sweet taste of roasted malt, a bit of booze, winy, light bitterness along. Well balanced. Nice brew.", "Poured from the 6-pack, look is reddish orange nice 2-3 finger collar. The first beer and a half are forced sippers, meaning it is almost impossible to gulp, but after that all bets are off. I got all kinds of different flavors in every drink: fresh fruit, dried fruit, sugar, booze, malt and some hops. I also get why the commercial description suggests to sip after dinner, because it’s strong! I wouldn’t suggest trying to drink all 6 if you have anything to do the next day, especially early in the morning.", "Bottle. Pours Reddish Amber with a very small, beige head. Aroma of malt soup. Notes of stone fruit and booze. Lots going on in the taste. Plummy fruit, liquor and a bit of doughy cake flavour. Gets you pished n’aw. Tidy.", "Orange-red with thin beige head. A bit hazy. \r\nWood, fruit, alcohol, apricots, chocolate, hops and a bit of liquorice in the nose.\r\nBitter and fresh flavour with notes of fruit, vanilla and chocolate. Somewhat sweet with a dry finish.", "A really beautiful reddish brown ale with light foam. Even when the bottle is opened spreads a lovely winey aroma. There is much fruit in the aroma and slightly malt. The palate is marked by hard roasted malt and lots of fruit. The alcohol has a nice warming effect and edge makes a good vinous fullness. The finish is long and the hops gives it a subtle bitter touch which is in a very good balance with the malty and fruity taste.", "This one has a lot going for it. Looks good. Smells good. Tastes good. Definitely recommend it.", "Grumligt orange/mörkbrun med kvarhållande beigt skum. Doftar sött, lite kanel och kryddor. Smaken omedelbart sötsyrlig, maltig med lite beska i botten. Eftersmaken ganska lång: lite sötsliskig, mycket tung maltsmak. Klart bästa Barley wine jag druckit.", "A- In my opinion it has a very alcoholic smell to it. I can smell a little bit of the dark fruit but mostly alcohol. A- Nice ruby color with an off white head that leaves very little lacing on the glass. T- I do not taste the the alcohol that I found in the smell. It has a nice sweet dark fruit. M- Light carbonation that coats the mouth nicely. O- A very tasty beer from a historic brewery. I have not had many barleywines but I’m beginning to love them more and more.", "Wyra?ny s?odkawy smak, pi?kna barwa. To dopiero moje drugie Barley Wine i jeszcze niezbyt dobrze si? w nich orientuje, ale chyba b?dzie to jeden z nich ulubionych gatunków.", "Pours a dark brown body with a thick beige head. Very nice aroma of burnt sugar. Well balanced malty taste.\n\n---Rated via Beer Buddy for iPhone", "Bottle one month past its drink-by date. \r\nL: a murky dark amber with a tan head. \r\nS: an upfront whiff of booze gives way to the most delicious plum, cherry and dark fruits, I’m instantly taken back to my grandma’s dense fruitcake. Yum. \r\nT: plenty of alcohol coming through, but I’m getting strong malt and fruit too. \r\nF: full-bodied and warms the mouth and throat. It seems to fluctuate, some sips are malty, some boozy. \r\nO: I get this better now than when I first tried it a few years back. Would go lovely by a fire on a winter’s evening.", "Poured from a 12 OZ bottle into a pint glass\r\nAroma- Has a very nice fruit smell\r\nAppearance- Pours a murky brown with a tan colored head \r\nTaste- Fruit is dominant, real good flavor\r\nPalate- A heavy bodied beer with moderate carbonation, has a strong alcohol finish\r\nOverall- A real good barleywine, I would drink this again", "Deep ruby red, with a medium tan lacing head. Sweet malts, dried fruit, lively carbonation... thick and rich, with a warming boozy finish. Nice.", "Warka 12/2016. Wygląda na to, że zbyt wiele oczekiwałem od tego piwa.\r\nJuż sam aromat nieco przystopował moje zapędy. Old Foghorn owszem pachnie ładnie jednak mało intensywnie.\r\nW smaku przyjemne lecz nieco zbyt wytrawne.\r\nDobre lecz z nóg nie zwala (chyba, że mocą).", "Bottle - fair size foamy head, murky dark brown color, complex dark fruity aroma and flavor, big malty backbone but well balanced overall, very good overall \n\n---Rated via Beer Buddy for iPhone", "Cor cobre avermelhado, espuma bege abundante, de fácil formação, persistente, linda cerveja. Aroma adocicado, caramelo torrado, licor de passas, morango, malte de torrefação média, lúpulo discreto mas presente, aroma muito bem equilibrado. Paladar adocicado médio, trouxe notas claras de uvas passas, frutas vermelhas e um amargor mais forte que no aroma. Corpo oleoso, aveludado, carbonação leve, álcool perceptível mas bem inserido. Aftertaste médio/duradouro, puxando mais para o aroma de uvas vermelhas e passas, açúcar mascavo com um pouco de amargor, dulçor sempre presente e em dose certeira. Muito boa, mas estranhei o efeito do dry hopping.", "355ml bottle from Systembolaget. Beautiful clear, deep brown, with a creamy tanned head. Sweet aromas, toffee, nuts, malt, pine. Fairly high carbonated, full body, thick, creamy mouthfeel. The taste is sweet and malty, caramel, bread, raisins, toffee, citrus peel, orange. Pleasant bitterness and some warming booze in the finish.", "Miedziane z beżową pianą. Aromaty bananowe, nuty chmielowe, owocowe i słodowe. W smaku znów banany, słód, lekka czekolada. Niskie wysycenie, piwo treściwe z kwaskowym posmakiem, Przyjemne.", "Bottle from SB 150613.\nPours a clear mahoganny with a lasting beige head. Very heavy aroma with banana, dried dark fruits, molasses and malt. Sweet taste with malt, prunes, treacle and candy/foam bananas. Not much hoppiness really but a nice bitter aftertaste. An excellent sippin' ale. \n\n---Rated via Beer Buddy for iPhone", "Beautiful warm red colour. Smells banana! Round sweet malty taste and ...banana, alocohol. Long sweet and hoppy finish, alcohol noteable in finish too. I love bananas, so i thoroughly enjoy this barley wine.", "Ambar tirando a marrón. Escasa espuma. Aroma muy lupulado, a ciruelas maduras y uvas. Excelente textura, suave y cremosa. Sabor de malta como dominante, pero muy aderezada por otras muchas cosas, caramelo, chocolate y especialmente por los toques lupulados. Final seco y limpio. Muy disfrutable.", "S:\r\n-lemons,orange peel,caramel,raspberry,elderflower,apricot,pine\r\nT:\r\n-Follows the nose plus grapefruit\r\nF:\r\n-low carbonation\r\nO:\r\n-Great barley wine", "Un barley wine, brassé depuis 1975, de 9,4 % abv, fait de first wort et en dry hop.\r\nCouleur châtain moyen à roux ambré, à la clarté nette.\r\nBulles moyennes en colonnes droites, peu nombreuses et très calmes.\r\nMousse beige moyen bien crémeuse, stable à 6 mm.\r\nArômes de vin, bois, pointe de cannelle, cassonade, feuille de vigne, malt cara.\r\n1ère bouche souple à veloutée, sur du vin capiteux, des épices et quelques herbes.\r\nArrière-bouche suave, longue.\r\n2ème sur du bois de fût, des châtaignes.\r\nArrière-bouche vineuse, complexe, longue.\r\n3ème sur du malt très doux, beaucoup de vin, du chai, des fruits mûrs.\r\nArrière-bouche forte, épicée, dense.\r\nLongueur avec beaucoup de fruits, du bois, levure, malt, vraiment très vineuse.\r\nJambes souples, bien marquées.\r\nLevure douce, mais avec du caractère.\r\nAlcool très bien, progressif, action massive sur les saveurs.\r\nFinale qui se savoure, au sens propre.\r\nCONCLUSION : un très grand barley wine, qui donne de la matière pour la philosophie de la \r\nbière. Toutes nos félicitations à l’Ancre californienne ...", "bottle bought at Dobre Pivo, Ljubljana. smell is very malty sweet, maltose, malt syrup, notes of dried fruits, plums, light liqueurish / alcoholic. full body, soft carbonation & light sticky mouthfeel. tastes alcoholic, malty sweet, molasses, light sticky, dried fruits, plums, syrup, some citric notes, oranges, syrupy sweet finish. good, was expecting a bit more though, a bit bitter-sweet.", "Bottle 355ml. Hazy brown colour with an off white head that fades rather quickly. Aroma of chocolate, coffee and alcohol. Lovely. The taste is in line with the aroma: sweetness with a mix of chocolate, coffee and a bitter undertone. The warmness of alcohol lasts for a long time.", "Bottle from Systembolaget. Big, bubbly, beige head. Dark copper colored body. Smells hoppy, some citrus and oak in it. The taste is very sweet, with barley, sugar, yeast and a bitter aftertaste. Great stuff.", "Thats a beer... No it’s a barley wine. And a very good one to. Creamy stable head and an Explosion of very pleasent smells. Color is Red to Brown and a bit hazy. Nose is raisin chrismas fruits and hints of lime. Taste is a Hammer of yeast and chocolate and some taste like Port or Sherry with a slight alcoholic warmth. I damn like it much...", "Piana drobna ale sycząca, przypomina tą z szampana, szybko znika niemal do zera. Barwa jasno miedziana tudzież ciemno bursztynowa, opalizująca. Aromat wprost powalający - cała feria suszonych słodkich owoców z gruszkami, figami i rodzynkami na czele, syrop klonowy, miód spadziowy gdzieś w tle chmiel i likier - rewelacja! W smaku lekko słodkie, sumarycznie czuć wszystko z aromatu, fajna rozgrzewająca likierowość i lekka goryczka chmielowa w afterteasie. W odczuciu dość treściwe, oleiste ale nie gęste, nie wyklejające, bardzo gładkie, rozpływające się od razu po języku i podniebieniu, nagazowanie wysokiego jak w belgijskich Ale, drobne. Alkohol mógłby być z deczko lepiej ukryty.", "Bardzo smaczny BW. Lekko piecze w podniebienie, co lubię. Bardzo aromatyczny: leśne owoce, słody, trochę chmielu, drewno. W smaku podobnie. Ciało gęste. W tej kategorii cenowej rewelacja.", "Pours mahogany colour with an apology for a head. I couldn’t find a trace of american hops in the aroma but what I got instead was even better. A mixture of dried fruits, raisins, a gentle alcohol note. The taste is pretty much the same, the beer is sweet but not cloggy, warms up a bit but is not alcoholic. In fact, it puts me in mind of some belgian strong ales or quadruppels, the only exception is the absence of phenols. Pour me an another bottle please!", "BOTTLE 12 OZ from Bov. 9,4% ABV. It’s got some citrus hops over solid malts, loads of dried fruit with mildly oxidized notes (apricot?) and a touch of alcohol that spices the thing up. The taste is mighty sweet, yet not sugary but rather fruity. The big balancing bitterness feels somewhat harsh and phenolic, but after a while it either mellows down or the palate gets used to it, but everything comes together in a perfect harmony. Great brew.", "Dark brown/purple hue and nearly opaque with a negligible head. Robust aroma consisting of red grapes, cherries, blackberries, alcohol, malt, caramel, and slight vanilla. Full bodied and quite rich. Smooth and sweet combination of grapes, cherries, blackberries, caramel, vanilla, and alcohol with a sweet and mildly hoppy finish. Very nice.", "Copper color, toffee and caramel aroma, great body with some bitterness, flavor of pepper and caramel.", "Shining brown, medium tan head, medium retention. Toffee aroma. Alcohol in the taste, medium sweet, bitter finish. Medium to full body. Oily texture, average carbonation.", "Review based on the BJCP2015 guidelines (style 22C). Bottle 35.5 cl - Batch unknown. AROMA: slight floral and pine-like hop aroma, with a high malty presence with notes of caramelized malt, peppery alcohols and slight dried grapes. malt aroma more prominent than hops. APPEARANCE: reddish copper color with slight orange highlights and good clarity. medium ivory head with good retention. alcohol derived viscosity with lacing. TASTE: strong malty and sweet presence with notes of peppery alcohols, caramelized malt. low hop flavours with a floral character. medium-high bitterness with a semi-dry and bitter finish. PALATE: meidum-full body with a slight velvety texture and alcohol warmth. moderate carbonation. OVERALL: an american barleywine with less hop notes that advertised, maybe from long conditioning.", "Colour is amber with greenish shades. Tan head.\r\nAroma is honey, orange, fried plantain, iron.\r\nTaste is mildly sweet, full body, low CO2. Not very long finish.", "wonderful sweet fruit flavour with a sharper finish. Only problem is why many Anchor beers are so sugary..", "335 ml bottle\n\r\nDark amber to deep ruby red clear beer with blonde head. Aroma has dark fruits, toffee sweetness and ripe fruity marmalade.. Flavor has raisin and toffee with some pine. Palate is full and foamy. Finish has quite strong bitterness. Aftertaste has raisin and syrupy sweetness, light saltiness, light licorice, some spiciness. A bit of alcohol. Especially nice aroma. Good refreshing slow-sipper. Not so far from dark Belgian Strong Ales.", "355ml bottle. White medium creamy head. Clear dark caramel color. Aroma is wood, oak, chocolate, alcohol, nettles, herbs, caramel, sugar. Very sweet taste with wood and sugar.", "An old stalwart. More British inspired old barley wine.\r\nRich brown colour. no lasting head or beading.\r\nMalty. Very malty. Rich treacle and molasses banana dried fruit and brown sugary end.Over time it displayed an aged sherry whisky element.\r\nQuite unique really.", "Tried on tap. Colour is slightly hazy brown/orange. Aroma is malts, caramel, dark fruits, almonds and slight fruit hops. Taste is also sweet malts, dark fruits, caramel. Mild bitter, slight smoke finish. Strong alcohol taste. \n\n---Rated via Beer Buddy for iPhone", "Bottle @ home. Pours a cloudy deep red liquid with a medium tan head and nice lacing. Aroma is sweet and malty with caramel, toffee, dried red fruits, honey, perfume. Big mouth feel with a smooth texture, medium carbonation. Flavors include caramel, toffee, pleasant bitter spices & herbs, syrup, dark fruits. Lasting bitterness. Nice balance, not more, not less, a very good barley wine.", "Aroma: malty, dried fruits, caramel, toast, alcohol\r\nTaste: heavy sweet, light bitter, malty, caramel, toast, alcohol, fruity", "Flaska. Rödbrun vätska med ett snyggt smutsvitt skum. Dofter av karamell, frukt och brunt socker. Smakinslag av torkad frukt, läder, toffee och alkohol. Saknar tyngd och en större kropp för ett högre betyg. Nu är det en bra öl, men bara en okey Barley wine.", "Bottle bought at Systembolaget Valbo. Even though I tried this one a few times it’s almost undrinkable. Very strong unpleasant taste of alcohol, hard carbonation and waaaay too bitter. Must be drunk to drink this kind of beers.", "친애하는 샌프란시스코의 형님 브루어리. 실력파 올드스쿨. 따르자마자 엄청나게 가라앉는 침전물. 무슨 한약 내리는줄 앎. 코냑-레드와인 류의 시작, 입안에 온통 쌍화탕 냄새 ㅎㅎ Lexington,KY\r\nhttps://twitter.com/MaekJuBot", "Reddish brown colour with no head. Aroma of fruits, some herbs, oak and yeasts. Flavour is very malty, sweet with fruity notes and with little carbonation. Alcohol is very well hidden. A surprisedly very good beer.", "Best in this beer is definitely aroma. Deep, thick, sweet malty aroma, with delicate alcoholic graze. Very good solid barley wine.", "Barley Wine er ikke helt min favorittype. Rødbrun i fargen med bra luftig skum. Lukter noe fruktig og alkohol. Smaker litt besk og søtlig. Medium med kullsyre. Litt tørr bitter avslutning.", "March 27, 2015 - bottle from Blue Max. Brownish orange pour with some head that faded somewhat quickly. Aroma was malty, caramel, dark fruit and light hops. Sweet malt and fruit dominate the flavors with a mild dry bitter finish.", "Bottle BBE: 12.2013 (Aged). Lightly chilled. Pours a cloudy copper scarlet with a moderate, almost greenish yellow head. Medium intensity aromas of cheese & onion, cat litter, chestnuts, almonds, sweet cherry and cranberry. A subtle red fruit, Christmas Pudding sweetness, swiftly followed by a heavy, blunt bitterness and sourness. Very full body with a thick, chewy texture. Low to medium carbonation and a touch of liquorice in the finish. Overall a delightful, sipping barley wine. Aging doesn’t do much to take the edge off its alcohol punch though.", "Pours a dark red with a low head. Pretty viscous beer with aromas of caramel, sweet malt, sweet dark fruits, nuts and some slight fruity hoppiness hiding behind the big, bold malt aroma. Flavor has huge caramel, sweet malt, freshly toasted bread, toffee, slight milk chocolate and nuts. The american hops are even more in the background of the flavor. Delicious beer that i will most definitely purchase in the future.", "Aroma: sweet malt, prunes, caramel\nPalate: sweet, well rounded, \"fluffy\" feel\nTaste: dark fruits, caramel, malty, well balanced\n\n---Rated via Beer Buddy for iPhone", "Bottle 355ml, pours clear redish with white fast falling head. Aroma of candies, red fruits, flowers and honey with a hint of grapefruit and melon. The taste makes the first impression of being very sweet, but it’s underlined by some delicate bitterness and a refreshing sourness that remains long in the aftertaste. Alcohol is good hidden and it’a very good drinkable. Imo it could be a little less liqueury, but still it’s a very pleasant one.", "Drink bottle version. Very nice dark red color. Nice 3/4 inch beige head. \r\nNIce aroma and superb malty flavor. Not to sweet. Superb beer", "reddish brown color with minimal head. Nose is sweet malty with some perfumish tones. Taste is malty with some fruity tones kicking in especially at the end. Pretty complex finish. Tones of warming alcohol in the end.", "Bottle from Systembolaget. Pours amber with a medium white and rich carbonation. Smell has some alcohol, malts, yeast and something that is reminding me of flowers or seeds. Taste is strong and full. Sweet malts, some caramel and syrup, though it could taste even more. Palate is oily and smooth. Overall a pretty nice beer, though it hasn’t anything over the ordinary to offer.", "Bottle. Pours a dark brown colour with a thin white head, malty aroma with hints of fruit, taste is malty and fruity with a short sweet finish.", "Clear amber pour, small quick head. Nose is honey, soft fruit, roasted malt, and a stray hop cone or two. More sweet than bitter. Middle is toffee, apricots, honeydew, and alcohol. Finish is bittersweet warming.", "Bottle at Cherry Reds Cafe. Reddish copper, mostly clear. Carbonation dissipates a bit quickly. Massive alcohol in the aroma, along with cough drop, caramel, nuts, some vegetable. Weird sort of burnt plastic bag smell (ok not that bad) that seems present in a few US ales (Anchor IPA & Founders Centennial). Taste is strong alcohol; everything else comes second. It is sweet with a bitter/sour hoppy aftertaste, but mostly all you get \r\nis the booze. It’s only 10% but I feel like my ears are bleeding. Having said all this, it’s actually not a bad beer per se, just intensely unsubtle.", "Drucken ur Pensmugg. Underbart rödfärgad men tyvärr med dålig skumbildning. Kittlar läckert på tungspetsen. Dominerande söt smak av framförallt karamell. God men något slät.", "Barwa ciemno miedziana z czerwonymi odcieniami. Piana średnia, szybko zanikająca co nie jest dziwne na tak mocnym piwie. Za to pięknie oblepia szkło.\r\nPiwo to prawdziwa bomba słodowa, niezwykle słodka, pełna i gęsta. Wydaje się, że ze zboża nic więcej nie da się już \"wycisnąć\". Smak to podobnie jak w aromacie słodkie rodzynki i suszone morele. Delikatnie wyczuwalne zioła pochodzące pewnie od chmielu. Goryczka jest na średnim/niskim poziomie, ale genialnie komponuje się z resztą. W tym wszystkim idealnie ukryty jest alkohol, którego właściwie nie czuć. Bardzo złożony, pełny smak.", "On tap at Craft, Calgary. Pours slightly hazy red with a tan head. Aroma is sea salt, caramel, and vanilla. Caramel up front with notes of spice and roasted malts. Grapefruit on the finish. Excellent barleywine!", "#2000 Rating of this beer, yay! 355 ml. bottle @ home. Procured from ABC Beers. BBF 05/2016. Deep dark hazy amber, small lightly off-white head with great lacing. Smell is thick cooked apples, caramel nose, maple, deep cooked fruits, malty, light port, thick cloves,… yummy. Taste is earthly hops, caramel, light leaves, cloves, cooked deep apples, first time hops make sense to me in a Barley wine, apple peel, caramel malts, smallest touch of warming work,… lightly warming. Body is substantial, malty & hoppy but not overtly thick or heavy. Earthly bitter hops. Wonderful earthly & autumn leave notes. Brekle’s Brown, Porter & Steam Beer were honestly let-downs for me but this was extremely impressive to spectacular.", "Not my favorite. Well balanced. It has a red look and a nice finish. Fresh whole hops and the richest runnings of a thick all-malt mash. Has a nice warm finish.", "A very good barleywine. Pours a beautiful bright red with a tan head. Smells of vanilla and salted caramel. Taste is malty, with vanilla, caramel and sea salt. Very refreshing and tasty. Had in the bottle.", "Deep amber to ruby, off white head which is not very long lasting. Wonderful aroma of a fruit salad covered with candied sugar. Taste is sweet caramel and toffee, candy sugar, candied fruit, dark fruit allround, spices, light bitterness in the finish. Full bodied and sticky.", "355ml brown bottle. Orange, clear, thin layer of beige head with minimal lacing. Nose has fruit, citrus, toffee and brown sugar. Taste has toffee malts, brown sugar, orange. Finishes bitter, bit of alcohol. Hops in the aftertaste with some rich malts. Very nice.", "Opaque mahogany color with rich and creamy beige head. Very sweet aroma, toasted malts, brown sugar, caramel and floral hints. Taste is also very sweet, with sugary and caramely notes, toffee, toasted malts and some alcohol with a very light and pleasant hoppy bitterness. Really nice.", "Pours a clear red brown ale with a bit beige fine stable head.\r\nSmells hoppy and fruity, some caramel malts also. nose is perfect no off flavours in my opinion.\r\nTastes bitter.\r\nLeaves a hoppy, bitter and fruity palate.\r\nIn the aftertaste you get more of the maltyness.\r\nThis is a full bodied beer with a clear alcoholic taste.\r\nReally love this beer!", "Bottles. Pours ruby-copper beautiful body with white thin foam. Impressive and fury aroma - some hops, a lot of subtle caramel malts, note of alcohol, some grass/woods. Bitter-sweet palate with some interesting fruity-bitterness on the edge of the tongue, rather thick. Finish is prolonged, well accented. Very nice!", "Aged 2012 vintage.  Opened 2/17/2015. I bought this bottle in 2012 while living in Rockford, Illinois. Shortly after, I moved to Atlanta, and the bottle came with me. Shortly after that, I moved to Chicago, and the bottle came with me. There it sat for 2 years, until I moved to Christchurch, New Zealand, where the bottle came with me. And now, to celebrate the successful arrival of my cellar, I open one of my most well traveled beers. Pours a cloudy dark amber with little head. What’s there is tan and clings well to the glass. Certainly oxidized aroma. Caramels, toffee, and port wine. Flavor is of raisins, plums, and sour cherries all baked in a crumble with caramel drizzle. Bitterness balances the sweetness nicely. The chewy texture and lingering bitterness help slow you from drinking it too quickly. \r\n----------------------------------------\r\nAged 2012 vintage.  Opened 1/7/2016.  Aggressive pour produces nearly no head to the murky brown beer.  Flavours and aromas similar to 2015 tasting but heavier on the raisin component and I’m picking up less oxidation in this bottle.\r\n----------------------------------------\r\nAged 2011 bottle.  Opened 4/2/2015.  Aromas of molasses, salted caramels, and alcohol.  No oxidation.  Flavour opens with deep caramel richness and moves to taffy apples and raisins.  Some light alcohol in the finish, but by no means strong.  Full bodied and a lingering raisin finish.  This one has held up significantly better than the 2012.", "Flaska från SB. Mörkt dimmigt brun med lite beige skum. Doft av karamell och choklad. Liknande smaker men också inslag av kaffe och humle.", "Bottle at the Norwich Tap House. Pours an amber/brown colour with a small tan head. Aroma of caramel malt, raisins, hop and fruit. Sweet with a touch of bitterness, soft carbonation. Dry and lightly bitter finish.", "Pours a nice mahogany-brown with a finger of light-khaki head. Very malty bouquet with a thick, grainy and sweetish aroma jumping out of the glass. Caramel, roasted almonds, porridge, semi-dark bread and syrup. The palate is full bodied and semi-sweet with nice roasted malt notes, an almost floral character midway and a medium length finish with low bitterness.\n\n---Rated via Beer Buddy for iPhone", "Very nice thickness on the tongue. Nice head. Sweet and carmel with a light toffee burnt flavor. Head last and last. Thickness is what I would want. Overall a nice traditional barley wine. Like most anchor beers top notch.", "A very solid brew. Creamy with a great balance between malty and hoppy. Strikes with easy to drink, creamy and light body. Oranges and toffee are the main aromas. Still more complex then that with candied fruits like anana, figs, mango and banana. Very enjoyable only think that might put off is the cough syrup aftertaste.", "A great old school barley wine. Pours a ruby rouge with a burnished brown body with a thin, creamy off white head. A solid amount of carbonation in the body. The aroma is rich with tons of toffee and caramel malt notes as well as toasted bread and floral hop notes. A nice well balanced profile with lots of heavy malts and more reserved hop notes of light spice, citrus and perfume. A light hop bitterness with a moderate resinous finish. A moderate alcohol presence on the finish leaves a warmth that perfectly accommodates the thick, rich profile.", "Bottle from Lisbeer, Portugal. Color is dark copper. Head is super persistent, white and thin to medium. Taste is medium sweet. Nicely balanced taste. Aroma is malty, hoppy, wood, chocolate. I’m usually not into barley wines, but this proves me I’m possibly wrong.", "Amber with off white head - Good sweet malt aroma - Sweet malt body with dark fruits and some hints of fruity hops in the back with some hints of alcohol - Sweet malt finish - This was real good", "Slightly too bitter for me in the taste, but a nice aroma and nice looks on this beer. Never thought too much of this brewery but they were one of the first craft breweries exported into Sweden.", "ENG: 355ml bottle from Liquor Mart Winnipeg, poured into the tulip. Very dark amber color, very clear. Nice medium to high dark yellow head. Aromas of roasted malts, caramels and herbal, citrusy and pine hops with some bready / sourdough aromas. Taste is very heavy, smoky, roasted caramel, cloves, licorice, prunes, sweet grapes, soy sauce and hint of sweet bubblegum. At the finish theres some sour-bitter taste of cough drops. It’s really heavy beer, especially in taste, it’s creamy, oily and thick. There’s some medium carbonation and full body. It’s a very deep beer, but not necessarily hitting my tastes. For me too heavy, but for sure interesting! ////~~~///!!!///~~~//// ////~~~///!!!///~~~//// PL: Butelka 355ml kupiona w Liquor Mart w Winnipeg, przelana do kieliszka. Ciemno bursztynowe, klarowne. Ładna średnio-duża ciemno-kremowa piana. Aromaty palonych słodów, karmeli oraz ziołowo-cytrusowo-żywiczne chmiele z dodatkiem zakwasu chlebowego. W smaku bardzo ciężkie, wędzonka, palone karmele, goździki, lukrecja, suszona śliwka, słodkie winogrona, sos sojowy i nieco słodkiej gumy do żucia. Pod koniec i w posmaku wyczuwalny kwaśno-gorzki syrop na kaszel. To naprawdę ciężkie, mocne piwo, szczególnie w smaku, kremowe, oleiste i gęste. Średnie nasycenie, pełne ciało. Bardzo ciekawe, głębokie piwo, nie koniecznie w moim guście - nieco zbyt ciężkie, jednak zdecydowanie interesujące!", "Dark amber/red colour with a creamy head. Aroma of caramel, burnt sugar and fruity notes of apricot, orange, berries and alcohol. Taste of caramel and fruits. A smooth, round flavour with a good feel of alcohol. Fruity sweetness and a rich feel of burnt sugar and alcohol. More taste of apricot, orange, butterscotch and molasses.", "0,3 l beczka. Bardzo ładna, bursztynowa, brunatna barwa. W smaku suszone owoce, słodkie winogrona, truskawki(?). Aromat owoców cytrusowch, słodu. Pierwsze wrażenie w smaku to przypieczony tost, który na długo pozostaje na podniebieniu. Po ogrzaniu pojawia się intensywny smak słodowy. Alkohol doskonale ukryty. Bardzo dobre piwo na długi wieczór. Z racji tego, że był to mój pierwszy BW biorę go jako wzór stylu.", "Fruktigt och bärigt söt maltdoft med inslag av hallon och jordgubbe samt lite karamelliserat socker. \r\nVackert tegelfärgad brygd och ett mycket bra skum med stadga och lång halveringstid.\r\nSmaken är söt och med en påklistrad beska. Kolaaktig och med russintoner. Ointressant och obalanserad. Hade förväntat mig mer av denna barley wine från Anchor.\r\nFint avvägd kolsyra men lite platt i kroppen.\r\nEftersmaken är även den kantig och obalanserad.", "Color ambar oscuro translúcido. Espuma beige no mu persistente. aroma fruta madura, cituela pasa,, malta, y un toque algo citrico de fondo y alcohólico. En boca se torna dulce, con sabores a malta, afritado, y algo lupulos aunque de foondo. la carbonatacion es media y la textura algo pegajosa. El final es muy mantido donde el amargor se hace mas presente, junto con el de frutas secas, ciruela Mi primer barley wine...y la verdad me ha gustado...lo recomiendo.", "Flaska från SB. Gyllene brunröd färg med tjock smutsvitt skumkrona. Spritig doft av torkad frukt, portvin och smörkola. Spritig smak av russin, portvin och lakrits- fudge.", "Pours hazy dark Amber with some cream head. Aroma of cane sugar and a bit of hop. Thick and sweet in the mouth with hints of bubble gum and some alcohol. Low bitter finish. Update: an awesome herb aroma when it’s warm.\r\n\r\n---Rated via Beer Buddy for iPhone", "Pours dark red, crystal-clear; creamy head. Aroma is malty and caramely with some evident notes of dark fruit. Taste wise one can feel the perfect combination of sweetness and hoppiness; it’s not an overy sweet, liquorish barleywine. Extremely drinkable", "Bottle at home. Pours dark brown and red. With a offwhite head. Smells of sweet malt, dark fruit, raisins and soil. Moist soil. Taste is thick, bit sweet, low carbonation. Quite strong are, I like that.", "This was poured into a chalice.\r\nThe appearance was a nice looking brown color with a slight transparency running about it. A slim half finger-ed white foamy head quickly dissipated. Light somewhat speckled lacing clings yet slides in a good quick thirty seconds.\r\nThe smell had a big sweet vanilla backed up by a big sweet caramel and light fruity (somewhat like plums).\r\nThe taste was mainly sweet through the vanilla and caramel. There was a slight tobacco aftertaste with a mildly dry finish.\r\nOn the palate, this sat about a medium on the body with a good sipping quality about it. A light tobacco-like quality combined with the vanilla to roll sweetly yet subtly over my tongue.\r\nOverall, I’d say this was a pretty good English Barleywine.", "Flaske 355ml fra Systembolaget, Kiruna. Drukket under nyttårsmiddag i Skibotn 31 Des 14. Mørk rødbrun. 0 skum. God plomme-/ferskenaroma. Smaken syrlige bær. Gjennomgående sherrypreg. Passet perfekt til multekrem!", "Tap. Aroma: malty, slightly fruity, raisins. Deep amber/red/brown colour with small head. Full, porter-ish taste which is a bit fruity, a bit spicy, with medium bitterness and warming finish. Interesting barley wine.", "Brownish red color. Off white head. Aroma of caramel. Dried fruit. Smooth full body. Sweet, fruity taste.", "355ml bottle. Copper body with a medium white head. Caramel, figs, dried fruit. Well made.\n\n---Rated via Beer Buddy for iPhone", "Bottled. Pours brown with a small light brown head. Smells nutty hoppy, citrus and some parfume. Tastes nutty, s bit sweet, hoppy with a thick bitter sweet finish.", "Väldigt tilltalande färg och skum. Djup arom och smaken väldigt fin. Lite spritig avslutning", "Somewhere between hazy and cloudy mahogany color, small off-white head. Aroma is bubblegum, yeast, sugar, some dark fruits, caramel and malt. Fruity kick in my face, also some bubblegum in taste, some caramel and a bit of alcohol. Full body, flat carbonation. Sweet finish. Foghorn, you are great! \n(0,33l bottle)", "Mørk brunorange med høyt beige skum som legger seg fort. Mørke frukter og bær, svisker og alkohollukt. Karamell, frukt og alkoholsøt. Fyldig. Kjenner alkoholen og gjærsmaken. Litt oljete. Koseøl...", "Klar. Rødbrun. Skum forsvant fort. Søtlig smak, svisker? Fyldig. Tydelig alkoholsmak. Meget svak ettersmak av mørke bær. Koseøl.", "Aroma here is classic toffee, berries, rich malts and a small hint of hops. The taste is truly great, maybe not the best in the world, but up there in the top layers. Rich and full malts, sweetness from ripe oranges and some spices. It’s almost a little too sweet, but the warming sensation that sets in after a while makes this a winner.", "Thick head. Nice lace. Cloudy dark brown. Strong hop aroma. Cinnamon and nutmeg complex flavor.", "Aroma of fig, plum, pumpkin pie spice, wheat bread and molasses. Slightly boozy. Reddish amber color with off white foam. Tastes like everything in the aroma except without the spice and a little more booze. Strong dark fruit flavor. Barleywines should be a little hot and slightly bitter; this one delivers just enough of these qualities. The palate is the only substandard aspect of this beer; I was expecting something more substantial. I'm glad I did not age this one - it's great fresh. \n\n---Rated via Beer Buddy for iPhone", "Flaska systembolaget. Brunorange färg med ljusbrunt skum. Söt och knäckig doft med fruktighet. Sockrade äpplen. I smaken känns russin, en touch av bitter choklad och knäck. Värmande alkoholstyrka med trevlig bitterhet", "Flaska från Systembolaget.\nFin röd färg men väldigt liten skumkrona.\nVissa vintoner, i såväl arom som smak. Ändå hygglig öl-känsla.\n\n---Rated via Beer Buddy for iPhone", "Currently I am updating my ratebeer with al the beers I drank but was too lazy to rate at the time. I give the scores I gave back than. If I drink the beers again I might re-rate them.", "Dark brown color, big head and good lacing. Aroma of fruits and caramel, malty and hoppy notes. Tastes sweet and malty, lightly bitter and fruity (plum, raisins). Full body, alcohol is hidden.", "What a surprise !: sharp, fruity fragrance, as well as the taste is slightly sweet, but it still feels very Hops note. The level of alcohol is very well hidden, in fact, is absent.", "Appearance: reddish copper color with a one finger big head that goes away fairly quickly \nAroma: caramel, fruity, malty,\nTaste: sweet malty , hoppy, little bit boozy \nOverall this is a really good barleywine", "chocolate, caramel, butterscotch, brown, hazy, minimal head, medium bitterness, soft carbonation, bitter, light body,", "Bottle; Hazy red colour, creamy yellow head. Aroma is dominated of citrus, , fruits berries,. Flavor had a sweet malty, berry, spicy mouth feeling lots of fruiys , big boddy, long fruity finish. Complex Barlywine this one!", "Det här var gott, lite spretigt kanske men gott. Smaken bar toner av päron, kåda och krydda. Kroppen var stabil men balansen satt inte helt på sin plats.", "Bra balans i smaken, lite dovare i aromen. Lite torrare och inte så fruktig. Traditionell öl.", "355 cl systembolaget. Fantastisk god öl som avnjöts tillsammans med ett lättare julbord dagen innan julafton.", "Huge sweetness, like absolute epic raisin, plum and figs. Huge malty syrupy sweetness. The color is what gets me, its a really beautiful dark red, mahogany. Taste is really nice. Big sweet dark fruits with a subtle hoppiness. For 8.8% you don’t really taste it, it’s well hidden but helps cut some of that maltiness down. I have only had a couple barley wines but this one is definitely the best of the ones I’ve had. I’m glad I tried it, it’s a very different style for me but around the holidays this is a great beer. Cheers", "En trevlig upplevelse så här kvällen före jul. Intensiv smak, en aning tallbarr som ger en viss fräschör.", "2 vintages, 2010 & 2014, very very different!\r\n\n\n\r\n2010:\r\n\n\n\r\nA – Very see through, extremely glowingly strong red colour, very faint disappearing head.\r\n\n\n\r\nS – Caramel, nutty, browned butter, figs, apricot, huge aroma, kind of reminder to Tom Hardy’s.\r\n\n\n\r\nT – Loads of caramel, with nutty burned noisette feel, very balanced, and not that sweet, lots of lighter fruits like dried apricot, peach and some fig.\r\n\n\n\r\nM – Perfectly carbonated, and a bit more full than fresh.\r\n\n\n\r\nO – 9/5/9/5/12 Total 4.3\r\n\n\n\r\n2014:\r\n\n\n\r\nA – Orange copper with a solid head.\r\n\n\n\r\nS – A bit grapefruit, a bit caramel malt, bready, and quite nutty, loads of pale malt and light caramel.\r\n\n\n\r\nT – Very easy going, nice malt backbone with some lighter caramel, hops are really quite present, floral grapefruit with some grassy bitterness.\r\n\n\n\r\nM – A bit too carbonated and quite thin.\r\n\n\n\r\nO – 7/4/7/3/11 Total 3.4\r\n\n\n\r\nAge seems to do wonder with this one, was closer to a less hopped up Bigfoot fresh.", "Hazy ruby red color, big off white head. Aroma of strawberries, malts and bubblegum. Taste of red fruits, malts and yeast. ABV is high but its not evident in taste or aroma. It has medium to full body but it’s very smooth and very easy to drink. It’s fruity, refreshing and I could drink a ton of it. Awesome.", "@ Nedre Mölla 22/12-14. Bottle from Systembolaget. Aroma: Fruity, overripe fruity, hops, caramel. Taste: Dito + sweet. Body is medium to full, the finish is fruity/overripe fruity with notes of caramel.", "Figs, raisins and some elusive fruit. And alcohol but not dominateing. Brilliant with figs and cheese.", "Recently picked up a bottle at the local shop. Impressed by how versatile this one is. Dangerously drinkable. Aroma is berries, caramel, sweet malts and more. Appearance brown reddish with a small head. Taste is dominated by heavy sweet tones. Raisins, caramel, honey, all balanced out by some nice bitter hops in the finish.", "Amazingly flavorsome. Nice tones of flowers and nuts. Really well made barley wine.", "medium bitterness, lightly sour, medium sweetness, medium body, creamy, average carbonation,", "Aroma: Smelling of bread, apple, chocolate and vanilla.\nAppearance: A hazy chestnut colored beer. A high off-white head with good lacing and good curtains.\nTaste: Tasting toffee, bread, alcohol, raisins and licorice.\nPalate: Medium low carbonation, a soft texture. A good body.\nOverall: Young, unbalanced and boozy.\nNote: Bottle 355 ml at home. (Vintage 2014) Reviewed 2014-12-19.", "@ Havregatan 141219. Bottle (355 ml) from Systembolaget. Malty and fruity with spicy notes, sweet, dried fruits, medium body with an oily texture. The finish is dry, malty and fruity.", "Pours reddish color, white head. Aroma of red fruits, honey, caramel, alcohol, plums. Taste is sweet, plums, red fruits, honey and hints of hops.", "@ Basunen 14-12-15: stor fruktig doft med framför allt banan. Smaken är något mer balanserad. Mycket fin fyllighet och balanserad hetta. En fin värmare. \n\n---Rated via Beer Buddy for iPhone\n---- Soberness not garanteed!", "(Bottle). Sweet scent of caramel, fruit, chewing gum and raisins. Taste of sweet raisins, fruit, malt and hops. Warm hints of alcohol in the finish, and also some hints of salty sea. A nice beer this one! A very good Barley Wine.", "Beautiful colour. Already some sweetness and maltiness in the nose. Even more in the mouth. High alcohol, sweetness and maltiness, rich hopiness and finesse. Either you love it or not. Love it.", "Metal, fruity and butterscotch on the nose. The taste of lightly fruity, butterscotch and bitterness. Heavy bitterness that fills the mouth forever. Too bitter for my taste. Follow me @ Kung av öl @ Facebook for more pictures and ratings.", "35.5cl bottle. cloudy amber colour. medium sized white/beige head. malt, caramel, toffee, cinnamon, spices, alcohol. medium bitterness. medium carbonation.", "A bit watery and with harsh taste after a few sips. A bit disappointing. The beer might have been a bit too cold.", "Amber color with no head. Aroma of melons and caramel. Taste is rather weak, weird for Barley Wine. Mostly boozy, maybe a little bit of spices. Nothing very special for a Barley Wine.", "Been looking forward to this grandfather of modern barley wine for a long time. It’s more than I expected. There’s lots of fruit in the aroma, both citrus and darker fruits. Sweet caramel, wood, vanilla, tobacco. Taste begins with sweetness but ends dry with a long bitterness. Complex but harsh. Would probably love this after a few years in the cellar.", "Z butelki uderzenie bukietu winogron. Po nalaniu do kieliszka pojawiają się intensywne nuty koniakowe, wyczuwam też gorzkie czekoladki nadziewane winogronem zatopionym w syropie z cukru. Barwa brunatna, klarowna. Piana piękna, wysoka, drobna, jasnobeżowa. Smak... znakomicie wytrawny! Coś pomiędzy francuskim wytrawnym czerwonym winem, a lekkim porto. Przyjemnie gorzkie, pełne w smaku i długo pozostające w ustach. Alkohol niewyczuwalny w smaku, ale czuć że piwo rozgrzewa.", "Bottle 0,33l. Pours a dark red/brown beer. Medium beige head that leaves lacing in the glass. Aroma of dark fruit, caramel malt, bread, plum and brown sugar. Taste is sweet malt, alcohol, raisin, plum, grass, dark fruit, a little bit orange, nuts and dark syrup. \n\n---Rated via Beer Buddy for iPhone", "Tyłka nie urywa, ale smakowało mi. Pite w temp. ok 10 st. z beczki na premierze Grand Championa 2014.\r\nCzuć owoce (truskawki / winogrona) W smaku dużo ciała, słodyczy , silny alkohol dobrze zbalansowane.", "Pours a caramel coloured hazy brown with no head or lacing. The taste is sweet bread malt, raisins, hints of dark chocolate and brown sugar, with slight bitterness. The alcohol stands out.", "Flaska delad med @thaalcoholic, tack! Mörkt rödbrun vätska med ljust skum. Söt maltig doft med lite jästig känsla. Torkad frukt, maltig. Kraftig. Man känner att den är stark utan alkoholsmak. God!", "- Alcoholpercentage van 8,8%\n- Redelijk biertje destijds gedronken\n- Niet verkeerd, maar heb naar mijn smaak veel lekkerder biertjes gedronken\n- Vandaar mijn niet al te hoge waardering uiteindelijk \n\n---Rated via Beer Buddy for iPhone", "Bottle from Systembolaget. Malty smell with dried fruit and caramel. Similar taste with some piney hops. Very round taste. Easy to drink even though the abv is quite high. Not boozy at all. Really nice.", "355 ml bottle. Hazy amber with small white head. Smell is caramel, honey, fruit and raisin. Taste is caramel, honey, raisin and warming alcohol. Dry with medium bitterness and medium carbonation.", "Flaska från SB. Dofter av karamell och bubbelgum.!? Eldig munkänsla med snudd på alkoholinslag. Lite torr.", "Marmelade and caramel aroma. Sweet, fruity, lots of brown sugar, some toast in the aftertaste. Spicy. Visually beautiful as well.", "Hazy, light brown beer with a thin head. \n\r\n\n\r\nNose: Dried fruit, plum, prunes, oak, red berries, orange, caramel malt, bread and brown sugar. \n\r\nTaste: Sweet malt, raisin, plum, grass, hops, ripe apples, a little bit orange, nuts and dark syrup. \n\r\nMouth: Medium to full body . Light carbonated. Creamy feeling. The alcohol is well hidden with a perfect balanced bitterness. Dry ending. \n\r\n\n\r\nA great English Barleywine from Anchor!", "dark Maroon body with foamy off white head. Rich malty oaky vanilla dried fruit and booze aroma. Taste is rich and sweet, a touch of raspberry and banana and cough syrup with a bitter hoppy backbone and some booziness. Nice beer and hoppier than most barley wines.", "A really great barley wine. Aromas of corn syrup and maybe a bit of bubblegum. Really nice malty corn sweetness balanced by a hoppy finish. Great mouth feel.", "Butelka z data do 11.2015. Barwa piekna rubinowa piana ladna ale szybko opada i znika. Zapach slod karmel alkohol miod i jeszcze troche chmielu. W smaku podobnie mega slodowosc + troszeczke cytrusow i alkoholu. Goryczka moglaby byc wieksza.", "Bottle. Pours a medium amber-brown with a small tan head. Malty aroma, with toffee, sultana raisins, tobacco, hints of white grape and other fruit. Flavour is sweet and malty up front with a touch of fruity tartness and bitterness, some caramel, toffee, raisin, grape and leather notes. Nicely balanced, a little dry with some warmth in the finish. Very tasty.", "33cl @ bottle. Prima Barley Wine per me e pienamente soddisfatto. L’alcol si sente molto.", "Intéressante à première vue et à la première gorgée, mais le sucre l’emporte trop, impossible à terminer. On sent le houblon, mais c’est trop doux pour moi.", "12 oz bottle pour. Pours a dark brownish copper color with a sweet, semi hoppy aroma. Really rich caramel malt flavor with a definite hop presence all throughout. Some dark fruit hints on the palate. I normally don’t enjoy beers with this type of sweetness as much, but it didn’t bother me here. Very smooth drinking barley wine. Think I might see what a little time will do to this one now. Really low price for a solid beer.", "Aroma: Sweet malts, plum, classy alcohol, dried fruits, flowers and caramel. Taste: Sweet dried fruits, citrus sourness, honey, plum, caramel and medium bitterness on aftertaste. Small head, no lacing, medium carbonation. Price [Warsaw, Poland] 16PLN (bottle)", "Julie says an interesting Carmelly nuke but takes a while to actually taste the goodness. It is blah the rest of the way. She gives a 2.2", "Copper colored beer with a white head, low carbonation.\r\nSmells fruity.\r\nTaste is fruity, sweet honey and some hoppy bitterness.\r\nThe alcohol is well hidden, good beer.", "I like this precisely because it doesn't really taste like a barley wine. The sweetness is almost residual and well balanced with the hops.", "Pours copper with a small head. Aroma: very malty, but also hoppy (flowers, citrus). Taste: pretty thick, malty sweetness, honey and a nice hoppy bitterness in the finish, plus a subtle warming effect in the throat. A greatly balanced barley wine, very drinkable. Alcohol very well hidden.", "De color ambar y buena capa de espuma beige de mediana retención.\r\nAroma a fruta madura y licor.\r\nOleosa y sin mucha carbonatación.\r\nEn boca de nuevo fruta madura, dulce y acaramelada, dejando sensación alcohólica en la garganta.", "Bottle. Dark red colour, white head. Sweet aroma, red fruits and caramel). Nice sweet fruity flavour with red fruits and plums. Medium body. Low carbonation. Nice sweet finish that end with some dryness. \n\n---Rated via Beer Buddy for iPhone", "Bue en bouteille de 35.5cl au Kilarney entre potes, couleur caramel, pas de mousse et très peu d’effervescence, une bière très très sucrée avec un début de bouche énorme sur le caramel et le pruneau, continuité sur le sucre candy et une pointe sur le coing et un final à peine malté.", "Bottle at home. Pours reddish color, white head. Aroma of red fruits, honey, caramel, alcohol, plums. Taste is sweet, plums, red fruits, honey, alcohol present, hints of hops.", "355 ml bottle @ The Local Pub, Athens Greece. Ruby red color with a nice beige head. Aroma of caramel, iqourice, dried fruits. Taste is sweet at first with caramel and honey, followed by dark fruits and earthy hoppiness to balance it. Aftertaste is medium sweet, long. Medium to full body with medium carbonation.", "Mooi amberkleurig bier met lichte schuimkraag. Geuren van hop, mout en vaag wat rood fruit. Smaak is zoet voor een barley wine, maar zeker lekker, fris door het koolzuur, hoppig, moutig en frambozenijs (!). De fruitgeur en smaak is slechts een toon binnen een complex geheel. Een zeer drinkbare barley wine, heel lekker!", "Een van mijn favorieten. Prima quadrupeltje/barley whine met vooral een heerlijke champagne achtige bubbel.", "Pours dark red/brown with decent head which disappears quickly. Sweet aroma of dried fruits (prune, raisins), caramel and malt. Noticable alcohol. Very sweet. Quite bitter.\n\n---Rated via Beer Buddy for iPhone", "\"a little sweeter than some, but with a hoppier finish, it will leave you wanting more. this is one of the better barleywines out there. I remember thinking it was a little thin at first, but have since changed course. Great beer! 3/09 - on tap for the first time...not quite as good surprisingly, had to wait to drink as it was served ice cold. sweeter, but balanced.\"", "Aw yeah. I’ve been wanting to try Old Foghorn since I saw Anchor’s cellar and heard our tour guide talk about the months required for this Barley Wine to mature into the rich malt bomb that it is. It did not disappoint. The reddish-brown color and frothy head made it easy on the eyes, and the flavors were equally approachable. Barley Wines can have robust personalities, but this one wasn’t overbearing at all. Caramel, brown sugar, hints of chocolate, booze, and candied dark fruits. The hops help to keep the flavors from becoming too heavy or cloying, but impart little bitterness. This is a full-bodied brew that would be right at home with a rich dessert or - better yet - a good cigar.", "Bottle.\r\n\r\nA- Sweet, brown sugar, candy, roses, malty, caramel, dark fruits, booze.\r\n\r\nA- Reddish brown color, slightly hazy liquid, tan head.\r\n\r\nT- Sweet, brown sugar, rock candy, malty, dark fruits, alcohol.\r\n\r\nP- Full body, average texture, average carbonation, smooth finish.\r\n\r\nO- One of the sweeter barleywines I have had. The alcohol normally found in one was quite subdued. A nice blend of sugary and fruity flavors with the caramel like malts. A good sipper on a cold day.", "330ml bottle poured in a Leffe chalice.\r\nA: Pours a beautiful deep reddish amber color with a large yellow head. Small retention but never disappears completely leaving some lacings left\r\nS: Sweet. Caramel, honey and candy. Sweet malts and liquor\r\nT: Sweet upfront, notes of caramel and toffee. Caramel malts and citrus and grassy hops, basically\r\nM: Heavy and extremely molasses body. Medium to low carbonation. Bitter-sweet aftertaste\r\nO: Good beer, Anchor Steam quality, but drinkability is compromised by the high ABV combined with its high sweetness\r\n[ BA Review @ 1/8/2012 ]", "Bottle at home. Pours dark amber, nose is fruity, toffee, taste is rich, caramel, fruity.", "Fľaša. Tmavá medená farba, krémová pena, celkom držala. Vôňa vanilky, medu, tropického ovocia, jemne citrusov a najmä alkoholu. V chuti prevláda med s vanilkou, neskôr trošku citrusové plody, tropické ovocie. Trošku karamelu v dochuti. Plné telo, vyššia nasýtenosť. Výborné pitie.", "Bottle 33cl. Clear dark amber color with tiny white head. Aroma - Dark fruits, caramel, flowers, alcohol. Something special.", "A mahogany red beer with a small head. Aroma is awesome sweet malts and syrupy brown sugary tones, also with a large amount of alcohol when warming up. Piney hops too, quite light though. Taste is sweet malts, brown sugar, medium bitterness and mild alcohol. Rather pleasant. Smooth finish. I'd have another. \n\n---Rated via Beer Buddy for iPhone", "Malty and boozy. It's not as sweet as I expected. Not the best I've had, but a tasty little barley wine. \n\n---Rated via Beer Buddy for iPhone", "Bottle 355ml, BBD 01.2016. Clear reddish brown color with medium head. Good barley wine, good body, malty, sweet but slightly acid & barely tart. Aroma is on tofee, nuts, raisins, caramel/sugar, dark fruits", "Bue en bouteille de 33cl. Superbe barley wine, malts caramélisés, bel équilibre avec le houblon juste assez présent. Pointe d’épices et d’agrumes. Finale sèche.", "Couleur cuivrée caramel, legère mousse beige. Fort nez caramel et houblon gras, boisé chêne. Super gout malt d’orge, caramel un peu brulé, notes fruits noirs, fruits secs, raisin, note reglisse, bien complexe et ronde en bouche. Corps bien huileux avec saveur d’alcool et fin de bouche avec note amere et notes caramel brulé. Très forte en caractère, sirupeuse mais très buvable, super!", "From a tap at the brewery. The pour is a clear amber in appesrrnce. There a sticky maple note that I taste. It’s good.", "Caramell aroma, \"kolasnören\", chocolate, vanilla, dark syrup and actually some tomatoes. Nice malty barleywine where the bitterness just acts to balance the malt and not to dominate.", "Bottle 33 cl from Barleywine in Copenhagen. Dark ruby/brown with a thin beige head. Fudge, raisins, brown sugar, vanilla, generic dark fruit. Very nice vanilla fudge taste, some sweetness, well balanced bitterness. Fullish body, low carbonation, bittersweet finish with lots of vanilla fudge. Great beer!", "Bottle. Brown, clear body, with a big, creamy, dark beige head. Aroma of toffee, nuts, creamy cake, berries, dried fruits, some banana, slight citrus. Taste with about the same aromas, with the banana a bit more prominent and some alcohol burn. Thick, oily mouthfeel, with a medium carbonation and it finishes bitter-sweet, alcoholic, sour-fruity and with a slight coffee dryness. Very good, heavy and greatly balanced strong ale. Nice banana aromas, that I experienced in other Anchor beers as well. Overall really enjoyable, but not the best Barley Wine I’ve had.", "Coloração marrom-âmbar. Creme bege perene. Aroma inicial de casca de laranja na taça, com maltes torrados e caramelo com frutas maduras em seguida. Sabor de maltes torrados, com dulçor levemente exagerado, mas sem prejudicar, corpo médio, densa, não se percebendo lúpulo. Sabor resinoso. Retrogosto maltado. Boa breja, mas muito adocicada ao permanecer na taça, prejudicando um pouco a drinkabilidade.", "355ml bottle. 9.4%. Deep reddish orange-brown colour, foam beige head leaving alittle lacing and aroma of malt, toffee, fruity, raisins, orange. Taste is sweet malty with toffee, brown sugar, caramel, raisins, dark fruity, candied notes and some spicy hop bitterness. Oily mouthfeel, medium to full bodied, soft carbonation, warming lingering earthy bitter finish. Very drinkable", "I had this at Global Brew. Pours reddish brown with a tan head. Taste booze, fruity, Carmel. I didn't care for this. I would not drink this again.\n\n---Rated via Beer Buddy for iPhone", "12 oz bottle. Pours a deep reddish brown with full head. Aromas of brown sugar, raisin tarts, and sweet malts. Flavors carry the same plus light resins and grass. Alcohol is quite prominent in the finish, and somewhat thin for modern American barley wine, but nonetheless very nice.", "Zapach z butelki: Intensywny, żywiczno-ananasowy.\r\n\r\nPiana: Dość skąpa, jasnobrązowa, drobno- i średniopęcherzykowa. Redukuje się do obręczy.\r\n\r\nKolor: Ciemnobursztynowe, klarowne z zawieszonymi drobinkami.\r\n\r\nZapach: Bardzo intensywny. Na pierwszym planie nuta cytrusowo-brzoskwiniowa, nuty żywiczne, zaraz potem biszkopt i toffi. Bardzo bogata gra aromatów, przeplatanie się. Słodowość, za chwilę chmiel, potem łagodne owocowe estry. Ciemniejsze słodowe nuty - rodzynki, delikatna nuta mlecznej czekolady. W miarę ogrzewania duża żywiczność, nuty tropikalne. Pojawiają się możliwe do wyróżnienia aromaty sosny, ananasa, lukrecji.\r\nSmak: Głęboki i złożony. Obfita podbudowa herbatnikowo-chlebowa z nutą suszonej śliwki. Owocowość świeżych śliwek i wiśni. Intensywna, korzenna słodycz w typie lukrecji. Spora ziołowość. Alkohol niewyczuwalny. Słodycz dominuje, choć odczuwalna jest delikatna kwaskowość jak w wiśniach wyjętych z nalewki.\r\n\r\nTekstura: Ciało pełne, piwo dość ciężkie, nieco lepkie. Masywne i nieco oleiste, wykleja policzki i podniebienie.\r\n\r\nNasycenie: Średnie.\r\n\r\nGoryczka: Wysoka, ziołowa.\r\n\r\nPijalność: Średnia.\r\n\r\nCoś wspaniałego. Złożoność smaku i aromatu tego piwa sprawiła, że musiałem usiąść i zamilknąć na kilka minut. Dzieje się mnóstwo rzeczy, obcowanie z tym piwem stanowi swoisty wstrząs, wstrząs ekstatyczny. Z jednej strony potężna słodowość z bukietem zacnych cech - z drugiej czuć, że nie żałowano chmielu. Jest tutaj fantastyczna równowaga smaków, wszystkiego jest w sam raz, przy czym wszystkiego jest po prostu dużo. Do tego niewiarygodnie zamaskowany alkohol. Polecam bardzo gorąco."]}