{"reviews": ["Piwo w kolorze herbaty z niezłą  pianą. Aromat karmelu, miodu, chleba. W smaku podobnie bardziej wytrawne niż słodkie. Niezle", "Another one I had at the retirement party of my buddy on 30 April.  Fantastic brew and logo, does it really flow in the dark?  The beer was great and will be opening more.", "Pour from a can is dark amber clear with fizzy bubbles and thin white head. Toasted malts, light bodied crisp with mildly bitter finish. Nice ABV hidden well.", "Smell is average, medium mouth feel, short finish. A better option to regular lager, but also abit more exp", "Van 't vat. Amberkleurig bier met wit schuim. Geur: mout, klein zuurtje, wat fruitig. Smaak: mout, wat karamel, licht fruitig en licht hopbitter. Medium koolzuurprikkel.", "Bottiglia. Il naso riconosce indizi di caramello. La finezza olfattiva è normale e l'esistenza olfattiva è sufficiente. Il manto birroso superiore ha una buona tenuta. La grandezza delle bollicine è medio-fine. Il liquido appare velato. Bollicine fini costituiscono la forma del perlage, con carbonazione vivace e persistente. Il colore è ramato. Il corpo è rotondo. Il dolce è medio. L'amaro è nella media. La forza gustativa è elevata e si prolunga in modo sufficiente. Le sensazioni boccali finali risultano di birra beverina. Il retrogusto è di decente intensità. Al palato prevalgono impressioni di caramello, miele, frutta secca, pane tostato, un accenno di resinoso e agrumi.", "Pours amber, fine retentive dirty white head over quiet texture. Malty, floral and bread notes on top with a hint of yeast and nuts. First sip is soft and sweet with toffee and caramel notes over a malty bed. Halfway down it echoes with figs, hazelnuts and cereals. Goes down easy in a medium carbonation. Finish is clean and sweet but in the aftertaste lies a little herbaceous bitterness.", "12oz can.  Pours a rich amber with a medium beige head.  Aroma is caramel, pine, honey, some nuts, and orange.  Taste is orange, resin, caramel, pine, toffee, and a little toast.  Medium body.  Moderate carbonation.  Slick mouthfeel.", "Una birra eccezionale con note caramelmate e frutta cotta con sentori erbacei e una componete maltata spettacolare, sul finale si fa strada una leggera amarezza al dir poco piacevole", "I'm a trappist nut, but these types of ales come in as a close second. Classified as a maibock, I find it really pushing the style's limits. It pours out a rich amber color and has a picturesque white head. It really looks perfect in tge glass. For fullmaltys like me, the smell must match those of the pearly gates. Ample caramel malts, toffee and a hint of bitter hops tantalize you. The first sip also doesn't disappoint. A bit sweet, but very supple and full bodied with molasses, toffee, and honey flavors throughout. It's balanced with mild hoppy bitterness, creating almost a boozy cherry finish. And this beer is BOOZY. I really enjoyed this ale! I was stunned to see some of my untapped mates didn't like it much, but hey...more for me! I loved this dead guy ale a skele-TON.", "355ml can from local store, imported. Pours clear reddish orange/amber with nice frothy white head, not long lasting. Aroma of malt, caramel and quite herbal hops. Taste is sweet and malty, really pleasant with a nice small touch of bitter, fruity hops at the end. Love how it is sweet at first and balances with the more biting, grassy hops in the finish. Low to medium carbonation. Malt, caramel, dark fruits, nuts, toffee with nice herbal hops. Medium body and slightly oily texture. Good 6.8% abv and slightly bitter in the end but really extremely easy to drink and for everyone, i'm really enjoying this. Very nice and so enjoyable.", "Hazy amber with a good slightly off white head.\nAroma: Both malt (bread, honey, nuts) and fruity hops (orange, passion fruit).\nMouth: Great mix of malty sweetness and hoppy astringency. Quite bitter lingering finish. Medium body, low/medium carbonation.", "Can. Clear dark orange/amber feat.  a really lovely white head. Aroma of honey and malts. Taste of malts,  caramel, honey, toffee with a small  herbal touch. Slightly sweet and oily. Moderate bitterness. Low to medium carbonation. Pretty boozy. Would pair well with a Scotch I suppose. Rather different than the German Maibocks I’m used to. \nNot really sure what to make of this but it’s nice though.", "Malty nose, faint roasty notes. Some fruitiness as it warms up and breathes. Medium body with a moderate bitterness. Nicely balanced between the hops and the malt. A very drinkable strong amber.", "Probably the best beer I have personally tried. Great full flavor, that goes down easy but has a ton of great smooth flavor. Amazing beer to say the least.", "Can at Lumiere. Dark honey color, bubbly offwhite head which subsides son. Aroma is super malty, nutty, toffee, bready, toasted bread. Crisp noble hops providing an intense grassy and resiny flavor. Some dried fruit, apricot, honey, molasses. Medium to thick body, creamy texture, soft carbonation, smooth creamy finish.", "Beige creamy head. Dark amber colour. Aroma is moderately hoppy with caramel, nutty, light roasy and resinous notes. Flavor is moderately malty with caramel and dried fruits tones, ending in a moderately malty finish. Medium bodied.", "Aroma of caramel, malts, dates, sweet fruits, and sugar\nHazy caramel colour with little to no head\nTaste of intense malt, fruits, dark fruits, caramel and sugar cane\nMild carbonation with oily thin mouthfeel\nNice", "Look- golden honey slight haze\n\nSmell- faint nuts and malt. Nothing overly aromatic.\n\nTaste- barley malt balanced with bitter hops. Mostly malt flavor, but has some almond and floral notes. Slight bite at the end.\n\nFeel- not too dry, with medium carbonation. Feels balanced.\n\nOverall- easy drinking beer. My go to if I can't make up my mind on what to get. Can't go wrong with this beer.", "Pours hazy amber with a thick large head. Aroma of herbs, spices, nuts. Taste of spices, caramel, malts. Medium carbonation, bitter finish.", "Amber colored, medium off white head. Aroma is of malts, caramel, slight roastiness, wet dog. Medium bitter sweet. Medium bodied with quite the carbonation. Nice, quaffable, on the sweet side yet likable beer.", "Old rating from 13/10/14 - bottle brought back from the US by my wife. Pours a dark amber with a off white head. Aromas & tastes of banana, dark fruits, roasted nuts, flora, toffee & sweet malt. Medium body. Malty mildly soft finish. Very enjoyable", "Pours amber with a thin white head. Aroma of Czech malts, grass. Taste has herbal, slightly oily malt, with grass and oak notes. Palate has some scotch on the nose, slightly oily finish and a hint of hops. Eh.", "I'm surprised I haven't rated this yet.  I poured it from the can into a shaker.  It pours amber with an off-white head.  The aroma is malt, nut, and earthy.  The taste is caramel, nut, toast, and herbal.  It's smooth and easy to drink with some carbonation and a very slight hoppiness.  This is all around very good and drinkable.", "Orangebrunlig med kortvarigt hvidt skum. Duften er sødlig og krydret med en antydning af tørrede stenfrugter og alkohol. Smagen er maltsødme, der dog balanceres fint af humlens bitterhed. Eftersmagen fortsætter det søde præg, der holder længe. \nEn superfin strong ale med god diskret balance.", "Cloudy amber color. Brown sugar and citrus smell. Excellent depth, boozy on my tongue, some citrus. Hops are excellently balanced. Not too bitter but provide some bite. Nice long finish. I've wanted to try this for a long time, and it's the best maibock I've had. Pricy but good for special occasion.", "My go to beer when someone asks \"what's your favorite beer.\"  Pours golden orange with no head.  Nut aroma, slightly malty.  Lively mouth feel for a bock.  Very drinkable nut brown like ale.  I never get bittering hops notes, but maybe that is why I like it so much and have for years.", "Color ámbar claro y semitraslúcido con clara carbonatación visual y una densa espuma blanca de excelente retención. Aroma moderado maltoso con recuerdo a caramelo y tueste, amém de cierta presencia licorosa. Sabor dulce a malta de intensidad medio-alta, con toque cereal y cierto amargor lupulado, sobre todo al final. Cuerpo medio-alto y carbonatación medio-baja.", "Can - from 6 pack. Medium amber color, cloudy.  Sweet, malty aroma. Pretty good. Both malty and hoppy but seems a bit thin.", "Hazy amber with greenish shades. Beige head. Aroma is cookies, porridge, Golden Grahams, vanilla, honey. Mouthfeel is oily, slick, a bit heavy and low on crispness. Taste is sweetish, moderately bitter, long-lasting. 5 outta 10, I'd say.", "Honey color, rich nutty honey caramelized/toasted malty taste. After taste is mild sweetness. Mild carbonation. It tastes like heavy white wine. Amazing.", "Bottle, 7months after best before date.\nBeautiful dark honey colour, sparse brown foam.\nDecent malty mouthfeel, but a bit dry.\nNice rich taste and very refreshing. Honey, nuts and dark wild berries, and a bit og pepper. Possibly coconut in the aftertaste.", "Holy shit. This is a great beer. It has an also wine-like element to it. A deep dried fruit aroma and flavor. Long mouth feel, it's like an ambrosia! It's sensual, dripping with flavor. Love it.", "Brown color thick foamy head  smell cinnamon malts hops sweet smell taste of light hops roasted malts tropical fruits", "12 oz. can poured into a shaker pint glass. Produced a lush, though short-lived, 1-finger, off-white head on a handsome dark amber body. Moderate lacing early faded with the head. Smell was pretty much as advertised; malty aromas of toffee, toast and nuts. Early tastes of pumpernickel, brown sugar and honey merged with a slightly bitter, earthy hop profile as the beer warmed. Moderate mouthfeel, crisp finish.", "Birra ambrata dalla schiuma opalescente beige chiaro con aromi di caramello e panificato e malto. Gusto molto ben bilanciato tra il dolce dei malti e l'amaro della luppolatura comunque ben presente", "Lækker øl.. fik den ved den helt rigtige temperatur og den smagte fantastisk... frisk og let hvede agtig, men på en mild måde. Skål", "12 oz can. Smells of malt and banana. Dark orange in color. Tastes sweet, getting taste of toffee and banana bread, nutty. Finish is rich and sweet. Not really my style.", "Non è male, ovviamente niente a che vedere che le tedesche ma si lascia bere. Dolce ma ben bilanciata con l'amaro nel finale.", "Bevuta in bottiglia da 33.\nAroma dolciastro leggermente affumicato.  Colore rosso aspetto cristallino.\nFg", "Chinée à L'Usine à Bières de Granville Bouteille 33cl (DLC: 06/2020).\n\nAu nez un parfum de houblon et de malt viens enchanter la dégustation.\n\nLa robe est bellement ambrée et quasiment opaque, tandis que la mousse et de tenue très brève. La carbonatation est très présente sur cette bière.\n\nEn bouche le breuvage chatouille le palais avec des arômes de malt qui dessinent un léger côté sucré caramélisé en y donnant un côté quelque peu rond. Le houblon arrive ensuite coloniser le palais pour l'équilibrer avec un goût sec, amer et fruité de houblon.\n\nPendant une gorgée j'ai pu ressentir une sensation de banane et de pêche typique de plusieurs bières teutonnes.", "Cerveza oscura, sabor maltoso dulce  ,recuerda a miel ,melaza \nMe recuerda a paulaner salvatore no igual", "bottiglia 650 ml, schiuma beige fine media persistenza, colore ambrato velato, al naso è intensa miele zucchero di canna malto tostato, in bocca malto caramello frutta sciroppata, corpo rotondo, l’alcool si sente ma non disturba, carbonatazione moderata, amaro accentuato lungo nel finale. Ottima decisa equilibrata. Una bottiglia da 650 ml é poca…..! Ricorda le Bock che bevevo da ragazzino. c. Beer-shop.it 17.01.20", "Bottle from McCafferys.  Hazy orange with offwhite creamy head.  Malty aroma.  Quite full mouthfeel with malt and hint of muscavado.  Even finish.", "Kicsi, gyorsan elillanó hab, opálos barna szín, szűretlen. Gabonás, enyhén karamelles, egy kicsit fűszeres illat. Leheletnyit édeskés, gabonás, karamelles ízek. Száraz, közepesen testes, közepesen szénsavas és közepesen keserű. Nagyon jól kiegyensúlyozott, finom sör.", "0,33l bottle. Pours amber with off-white head. Aroma of malt, honey, caramel, fruits. Taste is malty, honey, stone fruit, caramel, toffee. Very sweet, yet enjoyable.", "# 703; 4/2017. Vyvážený, chuťově komplexní pivo s velmi zvláštní vůní (připomíná bbq). V chuti převažují tóny pomerančové kůry.", "De botella en Oldenburg. Bonito color ámbar con suave espuma color marfil. Aromas muy ricos a miel, melaza, malta tostada y cierto frescor lupulado. En boca es fresca, carbonatada y con un rico sabor a miel de bosque, bizcocho de yogur y melaza. Retrogusto suave y dulzón con toques frescos lupulados. Qué rica!", "I love this beer. I like amber ale, brown and black ale, hate all these IPA overhopped BS beers and apparently like Maibock or what ever this dead guy ale is. \nPlease keep making it and don’t change a thing. It is awesome.", "Dark amber with a one finger wide white head.\nRoasted smell of grass and hay. Intense grainy, malty taste with a bitterness that develops during the sip. Low carbonation and hoppy bitter aftertaste.", "30-10-2019; bottle; at home (bought at Saveur Bière, as part of their October 2019 discovery box).\nThe looks of the beer are nice. The beer is crystal clear. On top some whitish foam is formed. Foam retention is low and not a lot of foam is left. The colour is a nice amber. Not bad.\nThe aroma of the beer is quite nice. The beer has nice malt profile. Filled with caramel, some nutty notes and also some nice bready notes. There are also some nice fruity aromas. Hops are floral and also a bit herbal. There is a slight metallic note though, this isn't the nicest. But, it is not that bothering. It is quite a light Maibock, but still very aromatic. It is quite nice and a nice light start to start the evening with. \nThe taste of the beer is also quite nice. The beer is quite sweet due to the many caramel malt notes. The hops give a firm bitterness too. The beer is quite balanced. It is definitely not a bad beer. I like it.\nThe palate of the beer is also nice. Medium body, smooth texture, light carbonation. The finish of the beer is nice. It has a nice malty note, fading towards the floral hops that end the beer. All in all, a very nice beer. I like it.", "Smooth mild flavor, a bit of carbonated feel. Caramel honey. Alcohol feel. \n\n---Rated via Beer Buddy for iPhone", "Rogue Ales Dead Guy Ale 6.8% ABV 40 IBU. This Ale pours a deep golden amber color with a finger width slightly off white colored head that lingers for a bit before leaving some lacing on the glass. The aroma is of malts with hints of citrus and caramel overall a pretty sweet aroma. The flavor is very malt forward with hints of toffee and caramel and dark brown sugar before it finishes with a slightly hoppy bitterness to help counteract the sweetness of the malts. The mouthfeel is a bit thin for my liking I wish it was more creamy but the carbonation level is perfect. 7.5/10", "Diciamo un bel classicone teutonico che non bevevo da tanto, in effetti il corpo è molto burroso, ma poi scende bene, dai...", "Bottled 0,355L. Dark brow/amber color, medium hazy and bubbly aspect with creamy and foamy white head of medium resistance. Toasted and caramel aromas, notes of alcohol, yeast, aged barley wine, malty. Moderate and balanced alcoholic impression, oily texture, moderate carbonation, light bitter content, intence floral and bock palate.", "Dark amber in color with no head or aroma to speak of.  Very strong cereal taste with no alcohol flavor.  It's a bit like drinking carbonated unhopped wort, including the thickness of the liquid.  It really tastes like I'm eating mashed grains.  Minus points for use of \"proprietary\" as if it's a positive word in the brewery's description.", "Can from Total Wine and More in Reston, VA\nAroma: caramel, spicy, floral, fruity\nAppearance: clear gold with a white head\nTaste: medium sweetness, medium bitterness\nMouthfeel: average carbonation, medium body, sticky feel, long finish\nDelicious", "Keg at BrewDog Camden in 2012. Clear copper with a white head. Aroma of perfumed hops, lager malt and raisins. Nice flowery, maibock flavours, with a good body and malty linger.", "Taste like it was brewed with dirty gym socks and coal dust. I'm just glad I didn't die drinking the one beer. I gave the rest of the rancid trash to my neighbor that I didnt like. I paid like $12 for a 6 pack of this dog water because I thought the box looked cool. I'll stick with beer that doesnt taste like a puked in a bottle then attempted to drink it.", "Ar: caramel, malt Ap: golden, minimal head T: med bitterness, malt sweetness P: thin/med body", "Aroma: toffee, caramel, herbal and spicy hop\nAppearance: moderately hazy deep amber color topped with a deep beige head. \nTaste: toffee, caramel, herbal and spicy hop, medium-high sweetness, medium bitterness\nPalate: medium to medium-full body, medium-low carbonation, bittersweet finish, alcohol sensation is mild.\nOverall: The best thing about this Maibock is its balance where its malty profile is solid but not overly done, and the noble hop flavor is supportive without being too distractive. The drinkability is much higher than expected.", "0.33 bottle\nC: copper amber\nN: mead, malt, caramel, hint of heather\nP: mid carbonation, very malty, nutty, caramel, burnt sugar, light biscuit, hint of liquorice.", "Vycap unorthodox. Vôňa karamelova. Farba červená. Chuť karamelova alkoholova.", "Bottle. Malty aroma and taste, caramel, light sweet, light to medium bitter. Medium to full body, malty bitter sweet finish. Ok.", "Botella 330ml  Color Ambar con blanca espuma,fina,alta,media resistente.Aroma malta tostada,caramelo,frutal.Sabor domina dulzor,malta tostada intenso,caramelo,pan negro,frutal", "IPA-style beer that leans a bit more towards the malt, but still plenty of hops. Sweet alcohol heat. Halfway between pale and amber.", "Honig Honig Honig... und ein bisschen Malz, Kaffee und Karamell. Bernsteinfarbend kommt dieses Bier trotz vorhandener Kohlensäure nahezu ohne Krone aus. Auf die Toten!", "Amber, clear with a minimal light white head. A fruity aroma with some caramel and wooden barrels sense. Sweet, light bitter with a strong fruit and caramel end.", "This is a backlog rating from 2011 from a bottle (I have had this many timesboth in the bottle and on draft), from notes. When I had this beer it was average to below average for the style and not something I wanted to have again or I just didn't get back to my notes because of my technology at the time. Words to describe this beer are malty, bready, caramel, earthy  and citrus hops.", "I am not a fan of this kind of beer.  It just lacks character and personality.  Fruity flavors with a light bitter finish.  Not my cup of tea.", "12 oz. can. Thick, opaque honey appearance. Minimal head. Malty aroma that reminds me of an Oktoberfest beer. Figs, sweet fruits, bread and biscuit nose. More strong biscuit upon first sip. Some peppery malt notes. All in all, I'm a little underwhelmed and wasn't expecting this to be so watered down tasting. For all the good it advertises, that part of the brew really failed to shine through for me. Maybe a bad can but I'm not sold on this one. Don't get me wrong, it's not terrible, and if you dig malty beers you could pick far worse... but an average overall rating of 3.5 seems bit steep from where I'm sitting.", "12 oz. can poured into a glass.  Pours a copper color with a two finger head of off-white foam that dissipates quickly.  Aroma is sweet and malty, and this matches the flavor.  The malts are very pronounced and balanced with just enough noble hop flavor.  The mouthfeel is somewhat thin.  Overall, this is a very malty and fairly sweet beer with a subtle noble hop flavor.", "Bottle. Pours a deep orange colour with almost no head. Nose is honey, hay, malts some booze. Tastewise it's rather sweet altogether, with notes of malts and honey again with a fruity touch. Medium sweet, malty finish, light to medium body, average carbo.", "Ich weiß nicht, ob dies ein Bier ist, wie es sich die Amis einen Maibock vorstellen oder einfach eine kraetive Auslegung dieses Stils. Das rotbraune Bier ist auf der einen Seite schön vollmundig malzig, haut aber immer wieder fruchtig-herbe Hopfennoten hinein. Aber es kommt nichts zu plötzlich und wirkt darurch recht harmonisch. Ein gutes Bier.", "0,33 l Flasche. Bernsteinfarbenes Bier. Riecht und schmeckt nach Portwein, Fasslagerung.", "12 oz can poured into a pint glass. Compliments of a customer at our bike shop. Thanks customer! Have not sampled this ale for 2-years or so and thought it mediocre then. Changed my mind. This is a solid beer. Try it for yourself or I'll kick you in the nuts!", "Pivo u flaši.\nFina sladna i voćno slatkasta aroma... recimo na breskvu..\nTijelo je lagerasto i srednje gazirano.\nOkus je sladan , voćno slatkast i gorkast ali ne na toliko na hmelj , nego jednostavno gorkast..\nFino pivo za sve koji i inaće vole Dojč-Bockove...", "Aroma: mounds of sweet malt and a hint of raisin\nAppearance: amber, brown hazy just off white head, small sudsy lacing\nFlavour: mounds of clean malt, flavour hop balance\nPalate: thick perfectly carbonated finishes hoppy.", "Bottle, thanks Colin! Pours a honey-brown with a fast-settling head and a malty-sweet nose with a light yeasty note. Rich and dry-sweet on the palate, lightly toasty honey and drying bitterness. Good stuff.", "Aroma of caramel toffee malt. Pours copper amber body thin lace. Taste is medium toffee sweet. Palate is medium bodied sticky feel soft carbonation and a long finish. Overall a pleasant malty ale.", "Birra ambrata dalla schiuma poco persistente. Profumi di caramello e malto. In bocca sapori di frutta, malto e piacevolmente amara", "Heller bock de 6,8 % abv pour 16° plato et 40 ebu.\nMalts 2 rangs, c15, munich et deux spécifiques des fermes Rogue.\nHoublonnage en perle et sterling.\nMon exemplaire était sans date décelable ...\nAvec ce zombie sur l'étiquette, j'ai cru bon de verser cette bière\ndans un verre de Brugse Zot  …. Zombie et zot iront ensemble !!\nCouleur ambre roux, avec particules en suspension.\nBulles moyennes, éparses, vives.\nMousse blanc cassé, en nappage à 1 mm.\nArômes de cerise confite, pêche, vin cuit.\n1ère bouche sur un beau malt cara, avec fruits confits.\nArrière-bouche avec raisins secs, figue, et pointe d'amertume.\n2ème aux saveurs assez riches.\nArrière-bouche un peu plus longue que la 1ère.\nLa longueur maintient ce relief de raisins secs et fruits confits, \nmais elle manque singulièrement de complexité.\nJambes fines, courtes.\nLevure correcte.\nAlcool pas mal pour son niveau, il aide la longueur à se maintenir.\nFinale linéaire.\nCONCLUSION : un heller bock pas désagréable, mais ce zombie est\nloin d'être une terreur .. Le brugse zot en rigole plein son ventre !!\n(5/2/5/2/11)", "Moderated dark amber color, nice foamy neck (mid persistence),  not significant lacing. Nose sweet. Good body presence, sweet but not overpowering (balanced acidity). Brief pleasant bitterness aftertaste", "Beautiful, mahogany color. Aroma of bread, malt and herbal hops. Malty taste with moderate, hoppy bitterness. Great example of a  unpopular nowadays style. Keep the Dead Guy aalive !", "Color ámbar oscuro, turbio, con capa de espuma de un blanco amarronado de dos dedos de grosor y buena retención. Carbonatación difícil de percibir visualmente. Textura entre oleosa y cremosa. Aroma a pan viejo y caramelo. Sabor a pan viejo y caramelo. Mucha malta. Ni rastro de lúpulo. Dulzor medio en boca. Ligero amargor al final. Alcohol bien integrado.", "Se quiser começar bem com uma bock, comece aqui. Fantástica cerveja, com começo, meio e fim muito especiais. O teor alcoólico fica nos bastidores com a qualidade desta cerveja. Vá com fé!", "A nice thick honey-colored head with beautiful uneven bubbles. Actually, the head is so remarkable I have to devote two sentences to it.\nThe smell reminds me of kabayaki eel, actually, though I'm sure someone has probably used the words \"bread\" or \"caramel\" for it.\nThe taste is that of oatmeal, apple and sesame initially then transitions into a crisp finish that would make you think you're drinking a pale lager, were it not for the slightly bitter Worcestershire hoppy finish that's barely there. If you don't do hop-heavy beers you might like this.", "Copper color with bready aroma.  Caramel sweet malt flavor balanced with a mild hop bitterness and and earthy finish.", "Color is light brown. Little foam head. Aroma contains honey and patoka notes. Taste is strong and sharp, rough bitterness in aftertaste. First sips feel heavy, but later beer is ok.", "Found from bottle from Ingles in Waynesville, NC. Pours a medium hazy copper. Aroma has subtle honey smell. To me that is also reflected in the final taste. Really good honey. Really good Fall option.", "Belle ambrée dans une bouteille de 355 ml. Nez sur les fruits rouges, les épices, la liqueur. Bouche maltée, sucrée/caramel, fruitée (cerise, raisin, prune), épicée. Une petite rondeur, des bonnes saveurs et une petite amertume finale. Good.", "Hoppiness offset well by the sweetness, but not quite perfect. Really smooth.", "355 ml. bottle @ home, served in a teku glass, due date: 05/2019.\r\n\r\nAroma: quite intense aromas of caramel malts, caramel, alcohol sweetness, honey, hints of yeast, burnt caramel, burnt brown sugar.\r\n\r\nAppearance: orange to amber color with slightly off-white head made of tiny to small sized bubbles. Medium head thickness with high retention and medium Brussels' lacing. Low to medium haziness.\r\n\r\nTaste: medium sweetness, low bitterness, low sourness. Flavors of caramel, caramel malts, brown sugar, alcohol sweetness, honey, orange, orange jam, hints of burnt caramel, burnt brown sugar, dates, prunes. Balance is toward the sweetness but it is not cloying and quite balanced by hops and a light acidic touch. More sweet at first and increasingly bitter toward the finish.\r\n\r\nPalate: medium body, watery to oily texture, medium to high carbonation, very long sweet and dry finish with low to medium sweetness and bitterness and the same aforementioned flavors. Alcohol is noticeable through some alcohol sweetness aromas and flavors and some throat and mouth warming. Astringency.\r\n\r\nOverall: very good looking, quite sweet aromas and flavors of caramel, caramel malts, sweet alcohol, hints of burnt caramel, burnt brown sugar. I usually don't like such sweet beers but it's not bad at all.", "10/10/18 (Chicago): $6.25 16 ounce pint glass draft pour at The Garage Bar & Sandwiches. Red copper pour, malt and honey aroma. Nice strong taste, honey comes through well, malt and caramel. Thin mouth feel, easy drinking. Overall good pour.", "Mooi ietwat donker bier met een fijne citrus smaak. Daarnaast heeft het bier wat moutigs en wat fris. -backlog de BierApp-", "This is quite a good ale! No gimmicks, well....there IS the black can, and glow in the dark skeleton picture, but I’m really talking about the flavor. Caramel permeates throughout without overpowering with just a bit of hops at the end, more of a nip than a bite. I love this stuff. \n\n---Rated via Beer Buddy for iPhone", "Cloudy orange color with small white head. Malt and some biscuit aroma. Sweet and light dry malt taste.", "Bottle, 0.355l. Cloudy copper pour, one finger frothy off-white head. Medium retention, thick lacing on the glass. Very sweet on the nose, heavily malty, strong caramel, molasses, mild honey notes.\r\n\r\nMedium body, soft carbonation. Thick and oily texture. Not as sweet as nose would suggest - medium sweet with low bitterness, nicely balanced. Aroma is heavily malty, caramel, toffee, molasses, sugar. Herbal and floral notes in the back, mild alcohol bitterness towards the finish. Slight burn on the tongue. \r\n\r\nOverall, good beer. Perhaps not one to remember, but nicely balanced and well executed. Ok.", "Just a little bit of head and a brighter brown body without intense carbonation. Aroma is vegetable, fermented brown sugar. Flavour is more brown sugar with some caramel. Medium finish. Simply all right, nothing too exciting going on here.", "Bottle. Clear full golden-amber body, creamy off white head, medium retention. Candyish and müsli-like maltiness in the aroma, actually quite cool. Candyish and grainy müsli-like taste, prunes, smoooth. Just a touch of bitterness and I'm not sure I like it here. Some lovely flavors with the bitterness as a detractor, even if it might have been there for the balance. Nice beer.", "Pours clear chestnut, with two finger, light tan head. Aroma is dried fruit, light caramel and some hops.Taste is light caramel, moving to light roast and a building hop backbone. Finish is hoppy roast. An OK maibock.", "Mousse faible, belle robe ambrée cuivrée, limpide. Nez très malté, souligné par le houblon léger. En bouche, dominante maltée, légèrement toastée à l'amertume soutenue par le houblon. Très fin et équilibré, par trop sucré. Excellent.", "Colore ambrato scuro, schiuma media poco persistente, leggera carbonatura. Aromi di frutta e caramello, leggere note erbacee. Al palato, uvetta, nocciola, malto, prugna, mediamente dolce ma nel finale arriva la punta di amaro. Una birra interessante ed abbastanza equilibrata, dove la parte luppolata si fa sentire nel finale.", "Can/Fest.\r\n\r\nA- Sweet corn.\r\n\r\nA- Copper color, clear liquid, beige head.\r\n\r\nT- Corn, grains, mild caramel, slightly sweet.\r\n\r\nP- Medium body, average texture, average carbonation, balanced finish.\r\n\r\nO- Finally, after almost 3,000 rates, I drink one of the most readily available craft beers around. Of course, I didn't expect a lot but it was decent enough. Lots of sweet corn throughout. Love the new black and metallic can.", "le cactus - Dieppe . Bière très intéressante , peu sucrée , aromatique . Arrière goût de liqueur (Kirsch)", "Can from Craft (Silom) in Bangkok. Clear amber with a frothy white head. Barley sugar and berry sweet aroma. A little bland and floral.", "Uma cerveja com alma própria, que carrega consigo uma identidade fortíssima dentro de um mercado gigantesco de IPA's, sours e outras cervejas muito criativas. A dead guy arrasta seguidores pelo mundo todo. Classificada como maibock,  os próprios funcionários da Rogue preferem caracteriza la como barley wine. Vale nota máxima não só pelo equilíbrio entre dulçor do malte, amargor dos lúpulo da Costa oeste americana e potência alcoólica.  Mas pela capacidade de transmitir a filosofia revolucionária da Rogue. #1", "Really nice Amber color. Sweet, caramel but not too much. Earthy and grainy", "I enjoyed this! Red, light, and refreshing. I'll look for it again when I want something light.", "Lekkere IPA uit Orlando USA. Gaaf etiket. Beetje bitterzoete afdronk. Prima!\n\n---Rated via Beer Buddy for iPhone", "Stark. Düsteres Skull-Etikett mit klasse Inhalt. Guter Röstmalziger Kern, leichte Bitterkeit, angenehme Süße und Karamell. Ein ausgewogenes und eher mildes Ale.\n\n---Rated via Beer Buddy for iPhone", "Got it in the CAN this time. Had a bottle of this many years ago and according to my records I loved it, other than the price tag. Can poured up an amber brew with small fast fading head and the aroma of caramel candy. Taste is caramel, honey, candy like, with a bit of spicy hops. For some reason I liked it more years ago than I do now. Could it be the difference between bottle and CAN or maybe my taste buds have changed.", "Amber, karamell, honning, noe frukt, brødbakst, nøtter, fyldig......................", "Fantastic full bodied easy to drink IPA. Pairs with anything. Love drinking this beer. \n\n---Rated via Beer Buddy for iPhone", "The aroma is full of honey, malt, sugar, caramel, butter and hops. The color is ruby red. The taste is full of honey, malt, sugar, butter and hops. Not impressive.", "Pours with a quickly diminishing small-bubbled white head. Color is amber. Bready and malty aroma with some raisins and plums, licorice, french fries, mämmi. Mildish palate, mild but smooth carbonation. Fits the style, IMO. Taste starts with some initial bitterness on the tip of the tongue, then marsipan, bread and malt with some salt water and herbal and spicy afternotes. Medium-dry finish. Not a particularly interesting beer, but it's 1) a strong ale and 2) a very good presentation of a \"bready ale\", so bread fans will love this. Also no odd side taste or aromas.", "On bottle. \r\nPours deep orange with little to no foam.\r\nScent: Wheat, prunes, oranges.\r\nTaste: Oranges, malts.\r\nTexture: Thick, cream, heavy.", "12 fl oz can. Pours orange brown. Caramel, biscuit, lemon juice, orange, pineapple, mango, biscuit finish. Medium body. Very nice.", "Can. Slightly hazy dark amber pour with offwhite head. Aroma has malt and hay. Taste is round and with full body. Lots of malty notes. Medium heavy body. Medium carbonation", "Bottle from Drygate, Glasgow. Beer served in 7°C, Duvel Glass. Pours hazy golden, small but thick head, leaving hundreds of tiny bubbles on the glass. Aroma is sweet, peach, pears, caramel, candies, sweet malts, juicy, bready, fruity. Taste is sweet, marmalade, ashy, earthy, herbal, quite bitter, malty, creamy, preserved fruits. A little alcoholic but also different.", "Bottle from drinkshop.sk\r\nHmmm, okay, it's good, bit spicy, I admit nice malty bits and some caramel, but still I feel Germans do it bit better. Good drinking anyway.", "Elle est rousse avec peu de bulle. On sent la céréale, un soupçon l'alcool aussi. Correcte.", "From backlog. 0,7 litre Bottle from Total Wine Oceanside. Copper/ orange with little head. Malty and Hoppy. OK", "La que menos me gusta de las Rogue que he probado. Muy correcta, maltosa con final amargo. Equilibrada. Tranquila y plácida, mortecina. Aparte de los ricos toques a malta nobme aporta mucho.", "(bel ambre-orange clair, nez ∞-pomme-raisin-fraise, assez grasse, fructose, malt, gourmande, > fruits, miel s’intensifie)", "An american, copper, foggy, Heller Bock with very low head. Aroma is caramel, raisin, bisquit, malt, light smoke? Light liqourice? Taste is bitter sweet. Pearly.\n\n---Rated via Beer Buddy for iPhone", "Aroma etwas muffig, fruchtig malzig. Geschmack dann positiv überraschend. Leicht fruchtig, kräftig, gut umspielter Alkohol und eine sanft zunehmende Bitterkeit die aber gut die Waage hält zu einer anhaltenden Malznote.", "Tap at Glens bar Jerusalem. Jeezzzzz this stank of the nasty chemical water they give you to wash your mouth with at the dentist. So so medicinal and unpleasant. Probably the fault of the storage but anyway...can only rate what I get", "Il y a des bières que l'on devine très bonnes rien qu'à l'odeur, et celle-ci en fait partie. Une rousse très claire avec des arômes de caramel brûlé et des saveurs très maltées. Une bière excellente, une réelle bonne découverte issue d'un pack Saveur Bière.", "Hazy amber with a small white head. Aroma is grain, raisin and honey. Taste is caramel, honey and malt", "Аромат солодовый, слегка карамельный и немного горький. Цвет темно янтарный. Пена быстро опадает, большие пузыря. Вкус горький, очень солодовый, чувствуется легкая карамельная, сладкая нотка. Послевкусие не сильное, солодовое с хмелевой горчинкой.", "Weak malty aroma. Clear amber, small lasting head. Light sweetness, Medium bitterness. Medium body, slicky and smooth.", "33cl can at FOB, Rimini, Italy. Pours light amber with limited white foam, very fine. Aroma is caramel and malt, candy fruit. Body is average, with delicate carbonation. Taste is delicate sweet, with good bitterness. Finish is relatively long and somehow bitter.", "Amber coloured beer with an huge creamy head. Aroma is earth and malt. Flavor is yeast with some spicy malt. Medium to heavy palate.", "Poors a beautiful red ocre, decent white head, good lacing. Aroma, sweetish, lots of tea? Taste sweet, caramel malts, fruity hops, sweet fruits. No alcohol or co2 disturbance. Decent balance between sweet fruity malts and dito hops, maybe a bit too much \"lemonade\", puzzling aroma though... Decent MF. Very interesting brew.", "bottle. sweet Amber deep caramel malt with mild sour tang well balanced soft finish. lts quite tasty and moreish. nice beer.", "Oats with honey a sharp strong tang followed by deep bitter hops and breadish yeast. Wonderfully complex for the style and very moreish", "Birra ambrata torbida, profumo di caramello e uva, sapore caramellato e di castagne. Schiuma assente.\nretrogusto in stile Orval", "Tasted 2018-01-06. Pours clear amber with no head. Aroma of honey and bread. Somewhat cloying. Less sweet to the taste than expected judging by the aroma, but still quite sweet. Moderately bitter finish.", "Duft kiks malt svag korn kedelig smag sød honing lime svag karamel eftersmag", "Dead Guy is a German-style Maibock made with Rogue’s proprietary \"PacMan\" ale yeast. It is deep honey in color with a malty aroma, rich hearty flavor and a well balanced finish. Dead Guy is created from Northwest Harrington, Klages, Maier Munich and Carastan malts, along with Perle and Saaz Hops. In the early 1990s Dead Guy Ale was created as a private tap sticker to celebrate the Mayan Day of the Dead (November 1st, All Souls Day) for Casa U Betcha in Portland, Oregon. The Dead Guy design proved popular and was incorporated into a bottled product a few years later with MaierBock as the elixir.\n\n---Rated via Beer Buddy for iPhone", "Sweet, almost like honey, with rich malt and some mildewy-spicey notes that keeps it from being a sugary pleaser. Not much bitterness to add further in the counter-balance.", "12 oz. can. Pours hazy gold with a white head. Malt, caramel, dark bread, grassy notes for the aroma and flavors. Finish trends towards maltiness and mild bitterness. Not bad but not as good as I remember.", "Aroma: malty and apple juice; Appearance: hazy brown pour with thin white head; Taste: follows nose but not too sweet; Palate: medium body with long malty finish; Overall: not as good as I once thought, but still decent.", "Bought this in a bottle in Philadelphia at Stefan’s for Christmas Eve. Pours out honey orange and clear. Almost no head. Malty nose and flavor. German style ale with a slightly sweet flavor. \n\nF Avey---Rated via Beer Buddy for iPhone", "Pours a light brown colour, fairly large fluffy head. Aroma has soft dough, light malty notes, a very soft hoppy character. Taste is middle of the road malty, light ale. Nothing too bold here. Easy drinking, light malty brew with a soft to medium mouthfeel and a pleasant bready aftertaste.", "Can, 20dkk at Fakta, shared with Lena. Amber with thick white head. Aroma: salt, malts, leaves, earthy. Taste: Spicy, light alcohol, earthy, yeast. Thick texture.", "Can 50  cl. Pours honey golden, off white foam, medium retention.  Nose is malty, bread and honey faint flowery. Taste is strong malty with sweet toffee notes and honey. Finnish is medium bitter. Nice ale", "Tap@O'Connel's, Tampere, Finland. Slightly bitter nuances with honey, sweet malts, caramel, a hint of malts. Medium taste spectrum. Unbalanced nature is counterbalanced with medium/strong, floury body and medium/light carbonation. Overall, distinctive and bold, very good in its style. A bit too sweet and dull. 7 5 7 4 17", "Das Rogue Dead Guy Ale aus Newport Oregon, USA. Das neue Etikett ist sehr gut und düster, Halloween Bier. Dunkelorange im Glas, trüb mit schwacher Schaumkrone. Karamellig süsser Antrunk, röstmalziger Körper, der ganz gute Fruchtnoten beinhalted (Reife Pflaume) und Honig. Cremiger Trunk mit guter Bittere zum Abschluss. Das Bier ist schön harmonisch abgestimmt und für den Winter passend, mir persönlich aber zu süss.", "Dark amber, closeup small head, light hazy.\nAroma is light karamel, and the taste is deep, with Dark overmature fruit. Den minder lidt om en belgisk duppel. Den balancerer flot en dyb maltet smag, med en let hoppy frisk følelse. Medium krop, slick feel, lively, med en karameliseret eftersmag.\n\nGod overraskelse, og selvom Etiketten antyder et skelet, er den en mangfoldig øl.\n\nOpdateret 28/10-19 \nDen er ligeså god to år senere på flaske", "Amber, almost clear, no head. Sweet malty aroma: dark fruit, jam, candy. Watery, easy going, tastes water melon, a bit harsh on alcohol. Not bad.", "Fra dåse.\nIndbydende ravgylden i glasset.\nNæsen giver malt, humle og karamel.\nSmagen er afbalanceret, ligetil og ligger mellem det søde og det bitre. Vellykket øl!", "Amber with a small off-white head. Aroma is malt, caramel and some toastede notes. taste is sweet with some hoppy notes an bitterness.", "Hazy, amber, stable white head.\r\n\r\nAroma: caramel, sunflower seeds, toffee.\r\nSweet oily body.\r\nPlain flavour: caramel, toffee, malt.\r\n\r\nGood.", "650ml bottle. Pours a deep gold with fluffy white head. Huge Malty nose with rich hops in behind. Light body with a sweet malt forward which continues to develop into slight hops but finishes with sweetness again. Would love to try fresh.", "Sweet caramel rich malt aroma. The body is a hazy honey color with a slim head. Mild sweet caramel malt. Bold yet smooth. A new favorite.", "Let honningsmag og noget maltet smag. Karamel er der også en del af. Lidt bitterhed", "Can. Clear amber, offwhite head. Malt and bisquit aroma, light spicy hops. Caramely bisquit flavour, honey too. Bittersweet with mild spicy hops. Pretty simple but also pretty flavourful.", "12 oz bottle purchased in Birmingham. Thanks Birmingham, I had a blast!\n\nPours a rust color. Two fingers or so cream colored head. Excellent retention, excellent lacing. Had an insane amount of sediment at bottom of bottle. It's dark enough you can't really see it in the beer.\n\nAroma is sweet, honey like. Also some sort of citrus, perhaps lime, or maybe clementine. Kinda smells like raisin bread.\n\nTaste is sweet. Caramel, honey. Sweet bread. Smooth.\n\nMouthfeel is medium bodied. Syrupy. Very smooth.\n\nOverall, this is really good. I really like this. I absolutely recommend it, I would absolutely buy it again. Delicious!", "malty creamy and shallow. Its a great flavor that is light on the palate. I like it.", "Caram�lis�e, fin de bouche dans le pain grill�, presque brioch�. Longueur en bouche int�ressante. Attention aux bi�res bues pr�c�demment", "hay, floral, citrus, leaves, bubblegum, berries, bread, amber, orange, cloudy, sparkling, frothy, white foam, light sweetness, medium bitterness, full body, creamy, lively, bitter, abrupt finish,", "Piwo raczej klarowne nalewa sie z dosc obfita drobnopechrzykowa piana. Dominuja nuty slodowo-melanoidowe z domieszka karmelu i kwiatowosci. Dosc wytrawne z wysyceniem i goryczka na srednioniskim poziomie. Bardzo mi smakowal.", "Great tasting and would recommend to others to try. I give this beer a two thumbsup\n\n---Rated via Beer Buddy for iPhone", "Very decent ale. Dark and bitter. Nice mustiness, good balance between caramelly sweetness and dark citrus spice.", "Sample at King Arthur in Ciampino-Italy. Copper dark pour with medium low foam. Aroma of ashes, very malty. Mouth is still malty and rough bitter. Not interesting to me.", "On tap at Olut Sabadell. Bright copper coloured with white head. Malt aromas, lightly caramel and nuts. Spicy, not sweet and almost no bitterness. Highly carbonated.", "Bread and alcohol with som apricot and a little mango. Nice, a little sweet for session tastes though.\n\n---Rated via Beer Buddy for iPhone", "Caramel, scotch, alcohol spiciness, toasted bread. Sweet and malty, the alcohol burn is slightly felt on the tongue. Some grassy hops in the finish, but taste relies mostly on malty flavors. Good, nonetheless.", "One of my favorites. Lots of character but very hard to put your finger on what it is. Very strong malt backbone with a long lingering Hoppy finish. A perfectly balanced brew. Also prominent notes of caramel and toffee and biscuit. \n\n---Rated via Beer Buddy for iPhone", "DOC: 6/28/17\n\n2015 BJCP Category: 4C Helles Bock\n\n\r\nAROMA: Malt-forward nose with slight confectionery sweetness (especially caramel). Hints of toast. Faint hop presence in the background with herbal/peppery character. Clean fermentation. 10/12\n\nAPPEARANCE: Murky shade of orange/copper. A bit too dark (9-15 SRM) and off-color for the style. Small, off-white, foam mostly dissipates. 1/3\n\nFLAVOR: Palette is sweet but not cloying. Caramel flavor is quite prominent with minor toast and Maillard characteristics. Very low hop presence in terms of both taste (herbal, peppery) and bitterness (slightly dry). Balance is malty, but not cloying. Flavors are a bit off for the style, but in the ballpark. Clean fermentation. 12/20\n\nMOUTHFEEL: Medium body; medium-low carbonation. Smooth and comfortable with a slightly malty but ultimately clean aftertaste. Feels much lighter than 6.8% ABV. 3/5\n\nOVERALL IMPRESSION: It's a Maibock done as an American Ale so it's not exactly to spec, but it's closer than not. 6/10\n\nTOTAL SCORE: 32/50", "Nowhere near spectacular in any area. Aroma, palate, taste…all below par in imho. \n\nSecond bottle was much more enjoyable. \n\n---Rated via Beer Buddy for iPhone", "Nice malty body, some alcohol, honey, excellent sweetness, some tartness. Citrusy light bitterness is noticeble. Some caramel in aroma.", "Very tasty. My last bought beer of my holiday and very palatable. Silly but love the can presentation too.\n\n---Rated via Beer Buddy for iPhone", "I thought this one was an IPA. Smooth beer, strong aroma. I like the honey-backed IPA style. Worth trying.", "Dark golden color, long lasting head. Sweet aroma of malt, caramel and hay. Taste of honey, caramel malt, pudding, alcohol and a wee bit hops.", "Very drinkable ale. Malty taste is what I pick up. No aftertaste. Great marketing with the can \n\n---Rated via Beer Buddy for iPhone", "33cl can from boxbeers.dk. Pours hazy, dark golden color with a big head. Aroma has malts and hints of yeast and some spices. Flavor is more malty, quite sweet. really nice!.", "Just a solid ass ale. It's rich yet clean, flavorful and heavy bodied. It's a delicious beer.\n\n---Rated via Beer Buddy for iPhone", "Robe ambrée, fine mousse. Nez élégant sur des notes épicées, pointe de fourrure, de cuir, de malt torréfié, de café au lait, de noisette. Bouche à l’attaque épicée, de la rondeur, une bulle ronde et onctueuse, longue finale épicée. Une très belle bière épicée.", "Bottle. Hazy copper color with a medium thin frothy off-white head. Aroma of bread, honey, caramel and notes of lemon. Sweet and medium bitter taste. Medium body.\n\n-- rated with beerbasher/winphone", "Draft.  Malty and sweet.  Light finish.  Subtle fruit flavor as well.  Not bitter.  Overall a good beer.", "Tap. Pours clear hazel, small off white head, decent lacing. Aroma is nutty, malty, dark bread. Flavor is medium sweet, very light bitter. Light plus body.", "Review based on the BJCP2015 guidelines (style 4C). Bottle 35.5 cl - batch Unknown (BBF 08.2017). AROMA: caramelized and stale malt aroma. slight maillard compounds. APPEARANCE: ambar color and slightly hazy. médium ivory head with médium retention. TASTE: medium stale malt flavor and caramelized. médium bitterness with a semi-dry and bitter finish. PALATE: medium-low body with medium carbonation. OVERALL: already oxidized. demands re-tasting.", "Bière ambrée sans mousse légèrement trouble. Un nez de prune, voir de mirabelles ! Elle est légèrement pétillante, le goût amene une touche de miel, on sent un certain degré d’alcool. Une bonne bière mais qui reste un peu différente de celles que je bois", "Amber colour, small head that never fades completely, creamy lace. \r\nAroma of caramel, nuts, spices, some hops that balance the malty flavour, chocolate.\r\nMedium body, creamy texture, carbonations is OK.\r\nTaste of caramel, dark fruits, nuts. Really good and easy drinking beer.", "Bottle, pours amber brown, thin pale head that’s quick to dissipate. Aromas of caramel, spice. Taste is medium sweet and light-medium bitter. Medium bodied, medium length finish.", "In der Nase deutliche Malzigkeit. Im Trunk definitiv bockig, Cookie, süffig, Karamell, Honig, leicht alkoholisch. Schönes Ding.", "Copenhagen 2/7 2017. 35,5 cl bottle from Brønshøj Vinhandel, Brønshøj Torv. Skeleton with mug of beer and a funny hat on the label. Would fit right in at Day of the Dead or at an Grateful Dead gig. \n\nPours hazy amber with small white head. Moderate Lacing. Settles as thin patch of foam floating around. \n\nAroma has substantiel sweetness with honey, caramel and a nutty quality. Something sharp and sour lurking in the background. \n\nMedium carbonation and slightly thick texture. \n\nFlavor is strongly sweet followed by medium bitterness. Aftertaste of honey and nuts with a noticeable bitter undercurrent. \n\nMalty and nutty affair not without a bitter charm. But a nice affair when it’s comes to that.", "On pourrait croire sans problème que cette Dead Guy Ale est d’origine allemande. Les codes de la Heller bock sont respectés. La bière est en elle même homogène, mais par contre tout cela manque de progression dans la ligne aromatique et après deux ou trois gorgées, on s’en lasse quelque peu. Sa robe, ambrée claire, parée d’un léger voile (EBC aux environs de 40) est plutôt sympathique. Petit point négatif cependant sur la mousse qui n’arrive pas à napper entièrement la surface. Joli nez sur une bonne complexité de caramel, résineux, litchi, prune un peu trop mûre voire sûre, miel, épices et par derrière, l’expression du houblon. Dommage que toute cette complexité ne se retrouve pas à la dégustation. L’attaque est plutôt ronde sur le caramel, les fruits murs, le caramel, le miel et les épices. La deuxième bouche monte sur les épices mais sur les mêmes arômes sous jacents. L’arrière bouche présente d’ailleurs une amertume encore un peu plus marquée tout en restant modérée. La troisième bouche, plus fraîche présente un alcool plus marquée et une amertume montant graduellement avant un final sur une amertume plus saillante sans être intense (IBU de 40) sur des notes herbacées et résineuses. L’alcool à 6,4 % Abv, progressif est très bien intégré et le sucre par contre, est légèrement trop dosé. On apprécie, mais on ne s’extasie pas non plus.", "F: big, tan, good retention.\r\nC: orange amber, hazy.\r\nA: malty, caramel, toast, light toffee, fruity.\r\nT: malty, toast, toffee, bit of alcohol, caramel, bread, light spicy, decently hoppy, mellow fruity, medium to full body, medium carbonation, very good balanced, enjoyed, 355ml bottle from Whole Foods Market – Piccadilly in London.", "12oz bottle. Hazy reddish orange, thin off white head. Malty fruity nose. Sweet malt flavors, dark fruit, cereal. Light hops on finish, but overall this is a malt show.", "Приятный бок, красивый цвет, хорошая горчинка, приятно испить в компании с бургером хорошим!)", "På flaske til Øl-mødet. - Klar ravfarvet med en Off-white skumkrone - Smag. Karamel, citrus og nogle krydrede noter. - Stærk maltet og en mediun krop.\r\nSamlet set en rigtig god bock.", "Sweet honey and caramel notes, slightly spiced. Such a beautiful dark amber colour, clear with no deposits, the head is fine too at first but sadly it’s very volatile. Tastes sweet, light body, medium-high carbonation, subtle finish. While not exactly shocking, everything about it is above average", "One of my favorite beers. Smells like roasted honey and caramel. Has a great bright warm hue for an ale. Taste like an expensive cologne in a good way. Finishes perfectly. I buy sixers of this beer too regularly.", "Keg at the Rake, Borough. Amber pour with a white head. Nose of toffee, caramel, apricot, candied peel. Taste of apricot jam, vanilla, caramel, toffee, tangerine. Quite nice.", "Arômes de houblon, grain et quelques notes d’orange. Robe orange claire et mousse blanche. En bouche, beaucoup de corps, amertume moyenne, caramel.", "Very smooth for Michelle dark but not to dark rates high for smooth balance\n\n\n---Rated via Beer Buddy for iPhone", "Bière d’une belle couleur de rouille qui fournit une mousse blanche persistante. Goût puissant qui perdure. Agréable.", "Draft Rogue dead guy ale. Hazy dark orange with an off white head. Aroma of roasted grains, malt, caramel. Flavour is the same with a long sweet aftertaste. Good!", "Nose: caramel, malts. Taate: sweetness going into a soft hoppy bitter. Very inoffensive beer: easily quaffable.", "Excellent beer. Smooth and easy drinking, but still decent ABV. \n\n---Rated via Beer Buddy for iPhone", "Na zdrowie, Salud, Kampai, Prost, Skaal, Zivjeli, Fenékig, На здоровь& Na zdravi", "Slightly hazy amber. Thin head, high retention. Aroma intensity 3.5/5. Pear, malt and cut grass aroma, with notes of vanilla. Medium bitter on anise-like sweet. Medium body", "Bottle from Liquor Barn into a pint glass. Aroma of caramel malts and something astringent.", "Cerveza de color ámbar anaranjado turbia con una pequeña cabeza blanquecina.\r\nAroma a maltas caramelo tostado dulce con un leve toque cítrico.\r\nSabor a maltas caramelo, especias, afrutado y maltas tostada con un toque de lúpulo cítricos y un poco dulce. Una buena interpretación del estilo y una cerveza agradable.", "Aroma: caramel, baked potato, malty.\r\nAppearance: amber color and white head.\r\nTaste: caramel, celler, roasted dark malts, malty, semi-sweet.\r\nPalate: medium body and medium carbonation.\r\nOverall: an average maibock, only sweet.", "Bue en pression chez John Circus. Ambrée, col de mousse moyen bonne tenue, carbo moyenne. Aôme malts grillés. Assez bien équilibrée, final légère amertume mais surtout malt grillés. A part le malt grillés, pas grand chose à dire.", "12 oz bottle shared by ebone1988. The pour is a darker golden orange with a thin ring of white head and no lace as it falls down. The aroma is really malty and sweet. There is a strong caramel going on, but it’s very bland and plain. The flavor is much of the same. It’s god a light caramel sweetness and a lingering bitterness from the hops. There is not a lot going on, and it’s kind of a bummer. The mouth feel is a little light with a brighter carbonation and a lingeringly sweet caramel and bitter hop on the back end. I don’t know how I feel about it.", "Can shared with koleminer20. For the book. Aroma is fruity, caramel, slight metallic, toffee, it smells pretty good. Appearance is amber, off white head, mostly hazy. Taste is slightly caramel, slightly malty bitter, toasted, slightly fruity, really light flavors all around. Mouthfeel is medium body, light carbonation, toasted caramel aftertaste. Overall, this one is pretty boring flavor-wise.", "20.09.2019 Kolor bursztynowy klarowny. Piana biała, średnio wysoka i podobnie też średnio trwała.\nAromat: słodowość, nuty chlebowe, świeże, jeszcze zielone orzechy.\nSmak: tutaj jest jeszcze więcej orzechów, jest skórka orzechowa, ta młoda, słodowość i chlebowe, razowe akcenty. Goryczka kojarzy się tak z orzechami jak i przyprawami korzennymi. Jest wyraźna, myślę, że akceptowalna dla każdego.\nWysycenie średnie. Pełnia średnia do wysokiej. Płyn jest dość gładki. Aromat 7, Wygląd 3, Smak 8, Odczucia 4, Razem 16, 3,8/5 Puszka.\n\n08.04.2017 Kolor ciemno bursztynowy, delikatnie miedziany. Barwa jest prawie klarowna. Piana bia?a, puszysta, jest do?? wysoka i trwa?a.\nAromat bardzo mocno chlebowy, s?odki, s?odowy. S? kasztany i orzechy z chrupi?c? skórk? z wijskiego chleba.\nS?odowo??, jest odrobina ?wie?ego chleba, ponownie troch? kasztanów i orzechów. Jest przypalony karmel i \"przypalona\" goryczka. W tle delikatne akcenty miodowe.\nWysycenie ?rednie. PIwo jest dosy? ci??ki, pe?ne ale g?adkie. Butelka.", "Bottle from Bitter Virtue, Southampton. Slightly hazy amber pour with small white head. Aromas of pine and roasted malts. Taste is quite sweet with caramel flavours. Decent bitter finish.", "On tap at local pub: Rich amber color with semi fizzy head. Pleasant aroma of roasted malt, pine, and tropical fruits. Nice hoppy taste with hints of citrus flavors.", "Nice amber/orange color; Medium slightly creamy body; Aroma of caramel malt, & hops; Flavor of sweet malt, hops, caramel, and light fruit; Finish is slightly bitter; Pretty decent overall.", "Bottle. Hazy honey colour, moderate off-white head. Medium-lacing. Pleasant melon smell. Nectar, honey, Sherry. Medium to full body. Relatively dry flavour. Nice maltiness. Melon. Nutty, Sherry. Pleasant esters. Solid grassy bitterness finishes the whole thing. The ending lingers. Very good.", "On the the occasion I am having a finicky palate this is my go to beer. Sure I’ll switch things up but this is always a good beer to get things started. Maybe it’s just the kid in me but sometimes I like the sweet, carmel malty taste vs the bitter taste of pine sap.", "From a beer hawk mystery case. Pours golden , little aroma, sweet, no hops I could detect. Little non-descript. Not one I will be looking out for again. \n\n---Rated via Beer Buddy for iPhone", "Hazy amber colour on pouring. Very malty, has a caramel sweetness. The hops give a slight citrus note but it’s in the background.", "Birra dal colore ambrato. All?olfatto sentori di caramello, malto e zeste. Al palato mediamente corposa con note di malto, frutta candita e ricola. Nel finale lievemente amara. Una birra mto beverina.", "Sweet malty, caramel. fairly low carbonation, medium body and soft mouthfeel. Children would like this.", "Bottle. Pours light hazy brownish amber with medium white head. Aroma is grain, green malt and deep bitter notes of hops. Taste is light sweet, medium bitter and light acidic. Body is watery to light oily with light fizzy carbonation. Finish is medium long and balanced sweet and bitter with notes that follow the nose.", "Aroma is malty like an Oktoberfest. Very light crimson color with an off white head. Tastes slightly sweet with a bite that is a mix between hops and orange rind. Good slick palate. Maibock is not my favorite style but this is one of the better representations I have had. \n\n---Rated via Beer Buddy for iPhone", "At BKL - The beer is rather sweetish, malty, full body, ripe mandarina, boozy finish. There are better Böcke in the world.", "Bottle at home. Pours amber in colour with a thin head and good lacing. Pleasant aroma: malty, nutty and some leafy hop. Slight sweetness leads to a strong bitterness. Creamy, smooth and nutty with fruit and peppery hop. A slight alcoholic glow, dry bitter finish.", "Bernsteinfarbend, wenig Schaum, schön süßlich in der Nase, dafür relativ leicht im antrunk, leichte malzsüsse im Abgang nicht schlecht", "Pours a slightly opaque red. Mild, fruity aroma. Fairly heavy carbonation. Taste has peachy undertones with hint of herbs and roasted malt. This doesn?t really taste that much like an ale, which is probably why I like it all right.", "Leichte Trübung. Kupferfarbe, weisser Schaum, bildet sich nur sehr wenig. Gutes Aroma, Orangen und Gräser. Bocktypisch deutliche Malznoten: Honig und Karamell. Milder Antrunk, sehr süffiger Körper. Gute Mitten, süsse Noten, feine Malznoten. Abgang kräftig, typisch Bock, leichte Säure am Gaumen. Geil!", "65 cl Bottle fr.o.m. sB. Pours amber with small white head. Malty, grainy, spicy aroma, hints of citrus and soap. Malty sweet taste with a medium bitterness. OatBiscuits and caramel coming in. A bit too much of grassy notes", "Leicht trübes Bernstein mit durchschnittlicher Schaumkrone. Malzig, süßlich, Karamell, leicht fruchtig, Orangen, Kräuter, sehr süffig.", "From tap at Fermentoren Aarhus. Pours a clear orangy amber with a small off white head. Aroma has lots of heavy, sticky malts, caramel, banana, sweet overripe fruits. Taste is very very sweet, heavy malty and with a tiny bitterness that not even is close to balance this beer. Very intense for the 6,5%, but other than that i haven’t got a whole lot of good things to say..", "Non ho capito bene lo stile della birra ma credo sia tipo bock. Il malto però è poco evidente, in particolare il caramello non l?ho percepito per nulla. Il luppolo non si sente per nulla come aroma ma abbastanza come amaro, aiutando la bevuta. In generale non mi è piaciuta particolarmente.", "Bottle @ Køge øldag w senior & friends/the chef. Appearance: clear amber with good off-white soapy head and lacing. aroma/taste: grain, light caramel, biscuit, citrus and some spicy notes. palette: strong malty and medium hoppy aroma, average carbonation, medium body, medium sweetness, somewhat dominated by a medium to notable bitterness, average tolong duration and a watery texture. Overall: very nice hoppy bock.", "Honey color, pours with a small-medium head, medium body, mild sweetness and noticeably hoppy. Good beer but not excellent.", "Nice bottle and you can find a lot of information on the website.\r\nCloudy amber beer with short white head, full body, malty, light sweet, hopy, oily, \r\n(I have 0.65l bottle with best-before 30.04.2017)", "Clead deep peach golden color with small tan foam. Aromas of tropical fruit type hops, youghurt and peach and floral notes. Palate, medium to full body with biting bitter texture leaving short dry finish. Taste, lighty bitter sweet of tropical fruits, more like not amazing IPA. Overall, okay beer, reminds more of IPA, quite hoppy still light though.", "Bottle @ home. Pours amber with a white head. Aroma is malty with grains, flowers, pine needle, caramel. Medium body. Taste of caramel, grains, flowers, pine, bread, fruits. Balanced bitterness.", "Bottle at home. Hazy amber with white head. Big sweet caramel malty, light resiny hops. Cara malt and some fruitiness. Light sweet and bitter. Over medium malty body. Soft carbonation and soft smooth mouthfeel.", "Overall bitter and blunt.no specific aroma except malt and caramel.Tastes caramel, malt, bitterness.", "650ml bottle from Systembolaget. Slightly hazy amber, small creamy white head, poor lacing. Malty bread aroma, spicy, crisp bread and caramel. Medium carbonated, full-bodied, sweet and silky mouthfeel. Malty taste, crisp bread, rye and grains. Woody finish mid-dry with mild sweetness.", "A rich golden light orange color with a thick creamy head of white foam. The aroma and flavor is balanced impeccably between sweet cereal grain, light roasted malt, fresh florals, and lightly sweet blend of stone fruits and hints of berries.", "Amber coulered beer with white head. Aroma grain, caramel. Taste is Bread, grain/malt with floral and fruit notes.", "Poured from 12 oz bottle amber in color small head light debris little funky smell and taste at first but gets alot better as you drink dried fruit and sweet malt at the fore front", "Had a pint at Pub Italia. Arrived with very minimal head, and leaves a thin ring around inside glass. Has a dark amber colour appearance. Weak lacing. Aromas are mostly of roasted malts and a bit of yeast. Flavours are also of the roasted malt variety, with spices and hops readily apparent. Hints of caramel. Has a good balance of hops and malts actually. Mildly bitter aftertaste but not offensive. Average carbonation. Warming mouthfeel. Pretty good and lucky to try on tap. Held its flavour with the spicy italian sausage pasta I had with it.", "@ fillepolo 20161210. Bottle (650 ml) from Systembolaget. Malty and caramely, dried fruits, sweet, medium body with an oily texture. The finish is bitter and malty.", "Beer rating @ fillepolo 10/12-16. Bottle from Systembolaget. Malty and fruity/overripe fruity and banana. Body is medium, the finish malty and fruity/overripe fruity.", "Bottle from systembolaget. Pours a amber colour beer with a medium head. Dried fruits with malt and caramel. Dry finish", "12oz bottle from Beer52.com. A hazy golden amber pour with a thin cream head; grainy aroma; smooth with a sweet caramel taste to start with some rye grain, then developing a sour bitterness give a clean crisp finish.", "330ml bottle. Bb 2017/2. Thanks, Martin! Slightly hazy golden yellow colour. Thin line of white froth around the glass. Grainy, malty, caramelly, sweet aroma. Grainy, caramelly beginning. Caramel in the middle. Grainy, caramelly, slightly sweet finish. Slightly bitter, grainy aftertaste. Rather medium bodied, slightly oily, rather low carbonated brew. Not really my cup of tea, but still descent brew.", "Bomber from web SB cons 2016-12-09 Göteborg, must have had this before!\r\nAR: wetabix and caramel,\r\nAP: orange glowing, high frothy cream orange foam - nice\r\nF: Wetabix, pop corn, wee hollow, bread, herbalish, dry, dried tropical fruity", "Obtained a bomber of Dead Guy Ale from a local Albertsons. Poured a orangey amber with a thin veil of light tan foam. Introducies itself with a scent of tropical fruit and pine. Malty opening taste with a touch of butterscotch perhaps and some bread too. A small bitterness, does not linger. All fine by me.", "Pours clear amber with a medium frothy white head. Aromas of caramel, citrus, orange rinds, rye bread. Taste is malty and floral with some fruity notes. Mouthfeel is light bodied with medium carbonation. Funny, I remember drinking this in my very early craft beer days and at the time thought it was quite extreme. Funny how my palate has changed. Still a very good beer mind you, just not challenging in any way anymore.", "Sweet aroma with some fruity hops and light malty presence. Taste is smooth and fruity with summerflowers and light peachy hops. Very easydrinking and pleasant.", "355ml bottle. Clear amber colour with a small head. Aroma: malty, caramel, light fruity. Taste: sweetish malt, dried fruit, caramel. Medium body and carbonation.", "Caramel, grass, toffee, light coffee, dried fruit, slightly spicy.\r\nAmber colour, small beige head, lacing.\r\nSalty, noticably sweet, lightly bitter, caramel, grass and lightly spicy and light coffee.\r\nMedium body, average carbonation, slick feel, malty finish.\r\nSolid.", "650ml bottle. Clear shiny brown with one finger slightly off white head. Aroma is caramel, candi sugar, rich malts, light alcohol, slight ripe banana and a light fruitiness going towards citrus. Taste is light malty with some roasted tones, light caramel, candi sugar, grass, light citrus peel and some slight ripe fruitiness. Medium mouthfeel, light carbonation and warming malty aftertaste.", "35,5 cl. best before 08/01/2017, aperta il 27 novembre 2016.\r\nAmbrata con riflessi oro antico, schiuma ocra di buona persistenza.\r\nAroma biscottato, caramello, chinotto, note di prugna.\r\nAttacca dolce, caramellata, con una punta di prugna e chinotto, butterscotch, finale amaricante erbaceo ed agrumato con un tostato finale che arricchisce la bevuta.\r\nRetrolfatto con chinotto e caramello.\r\nCorpo medio-pieno, non molto carbonata.", "355ml bottle from Jumbo Costanera Center. Santiago, Nov. 2016. Pours a beautiful hazy orange with a big white rocky head that diminishes slowly and leaves a gorgeous 3mm film. Aroma is malty, high on melanoidins. Notes of caramel, wood, some burnt sugars, dried peach, toffee, biscuit, raisin and nuts. Very elegant and well layered. Taste is sweet following the same tonality in the flavors. Nice hints of peach, apricot marmalade, well-balanced with grainy and biscuity malts. The caramel is clear but not overblowing. Very, very good. Medium body and carbonation. A really rich, fulfilling \"Ale\" Bock.", "One of my great favourites. Malty and characterful while being quite unique at the same time. Great aroma, wonderful complex flavour. \n\n---Rated via Beer Buddy for iPhone", "On tap at Sportsman, Bkk, Thailand. Dark clear amber. Quite sweet and lightly bitter. Hoppy, Malty, caramel and floral. Medium bodied.", "Lovely deep golden/amber color, small white head. Aromas of caramel, butter, apricot, marmelade and sugar. Sweet taste of malt, sugar, caramel, marmelade and slight hop during the finish. A bit too sweet.", "Poured from a 22 oz bottle into a shaker. Beautiful honey color, slightly hazy, small off-white head. Nose of sweet malts and caramel. Medium body, average carbonation. Lightly bitter and a malty finish.", "Bottle from beer 52. \r\nFruity, malty and hoppy on the nose. Great flavour, very fruity with prominent hop presence. Not had that many Bock’s but this seems a bit too sweet and hoppy for the style. One things for sure though, this is a very tasty beer.", "Sourdough bread aromas. Pours a cloudy golden orange with a rocky off-white head. Round banana flavors with notes of leather and a little licorice. Broad mouthfeel. Extremely nice beer.", "Nada más verterla en el vaso su color ya enamora. Ámbar limpio y muy anaranjado y una corona de espuma cremosa y persistente.\r\n\r\nEn boca entra muy dulce, recuerda a miel o caramelo que quizás hace que no refresque mucho pero que sea facilísima de beber. Además su final es amargo pero discreto.", "340ml bottle. Pours amber with a large off-white head. Aroma is caramel, biscuit, toasted malt. Taste is sweet, caramel, resiny hops, small alcohol kick.", "Pours a slightly opaque red. Mild, fruity aroma. Fairly heavy carbonation. Taste has peachy undertones with hint of herbs and roasted malt. This doesn?t really taste that much like an ale, which is probably why I like it all right.", "Sample from bottle, poured a Amber colour with slight off heat. Nose of caramel, cookies, big malt notes, dough, light floral, sweet dry malt aftertaste", "Sample at a Systembolaget tasting. Smell of oatmeal cookies. Sweet and malty smell with some oats, nuts and caramel.", "Opalescent golden with a fluffy off white head. Aromas of hay, some light toasted malts with a light floral and herbal touch. Fine carbonation, soft texture with a medium body. Well balanced malt sweetness with a floral hop bitterness profile. Moderately lasting finish. Nice.", "From bottle. Hazy copper with off-white lacing. Caramel and malty aroma. Sweet with hoppy notes. Good beer.", "The aroma is malty, roasty and a little caramel. Pours a clear copper with white head, mostly diminishing and excellent lacing. The taste is bitter and a touch sour. The body is medium, the texture creamy, the carbonation lively and the finish long. Very good!", "From decervecitas. In Teku glass. Watching Los Soprano 4x08. Sweet caramel, molasses, with good herbal hop bite to compensate it without removing protagonism from the malty profile. Very drinkable, invites to long sips, specially as it warms up", "About as clutch as a beer can get, Rogue’s Dead Guy might be the best workhorse in craft beer this side of Sierra Nevada Pale Ale. Big, doughy, caramel malt front with a brisk, euro-hopped finish, piney and herbal and bracing, with a gentle fade. Easy to drink, even easier to order a second.", "tap at street taco in ulsan amber color with creamy white head, mostly lasting with fair lacing. Aroma is heavy malty. Midium bodied, sticky texture, lively carbonation, Long duration, light sweetness,", "Bottle 0,33l. Pours amber colour. Aroma of bread, caramel, toffee, some sweet wood. Taste balanced towards hoppy, salt, artichoke and caramel. \n\n---Rated via Beer Buddy for iPhone", "I’m sure glad I decided to try this one...excellent!The aroma is pleasant and the taste is very impressive...a little sweet and as I always praise...No Bitter!", "On tap at TCB. Good enough for an autumn afternoon. Nice malt, enough sharpness to keep it interesting. I could happily do a couple pints, but any more would probably prove too much.", "Draft at Bru Craft. Clear orange copper pour. Lots of soapy beige foam and sloppy lace. Mop water aroma. Medium caramel malts. Wet wood. Pumpernickel. Dried apricots. Cinnamon. Nutmeg. Clove. Toasted bagels. Not awful but not a go-to.", "Dried fruit and malt aroma, hazy copper red color, head dissipates quickly. Medium body with chewy texture and warm alcohol finish. Toffee, dried fruit, licorice, and floral flavor. Excellent fall beer for cold afternoon.\n\n---Rated via Beer Buddy for iPhone", "I’ve had this many times over the years, and what keeps me coming back is 1) how complex it is -- is it a malty bock with all of the sweet caramel flavor? a pale ale from the hop bitterness? a Belgian ale from the yeast? and 2) how incredibly well-made it is. This is a great, balanced, complex beer.", "I bought this bottle at amstein. I drank it yesterday at home. In my opinion, it is a really nice ale, we already could say an IPA. The body is clear, copper and troubled, thin foam, average carbonation. The taste is well balanced, I love this side of sweet malt and bitterness, a bit citrus, small side of apricot and nice final touch.", "While it smells like dirty dishwater, the taste is quite pleasing. It has the Belgian yeast overtones, with subtle caramelly flavor. I’ve become a very picky beer drinker, and this is delish!", "Bottle from Brdr. Schmidt Vinhandel, Viby. Pours golden amber with an off-white head. Aroma and taste is sweet malt, caramel, some fruits, honey, hops. Medium body. Soft carbonation. Light bitter finish.", "Pours a clear light orange color with a very thin white ring. Not much of an aroma. Very smooth but not much flavor. OK but not great.", "Copper pour. Loads of toasted and sweet malt in the aroma. Full, syrupy body. Flavor is mostly toasted cereal grains, sweet caramel malt, light spicy and mildly earthy hops, and some fruit lingering underneath. This has never been a go-to for me but it is a well brewed and enjoyable brew in the right circumstances.", "Great caramel color, bubbles are good. sweet smell, moderate taste strong sweet flavor.", "650ml bottle.\r\nSweet fruity malty biscuit aroma.\r\nHazy light amber color with good sudsy head.\r\nMild bitterness with smooth malty finish.\r\nNot bad.", "Rogue Dead Guy\r\n•\tAroma (9/10): \r\nMiel, resinas, madera y vainilla. Un muy rico aroma\r\n•\tApariencia 4/5:\r\no\tCabeza (color, consistencia y duración):\r\n\tCabeza abundante, color crema, sólida, deja una abundante y gruesa nata.\r\no\tCuerpo (textura, carbonización, partículas y color): \r\n\tMuy burbujeante. Color ámbar, un poco turbio.\r\n•\tSabor 9/10 (inicio, final y duración): \r\no\tInicio: Inicio salado y un tanto amargo.\r\no\tFinal: Principalmente ahumado. Presencia intermitente de dulzores en las muelas.\r\n•\tPaladar 4/5 (Cuerpo, textura, carbonización, final). \r\no\tCuerpo ligero, cremoso, con burbujas un poco picantes. Final medianamente amargo y de corta duración.\r\n Resumen 18/20: Un aroma complejo y una apariencia espectacular. Una cerveza que se gana el calificativo de “sabrosa”. Se me antoja para comer embutidos. La recomiendo.", "If this brew didn’t cost so much, I could pound a couple of sixers in an evening. This is an outstanding brew that stands alone. Is it the yeast? I don’t know. But whatever it is, it works. Rogue rocks.", "Una Heller bock de color anaranjado y baja carbonatación. Su aroma a frutos secos, miel y bizcocho. Su sabor es refrescante con toques de miel y un suave amargor.\n\n---Rated via Beer Buddy for iPhone", "12 oz. bottle. Pours an amber color with a brief off white head. Aroma is mainly malt with a touch of hops. Medium body, taste is sweet, not much of a hop presence. Finish is also sweet. Notice more hops after the swallow.", "Tight, but malty and yeasty nose; a bit of cheesy Quaver crisps, babyleaf salad, a little honey? A lightly sweet, wry/rye and slightly malty – and rich – middle. Like pine nuts and hazelnuts? Whilst neither the flavours nor the ingredients are showstoppers, there is a v nice balance about it – very rounded bitterness in finish, but right at the end a little bit of bourbon biscuit. V drinkable.", "Bottle at the Draft House, Tower Bridge, London. ABV 6.5%. Poured a golden colour with a medium white head. Aroma of malt, hops, grass and yeast. Light sweetness, medium+ bitterness. Medium bodied, slick texture, average carbonation. Finish has a good level of dry hoppy bitterness.", "This is a really smooth, really drinkable beer. I don’t pick up much on the nose from it, but it’s a nice shade if dark amber in color and it tastes like something between sweet and full bodied. It’s right there in the middle with something extra to separate it from an average beer.", "After all this time, I still don’t think I have ever tried this beer before now. Seems like it’s the most widely produced beer in the style, one in which my experience with is limited to random beers I hear of for the first time upon trying. This beer recipe seems to be older than I am, so it must be good. I get a lot of banana bread notes in the aroma and flavor. Sweet malt, but it finds a way to work. I probably couldn’t drink a lot of this. I think the sweetness would start to become too much. A 22 Oz split was just right. Enjoyable beer here. Unique too. Good stuff.", "Pours amber, crystal clear with white dense head that dissipates slowly. Aroma of bread, caramel, toffee, some sweet wood. Taste balanced towards hoppy, salt, artichoke(!!!), caramel. Aftertaste is similar with taste but a bit more hoppy. Low to medium carbonation, light to medium body. Nice but nothing special.", "Nice label, nice aroma, ok palate, reasonable aftertaste. An average of 3.5 seems to be overrated imo however.", "Little to no aroma, with excellent presentation, sweet taste and really thick palate, a great experience", "Bottle, 355mL. Home. A brown-orange opaque beer with a medium white foamy head ; ok retention. Candied fruits, caramel, roast, sugar, herbal note. Medium sweet, dry refreshing note. Medium body, average texture, light oily, soft carbonation, sweet finish. Overall, enjoyable beer :)", "Sweet aroma of malt, caramel and with hints of fruits and hops. Clear and light brown appearance with a small white head. Medium-high sweetness and light-medium bitterness. Average lively carbonation and medium-full body. Really great ale!", "Tasty beer with a carmely after taste but definitely a beer I would have again.", "Colore quasi ambra, limpida, schiuma compatta fine. Aroma di malto con note floreali. Al palato generale dolcezza del malto, con sentori floreali e fruttati in evidenza. Chiusura quasi dolce, il luppolo non si fa molto sentire. Carbonazione medio bassa. Una maibock molto americana.", "BOTTLE. Hazy bronze pour with medium off white head.. Floral to grassy hoppy nose with a hint of sweet malt.. Biscuit and caramel malt throughout, some earthy quality in the middle finishing with solid sweet hop kick. .Sourced Cellarbrations @ Capel", "330ml bottle at the Head of Steam, Durham. Orange pour, with a fine, pale yellow head. Vibrant aroma of apricots, faint haylage, and golden ale. Soft flavour of wholemeal bread, oats, with a rounded overall taste of hops.", "Cerveja com coloração âmbar e espuma com média duração. Agradável e com amargor que predomina.", "Cant believe i never rated this. Citrus aroma with something else I can’t place. Never have. It’s always been dead guys x factor for me. Bit bitter forward that evolves into sweetness. light carbonation. Orange and slightly cloudy body. Smooth, a little viscous.", "12oz bb04/2017 from BH. - An interesting import, a Heller Bock to its home terroir...like importing German IPAs to CA... - Bref: smells, tastes and feels like a Heller Bock with crisper than average malts joining the starchy honeyglue show. - ar: on-point Tapetenkleister/wallpaper glue proteins and thin starches, dry honey and herbal grasses. Crisp, un-stodgy mouthfeel making the best out of grainy, cereal malts. Surprising: does not forward any of the high-alpha hops, opting to blend in Saaz and Perle subtlety into the wild honeyflower. Well done cover of one of my least favourite DE styles...beats Ganter Maibock.", "At Kufle i kapsle, Warsaw, February 2014. Shared with lovely Anja. Sample on a \"deska piw\" (beer plank for tasting). Copper colored, small white head. Medium aroma, sweetish, honey, alcohol, raisins, blueberry. Sweet, like a cake with dry fruits, lasting sweetness. Drinkable, but strong. Soft carbonation, full body. A strong fruity beer, balanced. Value for money.\n\n0.33 l bottle shared with Marko and Anna God. Hazy amber, small to medium off-white head. Strong malty, dried fruit, prunes, honey, toffee, toasty. Not as sweet, finishes dry with a hoppy note. Medium body, quite drinkable, alcohol hidden, moderate finish.", "Sample at Omaha Beer Fest, Stinson Park. 6-11-16. Bottle. Poured dark amber, slight off white head. Aroma was toasted malt, dark fruit. Taste was sweet, caramel, dark fruity. Very good.", "355ml bottle into shaker. Sweet aroma of caramel toffee and brown sugar. Murky orange/brown beer with thin film on top. Oily texture, fresh and bitter taste. The finish is burnt caramel and bitter fruit. Very pleasant, well balanced.", "Tap@Taphouse, Copenhagen - golden amber pour with white head. Aroma and taste is sweet with notes of caramel and toffee and honey, nice hoppy backing, bready malts, solid bitter finish. Nice.", "From a bottle, smell of toffee and caramel, big brown sugar and chocolate chip cookie notes. Taste follows, rich and buttery in texture with a long sitting almost smoked aftertaste.", "Pours dark amber, a little head. Nose is malt, some pine. Taste is malty, maybe graham cracker, with piney hops rounding out the background and balancing out the hint of sweet from the malt. Mouthfeel is slightly heavy, with some bitter and a cleanish finish. \n\n---Rated via Beer Buddy for iPhone", "Nice amber colour with a cleaner thick but quick disappearing head.\r\nThe aroma is sweet, full of caramel, honey and malt; maybe a little of ananas.\r\nThe taste is weaker and more bitter than I expected from this style, expecially in the end.\r\n\r\nNothing exceptional. It’s ok, but a bit of a let down.", "Growler to wine glass\r\nAppearance:\tdark amber color, hazy, tan head that disappears slowly quickly\t\r\nAroma: Slightly hoppy on the nose\t\r\nTaste: Medium bitterness\r\nMouthfeel:: medium body, fizzy, \r\nOverall: Good beer, good to repeat, not to look for\r\nDrank in 2012", "12 oz bottle: Red amber color. Candy-caramel malt aroma. Rich malty, lightly toasted flavor. Substantial body but not cloying - a good beer.", "Appearance- amber, cloudy, half a finger off-white head. Aroma- lots of caramel malt, honey, biscuit, dried fruit, cereal, hops. Taste- caramel, toasty malt, honey hints, sugary dark fruit, malt loaf, biscuity malt, sweet slightly treacly finish.", "bernsteinfarben, leicht opal mit weißem Schaum. Schöner Duft nach Malzbonbons, Honig, etwas Karamell, leicht fruchtig. Geschmack ist malzig, Sahnebonbons, leicht kräuterig, Honig, nicht zu süß. Tolles Bier!", "Bottle. Almost no head. Really beautiful amber colour. Medium to high malt aroma. Strong barley and caramel flavour. A bit sweet. Light bitterness with some lasting on tongue. Medium alcoholic taste. To me (I am no Heller Bock specialist so maybe it?s one of the style criteria) I see it as a almost barleywine : not as much alcohol, no so malty. But a great compromise between everyday Belgian beer and a great barleywine. Really a very good surprise", "Top 50? Really? OK bottle at Qbrick and other places. It’s a decent malt forward beer with decent flavor but doesn’t really wow nor disappoint. Worth trying but I’m still trying to wrap my head around the fact this is a tope 50 heller bock...", "Farbe: Bernstein \nSchaum: kaum, fein \nNase: malzig, Waldhonig, bisschen Gras Geschmack: auch ziemlich malzig, aber nicht platt breit süß, sondern mit ner deutlich bitteren Komponente die das Bier nicht zu schwer werden läßt, sondern einigermaßen spritzig hält. Das gute ist auch dass das bittere den Abgang dominiert, im Nachgeschmack aber wieder weg ist, bzw durch Gerste ersetzt wird.Sehr sehr gut.", "Bottle from LCBO. Pours dark, very hazy orange with a small creamy white head. The aroma is sweetish malts with grassy hops, tastes along the same lines, it’s somewhat grainy with a dry wheaty dry finish that’s also grassy of hops. Quite fruity too. Mouthfeel full, carbonation active but pleasantly thin. At points very pleasant.", "De couleur cuivrée la mousse à une tenue correcte et finne \nAu nez on va trouver des arômes malté et orangée\nEn bouche on va trouver des saveur douce sur le caramel l’orange confite et les épices", "355ml bottle, served in snifter glass. Poured a hazy, cloudy amber with a two finger ivory head. Aromas of orange peels, bread, bubblegum, caramel, chocolate, banana, toffee. Taste: Orange, spices, caramel, banana, milk chocolate, vanilla, butterscotch, toffee, nuts, haagsche hopjes (Dutch sweets with coffee and caramel). Wow this almost drinks like a chocolate/vanilla milkshake. Very smooth. Some hoppy bitterness in the background. A medium to full body with lots of caramel and some spice in the finish. Absolutely love this brew!", "Bottle pour into nonic pint glass from Greg & Jane’s Beer and Wine. Aroma is bready malt with caramel, noble hops. Appearance is clear copper/amber with nice sparkle, finger-width off-white foamy head with poor retention and trace lacing. Taste is caramel dominant moderate sweet malt. Palate is medium bodied with smooth, creamy texture, average carbonation and sweet caramel finish. Overall, a perfect example of the style, which is pretty straightforward.", "A very well produced heller bock with a strong malty body packed with sweet caramel flavors. The crispy and balanced hoppy finish creates a fresh aftertaste.", "Een troubel blond bier met een mooie schuimkop. De geur is wat citrusachtig. De smaak is verfrissend met weer een toets van citrus erin.", "Aroma of clementine & flowers. Clear golden with tanned head. Sweet & lightly sour taste. Medium body, creamy texture & soft carbonation.", "een rood bruine kleur en mout smaak als van een bok donkere toon licht bitter en toch watervlug een drogerrige mond.\r\npersoonlijk mis ik de volle smaak van mout die door hop opgehaald mogen worden.", "Clean amber colour, small white head. Aroma of malt, caramel, grain, honey, biscuit, apples, banana, grassy hops. Lightly sweet bitter taste worth long hoppy aftertaste. Medium body and average carbonation. Quite enjoyable beer.", "Bottled. No clear date. Pours dusty copper, off white head. Aroma is fig, cherry, esters, little bit of a cola aroma, little bit of hop citrus. Flavor is cherry, fig, it’s almost toffee but not quite. Orange hop citrus. Nice hop bitterness. A little heavy in the astringency but it’s really solid. I quite like it. It’s pretty complex and good. Especially for a German style beer which usually isn’t my cup of tea (or beer).", "Poured from draft at Century House nice copper color with a one finger white head. Aromas of malty biscuit dark fruit caramel and yeast. Taste is fruity malty hints of spice and balanced bitterness.", "Bottle:355ml Price: 1,49 €. Gintaro spalva. Malonus kvapas, labai geras skonis... didoka kaina", "Dark golden color, slightly hazy liquid; Quickly dissipating white head - Aroma is malty, caramel, biscuits, some hints of dark fruits, some hops too - Taste is sweet at first, getting bitter towards the finish - full body, rather sticky mouthfeel, below average carbonation. Long, rather bitter, dry finish.", "Nez: Malté, miel, raisin\r\nBouche: Maltée, caramel, biscuitée, miel, raisin, fruits secs\r\nTrès bonne bière qui fait penser à un Barleywine en plus léger", "It is deep honey in color with a malty aroma, rich hearty flavor and a well balanced finish. Dead Guy is created from Northwest Harrington, Klages, Maier Munich and Carastan malts, along with Perle and Saaz Hops.", "12oz Flasche. Hellbraunes Bier mit luftigem Schaum. Fruchtig herbes Aroma. Kräuter und Süsse im Geschmack. Langes bitteres Finish.", "From bottle in beer stein. An amber brew with fleeting head and aroma of fruit bread and a hint of banana. Broad malts dominate the taste with a bit of spice and smokiness on the palate. My first venture into the lighter side of the bock family.", "the aroma is malty and herbal with hints of grain, flowers, garden fruits and spicy grasses... the taste is malty and, a little bit, fruity with notes of toffee, apple, pine and spicy herbs... sweet, bitter and dry aftertaste...", "Copper color with white head. Malty aroma. The malt is present also in the taste, caramel but nice dry finish. Enjoyable.", "Originally rated on 8/14/08. Didnt know this was a bock until i just looked it up. The body looked more like an APA or even a IPA with an orangish-copper colored body, ample carbonation, with a mid sized light tan head. Aroma of spicy hops, flavor was balanced between the hops and malts, a little sweet, with hints of berries. Overall a pretty good beer no matter what style it tries to be", "Bottle. Amber, clear, minimal head, white foam, medium bitterness, medium sweetness, medium body, oily feel, soft carbonation, & bitter finish.", "Pours Light and clear with a bit of foam that disappears quickly . slightly bitter taste. Overall quite good but not great", "Enjoyable lager slightly hazy Amber rich yeasty taste hints of cocktail cherry very nice stuff.", "Yum! banana, bubblegum, butterscotch, herbs, caramel, bread, dough. Lovely sweet notes. Almost a bit like a light barley wine. Surpisingy good!", "Bottle. Golden color with white head. Aroma has malt, grass and noble hops. Taste is malty with quite long bitter and dry aftertaste. Flavors of malt, hops, citrus and spices. Nice drinkable beer with good aftertaste.", "Bottle, 330ml. Pours beautiful clear golden-red, head is very short and beige colored. Scent is of fruits and berries, malt, bread and yeast. Mouth feel is oily with a light body and gentle carbonation. Tastes nicely bitter with some sweetness and light tartness. Flavors are of ripe fruit, malt, hops, caramel, lightly herbal, fruity hops, phenol, light buttery note, yeast, light spice and clove, some tart fruit. Very nice, fresh, not heavy, well balanced with interesting flavor.", "Surprenante couleur rouge orangé, levure au nez, goûts de fruits (pêche?, abricot?), résineux, miel, caramel, Un peu acide. Alcool sur le retour, un peu fade quand même...", "Tap at msp airport. Pint glass. Hazy copper with very thick frothy white head. Sweet and grain and slightly spicy nose. Malty, heavy grain, then yeast. Nice finish. Very full body for the style. A bit of a meal. Lots of sugar. To me, an ipa reminiscent version of a maibock. Good stuff. Would be one of my go to beers in this region.", "Clear copper color with a off white head that’s impassive at first but doesn’t last very long. Aroma of honey, caramel, and a bit of veggie note. Taste is honey, veggies, and metal. Pretty awful", "11.02.2016 İstanbul, şişe.\n\nGörüntü: köpük zayıf, bulanık maun renkli. Küçük parçacıklar gözle görülür şekilde yüzüyor.\n\nKoku: tatlı, şerbetimsi.. Karamel, malt, tatlı tınılar önde.\n\nTadım: orta gövdeli, tatlı.. Damakta kara üzüm, şerbet, karamel, malt, mayası hafif tatlı-ekşi bir burukluk var\n\nGenel değerlendirme: son tüketim tarihi 1 yıl geçirdiğim bu Amerikan butik blrası damakta tatlılık, ama ve hafif üzümsü ekşi tınılar barındırıyor..", "Pesada para beber em quantidade, mas saborosa. O gosto forte e pouco amargo desaparece logo.", "330 ml bottle. Hazy semidark orange colour with small head off which goes down really soon. Aroma of oranges,caramel, malts. Taste of caramel, sweet, tangerine, bread, dry bitter finish. Good beer", "Bottle poured into a tall tulip. Surprising, almost unique, flavors evident on the first sip. Color of a dark honey, aroma of sweet malt and bread. Very smooth, rounded nut-like flavor. Malty, floral hops, sweetness, creamy texture, quite complex, easy to drink, tastes and looks more like an amber ale than anything else, I would certainly drink this one again.", "EIN HELLER BOCK!!!!!!!!!!?????????????????? WAHNSINN!!!!!!!!!!!!!! So malzig,hoppy und rundum lecker. Sehr eigenwillige Interpretation eines deutschen Klassikers. Die Rogue Brewery spricht übrigens von einem Maibock!!!!!!!!!!!!!!!! HELL YEAH!!!!!! Flasche von Beyond Beer HH 2 Euro 0,33.", "L:\r\n-pours a hazy amber-red with a medium to big,foamy,offwhite head\r\n-medium carbonation visible\r\nS:\r\n-orange,tangerines,caramel,honey,gooseberry,peach,slight grapefruit\r\nT:\r\n-Follows the nose with a toasty finish\r\n-low to medium bitterniss\r\n-finishes dry\r\nF:\r\n-medium carbonation\r\n-light to medium,creamy body\r\nO:\r\nThis is not a Maibock,hell it’s not even a Lager.\r\nAside from that,a great Amber Ale though", "From notes: sweet, malty, lots of body, a bit more balance with the alcohol would be nice.", "33cl bottle\norange color\naroma major of honey\ntaste a bit malty, lightly hoppy\nfine beer", "The taste isn’t too bitter and no after taste which pretty good for me. Aroma itself isn’t hoppy.", "Bottle, bubbly fluffy head, hazy deep orange color, biscuity fruity aroma, biscuity jammy flavor with some honey in the back, herbal bitterness, a bit too sweet. Decent.", "Introduced to this at a local pub that had it on draft. Now one of my top picks, i just wished that in the northeast it wasn’t considered such a premium brand at typically close to $14 a 6 pack. Highly recommend visiting one of their bars in Portland, OR - enjoyed a flight and still come back to this.", "22oz bottle 1/12/16 (Old Notes)-Pours copper with a decent head. Aroma of roasted malt, caramel, and slight dark fruit. Taste of the same with a bit of grass and biscuit. This medium bodied brew is well done.", "35.5cl Pours clear orange, with thin head, that goes immediately. Fain aroma of caramel and some malts. Slightly sweet, medium bitter, with some clear caramel and candy sugars. Reminds a bit of faro with extra ABV. Medium bodied, smooth with some sharp alcohol bites. Not fizzy in the glass, but livens up in the mouth. A pleasant drink overall.", "Bottle: Amber in color with a quickly dissipating white head. The aroma is malty and some dark fruit esters. The flavor includes bread and caramel along with the fruitiness. The tastes is sweet up front and a mild bitterness on the finish.", "Pours clear copper with a fine white head. Nose is weak and generic sweetness. Flavor is a balance of bread, licorice, and european hops. Finish is quick. Drinkable but unremarkable.", "12 oz bottle. Didn’t know much about this...malty, almost stout-like but pale-ale in color. Surprising, interesting, good beer.", "Along with Yves at his home amber coloured body with a white head and a spicy yeast malt hops aroma a spicy herby hop bitter sweet taste with a slight bitter finish", "Pours nice golden and clear. Aroma contains some cereal, yeast, sweet bread, malts. Taste is balanced, some grain, cereal, roasted white bread, grass. After lasts surprisingly long and follows to balanced taste line. Very nice ale!", "Decent ale. Not my style but not a bad choice when selection is limited. Once of the more standard of Rogue’s lineup", "This used to be one of my favorite beers, yet I haven’t had it years. Time for a revisit. Nice golden color. Light carbonation. Lovely malty aroma of nuts, caramel, and breakfast cereal. Balanced flavor, a bit on the hoppy side. Grass, caramel, and a touch of yeast fruitiness. Still delicious, but it has fallen from my favorite beer pillar.", "This is a great beer. A good stand by. Honestly, I’ve drank it for so long it no longer commands my attention but I still dig it.", "Tap@Zlý Časy. Amber, smooth off-white head. Aroma bread, plums in alcohol. Taste even more plums in more alcohol. Finish plums in alcohol. A consistent ale.\n\n---Rated via Beer Buddy for iPhone", "Shared with wim at my home. Hazy amber colored beer with small white head and no carbonation visible. Malty yeasty aroma. Full sparkling palate. Finish is sweet bitter yeasty cartonnage hinted. \n\n ---Rated via Beer Buddy for Android", "Bottle from the LCBO. Malty, toasted, orange, mild bitter, chocolate, sweet bread, raisin. Satisfying and tasty.", "The sweet hop aroma mutes itself a bit with the typical hop character of most smaller brewed American beer. Very pleasing, surprisingly balanced flavor dutifully follows the aforementioned olfactory qualities. Absolutely nothing bad about this beer. But not much to write home about either. It is quite good, but the price can’t be justified. Ideally, this is what a seven dollar six pack should be.", "Pours murky copper with a thin sticky head. Initial taste of ever so slightly sweet caramel. With a chocolate/caramel middle that fades quick but with a sweet lingering taste. \n\n---Rated via Beer Buddy", "600 ml bottle at Laughing Buddha, in Sudbury. Pours an amber colour with a small off-white head. Aroma is grain, yeast, hops. Aroma is floral. Very good beer.", "Rated from old notes. A yeasty, hoppy concoction ... actively bitter at the start, but mellows as you progress. Faintly smells like apple cider, although no such taste is present. Floral notes. Remains dry and bitter for the duration with only a slight mellowing.", "Pours clear amber with a thin off white head. Aroma is very grainy. A lot of carbonation on the tongue with a sweet finish. The yeast is very unique and adds a ton of flavor. Really good Hellerbock.", "Bottle. Pours amber with yellowish head. Aroma: caramel, toffee, white chocolate, slight hay, Taste is sweet, caramel, hazelnuts, toffe, some bitterness, hay. Medium body.Nice beer.", "Bottle. Opaque Amber color with thin off-white head and very little lacing. Malt aroma with some dried apple notes. Malt upfront with caramel notes. Dried fruit, including Apple and apricot, and mouthcoating woody bitterness in the finish that is slight powdery. Lighter body than expected. \n\n---Rated via Beer Buddy for iPhone", "0.5 draft. Hazy, tea color and a medium, white head. Aroma of hops, pines, some malts, hints of bread. Taste is malty with a noticeably strong hop touch. Medium body, slick texture, and a soft carbonation. Finish is sweeter, more biscuity - props for that. Overall, not a bad beer, quite drinkable.", "Sampled from a bottle at The Tilted Kilt S. Wabash, Chicago. Deep amber colour with a white head. malty aroma and very malty taste. Also honey and butterscotch with lots of floral notes. Powerful flavours and very full taste in the mouth. A really nice flavoursome beer.", "No muy aromática, toques a malta. Color miel oscura. Sabor dulce, caramelo, tostado. Persistente en paladar, con cuerpo, cremosa. Recomendable.", "Bottle. Smell is honey, herbs and gas. Comes in harsh and malty, bitter like earwax. Some sweetness in the back. Wishy washy finish. Eurghh don’t know what to say about this - it just isnt very nice!", "330 ml bottle. Pours hazy amber colour with small white head. Aroma of fruits, malts, honey, caramel. Full body with soft carbonation, taste is sweet with bitter finish.", "Bottle @ dining room! \n\r\nPours a hazy light orange color with a big fluffy white head and some nice lacing on the glass.\n\r\n\n\r\nThe aroma is sweet malt and leafy hops.... I mean, that sounds like bullshit I know... but that’s about it... I mean it’s lightly fruity, it’s got some fall time leaf rot, it’s got some honey. But more than anything it smells like the raw ingredients from whence it came, which is not wholly bad. \n\r\n\n\r\nThe flavor is spicy, with a medium to low level of hoppiness & really pretty honey and apple forward. The bitterness level keeps things balanced pretty well here, nothing is terribly out of place. \n\r\n\n\r\nHonestly I’ll always consider this more of an Amber Ale than anything, but it’s not a bad Amber Ale, even if I don’t care about amber ales.", "Great beer for the flavor, a bit sweet you can feel the hops on this one\n good one from Rouge", "Nice looking ale. nice aroma & mouth feel. Bu,t too much of a bitter aftertaste. Decent beer.", "I didn't take any extra notes when I tried this beer for the first time but I'm gonna try it again and update my comments.\n\n---Rated via Beer Buddy for iPhone", "Pours amber with medium, quickly diminishing head. Aroma is malt at first, some sweet citrusy notes can be sensed. Taste is very full. First thought is very carbonated, but it is not. It is a hard rocking body of the beer that gives you this sensation. It is slightly sour with a bitter finish, that is not too strong. A nice ale.", "Bottle. Sweet, thickish, full bodied in a caramelly and bready way, quite a lot of fruity esters, some spicy hop notes. Dryish, light astringent alcoholic finish that balances the main part. Good.", "Bottle thx Stefan. Pours nearly clear amber with a white head. Aroma caramel, grain, light fruit. Taste is malts, caramel, grainy, touch of citrus, syrong body.", "From bottle. Pours hazy amber with a white head. Aroma of bread, grains, cereal, nuts, loooots of sweet caramel. Taste is the same. Sweet, grainy, corn. Meh...", "On tap in Stamford, CT. Amber color - malty nose. Taste is malt bomb with some alcohol up front and a touch of bitterness on finish. Not really for me.\n\n---Rated via Beer Buddy for iPhone", "Slight alcohol at first. Higher carbonation rich full body. Slightly bitter aftertaste.", "Presenta ámbar oscuro con buena cabeza de espuma blanca de burbuja fina y buena retención; aromas a fruta tropical, caramelo, bizcocho, pino y miel; en boca entrada media y maltosa con ligero amargor, notas terrosas, herbales y a caramelo toffee, cuerpo medio y gasificación media baja, buena cerveza, bien balanceada en el lúpulo y malta pero no resulta excesivamente compleja.", "Couldn’t believe I haven’t rated this one yet. Definitely one of the first craft beera I remember getting in 95 I think.", "Couleur ambrée, légère mousse. Nez malté, caramel cremeux. Gout malté caramel, note caramel cuit et candy puis fruits confits en fin de bouche. Bon corps. Fin amère houblonnée et note sucrée.", "De couleur orangée avec peu everfesssance . On sens tout le le côté Malte légèrement caraméliser . C est une bière légèrement houblonner mais herbale.", "Bottle in LA. Pale amber, hazy, tiny head dissipates fast. Some malt and noble hop aroma, otherwise clean aroma. mildly sweet malt flavour, moderate bitterness. Hint of alcohol warmth. alcohol could sneak up you. Well balanced, easy drinking.", "This was a surprisingly good beer very smooth easy to drink not hoppy and bitter plenty of good malty yeasty flavor would recommend.", "From tap. Almost clear dark amber color with off white head. Malty aroma, caramel, bread, light hoppy, grassy and fruity. Sweet and bitter taste like aroma. Medium oily body with soft carbonation.", "Nice hoppy beer, light and refreshing. Not one for a winters night but I would drink again!", "Bottle from Gott’s in Palo Alto, CA. Malt and honey up front with a nutty mid and slightly bitter finish. Reminded me of something from Anchor. An American craft beer staple.", "Прекрасно сбалансированный вкус : солод, хмель, присутствуют нотки карамели, специй. Горьковатое послевкусие. Цвет жёлтого янтаря, немного мутноватое.", "Unclear amber colored beer with a small white head, medium carbonation.\r\nTastes hoppy, malty, caramel.\r\nNice hoppy bitter aftertaste.", "The foam is coarse and moderate. Fine small pearl bubbles rise from the glass, releasing good flavors of caramel. Lovely bock with good caramel malt as first impression. Fine nuances of fruit and a lovely and well-balanced hop bitterness contributes semi-dry finish. Nice and tasty bock, which certainly falls in my taste.", "Rich malty and hop aroma. Dark Amber garnet pour. Malty and hoppy, flavor is really rich, hops balance it very well. Great malt finish.", "Ambar anaranjada, escasa espuma blanca. Aroma malteado y herbal. Excelente sabor de malta acaramelada, perfectamente balanceada con lupulos que aportan notas verbales y terrosas. Cuerpo moderado, perfecta de gas. Moderado amargor. Muy sabrosa.", "Fles gekocht @The Beer Tree. Een moutig en licht hoppig bier, rood-oranje van kleur. Fris van smaak. Een lekkere grassige nasmaak. Heller Bocks zijn niet mijn favo bieren, maar deze is wel aardig.", "Bottle at home (650 ml, best by 08/2015). Pours light hazy orange amber with a fast disappearing head. Aroma of sweet malts, honey, caramel, yeast. Taste is sweet, malty, honey, yeast, light orange, hint of hoppy bitterness in the end, sweet malty aftertaste. Not bad, maybe a bit too old.", "Opaque blunt copper-coloured beer with a weak head.\nSmell is intense raisins, apples with a hint of alcohol. Hint of strawberry, cherries, lemon. Spices.\nTaste is initially watery sour, then bitter with a hint of zest. Touch of caramel, alcohol. Bitter malty finish.", "Bue en bouteille de 355ml chez Victor.\nCouleur ambrée mousse moyenne effervescence peu présente.\nNez sur le malt frais.\nEn bouche attaque sur la bêtise de Cambrai. Sucre et houblon mandarine.", "Tap pour at Rogue in the Portland airport. 16 oz pint glass. Copper in color with minimal head. Aroma is mostly malty with mild caramel and toffee notes. Taste is also leaning towards malt with very minimal bitterness that only pops up at the end. Sweetness of malt comes through pulling some familiar toffee and caramel characteristics with it. As the most noteworthy Rogue offering you can taste why it’s nearly a flagship. Easy to drink without overwhelming the drinker with anything abrasive. Much like Bernie this is a fun dead guy to have around.", "35,5cl bottle. Second time having this one. Pours lightly cloudy dark amber with small, creamy, diminishing, off-white head. Average malt character, cookies and caramel taste, average hoppyness, mostly citrus. Hints of butterscotch and toffee. Medium to full body, creamy texture, lively carbonation, bitter finish. Moderate sweetness and bitterness, well balanced, light acidity. A great brew from Rogue, maybe the best I’ve had from them so far. Pity they have a poor distribution where I live.", "Aroma:\n\n\nMalts, caramel, bread, yeast, fruit and hops.\n\n\n\n\nAppearance:\n\n\nTurbid amber/brown with a lot of yeast and with a slight/medium off-white head.\n\n\n\n\nTaste/Palate:\n\n\nStarts medium sweet with malts, caramel, yeast and fruit; ends slightly dry and bitter with bread and hops.", "Ambar dourado, espuma amarela boa formação e retenção. Paladar de aroma de Caramelo, pinho, dulçor intenso. Impactante, preciso tomar outra pra poder avaliar melhor.", "12 fl oz bottle. Gorgeous deep gold / honey colour with decent cream coloured head which settled to a ring but left plimsoll lines. Gentle aroma of caramel, toasted malt, two fruits and alcohol. Light to medium sweetness and minimal bitterness. Medium bodied, smooth texture and slightly boozy in the finish. Easy drinking. 8.", "La notas de cereal con un toque acaramelado son las que aparecen en primer lugar, con un perfil afrutado sutil, pero sabroso, el punto cítrico me recuerda a la naranja sanguina, y remata la faena con un fondo a hierba refrescante, adornada con trazas florales. La intensidad del componente carbónico es moderado y el cuerpo de nivel medio. Aunque esta cervecera tiene esta cerveza no me convence, No está mal del todo pero no es una cerveza de la que vuelva a repetir", "A little dark for an heller bock. Malty, caramel, nuts, toast, butterscotch, roasty. Wunderbar heller bock. malaise.", "Golden Amber body under no head. Slick, moderate mouth feel. Satisfying heartier drink. No offensive flavors but no really positive notes.", "Айм нот э бокер, но этот бок заценил, даже открыл глаза по-новому на все бокию", "Nice looking ale. nice aroma & mouth feel. Bu,t too much of a bitter aftertaste. Not horrible but for the price, middle of the road.", "Bottle from The Roebuck, Leek (Titanic) Pours a hazy amber colour with a thin white head. Aroma is malty of caramel, honey, some bread, spicy orange, subtle nuts and red berries. Taste of caramel, molasses, honey, red berries, bread then orange, cranberry and slight apple. Medium bodied and a slick texture. A quite dry, caramel then orangey, earthy bitterness in the finish. A very malty, sweetish start and then a fruity, citrusy end. Really decent.", "Pours amber with thin beige head. Aroma of malts, caramel, pine and herbal. Taste is sweet with some bitterness at the end. Medium body, low carbonation.", "Bottle at home. Pours slightly hazy dark orange. Nose is orange, malts, sweetness, fruitcake. Taste is caramalts, dry toffee, sweet fruits, syrup. Decent.", "Dark brown with a quickly fading head. Nose is barley sugar and somewhat metallic hops. Palate is rich, sweet, malty and a little fruity (fruitcake?), with a bitter finish. Decent beer.", "Dark orange bronzr appearance with a white hrad. Malty sweet aroma. Sweet taste of syrup, malts and a slight touch a fruits. Low carbonation. A solid beer.", "Dark orange-brown with thin beige head.\r\nMalty aroma with notes of syrup, soysauce, chocolate, cream, alcohol and fruits.\r\nFruity flavour with notes of chocolate, caramel and cream. Round with dry bitterness.", "Bottle. Pours clear copper. Small head disappears quickly. Aroma of fruit caramel apples pine. Taste of caramel some citrus and light bitterness. Very good. \n\n---Rated via Beer Buddy for iPhone", "Poured from a bottle. Bread and caramel with a hint of nuttiness. Earthy and pine aroma. Deep rich and dark golden hue with a healthy amount of lacing from a white frothy head that retains for a descent amount of the beer. Nice balance of sweetness to a soft bitterness and dry finish.", "Smell is sweet and grainy. Taste is sweet, a little fruity and bitter with a long bready finish. This is the second rogue beer iv’e had and want to try more if they are nearly as good as this.", "12 fl oz bottle. Deep amber colour, off-white foam head and aroma of bready malt, grain, toffee, caramel. Taste is malty, bready, with some tangy spicy grassy bitterness. Medium bodied, soft carbonation, dry grassy bitter finish. Quite drinkable.", "Bottle 35.5cl. Clear medium amber, small frothy off-white head, diminishes slowly, thin layer remains, almost no lacing;  arosweet malt aroma, grain, caramel, orange peel, biscuit, grass, light alcohol; taste medium sweet and bitter, fruity, spicy notes; medium body, oily to creamy texture, soft carbonation, aftertaste moderate bittersweet, spicy and alcoholic notes; nice but not really a Bock.", "One-finger head on top of chesnut brown body. Slightly cloudy. Aroma is malt fruitiness, some apples and toffee. Taste contains a hop bittering which punches through the malt character at the end. Very well balanced and moreish.", "Creamy ale, not as much of the sweet German influence as I was expecting, decent, but no better.", "Líquido turvo,alaranjado,espuma mediana na formação e duração;no aroma malte,caramelo,notas torradas e um leve herbáceo;sabor inicial maltado,adocicado,seguido por notas cítricas e finalizando com leve amargor,corpo médio,refrescante,boa drinkability,final seco,retrogosto agridoce.", "Caramel aroma, light aroma and nice light yeast aroma. Taste is simple, caramel, 1/27 of a quad :)", "Výčap Zlý časy. Bledšia jantárová farba, biela pena. Vôňa sladká, ovocná, ľahko karamelová. V chuti stredne plné telo, nízka nasýtenosť. Zo začiatku sladkosť ovocia, neskôr karamelové chute a v pozadí veľmi príjemná dochuť prezretého ovocia. Výborné.", "Plain old ale, nothing surprising, medium carbonation, nicely balanced malts and undercurrent woody notes.", "Bright amber. Sweet caramel and floral aroma very smooth and intense. Hoppy finish. Very tasty ale.", "The Cannery Row Beer Club enjoyed the Brewery's beer that made them famous. This cost $6.", "Fresh and malty. Smooth, hints of sweetness. The mainpart is a bit sharp, typical Heller Bock flavours, sweetness with a nice bitter aftertaste. Round and fresh with not too much depth. A bit sticky in the end without being too sweetish. Nice.", "Draught. Amber body with white head. Aroma is malty caramel with hints of toffee and some hints of floral notes. Tasis malts m caramel and some biscuits. Aftertaste is sweet with hops.", "Good, but nothing exceptional. Slightly dark with a little after taste that hangs in your throat.\n\n---Rated via Beer Buddy for iPhone", "Maybe I got an older bottle but not much going on with this beer. Some syrupy caramel malts and wheat flavours. Not too shabby but nothing exciting.", "Toffee and orange on the nose, not as bold as i’d expected. Pours a nice burnt orange colour with a thin but robust, stark white head. This is a very complex beer but in a really subtle and understated way. Quite malty - biscuit and toffee dominant with a slight bitter hit intertwined. There’s some floral flavours in the back end, with an ever so slight lemon twang. Superb levels of carbonation and great density. A little sharp on the back end but leaves a good mouth coating.", "Shared bottle. Pours is orange to light amber, thick white head. Aroma is fruity, pear, herbal, some peach. Taste is malty, sweet, light bittery, fruity, light pear. Medium body, flat carbonation. Very good.", "Bottle at brewfellas pub in nicosia. Pours copper/amber with a nice white head. Malty with some caramel notes, a bit sweet but well balanced with some hop bitterness", "0,355l bottle at Cafe Restaurant Aumann / Wien 18. Malty aroma and taste. Perfectly balanced between sweetness and bitterness. Excellent bock.\n\n---Rated via Beer Buddy for iPhone", "Wow, I don’t know how many times I’ve walked past this over the years. Silly me! Pours a clear orange-copper with thin white head - no retention. Smell is wonderful - semi-sweet with malt and bread and citrus. Flavor also has a slight honey sweetness, balanced well with some hop bitterness. Finish has a trace of alcohol, but smooth and again semi-sweet. I must have more...", "From the bomber, has a nice cloudy two tone (brown on the bottom, orange on top) look to it, little to no collar. Smells of sweet malt. Starts out really sweet but once the palate adjusts it evens out with carbonation and is very drinkable. I don’t remember having a maibock when I spent time in Germany, but then again I don’t remember a lot of things I did there. This is a delightful change of pace from what I usually drink, and I like that they made a German beer to celebrate a Mayan custom. Cheers.", "From tap, dark yellow-orange coloured non filtered ale, medium bitterness and light malty sweetness. Rich mouthfeel. Nice one!", "Bottle from BeerMerchants.\r\n\r\nPours hazy amber orange, with a single finger off white head. Aroma of sweet malts, dark fruits, and some hops too, faint.... Taste of initial fruits, then some light malts, then honey and extreme fruits and bitterness. Very good.", "Tough beer for me to rate. First of this style. Most beers I like have a stronger flavor. I didn’t get much of a distinctive smell out of it. Pours a nice amber color with lasting lacing. There is tingling on the tongue upfront. The middle is a smooth malty feeling. Sweet, somewhat caramel or butterscotch hints, though not overpowering. A bit too much carbonation at the end for my liking (considering the middle felt so smooth). There are hints of hops bitterness, but nothing that even compares to a pale ale.\r\n\r\nVery drinkable beer. Came to the conclusion that this is one that will not stand out on unique or powerful tastes, but a great beer to go to if you just want to enjoy a good beer.", "Honey aroma , bright cooper color,. Malty flavor but not over powering , clean finish.", "Pours copper with a thin head. Aroma of honey. Taste is like a sweet honey hot toddy. Lovely.", "Goede kraag van schuim, helaas weinig geur die opvalt. Groente smaak maar niks extra. Beetje zoet met lichte bitter. Ik mis iets fris of een citra.\r\nHij brand een beetje na in je mond, ik vind hem niet super slecht maar een topper is het ook niet. Iets beter als een middenmotor.", "A well-balanced, substantial ale with a clean finish. The Dead Guy has a pleasant amber hue and a nice hippy bite.", "Only slightly better than a generic/cheap beer. Not as bitter but no discernible flavors. Not very good.", "Bottle 33 cl.\n\r\nClear amber, off-white head. Malty caramel, toasted, slight alcoholic and a hint of yeast. Moderate sweet and bitter, long.", "This is there most popular beer. It is their original beer. It is smooth and well balanced. Good mix of hops and malts.", "Pours a dark slightly hazy amber-orange with an average size fizzy off-white head. Aroma of sweet malt, fruit and a touch of hops. Taste is fruity with fresh floral hops along with caramel malt and honey-- sweetness and bitterness are incredibly balanced.", "Bottle. Deep orange colour. Medium white head. Flavour of caramel, honey and dried fruits, light cookie notes. Flavour of caramel malt, dried fruits, light cookie notes. Bitterness in the background. Medium bitter dry finish with dried fruits notes. Medium body high carbo.", "Dark golden appearance, with almost no head. Fresh aromas of citrus and honey. Complex taste of honey, anise , dark caramel, tequila and vanilla. Medium body, fine carbonation and a lasting aftertaste of honey and caramel. Quite good", "Bottle. Caramel to brown in colour, low carbonation, slightly opaque. Aroma is, well, malty with some timid hops. Taste is rich and round, slightly bitter aftertaste. Good mouthfeel. Perfect (or close) beer in the sun!", "Pours golden from 12 oz with medium persistent tan head. Malty honey aroma. Complex malt flavor with honey, hints of tangerine/citrus fruit, and decidedly bitter end. Medium bodied with ample carbonation to support malt. Fantastic beer, complex and drinkable though wouldn’t really call it a maibock.", "Muffiger Geruch. Relativ Restsüß, nachhängende Bittere. Aromen nach himbeere bzw. Waldbeere.", "Bottle at the Free Press, Cambridge. Amber/copper, clear with a bit of cream/beige head. Odd aroma: forest berries, bubblegum, pine resin. A whiff of plastic. Not unpleasant, actually quite enticing, but as I say, odd. Taste is a full on malty bittersweet hit. Finish is more bitter, fades slowly, and creates the perfect denouement for this exciting drink. Loved it.", "This is a bit hoppy for my liking. I like the hop with certain beers, like an IPA or something, but didnt work for me with this one. Not quite an extra bitter, but pretty close. A good overall beer, and was able to drink it no problem. I just prefer some of the other types that Rogue makes.", "Geruch malzig bis fruchtig und nach Karamell. Geschmack ebenfalls malzig bis karamellartig.", "How : bottle Appearance : cloudy copper, small white head. Aroma : fresh fruits, hops, caramel, floral and some herbal tones. Palate : medium body, smooth carbonation.", "Nice American beer it is Always asking for one bottle and another and another worthy the try", "341 ml bottle poured at home. Pours a copper color with a bit of carbonation and minimal head. Aroma is spice and orange peel. Taste is slick in the mouth with some carbonation and bitter finish. Definitely a drinkable beer.", "Dark reddish colour with little compact head. Smell of malts, hops, herbs, honey. The taste is the same with well balanced carbonation and bitterness. For me very tasty beer.", "Been drinking this for years, even when they sold growlers at bev mo. Big malty for IPA almost arrogant bastard like. Hops are dark fruit flavors. Slightly sweet on palate. Otherwise great big brew.", "geil! xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\n---Rated via Beer Buddy for iPhone", "Pours a clear amber ale with a medium beige head.\r\nSmells malty, caramel.\r\nTastes bitter and a bit sweet.\r\nLeaves a malty sweet palate.\r\nOkay beer.", "Bottle from Bierzwerg!\n\n\nPours amber colored with nice off-white head. Smell has sweet malts, spicy. Starts sweet malty, spicy, with some floral hops. Finish is lovely malty and slight fruity.", "Bottle. Malty, caramel and fruit notes, a slight candy sweetness. Full bodied and flavourful, pretty well balanced. Nice.", "Pours with a heavy foam, beautiful color. Muted aromas. Tastes like an American ale, toasty, malty, not heavy on the alcohol. Great beer for tapas.", "Pours a hazy copper gold with fluffy eggshell head. Aromas of caramels, toasted bread, and a touch of campfire smoke. Taste is of caramel malts without too much sweetness. Alcohol shows as it warms. Finishes with a light tang and a caramel flavors. Full bodied with a faint astringency.", "Light fragrance of flowers. The taste is very bitter and fruity. Heavy bitterness that fills the mouth a weak moment. For bitter beer for me to like it. Follow me @ Kung av öl @ Facebook for more pictures and ratings.", "Pours brown. Aroma of red licorice, brown sugar, malt, molasses: nice. Tastes of the same: smooth and sweet. Lingering bittersweet aftertaste. Flavourful yet sessionable.", "I could tell you about the aroma, the appearance the palate. But I wont waste your time: This was simply, the most delicious beer I have had the pleasure of drinking in a very, very long time. If I had the choice, I would drink nothing else. Spectacular work Rogue.", "Pours a caramel color. Aroma is very sweet- caramel and toffee. Taste contains more bitter or dry elements than I would expect based on the coloration and taste, and I think that’s a good thing. Hops upfront quickly melt into a Werther’s original candy type taste that is sweet, but not overly sweet. I guess I’m a little picky in some respects for a guy who’ll drink adjunct lagers when finances dictate- I enjoy some malty beers, but when they taste a little too much like candy, that can be a turn-off, and when they get a little too roasted and burnt, that can be a turn-off. This definitely is not the latter. It has some aspects of the former, but skirts the line nicely with the upfront hoppiness and not overdoing it on the backend sweetness despite the base backend flavor being similar to beers that cross the line. I would say a good beer, but not spectacular.  Nicely avoids some common pitfalls, but it’s aim isn’t to the side of the bock equation I’d aim for.  I think I would raise my rating a lot if it were only relative to beers that smell and somewhat taste like candy.  But in a world where not all beers do, just a solid beer (Which is nothing to sneeze at).", "Amber with a small white head. Aroma is bread, biscuit, caramel, honey, bananas, apples, oranges. Taste is malty, citric, fruity, grassy and light alcohol presence. Sweet and light alcoholic aftertaste. Warming mouthfeel.", "355ml bottle from Vinmonopolet. Small tan head. Hazy light amber body with quite a bit of sediments. Low carbonation. Aroma is mostly earthy yeast and marmelade. Rich malt body. Slightly bitter on the tongue at first with a sour/sweet finish. Slightly spicy.", "355ml bottle at Van Zanten. Hazy amber with a medium slightly off-white head. Medium body with low carbonation. Nice sweetness with some bitter tones. Malts, caramel, honey, raisin and herbs. Quite a tasty brew.", "pours a light copper with a medium beige head. aroma of grass/hay and malt. Nice malty taste. Some mild hop bitter arrives in the middle and goes into a pleasant hop presence on the finish. Not syrupy like many bocks. A really good balanced beer.", "Pours with almost no head. More on the malt (caramel, nutty feel) side but with a nice touch of extra hops in the end which is a bit unusual for this style (but expected considering it s made in USA)", "Aroma is strongly malty with notes of marmelade, fruits, raisin and slight vanilla. Mouthfeel is nice and slick with a medium amount of carbonation. The flavor is definately malty, sweet and marmelade-ish with some butterscotch and vanilla. Finish has some slight spice, probably from the hops. Definately a really nice beer!", "Bottle. Orange-amber color. Aroma: toffee, plum, jam, caramel a bit of marsala. Taste malty, honey, some wine, hop bitterness in finish.", "Small off-white head; medium to dark Amber color; just a bit hazy.\r\n\r\nMalt dominates with molasses and bread aromas; some hop balance though with some mild grass aroma.\r\n\r\nMedium to full body; texture a bit oily and creamy. Long finish with moderate to heavy sweetness and bitterness.", "Bottle at home. Pours reddish amber, nose is caramel, fruity, taste is malty, toffee, caramel, raisin.", "Bottle. caramel, earthy, alcohol, raisin, black currant, vanilla, butterscotch, amber color, cloudy, frothy, white foam, light sweetness, medium bitterness. medium body, creamy, soft carbonation.", "Wow. Quiet, calm, refreshing. Nothing unwanted upfront, nor aftertaste. I might be giving this more credit cause it is Oregon Craft."]}