{"reviews": ["Piwo o randze kultowego piwa, które zapoczątkowało piwną rewolucję w Stanach. Kolor bursztynu, niezła piana, aromat cytrusó…", "Bière bue au Memphis à Villeneuve d'Ascq, robe blonde, bière qui sent le fromage, en bouche le goût n'est pas top", "Bière 35 cl bue au Memphis coffee. Robe blonde pas très intéressante. Nez légèrement houblonné, avec un côté lactique fermenté pas super agréable, bouche assez amère, plus de notes tropical auraient été appréciables mais elle est plutôt réussie.", "Pale copper pour with a thick frothy head and lots of lacing …. Aroma of chewy caramel malts, cascade hops all the way, juicy fruits, citrusy orange, grapefruit and lightly floral …. Taste is of chewy caramel malts, juicy fruits, orange, grapefruit and light lemon …. Little floral hop in there …. Dry lightly bitter and delicious …. One that got away from me for a long time …. Lingering citrusy hops in the finish along with a light spicy bite, mostly orange and grapefruit hanging around …. Delicious and timeless, would love to have this fresh on tap.", "355ml Bottles from Beersniffers Webshop, Saltburn-by-the-Sea, Cleveland etc.\n\nHazy golden coloured with a massive rocky white head of foam. It has a peppery hop and pine flavour with malt, toffee and earthy notes on the smooth, warming finish. Excellent!", "Color cobrizo, sabor tostado y medio afrutado. La verdad que es espectacularmente sorprendente.", "Color cobrizo, ligero amargor, aroma a frutas, caramelo, floral y cítricos. Suave carbonatación y aroma único aportado por el dry hopping. Vaso pinta americana. SP", "Large foamy white head stayed on an unclear pale gold body.\nLemon & malt aroma.\nMedium bodied, nicely carbonated with a sharp back.\nLemon, stone fruit, grapefruit & malt tastes.\nNicely balanced.", "The beer's appearance and introduction is textbook. Golden pour with wonderful head retention, it's super inviting in the glass. Its aroma is highly floral, piney cut with malts and citrus peel. A very nice bouquet. The taste is incrediblely consistent throughout the entire palate. It's medium malty sweetness, which is quickly flipped to bitter hops, finishes bitter but very smoothly and light. An easy drinking pale ale which is well structured and doesn't compromise on taste. Hard to compare it to many of the tricked up pale ales today as it may seem basic, but its simplicity as a prototypical APA is wonderful. It may not even be my favorite APA I've had recently; however, this beer's recipe has been around since 1975 and is a standard bearer. Much respect to those that paved the way out of the Miller/Coors/Bud miasma.", "Color ámbar intenso, espuma blanca y densa de una excelente persistencia, dejando marcas en el vaso.\nAroma completo gracias al lúpulo, notas cítricas, frutales y de resina.\nSabor en la misma línea, poco maltosa. Predomina la presencia del lúpulo dando sabores cítricos y a pino y resina. Final amargo.\nUna pale ale de manual.", "Amber colour, transparent, lots of bubbles.Big head, nice carbonation.\nSmell is resin, leather white pepper, grapefruit, flowery, puke.\nWatery taste, lots of hoppy grapefruit, well balanced, little sweetness. Subtle finish with grapefruit peel.", "One of the best pale ales one can drink. Excellent smell of pine, caramel taste with balanced carbonation and moderate bitter aftertaste.", "Color anaranjado semitraslúcido de burbuja viva y fina espuma blanca periférica. Aroma intenso afrutado y algo cítrico monopolizado por el lúpulo. Sabor principalmente lupulado cob toque cítrico e incluso tirando más a ácido que amargo al principio. Final muy seco. Cuerpo y carbonatación medios", "33 cl bottle served in a snifter. Poured clear Amber with two finger off White head. Aroma: grassy hops, caramel, peach, vanilla, citrus, pineapple, orange peel. Taste: Orange peel, caramel, citrus, bitter grassy hops, vanilla, grapefruit, pineapple, Pine. Medium body with bittersweet hoppy finish. Nice!", "Lighter amber with no bubbles\n\nSweet malt, slight spice, starinise, not very pronounced, slight pine.\n\nCreamy, hoppy, herbal tea, slight citrus, very slight burn.", "Drunk at Varnavas with my fellow beer analyst @zambon who is inactive on the site. Great pale ale though I'm not a pale ale fan", "Si bien no muy atractiva en nariz ni de color (aunque la espuma es perfecta), sorprende por su suavidad y buenos matices en boca. No es la octava maravilla del mundo, pero es agradable y suave, tanto de sabor como de carbonatación.", "Clear golden/light amber pour, small white head but excellent retention. Aroma is like nothing I have experienced before, very hoppy, malt, flora, candy, stone fruits is the best I can describe but doesn't really touch it. Intriguing. Taste is sweet malts, again very hoppy, with the stone fruits, a bit yeasty and flavoursome. Moderate body and a lovely soft carbonation. Excellent.", "16-08-2020; bottle; at home (bought at Saveur Bière, as part of their July 2020 discovery box).\nThe looks of the beer are nice. Golden yellow brew that is crystal clear. On top a thick layer of frothy slightly off-white foam is formed. Foam retention is quite good. \nThe aroma of the beer is nice. The malts give a nice biscuit aroma, with touches of caramel. The hops are interesting. It has a floral bouquet, but there is also lychee, some more stone fruit and some pine. It is new world hops, with kind of a rustic traditional feel. Yeast gives some fruity aromas too. \nThe taste of the beer is nice. Quite some sweet malts are balanced by bitter hops, with some fruity sours. Well balanced.\nThe palate is good. Medium body, smooth texture and medium carbonation. The finish of the beer has some nice stone fruit and pine hops. All in all, a very nice beer. Very rustic and traditional feel, yet refreshing at the same time.", "Fles thuis geprobeerd met LiekevdV. Het is een licht troebel goudkleurig bier met een volle witte schuimkraag. Het aroma is hoppig en fruitig. De smaak is bitter, hoppig en fris.", "Hazy amber with a white head. Aroma is malt and some exotic fruit. Taste has some very curious, exotic twist, gentle bitterness.", "330 ml bottle. Ipa hoppy smell, nice golden color. Taste is herbal, kind of ment in there. Very old school. Decent.", "Bouteille de forme originale, étiquette américaine sympa. Degustée en bouteille. Nez franc de levure. Bouche amère et épicée. Très bonne.", "Bottle at home, isolation beer #11. Pours orangeish, copperish golden with long lasting off-white head. Nose is pine, malts, citrus peels, slight oxidization. Taste is moderately bitter, somewhat sweet notes of resinous and citrusy hops, bready malts and honey. Bittersweet finish, ligh body, average carbonation. Not the freshest bottle, but still pretty decent.", "Hazy dark yellow, visibly carbonated. No head.\nHops, citrus, yeast in the bouquet.\nSour bitter, hops, apple. Turns to cilantro, lemongrass, bitter. Strong bitter finish, dry.\nNot my type of beer but tasty in its own right.", "C: pale amber\nN: malt, oranges, hard candy\nP: very malty, hoppy, oranges, hard candy, slightly vegetal, grassy.", "Slightly orange pour. Bitter, very bitter but still refreshing and light. Clean, proper bitter ipa", "Six-pack received as a birthday present - cloudy orange appearance, with citrus aromas. Taste delivers similar fruits, with a touch of sweetness. Lovely drop.", "Bouteille 33cl couleur blonde dorée mousse blanche, goût sur le houblon, très légère et douce", "355 ml bottle. Clear golden to amber colour, medium head with good durability, fair lacing, lively carbonation. Nose is hoppy, grass, light pine, citrus fruit. Flavour starts rather malty, medium sweetness, followed by a well balanced bitterness with notes from bread and hop. Very good!", "Léger trouble, belle couleur.\nNez pas très expressif malgré le dry hopping. En bouche, la bière est portée sur le malt, léger houblon, bon équilibre mais carbo un peu forte.", "Fles. Wazig blond bier met wit schuim. Geur: mout, wat floraal, fruitig. Smaak: licht hopbitter, fruitig, sinaasappel, sinaasappel zeste, wat tropisch fruit. Medium koolzuurprikkel.", "Belle couleur abricot. Légère amertume, bcp de fruits, fruits jaunes, agrumes. C'est une ale us de grande qualité avec un équilibre en bouche très remarquable. 355 ML WINE and Beer Roscoff", "Pours to a slightly hazy straw yellow with a finger thick persistent head. Nice sweet malty nose with caramel or toffee notes, hint of orange peel. Very aley taste in the mouth, yeast forward almost. Lingering hoppy aftertaste, slightly soapy astringent. Ok", "Color naranja claro, sin apenas turbiedad, transparente. Espuma marfil de un dedo de espesor y buena retención. Aroma medio escaso a cereal, piel de cítricos y notas de caramelo. Sabor en esa línea, final medio, maltoso y de amargor cítrico y ligeramente resinoso, alcohol bien integrado. Textura acuosa y ligeramente oleosa. Carbonatación media aunque chispeante.", "Una APA de espuma frondosa y abundante. Color anaranjado con tintes miel y numerosas burbujas. Aromas a lúpulo, levadura, cebada, cáscara de 🍊, efervescente de naranja, miel, cuezco de durazno, \nSabor ligero, persistente, retrogusto amargo, balsámico y sedoso de pomelo rosado, hierbas silvestres, cebada, cuezco de durazno, ruda, \n\n---Rated via Beer Buddy for iPhone", "Pours a clear golden orange on tap with bubbly white foam that leaves moderate lace. Aroma of nice cascade pithy citrus notes over pale and caramel malts. Taste follows, meaning more towards a current American pale ale than an IPA, but I respect its history. I'm sure in 1975 this was amazing, nowadays it's decent and well done for what it is.", "Dorée légèrement trouble et petite mousse.\nNez agrume, houblons, fleurs.\nBouche légère, guimauve, caramel, pamplemousse avec petite amertume.\nUn peu \"de la flotte\" mais pas vraiment désagréable.", "Very rich, pleasand and refreshing beer for sure. The beer fill your mouth for fun and go down in your stomach very smooth.. The carboration is decent and help you a lot to enjoy it more.. The beer remind me some \"Imperial IIPA\" or something like that. Many fruits here.. \nOverall a nice bitter and hoppy beer to drink.. The alcohol level is ok too.. I have nothing more to say. Great!", "Pours amber with a thick and bubbly white head. Aroma of flat malt. Taste has herbal malt notes, light hop bite on the back of the tongue. Palate has resinous herbal element that lingers on the nose.", "Keg at APEX, Portland, OR in 2013. Clear mid golden with a white head. Aroma of floral hops, brown sugar, grain and dried fruit. Good balance of biscuity malt and grassy hops in the flavour.", "33 cl bottle at home. Drank on August 29th as Anchor Brewing Co. Liberty Ale (5,9%). Nice lacing and look, decent taste.", "11.07.2016\nAR: Melasse, Erdbeermarmelade, Tropenfrucht, leicht harzig, Butterkeks, Kaugummi\nAP: klares bernstein\nTA: Harz, Zitrus, Butterkeks", "Wygląd: Barwa jasnozłota, lekko opalizująca. Piana biała, średniej wysokości, drobnopęcherzykowa, opada do ostatniej warstwy, pozostawiając lacing na szkle.\nAromat: Na pierwszym planie kwiaty z subtelną nutą cytrusów i żywicy, uzupełnionymi średnią słodowością chlebową i akcentem miodowym.\nSmak: Kwiatowo - żywiczny z lekkimi, ale wyraźniejszymi aniżeli w aromacie cytrusami oraz średnio - niską słodowością chlebową z nutą miodu. W ustach półwytrawne, gładkie z średnią gorzkością żywiczną i subtelną kwaśnością. Treściwość średnia, wysycenie niskie. Goryczka średnia, albedo z grejpfruta i żywicy, średniej długości. Finisz wytrawny z przyjemnie pozostającą goryczką chmielową i nutą cytrusów.\nOgólnie kawał historii, nie można oceniać intensywności aromatu i smaku nowofalowych chmieli patrząc przez pryzmat dzisiejszych APA. Goryczka bardzo fajna, życzyłbym sobię takiej w każdej apie. Na minus lekka miodowość podobna do utlenienia.", "Bottle from Waitrose, West Byfleet. Grainy citrus aroma. Copper gold. Thick frothy white head.  Initial citrus sour edge gives way to herbal bitterness. Some juicy sweetness in the undertow. Light-medium bodied. Slick if thin. Average-fizzy carbonation. Long dry slightly astringent finish. Not too bad. I guess this is an oldschool APA.", "Color marrón cobrizo, con una ligera neblina. Dos dedos de espuma con buena retención. Aroma a malta, caramelo y pino. Gusto en la misma línea del aroma, añadiría ligero pomelo y resina, con un regusto final un tanto metálico, amargor bajo. Cuerpo acuoso. APA que tira a IPA West Coast, creo que la pillé a punto de degradarse, la quiero volver a probar cuando la encuentre fresca.", "The combination of malt and bitterness, with a creamy undertone and a citrus finish makes this a very drinkable and tasty ale.", "Bottle from Waitrose. 2nd time I’ve tried this. 1st time 2013. Original notes - Light. Fizzy. V refreshing. \nThis still applies and I would add: like an American Cream Soda.", "Anchor Brewing Coo. Liberty Ale 5.9%. Slightly hazy amber, citrus aroma, light bodied, barley malt, citrusy, orange zest, grapefruit, bittersweet finish. Lovely Pale Ale from California 🇺🇸", "Yeasty bread aroma a little on the flavor too. Strong bitter Finish. Lots of malt.", "une ale américaine relativement traditionnelle , pas de grande surprise mais agréable", "Als die Craftbier-Bewegung auch in den USA noch ein Nischendasein führte, gab es schon die Anchor Brauerei aus San Francisco mit dem Liberty Ale.\nEs ist ein tiefgründiges, rotes Ale mit ordentlich Geschmack: Hopfen trifft auf Malz und es ergibt sich eine Orgie der Aromen auf der Zunge, ohne allzu verrückt zu wirken.\nWirklich gut gelungen.", "Butelka. Wygląd - słomkowa barwa, lekko opalizujące, z piękną, puszystą pianą. Aromat - ładna kwiatowość, trochę karmelu od słodów, ale bardzo lekkie cytrusy. Smak - fajne grejpfruty, jest trochę  tego karmelku, bardzo fajna, gładka faktura, trochę krokodyle kwaskowate, jest kwiatowość, trochu jakby miód gryczany, goryczka w stronę wysokiej, o bardzo czystym profilu, z krótkim finiszem.", "Bottle at home from Waitrose, 30th March 19.  Pours a clear straw beer.  Aroma is citrus, some maltiness.  Taste is straight forward, citrus, good balance, not overlly bitter.  It's not remarkable, but nice", "A hoppy APA, but not quite and IPA.  First time I tried this actually...grabbed a 6-pack to start.  Could be one of my staple APAs now.  Found it similar to one of my favorites in this style, Stoudts, but both maltier and hoppier.  Mouthfeel is crisp, but not supersmooth otherwise would lose some flavor.  Semi-creamy texture...sort of like their other beers.  Another solid brew by Anchor!", "Une très bonne pale ale trouvable en grande surface qui change un peu de la Sierra Nevada ! \n\nLe packaging a fait que je me suis arrêté dessus : No regrets", "Rami Rami is drinking a Liberty Ale by Anchor Brewing Company at Hoppiness Beer & Food\n\nNie jest zabardzo utlenione :) jest fajnie puchate. Slodkawe, tropikalne, visolvitowe, troche goryczki... raczej pozytywne zaskoczenie\n\nRami Rami: Chociaz ma tez nutki jakiegos plynu do naczyn?\n\nRami Rami: A goryczka moze niewysoka ale dosc dluga, w polaczeniu z kwaskowatymi posmakami\n\nRami Rami: Troche sztuczne wrazenie z tych aromatow owocowo-plynowych ;)\n\nRami Rami: No dobra, argument dla przeciwnikow panelu... pierwsze pol szklanki: 3.5... potem 3.4... teraz zaczyna draznic, 3.3\n\nRami Rami: Dziwne jest\n\nRami Rami: A moze to jest na A R O M A T A C H chmielowych jakichs? Jesli tak, to z dupy te aromaty", "Tonalidad anaranjada, espuma débil, burbujas locas y que desaparecen rápidamente, notas a fruta y algo cítrico, con final refrescante y cítrico", "Bue avec un ami 33cl\nUne jolie robe blonde orangée.\nFaible mousse.\nPetite carbonatation.\nNez Citra.\nFruitée et saveur d'une Indian Pale Ale", "Bottle from Damian. Clear golden colour with medium white head, aroma is very hoppy, orange peel. Taste is medium bitter, slightly sweet, lots of hops and citruses, especially orange, light body, long citrusy finish. Very enjoyable", "Yellow colour and medium cloudy, withe and heavy head with good retention, citrus aroma, medium body, herbal and citrus flavour.", "Flasa z damiana. Vona chmelova nie moc vyrazna. Farba zlatista pena sa drzi. Chut mierne horkasta, vyrazna.", "Color naranja cobrizo medio turbio con espuma media beige que baja hasta formar una fina capa y residuo escaso. Aroma a lúpulos herbales, caramelo, tierra, naranja y algo de levadura. Sabor maltoso a cereal integral, pan tostado y caramelo con notas lupuladas de fondo, hierba, tierra, cítricos maduros y nota a frutas de hueso. Regusto medio y amargo terroso con ligero dulzor cítrico. Textura acuosa, cuerpo medio y carbonatación medio-alta. Una Pale Ale de corte clásico, con buenos carácteres maltoso y lupulado cítrico que encajan bien.", "Verkostung im Bierweltweit, Thema US- Biere, #2. Goldenes, trübes Bier, riecht malzig, nach Mango, schmeckt nach Grapefruit, leicht wässrig, was aber durch eine angenehme Bitterkeit im Abgang übertüncht wird.", "Robe orangée, belle mousse fine, mais faible tenue. Nez très floral, houblonné et malté. En bouche, l'attaque est plutôt maltée, puis se développe un fort côté houblonné, avec une belle amertume. La bouche est assez sèche, rafraîchissante, mais manque de rondeur.", "Uit blik. Zoet, mout, iets karamel, prima bitter met harsige en pijnboomachtige kantjes. Classic type IPA. Erg prikkelig en langbkn de nasmaak.", "Tap@Kulma 26, Tampere, Finland. Medium, balanced nuances of pine, slightly overaged fruits, citrus and sweetish grains. Averagely hopped. Medium body with medium carbonation. Overall, great combination of refreshing fruits and malty notes. 9 3 9 3 18", "On bottle.\nPours close to hazy yellow, with small head.\nScent: Banana, yeast.\nTaste: Hoppy, Banana, yeasty.\nTexture: Medium co2, long aftertaste.", "Tropical fruits from American hops, resin in aroma. Yellow, haze with small white head. Resin, malt, medium bitterness in the finish. Medium body, medium carbonation.", "Aroma: Dominated by fruity (mango, orange, lemon, grapes), floral, herbal and grassy hop notes. Malty caramel background.\r\n\r\nAppearance: Orange with a touch of haze. Huge, frothy white head.\r\n\r\nTaste: Slightly sweet, quite high bitterness.\r\n\r\nPalate: Full body for a pale ale, average carbonation.\r\n\r\nOverall: Very pleasant pale ale, nice hoppy aroma backed by malts. Classic, day-to-day beer.", "Złocista barwa, delikatna opalizacja, ładna, obfita piana, tworzy efektowny lacing. Aromat może nie jest oszałamiająco intensywny, ale jest przyjemny, głównie cytrusy i winogrono. W smaku bardziej słodowe, trochę biszkoptowe, jest też nuta owocowa, ale i trawiasta. Wszystko to kontrowane zaskakująco wysoką goryczką.", "Flaska.Pena smotanova rychlo padla.Farba je medova a silnejsie zakalena.Vona je jemne sladova,korenista,citrus.Chut jemne sytena,troska citrus,zemitost kvety.Telo prazdne.Dochut jemne horkasta", "Aroma; malt, caramellized hops, fruit. Look; off white head, close to clear golden body. Taste; malt, candies, hops, crystal caramel, fruit, grass, and finishes to the malted side. Feel; good juicy body and ok co2. Overall; quality classic beer. [tasted@Cph Tryk Bar May'2018] 5484'15", "Gyllen, fruktig, marmelade, ufrisk...................................................", "Bitter. Väldigt mycket kolsyra och syra. \n\nSaknar en del fruktighet. Inte min typ av öl men helt okej.", "355 ml bottle, bb 03/2020.\r\nGolden, clear.\r\nNose - malt, some unexciting hops.\r\nTaste - bitter. \r\nToo oldschool. No.", "Maybe it’s because I just had an IPA. But I am not tasting a whole lot with this lil’ guy. I’m sure it’s not bad though, hence why I gave it such a high rating.\n\n---Rated via Beer Buddy for iPhone", "Een mooie amberkleur met een witte laag schuim, in de geur zit citrusfruit, perzik, ananas en hop en in de smaak is de hop ook weer duidelijk aanwezig.\r\nIn de afdronk is droog en de nasmaak is iets plakkerig, honing of siroop.\r\nGoede Ale.", "Bottle 355ml at home. BBE 2-2020. From Alko. Pours clear golden with white head. Pale malts , light fruityness, floral hops, sweet caramel flavor, light grapefruit. Medium body, average carbonation.\r\n\r\nOriginal rating 7-3-7-3-14 from bottle 355ml at home 2011-04-03.", "Barwa złota, piana biała, skąpa. \r\nAromat mało intensywny, słodkie białe owoce, nafta i pieczywo.\r\nW smaku lekkie, bieszkoptowa słodycz pojawia się na chwilę, średniej wysokości goryczka, nieco trawiastą, bez wyrazu i zalegająca.", "Цитрусы и травяные оттенки в запахе. Прекрасно сбалансированный вкус-опять же цитрусы, трава, небольшая хмельная горечь. Очень питкий. Прекрасный образец", "Aroma is herbal, spruce, and resin hops.  Cloudy with an amber color. frothy head.  Heavy bitterness; an old school IPA, I guess.  Medium body with sticky texture, soft carbonation", "Bottle. Foggy deep golden. Small white head. Nose: floral hops, biscuit malts. Light to medium body. Taste: clean pale malts, floral & spicy hop. Feels quite British. I did not recognize Cascade hop.", "Bottle from Bitter Virtue. Rather pleasant APA with a hoppy and fruity taste.", "One of the first ‘craft’ beers I ever had back in 2008.... still great still distinctive. Soft fruits, little bubblegum, sweet then medium dry. A little thin bodied. Legend.", "35.5cl Bottle. Malty, hopps ++ , white pepper- juniper - bubblegum - leather. Not for people unexperienced with such beers", "Puszka 330ml. Lekko metnawy bursztynowy kolor. Piana biała, obfita,z drobnymi pecherzykami,opada powoli. W aromacie mix owoców tropikalnych i czerwonych cytrusów. W smaku słody, brzoskwinia,karmel,ciastka , mango,czerwoną pamarancza.lekkie kwiatowo-miodowe nuty. Niezły balans, małe wysycenie", "Klar bernsteinfarben mit weißer Schaumkrone. Malziger, hopfiger, fruchtiger Geruch, Geschmacklich ausgewogen malzig, fruchtig, hopfig. Mittlere Süße mit mittlerer Bitterkeit, mittlerer Körper mit spürbarer Kohlensäure. Schmackhaftes Pale Ale.", "0.355 l bottle from Alko Arkadia, Helsinki. Appearance is like modern California APA, but taste is quite heavy. Aroma has resin from pine trees and taste does not differ from that. So this is what Cascade hops taste. This must have been really something diffeant in 1975. It still feels quite heavy hopped. Not for beginners, but should be experienced when you are ready.", "Very nice but a little too dry and with a slightly watery body on the finish. I like it.  But I think there are better beers out there with slightly more going for them, hence I rate this 8/10.", "corona de espuma densa con buena retención, sin llegar a ser una excelencia es una cerveza agradable de beber, muy correcta, quizas repita pero sin buscarla.", "Muy aromática, notas frutales, un dejo ácido en el retrogusto.  En general una muy rica apa, muy tomable y me atrevo a decir similar  en aroma a una Fuller’s.", "Fles 35,5cl thuis. Bitter hop (Cascade), 'pils'smaak. Klein beetje citrus, pine. Bittere nasmaak. Fruitig. (7-2012)", "Bottle. Clear cobber with a lasting off-white head. Malt, hops , lemon, caramel, pepper. It's not bad.", "Pivo u flaši. \r\nPopijeno u Stella Beer2Go dućanu i kušaoni piva u Medulinu .\r\n\r\nDakle , ovo se smatra prvim 'modernim' American Pale Ale pivom i prvim Craft pivom uopće. \r\n\r\nZnači da svi poštovatelji Craft pivarstva i koji cijene te ljude koji se trude u 'garažnim' uvjetima 'skuhati' pivo moraju probati taj Anchorov Ale koji oni još uvjek rade po orginalnoj staroj recepturi , da vide kako je ta i sa čime 'revolucija' počela ! \r\n\r\nTo je Chuck Berry među Craft pivima :)\r\nJa neću ništa napisati o mom kušanju ovog piva jer to jednostavno svaki pivoljubac kao što rekoh mora probati makar jednom.", "0.33 l can from Beerlovers, Vienna. Shared with Nicky and Charlie. Drank from the can on the bus. Moderately hoppy. Fruity, some apricot, candy, some herbs here and there. Sweet and a bit harsh. Medium body, moderate carbonation, moderate finish. On the sweet side, not bad. Fresh.", "citrus, herbs, orange, golden, amber, sparkling, white foam, rocky head, frothy, medium bitterness, medium sweetness, lightly sour, medium body, oily feel, lively, bitter,", "(blond cuivré, nez guimauve-arlequin-barbe, bouche facile, sucrée, amertume sobre qui se distingue, powerly hoppy)", "12floz bottle, BOD: 07.20.2017, $1/75 unit cost, pint glass. This bottle is a tad beyond it's prime, so it would probably be more like a 3.5ish beer if fresher. That being said, Anchor products are not shipped as much to my area nor as fresh as they used to be when options were limited. All in all, this dark golden old school APA offers up biscuity citrus aroma/taste notes wrapped in neatly medium everything feel.", "Gedronken met Peter, goed in balans, lekker fruitig, licht caramel, weinig bitter, subtiel zoet, goed te doen", "Prety much like a well balanced and less hoppy ipa with decent maltiness and subtle caramel.", "Très belle robe acajou/abricot translucide avec une belle mousse blanche à bulles fines. Arômes à l'équilibre entre les malts blonds et les houblons (dry hopping en Cascade sur cette bière) avec un miel fin, un caramel qui l'est tout autant, des effluves de croissant et de pain chaud, un peu de pomme verte, de poire, des notes de camomille et de verveine, de groseille, de raisin blanc, de baies blanches, de reine-claude jeune... En bouche, belle amertume, un peu de sécheresse rappelant quelques vins blancs secs, alcool qui fait le job sans plus, quelques sucres résiduels qui adoucissent l'ensemble... Le corps est moyen, un tout petit peu sur l'eau, la carbonatation est assez vive. La longueur est bonne, essentiellement basée sur l'amertume et les notes végétales. Une bonne petite APA sans grande surprise et qui fera le bonheur des amateurs d'IPA légères de part son houblonnage vif et de Ales légères Anglaises de part ses notes maltées. Bouteille 35.6cl, Boissons du Monde, Saint-Egrève.", "Anchor Liberty Ale.  Botella 33cl en Gambrinus Beer Shop, Córdoba Capital, Argentina. \nUn espectáculo para los sentidos. Empezando por la vista. Cobre anaranjado, gasificacion media, burbujas muy finas. Espuma esponjosa, con muy buena adherencia a la copa. Aromas cítricos otorgados por el lúpulo.. En entrada en boca es amarga, luego se siente apenas el dulzor de la Malta. Predominante el riquísimo amargor del Lúpulo. Bien seca en el retrogusto. Sumamente cítrica. Cuerpo medio. De inmediato se convirtió en una de mis Cervezas preferidas.. Aplausos para Anchor Brewing 👏👏", "Hazy golden colour with snall white foam. Aromas of light sweet of fruity hops and sweet malts and bread. Palate, medium full body with smooth texture leaving dry finish. Taste, sweet of malts, biscuits and fruity, herbal hops. Overall, rather nice easy going session ale.", "Very fresh aroma of noble, but herbal hoppiness with some floral notes and wet malt. Translucent golden in the glass with thick white head. Taste is semi dry with notes of noble hops, earthy notes, bit herbal harshness with floral notes. Very drinkable and refreshing. That's the point. Love it.", "Pours amber in colour with a floral aroma. Tastes sweet and fruity . We’ll backend beer", "Pours a clear light amber color with a well laced white head. Aroma is light resin, with some floral notes. Taste is balanced with notes of pine resin, floral hops and caramel lighter body with a slightly bitter hop finish.", "Boa cerveja, frutada e com um amargor agradável. Além do lúpulo estar bem presente no cheiro e sabor.", "Almost clear orange pour with a medium sized head. Very fruity aroma of grapefruit and peaches, pine tree, honey and caramel sweetness. Taste is mildy bitter sweet. Medium bodied and same carbonation. Tasty, refreshing. Loved it!!", "An american, amber, cloudy Fresh Hop APA with high, white head. Aroma is hops, malt, light tea? Taste is bitter.\n\n---Rated via Beer Buddy for iPhone", "Pours a bright golden light amber with a big white foamy head. Crisp, tart, vinegary aroma. Medium body. Smooth with the feel and taste of a heavy lager. Bold malt flavor with only a light bitterness. Smooth finish with a decent lingering aftertaste. Pretty enjoyable.", "Pours a hazy gold, decent snow white head. Hoppy, herbaceous aroma with some IPA type notes. Taste is of citrus, hops, resinous pine, slightly bitter finish. A good well-balanced beer.", "Kolor jasny bursztyn, opalizujące, piana obfita, górzysta, drobne pęcherzyki, zostawia lacing.\r\nW aromacie kwaskowo, drożdże, karmel, żywica, drewno, cytrusy, kwiaty, owoce tropikalne.\r\nW smaku mało intensywne. Lekko kwaskowe, wyraźny słód pale ale, lekkie nuty cytrusowe, żywiczne, ziołowe. Drewno. Posmak chmielowy. Finisz raczej wytrawny. Wysycenie raczej niskie. Goryczka jest, niska do średniej, dość długa.", "33cl can. Poured a hazy light golden colour with a frothy white head. The aroma is dry yeast, woody, light floral, metallic hop. The flavour is moderate bitter with a light, crisp, fresh, light fruit, floral hop bitter palate. Medium bodied with average carbonation.", "Fabe: trübes orange \r\nSchaum: fein, dünne Schicht beständig \r\nNase: hefe, nach Mostkeller. Bisschen mach grapefruit. \r\nGeschmack: recht trocken und bitter, Abgang Bitterorange, aber auch schaumig und leicht hefig, wird fruchtig getreidiger Richtung Nachgeschmack. Dann aber kaum Nachgeschmack bis auf leichtes Prickeln auf der Zunge. Ziemlich gutes Bier, immer wieder gerne.", "From Feb 2006\r\n\r\nPoured from bottle(room temp) a medium gold with a large head of foam that dissipated very slowly\r\n\r\nThe smell is all fruity and hoppy...very good scorer in that department.\r\n\r\nThe taste is a nice spicy hoppy up front with a bit of malt moving in midway through. Very nice. The finish returns to the hoppy side though not as intense but it's very satisfying for me and thus makes it a brew that I give high drinkability marks to.\r\n\r\nBottom line: This is one tasty heck of an American Pale Ale and I'm glad it is so widely distributed. Highly recommended!\r\n\r\nEdit: Revisiting June 21, 2008\r\n\r\nIt's been a while since my last Liberty Ale and after reading a BA thread on it, I thought I'd get another 6 pack and update my review, which was fairly non descript.\r\n\r\nPours a light amber gold with a good 2 finger billowy head of foam. The head on this beer is really impressive.\r\n\r\nThe smell is as fruity and hoppy as I noted earlier and again, it makes promises that last time, it easily kept.\r\n\r\nThe taste has a vey nice balance between the hops and the malt. The hops inject a very nice lemon flavour that falls just short of being really bitter to me; more of a tartness. The malt has some sweetness to it along with a touch of roasted, but not too much, and a touch of bread. Great stuff and a very good beer to have after having just mowed the lawn. And...it has a great longlasting aftertaste.\r\n\r\nOverall, I'm not going to change my score at all; the current one speaks for itself as a testament to how much I like this American Pale Ale. One of *the* best in the style!", "Beautiful orange color with a dense white froath. Smells like hop and citric. On the mouth it’s fresh and herbaceous. The after taste is at the same time, very fresh and very bitter that I really liked. Exceptional beer.\n\n---Rated via Beer Buddy for iPhone", "Copenhagen 15/9 2017. 35,5 cl bottle from Meny. They managed to cram both an Anchor, an Eagle and a lot of hops and Corn Ears into the label. Crowded but impressive. Pours hazy golden amber with fluffy white head. Moderate lacing. Aroma is intense and sweet with strong citric notes. Rather strong carbonation and medium thick palate. Flavor is medium sweet followed by strong bitterness. Aftertaste is bitter and finish dry. Good one.", "Bottle from Pezinská pivná pumpa. \r\nSo this is sort of a history right? I wouldn't really call it liberating. It's okay, not bad, but still I would appreciate more hops in taste.", "12oz bottle at home. Hazy golden-orange with a medium off-white head. Floral and citrus hops, orange, tangerine, light caramel sweetness. Medium bodied, medium carbonation. Nice hoppy finish. Excellent.", "Bottle, UK import, source not recorded. Backlog entry. Entering my historic scores for US beers whilst visiting New York. No tasting notes kept, just rating.", "Botella 33 cl en el Lúpulo Oviedo diciembre 2010. Fcpref 03..2011. (r3057) Fresca con suaves cítricos y afrutados. Cuerpo ligero a medio algo espumoso y cierta densidad. Fina. Bastante buena.", "Aromas frutales y cítricos\nBuen aspecto espuma poco persistente en boca fruta madura y caramelo, final cítrico \n\n---Rated via Beer Buddy for iPhone", "I poured it from the bottle into a pint glass. It pours copper with a big, fluffy, off-white head and lacing. The aroma is caramel, hops, and dark fruit. The taste is caramel, bread, and hops. There’s a nice bitterness balanced with subtle sweetness. It’s very smooth up front with some carbonation on the back end. This is very good without trying too hard.", "Bottle at home. Good light amber color, very nice beige head. Fine taste, a good beer to drink a few!", "7/20 tastes lagery and pretty watery, malt taste and slight bitterness but nothing of interest. tastes weaker than 5.9", "Tropical fruity, alumalty und nett lemonbitter. Kann man immer wieder machen👍. Nicht mehr nicht weniger😉. Kratz sogar a little bit👌. Orangenabrieb spüren meinen Sensoren ebenfalls. A Gift from NICO & WENKE !!??? 355ml Bottle.", "Pours amber with a good head that dissipates. Nose is malt, grain and some orange rind. Taste is pronounced malt with some bitterness, suits the beer. Robust and satisfying. Good.", "Fine and gold-standard-ish pale ale from the US. Not the best one around, but will certainly give you all basic ingredients a pale ale should offer.", "Dzeras ļoti viegli. Mierīgs amerikāņu eils. Neuzbāzīgs rugtumins, noturīgām lutām", "33ml Bottle at MDP. \nNice to be able to finally taste this classic Californian pioneer!", "Can. Pours a hazy golden color with medium-sized off-white head and average carbonation. Hoppy aroma with citrus notes. Somewhat bitter hoppy flavor with a big citrus element. Bitterness is mellow on the palate. Medium bodied and quite nice.", "Color dorado, translúcido, con capa de espuma blanca de dos dedos de grosor (buena retención). Carbonatación suave. Textura acuosa. Aroma terroso, ligeramente cítrico, con grano presente y algo herbal. En boca los cítricos están más remarcados, con ese carácter terroso que hay en aroma, base de grano y ligeramente herbal. Amargor final suave que continúa en regusto junto con algo de resina. Seca. Amargor manejable en postgusto.", "35.5cl bottle at home. Appearance: pale straw with medium white head. Aroma: hoppy, orange zest/limonene, honey, stonefruits. Taste: medium sweetness and medium bitterness. Notes of hops, apricot, limoneneand banana. Palate: medium bodied, watery texture and lively carbonation.", "En aning bitter och ordentligt med beska. Jag saknar en aning fruktighet. Totalt sett en hyfsad tolkning av stilen.", "355 ml bottle, served in flute. Pours pale orange with thick white head. Grapefruit, caramel, hops, grass and orange zest. Hoppy bitterness and fruity. Medium bodied and soft carbonated. Bitter finish and long-lasting aftertaste. Nice.\n\n---Rated via Beer Buddy for iPhone", "Rigtig humlet øl, med en god maltet sødme. Rigtig god øl...................", "Proefglas van 33cl-fles op Feniks & Friends te Heule. U: Helder goudblond met een witte schuimkraag. G: Floraal, honing, wat anijs en wat tropisch fruit. S: Tropisch fruitig met een lichte bitterheid. Floraal. M: Doordrinker met medium carbonatie.", "Bu au festival à la brasserie De feniks\r\nverre de 15cl.\r\nCouleur blonde dorée avec de beau reflet de belle brillance .\r\nmousse diffuse et fini sur un col qui redescend progressivement .\r\nAu nez : Note épicée , un peu honey et graineux je trouve comme de la fenouille ou bien de l’anis mais leger .\r\nEn bouche : miel présent qui donne de la rondeur en bouche .\r\ndes notes épicées sont de la partie . un bon corps porté par le cereales .\r\namertume plutôt faible mais perceptible en arrière bouche .\r\nun bon corps et de belle ligne .", "Bottle. Amber color with lacing off-white head. Aroma has citrus, grass, caramel. Taste is malty with quite bitter aftertaste. Flavors of citrus, grass, malt and toffee.", "Aus der Flasche getrunken (Händlerlieferung). Schönes leuchtendes Orange im Glas mit weißer Schaumdecke. Leichte, herbe Hopfennoten in der Nase. Gute Balance zwischen Fruchtigkeit und zarten Bitternoten.", "Clean amber color with a fluffy head of cream colored foam. Toast, caramel, and hint of plum with a balanced hop bill to cut through. Smooth and crisp, sweet and dry. A classic.", "Espuma blanca con tonos beige cremosa y permanente, color dorado anaranjado bastante cristalino y donde se aprecian finas burbujas brotar constantemente, aroma intenso en nariz a frutas cítricas, sabor con notas amargas pronunciadas y regusto permanente y sabroso.", "Can at Beerdock Leek. Pours a clear deep golden colour with a medium white head. Aroma of roasted grains, some bready malts, slight banana, a little plastic, a hint of fruit and subtle floral hops. Taste of bready malts, some caramel, slight lemon, orange, a little fruit, a hint of grain and subtle floral hops. Medium bodied and moderate carbonation. A lingering, dry, floral hop bitterness in the finish. Maltier and quite British for its style. Fruity, slightly estery and a floral finish. Solid I suppose.", "Achetée chez Hopla Boisson à Sierentz par Jess. Bière blonde dorée au nez malté et amère. Bouche amère type Pils. Pas trop mal.", "Bottle from Alko Kokkola. Pours copper coloured with a small head, smooth taste. Hops alot and a little taste of citrus in between. decent", "I cant believe I havent rated this classic beer yet. Clean bready/cracker malt aroma with a hint of green grass. Slightly hazy light/medium yellow body with a small white head. Smooth, almost creamy body with straightforward crisp toasted malt flavor with a dry woodiness. Somewhat brash grassy, thistly bitterness with a slight citrus rind/pith dry tang comes barging through to really take over the malt flavor. That bitterness plants itself firmly in the mid to back tongue and then allows the slightly sweet bready malt to return. Lasting dry bitterness with a touch of honey on the finish. Great, classic beer from a great, classic brewer.", "Very malty with interesting fruity flavours (dried apricots, figs). Humble bitterness. Very good indeed.\n\n---Rated via Beer Buddy for iPhone", "12 ounce can at home. Smells very nice with slight aroma of the hops Big white head Film on glass. Taste very nice. Very well balance between hops and malt. Smooth on the palate Overall super nice beer. Very drinkable any time of year.", "Bottle@Cool Bun, Brussels. Hazy orange, white head. Roast malt, hops, citruses. Balanced bitter taste.", "pours a murky orange gold with a persistent billowy off-white head. mild floral and citrus hop aroma. great taste! A nice balance with light malt at first and then the mild hop bitter kicks in and lingers. A well balanced easy drinker. Good beer!", "Well, I like it! This classic American beer may not be for everyone, but it stills holds up after 40 years to me! It pours a nice amber orange cloud with a medium head and a citrusy apple juice smell. The taste is maltier than most modern pale ales but with just enough hops to remind you where it is coming from. It’s very drinkable and smooth, but comes across more lagery in its mouthfeel than most APAs. Good for a post Mamouns binge couch watch a thon for the final Kigurumi day of the season with yr bae-gul.", "From Decervecitas. In Teku glass. Playing 8 Bit Adventures. Suprising profile for an ipa.Pretty malty, with strong toffee. Pretty bitter to but without usual american fruityness, just some citrusy end", "Fresh aroma, a tad hazy but not bad. powerful hit on first taste of grapefruit with subtle hops underneath. Very enjoyable and another classic from Anchor ?", "Aroma: faint roasted malt, amber orange colour, big lively fizz - looks great in the glass. Taste is malt and some wheat and the beginning, almost a rye-esque backbone. Well balanced hop-bitter end, with a bit of pine.", "0,3l bottle. Nose: citrus, honey, malty. Taste: grass, honey, bitterness in the end.", "Clear orange with a huge head\r\nHops, grapefruit malty notes.Bitter finish. \r\nNice but was expecting more given the famed brewery..", "Botella en 99Cervezas.\r\n\r\nEn nariz es de intensidad media, destacando quizá en primer lugar las notas frutales, con ciruela claudia, plátano y algo de almíbar de melocotón. Es un conjunto claramente dulce. También da algunas notas herbales suaves. Complejidad media y de aroma muy agradable.\r\n\r\nVierte en color dorado-ambarino y turbio. Abundante espuma casi blanca, densa, de burbuja y persistencia medias.\r\n\r\nContrariamente a lo que cabría esperar de las notas predominantemente dulces en nariz, el sabor que más destaca es el amargo, aunque se acompaña bien de un fondo dulce y salado. En el retrogusto aparecen también las notas frutales, aunque de una forma menos preponderante que en nariz, compitiendo aquí con notas herbales muy frescas.\r\n\r\nDe cuerpo medio y sedoso, resulta tremendamente refrescante gracias a su amargor marcado pero muy suave. La persistencia en boca es media-baja sin llegar nunca a llenarla.\r\n\r\nUna cerveza de trago largo muy agradable de beber, que mantiene un interesante equilibrio entre ligereza (más que nada por su corta persistencia en boca) y su carácter sabroso. Gran bebestibilidad.", "Clear golden with one finger dense white head. Light fruity aroma with orange, citrus, mango, light malts and light apricot. Taste is light bitter with orange, citrus, mixed fruitiness and light malts. Light to medium mouthfeel, light carbonation and light hoppy aftertaste.", "Can from Asda, Purley Way. It pours hazy copper with a medium white head. The aroma is fresh, bitter - sweet, piney, resin, stewed orange, peach. toffee and cake. The taste is bitter, earthy, pine, resin, sweet estery fruits.... pear, melon, but also grapefruit, peach, peppery spice and caramel. Finish is firmly dry and woody. Bit of alcohol kicking about, Medium body and average carbonation. Still pretty solid after all these years.", "(Bottle) Pours hazy amber brown with small short-lived white head. Nice citrus aroma with pine and caramel hints. Light body with nice fine carbonation. Nice complex taste. There’s citrus, something resinous, apricots in the foretaste. Some burnt toffee hints appear in the mid palate. There’s a pleasant long bitter finish. Very drinkable - complex, interesting and tasty.", "355ml Dose. Dunkelgolden mit leichter Trübung und kleiner Schaumkrone. Fruchtiges Honigaroma. Feinherb im Antrunk. Süffig. Ordentlicher Körper. Etwas trockener Abgang.", "Warka 04/2018. W aromacie cytrusy i trochę żywicy. W smaku podobnie. Wytrawne, lekkie i pijalne. Dobre piwo. Degustowane jako symboliczne zakończenie etapu fascynacji mojej przygody z piwem rzemieślniczym.", "Liberty IPA; a modern twist on a craft classic. \r\nDank and resinous pine aromas with bold, citrus and grapefruit notes on the back end. Assertive bitterness with hints of light biscuit malt base and a smooth, dry finish. But you should really try it for yourself.\r\n47 UBA (hops bitterness)\r\nresin, citrus, amber, hazy, frothy, medium sweetness, medium bitterness, medium sourness, medium body, creamy,", "Asda BBD 10.01.19. Aroma is very sweet with a little bit of vegetal/vomity smell. It tastes OK but with a slightly cloying sweetness then a light bitter and spicy quality. Not sure of this is an off batch or just not at its best.", "355ml can. Pours an opaque copper orange with an off white lasting head. Nose is bready, caramel, toffee, floral and dried fruits. Medium rich mouthfeel. Taste is rich in the malts, bready and sweet, leading into a floral, dried citrus fruit and apricot, slightly dry and piny bitterness. A good example of this classic American style. Lovely.", "Golden color. Aroma: mango, flowers, citrus. Good taste with grapefruit in finish. Bitterness is medium. Good beer.", "La luppolatura è generosa soprattutto nell’ ottimo e evidente aroma di pesca che sprigiona. In bocca si perde un po rispetto al naso. Ale molto buona.", "Klares Orangegold mit reichlich Schaum. Malzig, etwas Karamell, fruchtig, Grapefruit, Zitrus, blumig, süffig.", "Piwo skonsumowane. Ocena na podstawie retrospekcji w celu uzupełnienia profilu.", "From bottle in shaker. Pours with Cu hue and pillowy white head. Aroma is faintly fruity with hints of pine. There are fruity elements in the finish which remind me a bit of Anchor Steam", "Cask. And Bottle. Orangey Gold in colour. Hoppy (resiny hops, nice hoppy bite). Citrus-fruity (grapefruit & lemon). Malty (sweet malts, caramel). Sweet-bitter hoppy fruity throughout. Long dry citrus aftertaste. Refreshing, easy drinking beer. Nice pint! (2008)", "Bottle : 355ml,  Price : 0,99 eur\n\r\nTinkamas vartoti .....", "355 ml bottle. Pours a hazy orange with a large off-white head, good lacing. The aroma is lightly malty and very lightly hoppy (floral, some citric fruits). Medium body with a low to medium carbonation and a light bitterness - balanced. The flavor is malty, dried fruits, green grapes with a hoppy bitter finish.", "330 ml bottle, hazy amber with off white head\r\ncitrus, honey, malty, saffron\r\nlight body, balanced, light bitterness in finish\r\nwatery texture, drinkable", "Cloudy dark orange color. Nice orange peel citrus with a bit of hops kick. Very tasty without being overwhelming. Nice simple balanced apa", "Hoppy bomb, hazy orange, beige top. Pine and citrus, very crisp and with typical American fragrances. Solid and light bitter finish at the same time. Full mouthfeel. Such a good stuff!", "Thanks Ivan R. and Karlo! Clear shiny orange-golden body. Big, lasting white head. Caramel, candied fruit, green fruit, big maltiness. Nice soft fruity-herbal hops on big caramel. Very good balance, interesting taste. Liight alcohol touch. Soft generally. Fine enough.", "Piłem na pierwszym festiwalu w Warszawie. Uzupełniam swój profil na ratebeer.", "Ampolla de Vins j. Carreras. Cervesa amb aromes afruitats dolços i madurs de plàtan, préssec, taronja i mango. En boca es amarga i seca. Bona.", "More subtle than I was expecting but very nice. Better on a baking hot day I expect. Citrus and honey on the nose. Subtle malts and bitter hops taste, quite thin-bodied.", "0.355l bottle from Csakajósör. Nice persistent off-white head, floral, yeasty aroma, with some citrus in the background. Taste is complex, bittersweet, sweetness is coming more from fruitiness than from malt, though. Palate is relatively strong, lively carbonation. Mildly bitter aftertaste. This is an APA with some Belgian influence, quite good.\nRated again in 2018, this time drinking from can. Adjusted the score to reflect that this is indeed a great beer. This time I feel the APA-Belgian Blond \"marriage\" even stronger and that is indeed a harmonic and unique combination.", "Bottle from Kiwi. Pours golden with a white head. Aroma and taste is hops, citrus fruits, caramel, bread, malt. Medium body. Soft carbonation. Bitter finish.", "Bottle. Clear golden with white head. Hoppy. Aroma of citrus, grapefruit and floral/herbal. Malty backbone. Light notes of spicy yeast. Starts light sweet and finish medium bitter. Light and juicy. Decent.", "Pours a golden orange color. About two fingers or more thick white head. Long lasting head. Good retention, okay lacing.\n\nAroma is very floral. Some earthy. It smells great, although really too good. It’s almost like lotion or something.\n\nTaste is light, floral, hoppy bitter. I can’t really taste anything, it’s so aromatic, it takes away from the flavor.\n\nMouthfeel is medium light. Drinkability is very high, but there so much going on in the aroma it detracts from everything else.\n\nOverall, tone down the aroma. I’ve had beets that smelled so bad they were almost undrinkable. The reverse is true here. It’s hard to drink because it smells so good. Maybe after a few more things will change. It’s good. I’d buy it again, and It makes a great gift.", "0.355l bottle. Golden color with medium white head. Aroma: grapefruit, juicy, hint of candies. Taste: citrus, candies, earthiness, malt. Medium body, lively carbonated, dry finish.", "A bottle at Bar Eleven, near Tai Power station. Aroma: fruity and hoppy, very inviting. Appearance: opaque amber with disappointingly negligible head, although the bottle was certainly not out of date. Palate: light-bodied but with satisfying texture, soft carbonation. A long bitter finish, with a satisfying hit of alcohol at the end. Taste: dry, heavily bitter, pepper from the alcohol. A well-crafted beverage, reminds me of ’Proper Job’ from home.", "Aroma: malt, bread, some citrus and flowers. Taste: semi-sweet, malty, grassy. Low carbonation.", "12 oz can pours a clear light amber color with lasting white head that leaves good lacing. Aroma has bready malts and citrus hops. Taste is on the bitter side, with nuts and biscuits coming out in the finish. Body is medium with light carbonation. Easily drinkable and well balanced.", "W aromacie nuty słodkie, nieco landrynkowe, nieco karmelowe, do tego drożdżowe, czuć też kwiaty. W wyglądzie dość klarowne, barwy jasnego bursztynu, piana całkiem obfita, zdobiąca szkło. W smaku karmelowe, drożdżowe, nieco ziemiste, goryczka łodygowa. Ogólnie smakowo i aromatycznie dość przeciętne piwo, natomiast trzeba pamiętać o jego wkładzie w rozwój craftu", "XggjetgvgjjfgjugbjhccnRdsjrxtvtdhrgg3tvrtgrtftvfthbbfhcdgjbgyiftyundthhhghj \n\n ---Rated via Beer Buddy for Android", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "Golden orange little hazy beer. Sweet fruity Aroma. Fruity flavour with citrus, hops and orange.", "Pour from a 12oz bottle. Clear pale amber brew with two fingers of thick egg-shell colored head that seems to last forever. Aroma of cascade hops, caramel, spice. Taste is light caramel malt with faint cascade hops notes, a little spice towards the end, finishes sweet. Overall rather plain.", "Espuma blanca y cremosa que dura poco pero siempre se aprecia una fina capa que va dejando un buen encaje en la copa.\r\n\r\nTiene un color ámbar anaranjado. Es una birra bastante más “cremosa” que otras del estilo. Su “Dry Hopping”con lúpulo Cascade la dota de un aroma excepcional a fruta y muy floral.\r\n\r\nEn boca es sabrosa y potente.", "355ml bottle @ Home.\r\nAroma: not very intense. Hints of yeast, spices, malts, herbs, fruits.\r\nAppearance: excellent appearance. Slightly light amber color with huge, super creamy, and perfectly white head with above average retention and some Brussels’ lacing. No hazyness, perfectly clear.\r\nTaste: light-to-medium sweetness, medium bitterness, very light sourness. Flavors of malts, spices, some citrus, herbs, grapefruit, fruits.\r\nPalate: light-to-medium body, watery-to-oily texture, average carbonation, quite long dry finish of malts, hints of spices.\r\nOverall: excellent appearance, not very intense aromas or flavors. Hints of spices, malts, herbs, fruits, grapefruit, citrus. Quite long dry finish of malts, fruits, herbs, species. Good beer but not my favorite type of beer.", "Bottle in the Twisted Lip, Middlesbrough. Pours golden with a big frothy off white head. The aroma has citrus. The taste has lts of lemon and lime citrus over a little caramel. Some spice too. Decent.", "5.9%ABV. American pale ale.\r\n\r\nPoured out amber. 12ºSRM.\r\n\r\nNose has nice nutty, wheat toast aromas. Light beery aroma.\r\n\r\nMouthfeel light soap. Palate is toast, bread crumbs, wheat crackers. Hops are bitter with light pine and some brief resin. Herbaceous.\r\n\r\nFinish is medium, bitter.", "Amber. Good aroma with malty caramel and citrusy hops, in addition to a bit of hoppy spice and flora. Moderately hoppy flavour, and a somewhat dry taste with a dry and bitter finish. Very little malt flavour. Medium body. Overall, a good pale ale. While tasty and refreshing, it is also somewhat light, and I prefer a more pronounced malt character and sweetness to balance the hops.", "355ml bottle. Clear golden colour with a small white head. Aroma: hoppy, citrus, herbal. Taste: hoppy, citrus, pine, herbal, same as the aroma. Bitter finish. Medium body and carbonation.", "Aroma marcante, cor dourada e espuma bege. Sabor bem maltado com amargor bem balanceado.", "Paladar ligero, buen aroma, para acompañar la comida. Cítricos y un toque herbal.", "bottle. Hazy orange colour with stalbe head off. Aroma of citrus fruits.Taste of grapefruits, lemons, grass, malts, moderate carbonation, bitter finish.", "Liberty ale poured a slightly hazy golden body with a thin off white cap. not much lace left behind, mouthfeel was good with a hop bite. Aroma of citrus and slightly floral. Flavor was similar to the aroma with a nice hop tartness, and plesant aftertaste. Overall a pretty good offering from anchor.Originally rated on 10/10/08", "Kobberfarvet APA / American Pale Ale med flot hvid tætskummende top på 2-3 cm. Diset og rolig. \nLet frugtagtig aroma af appelsin og tropisk frugt, men ganske fjern. \nSmagen er let til middel bitter med mindre søde frugtagtige noter i det fjerne. Eftersmagen er ganske bitter, grænsende til det beske. Ganske fint balanceret. \nFrisk mundfølelse med en middel karbonering. Kroppen er middel fyldig, og konsistensen er olieret. Bitter afslutning. \nOverall: Fin, ganske typisk APA, med streg under det amerikanske qua humlevalget og ditto niveauet. \n355 ml, flaske, 5.9 % ABV, BB: 03/2018, købt i KIWI på Roskildevej i Valby. \n\n---Rated via Beer Buddy for iPhone", "Aroma: weak citrus notes and herbs.\r\nAppearance: golden color and white head.\r\nTaste: medium herbal bitterness, some pine and citrus notes, quite dry.\r\nPalate: medium body and medium carbonation, bitter finish.\r\nOverall: It is a great moment to drink this beer next time. An icon.", "One of my favorite beer! Pours gold colour beer with a medium head. Well-balanced!", "Hazy golden amber with no head. Hoppy fruity aroma, bubble gum. Taste is on the hops side (fruit, citrus, bubblegum, pine) with and unexpected strong alcohol taste. Decent ale.", "Fruity hop aroma with pine notes. Medium creamy white head, semi-clear amber color. Medium sweet and bitter, with bitter finish and aftertaste. medium body.", "Aroma of malt, fruits, pine, floral hops and a hint of mint. Golden with a white head. Medium sweet and medium + bitter. Medium to full body with a average carbonation. Overall an enjoyable drink.", "- leicht trübe gold-gelbe Farbe mit geringer Schaumbildung\r\n- aromatechnisch nur eine seltsame bzw. schwer erkennbare\r\n Malz-/Hopfennote vorhanden\r\n- geschmacklich kommt dann noch etwas harziges hinzu\r\n- der Abgang gerät mit irgendwelchen Gewürzen zum endgültigen\r\n Fiasko\r\nFazit: Absolut ungenießbar, dieses \"Bier“ macht einen fassungslos", "Bottled, Pilsen, CZ, Malt,nuts, floral and tropical fruit aroma, Bit hazy golden, lasting head, Sweeter taste, long bitter finish, Medium body, Soft carbon, Pleasant brew.", "Slight floral nose with a touch of bubblegum ester and some resiny notes. Medium body with a nice balance of malty body and bitterness. Moderate bitter finish with no harshness. Doesn’t really stand out, but a very drinkable, nicely balanced West Coast pale ale.", "Bottle. Pours clear golden to amber with thin white head. Aroma is malty and floral. Taste is bitter with yeast, malt and spruce.", "Kaunis vaalea olut vaahtoaa kohtalaisesti. Tuoksu ja maku tasapainossa ja varsinkin suutuntuma. Ok.", "Somewhat cloudy light amber with a nice beige head. Nose of pine, grapefruit, malt, spice, mint. Fairly dry taste with a mellow yet crispy bitterness slightly ahead of sweetness and sourness, very crisp finish. Lovely light palate. My favourite APA so far.", "golden, huge white head; aroma is very hoppy citric and grapefruit, tangy as well; taste is low to medium sweet with citric and resin, solid hoppy bitter finish; dry body, full mouthfeel, very refreshing", "Bottle. Aroma of honey, toffee, herbs, orange, grass, spice. \r\nPours clear copper with a dense white head. \r\nTaste is medium to lightly bitter and sweet. I’m surprised by the unique taste of this one - it has a basil note to it in the taste which at first was weird but actually is pretty good. Otherwise it has bready, herbal, grassy and toffee flavours. \r\nMedium body, pretty easy drinking, medium soft carbonation and a grassy herbal finish. I got this fresh for just 2,5 euro - certainly a well deserved, iconic go-to ale.", "Bottle. Deep golden body, big beige head with decent retention. Aroma of caramel malt, herbs, hints of orange jam, basil, honey. Taste of orange zest, grapefruit, caramel and a touch of pine. Classy!", "About a 6-pack of 12oz bottles every year since 2010-2016; also served during What’s Brewing 101 and sampled at tastings 2016. (This rating based on Bier&Co/Bierlinie import bb02/2017.) - Bref: This quintessential APA’s sweet & zesty aromas and appearance are marked by delicate nuances, its taste is straightforward and of an uncouth simplicity - natural carbonation in league with UK ESB’s tealeafiness makes this extremely moreish and addictive. - Easy parallels drawn to the US character are entirely coincidental. - Ap: lovely orangeat copper, impressive organically dented head. Ar: lemon candy, ice tea granules, flower petals, Thai basil, caramels. T: mainly dry grapefruit and lemon candy and sorbet with a classical zesty bitterness stopping short of pine. A tealeaf dryness (flowery Orange Pekoe, Lady Grey) and delicate carbonation crown this beer’s straightforward appeal for me. Simple layer of toasted malt biscuit with a caramel edge does the job. Lingering orange rind and pith bitterness, quenching and drying. - In league with Fuller’s ESB in terms of classic Anglo-American ales. Is it the whole cone hops that make this beer feel so natural? Can easily cut through a 6 pack of this classic when nearer to the source.", "12 oz bottle @ a friend’s. Clear golden to orange color. Rocky off white head. Aroma’s: fruit, ale-yeast. Fruit, some herbal hops and light malt retronasal. Flavor is moderate bitter with light sweetness. Medium bodied. Long, moderate bitter finish. I’d like to retry this fresh from draft, if I ever make it back San Fran.", "Bottle from Cotteridge Wines; clear light copper pour with a frothy off white head, aroma has hints of pine and light caramel, along with some grapefruit, taste has citrus, sweet caramel, tangerine, bitter grapefruit, smooth mouthfeel.", "Purchased in Booths supermarket. 35,5cl. Good head and appearance, undistinguished medium bitter taste. Although likeable slightly malty after taste", "This beer smelt much better than it tasted We found it lacks some taste to be a good beer.", "Sweet aroma. A bit weissy. This is like a mix of pils and weiss and ale. Sweet and hoppy. Noticed this one in the book 101 beers to drink before you die.", "From 330ml can. Copper gold with white head. Citrus, biscuity taster with hint of bitter in aftertaste. Easy to drink.\n\n---Rated via Beer Buddy for iPhone", "dark gold color clear ale with big white head that nicely stays on the glass. Perfect lookin beer.\r\nAroma: very sweet hop profile, sweet citrus (like mandarine) and some light resin (like freshly cutted mango), some biscuit and caramel from malt, light diacetyl aroma (butter like)\r\nTaste: Light sweet, light bittter, caramel, buttery biscuit, sweet citrus (mandarine), light iron-like taste in there on the finish.\r\npalate: smooth, low carbonated, easy drinkin\r\nOverall: very good pale ale, the fun fact is that diacetyl added nice character to this beer,", "0.335l bottle. Aroma of grapefruits, figs and oranges. Pale amber colour with low medium head. Taste of citrus fruits, especialy grapefruit. Medium body with high carbonation and bitter aftertaste. Good ALE.", "It seems my bottle isn’t indicative of what Liberty Ale is general like. The first aroma I picked up was grain. Fairly high carbonation, light copper color. First taste is more like a lager to me, grain, cracker-like fairly sweet with a tiny bit of hops bitterness. Slightly creamy mouthfeel. It’s not bad per se, but I certainly don’t care to try it again to see if I can get a \"good\" bottle.", "A decent enough pale ale, nothing very special about it but it's ok. Certainly sessionable.\n\n---Rated via Beer Buddy for iPhone", "355ml bottle from Intermarché Estaimpuis supermarket.\nF: huge, egg-white, long lasting.\nC: orange gold, light hazy.\nA: orange, mellow tropical fruits, bit floral, citrus, caramel touch.\nT: medium malty backbone, orange, citrus, bit tropical fruits, nice long lasting dry bitterness, caramel biscuits touch, grapefruits, medium body and soft carbonation, yet this is very nice and even under-ratted on RB may be because there are a lot of tasty beers all around us now.\nPrevious rate from 10/06/2016 6/4/8/4/15 = 3,7\nF: big, creamy, light off-white, long lasting.\nC: orange, hazy, non-transparent.\nA: light malt, citrus, floral, grassy, biscuits, tropical fruits.\nT: malty, light citrus, orange, hint of earthy, tangerine, caramel, toast, medium body, lower carbonation, creamy mouthfeel, refreshing beer, worth to try, 355ml bottle from De Keyzer Drinks.", "Pleasant light, fruity hoppy aroma. Golden color, clear, no head. Fruity, malty in the mouth. Quite full in the mouth, feels god. Tho one think it’s missing is bitterness - it’s on the pale ale level. It’s solid, good one but not mind blowing in any way.", "Ljust bärnstensfärgad med ett stort vitt skum. Malten och jästen känns mest i smak och doft. Lite fruktig men humlen står tillbaka. Ganska mycket kolsyra\n\n---Rated via Beer Buddy for iPhone", "Can sample at a tasting at Tom L place. Thanks Tom. Clear golden with white head. The aroma is hoppy and fruity with notes of bubblegum and citrus (tangerine). Bitterish flavor with notes of citrus, lemon zest and hint of bubblegum, dry. Medium-bodied.", "On point for the style, old school ale. That being said for a modern beer drinker this one excels at malts and low bitterness but the hops take the back seat. Good brewer and a lot of folks will like this if they dislike hops but just not for me. \n\n---Rated via Beer Buddy for iPhone", "Palate is fizzy with long finish. I am not tasting much hoppiness here. Color is nice golden, there is almost no head. Not much character, but overall refreshing experience.", "Bottle sample at a tasting , thanks Tom. Hazy orange golden color. Floral aroma with hints of tropical fruit and orange. Moderately sweet, floral, fruity, notes of mango and lemon peel, dry bitter finish. Medium-bodied.", "Citrus and floral hop notes dominate the aroma... fruity yeasty malt follows.\r\n\r\nVery good bitterness with the perfect amount of malty sweetness to balanced... there is still a slight yeasty fruitiness mid palate that cuts to a subtle earthiness.. everything is balanced very well by a toasty caramel maltiness.... finishes with a fresh citrus blast.", "Nagy, tartós hab, borostyán szín. Gyümölcsös, komlós illat. Íze keserű, gyümölcsös, hangyányi gyantával, közepes szénsavval. Testes, jó egyensúllyal rendelkező, nagyon finom sör.", "Fra flaske på Mi2 Cardinal mai-16: klar gylden med ok skum. Inviterende humlearoma og rik smak, eminent balansert. Tropiske frukter, krydret honning, sommerblomster. Rund og meget lettdrikkelig med fruktig avslutning. Deilig.", "Ale con sabor duradero en paladar, aroma agradable e intenso. Muy buena en su estilo.", "Tasted from the tap on the 06/05/2016. Clear amber color with a medium white head. Aroma of hops, malts and some fruits. Taste is fruity and low to medium hoppy. Next one please!", "Flasche gekauft bei Bierlinie. Bernstein, aufschäumender fester Schaum, Geruch Hopfen, Zitrone, Orange, Maracuja. Geschmack: Voller Antrunk, bitter, Kiefer, scharf. Etwas Grapefruit im Hintergrund. Im Nachgang dann milder, fruchtiger (Pfirsich)", "Sehr ausgewogenes und interessantes Ale. Runder, nie langweiliger Körper. Im Abgang für mich einen Hauch zu bitter. Insgesamt aber absolut überzeugend.", "Lett tåkete lys brun med fingerhøyt hvitt skum. Lukter korn, fudge karamell og noe honning. Honning, karamell i starten, kort medium sitrusbitter avslutning.", "Mítica y una de mis APAs favoritas. En nariz herbal y terrosa, con es presencia del cascade combinada con esas maltas tan sabrosas, dulces, casi a miel, para volver de nuevo a un final herbal y seco. Equilibrio sin artificios!", "Aroma is earthy and floral hops, and a strong and reminiscent presence of big spray which is weird, malt, metallic, pine. Appearance is golden amber, off white head, clear. Taste is very floral, fruity, hops, malt, citrus, lemon zest, not nearly as metallic. Mouthfeel is light to medium body, light carbonation, floral aftertaste. Overall, this one is pretty good.", "355 ml, bottle conditioned. Slightly hazy, golden amber, thin off-white head, medium carbonation. Aroma is sweet, orangy and citrusy. Mouthfeel is a bit oily, not very carbonated, hops at first and malts in the long aftertaste. Flavours are citrus, grass and pine.", "Bottle. Pours an orange-gold, visible particles, slightly hazy, lovely creamy finger of head that lasts. Very floral aroma, hard to pin down, there’s also a herbal note like Sorachi Ace, barley, dough. A piney hop note sits up in the flavour, bready malt, barley, resin. Quite oily in feel, a decent malt body, short sharp bite of hop flavour, lingering tingly carbonation and bitterness. Nowadays this comes off old school and classic for a PA, like a Sierra Nevada. Good flavourful bitterness that hits the spot, glad I returned to it.", "Bottle at NYC Craft beer festival.\r\ngolden white head.\r\nAroma of foot, anis and hops\r\ntaste sweet. fizzy feel. nice hoppy", "Kolor: herbaciany z pomara?czowymi refleksami i lekk? mgie?k?. Piana wysoka, w kolorze ecru, bardzo trwa?a.\nAromat: s?odkie owoce, miód, lekki karmel.\nSmak: mnóstwo s?odkich owoców, s? tropiki i cytrusy z grapefruit’em na czele. Co jaki? czasem wyczuwalne s? akcenty le?ne. Mocny punkt Liberty Ale to tak?e goryczka, bez niej piwo mog?o by by? ubogie. Grapefruitowo ?ywiczna, fantastycznie balansuje s?odycz owoców.\nWysycenie ?rednie w kierunku do wysokiego.", "12-ounce cans, a bit too bitter like most IPAs. A better IPA from the same company is Anchor IPA, which has better balance between flavor and bitterness.", "Bottle @ buitenlust... small white head... pours an opaque orange colour... smell barn life hay sand trees. Taste malts some yeast hops a little bitter... strong aftertaste soft body still.", "Good balance between malt and hops. Great introduction to IPAs. Caramel notes in the aroma.", "330ml bottle. Pours golden with small white head. Aroma of fruits, pines, hops and a bit of caramel. Medium body with soft carbonation and bitter taste.", "Draught at local restaurant. Hazy amber, with medium white head. Aroma has hoppiness, some pine and citrus. Medium bitterness throughout. Pretty basic APA, goes really well with a burger.", "Aroma is floral, fruity and caramalt. Taste is dominated by caramalt, but also hoppy. Fine bitterness in the ending. Ok but not great in any way.", "I picked this up because of the cool looking can. I mean you can’t go wrong with Liberty and Merica. However, this taste like drinking a pine tree. This isn’t what I was hoping for.", "We are in love on 1st sight. But on the next morning without make up it just look like the cute girl from next door. Which aint a bad thing.", "Light amber colour with medium white head. Really pleasant carbonation. Malty taste and hoppy aroma.", "Clear , amber color . Aroma of tropical fruits, malt and bread . Notes of bread in malty taste . Herbal , hoppy bitterness.", "12 oz. bottle. Pours clear straw, with small white head. Aroma was citrus, spices and lemon. Taste was pine and dry with a lingering bitter finish.", "Golden with a white head - Nice hoppy aroma - Malt body with a gentel hop profile that has some fruity notes - The hop goes into the finish with gentel hop - This was nice", "Pours a nice Orange color with a medium white head. Smooth drinking beer with a hoppy flavor. Nice beer.", "Clear amber comoru, three fingers of white head. Aroma of citrus, apricot, cereal and caramel. Flavours of caramel, apricot and citrus notes. Medium sweet and quite bitter finish. Medium body and carbo. Balanced and full of subtilities.\n\n---Rated via Beer Buddy for iPhone", "bread, cereal, floral, orange, cloudy, white foam, light sweetness, medium bitterness, medium sourness, medium body, oily feel, soft carbonation, \r\nle nez est trés complexe, un peu au dessus du niveau des sensations en bouche, légère amertume sur un bel equilibre tout en subtilité.", "Kolor: Pomarańczowy. Prawie klarowne. \n\r\n\r\nPiana: Niska, kremowa, drobno pęcherzykowa. Nieszczególnie trwała, ale pięknie barwiąca TeKu.\r\nCała masa zacieków na ściankach. \n\r\n\r\nZapach: Nie jest ciekawy. Gotowana kapusta, kukurydza z puszki pomieszana z cytrusami i miodem...\n\r\n\r\nSmak: Trochę słodowy, trochę karmelowy, lekko mandarynkowy. Jest też nieprzyjemna warzywna nuta.\r\nGoryczka średnia, lekko zalegająca.\r\nPijalność bardzo niska. \n\r\n\r\nWysycenie: Średnie.\n\r\n\r\nPodsumowanie:  \n\r\n\r\nKolejne piwo z grupy tych, które nieprzetrwały warunków dalekiej podróży, a szkoda bo świeża warka miała by z pewnością potencjał.\r\nDużo wad i niewiele do zaoferowania. \r\nKolejna kiepska butelka przywieziona z Holandii...\r\nNa otarcie łez piękna butelka i firmowy kapselek;p", "Poured from botle, clear amber with a medium head. Aroma full of citrus, with notes of cereals and some fruit. Taste is bitter with a medium body and medium finish. Fruit and bread with a trace of resin. Very refreshing!", "Medium orange body with a thin white head and nice lacing. Fruity aroma with hints of spice. Taste is hoppy, bread and again spice. Fairly mild with a relatively clean finish.", "Bottle 0,33l. Pours an amber colour with thick white head. Aroma of hops, alcohol and yeast. Taste of pine with a hint of banana. Bitter and metalic taste slightly soapy. \n\n---Rated via Beer Buddy for iPhone", "Too bitter and hoppy. I do like the aroma but the taste just isn't what I want it to be. Pretty typical of Anchor Brewing in my opinion.\n\n---Rated via Beer Buddy for iPhone", "355ml can (6%) from Good Spirits Company, West Nile Street, Glasgow (bb 22 Jun 2017), floral, fruity aroma, amber with a bubbly, cream head, fruity, caramel, grain, fairly bitter finish.", "Il Cascade la fa da padrone, aroma agrumato costante e decisa nota amara finale.", "Pours very clear and red with small foam. Aroma is almost incomprehensible. Maybe some crass and sourness. Taste is interesting - it varies a lot. Reminds a little bit water mixed with shower gel. Can’t get over those parallels with bitterness and soap. Interesting.", "Slightly hazy copper ale. Hoppy bitterness on the nose and palate. Well balanced and although a dominant flavour not bitter. Great carbonation and velvet mouth sensation. Crisp and refreshing.", "amber color, with a white foamy head.the aromas are malty,spicy,vanilla, some caramel.the taste is bittersweet,honey,a little caramel.", "Bottle from World Market in Mountain View, CA. Aroma is malty toffee, candied orange peels. Taste is caramel, honey, orange, light tropical hops. Very tasty and balanced. A go-to six-packer.", "Nice clear copper color, some aroma, pines & citrus, foam that leaves quite quickly, medium carbonation, taste is balanced, cascade hops, some caramel, easy drinking. Nice brew to enjoy with BBQ.", "Pours an amber from a bottle. Citrusy aroma, not lemon or grapefruit, but I’m thinking of something orange. Caramel flavor, with more floral and tropical fruit tones. Very good beer.", "Can at home. Caramel malts. Piney hops. Mildly bitter, slightly sweet. Nice!", "Thuis, fles. Hoppig en herfstachtig, maar in de achtergrond. Op de voorgrond citrus en gistzuur. Koolzuur prikt de tong. Honing/stroperig. Backlog from 2015/05/25.", "Bottle. Had this so many times over the years. Nose of caramel, toffee, quite floral and citrusy, with deep dark grassy hopping. Slightly hazy orange/amber color. Caramel and pepper right off, piney and rich, and a touch sourish in late mid and final. Thin-medium body. Cascade hops never taste quite this way in any other beer.", "35.5cl bottle at home (11 XII 2015). This brew is an amber, cloudy ale with a think, vast creamy head of white colour. The nose has some very appealing, cascade hops flavours. The mouthfeel is not that complex. The carbonation is mild and the malt and yeast features are hidden. The bitterness in fact is quite strong. And very nice too. The ending is somehow dry, and captures a lingering bitter finish. This is one solid hoppy ale!", "Butelka prawie bączek 0,355l.Kolor złoty, klarowny, niestety piana średnia, słaba. Aromat cytrusowy z kwiatami w tle.W smaku cytrusy i zioła. Wytrawne, średnia goryczka. Wysycenie średnie, łagodne na podniebieniu z dużą dawką alkoholu. Dobre piwo.", "Kolor złocisty, lekko tylko zamglony. Piana biała z drobniutkich pęcherzyków tworzy ślad na szkle.\r\nAromat chmielowy – kwiatowo-cytrusowy. W smaku słody kontrujące goryczkę w średnim poziomie w nucie ziołowej i cytrusowej. Jest wytrawnie Alkohol choć spory (5,9 volt) nie jest wyczuwalny. Pije się je przyjemnie, trochę tylko drażni wysokie wysycenie.\r\nPrekursor American Pale Ale odstaje od dzisiejszych ultra nachmielonych IPA ale ma swój urok. Pije się je przyjemnie, łyk po łyku.", "2 month old bottle from the LCBO. Nose is bright floral hops, spicy malty, very fresh smelling. Well balanced, bitter, floral fruity. Complex and lovely.", "Bottle. Pours clear brass color with lots of white head and lacing. Nose is floral and soap. Taste is soapy, metallic and a little malt sweetness. A little thin in the mouthfeel. Okay.", "0,35l Flasche. Orangenes Bier mit kleiner cremiger Schaumkrone. Latent Fruchtiges Aroma, im Geschmack intensiv fruchtig nach Ananas und Citrus.", "Muddy orange color with big white head. Aroma is piney-hoppy, some milk, mint, butterscotch. Taste is spicy, hoppy, bready malts, slightly bitter finish. Ok, but not my favourite.", "Pours amber with thick white head. Aroma of hops alcohol and yeast.Taste is of pine with a hint of banana. Bitter and metalic taste slightly soapy. Ok but wouldnt have another.", "Bottle at home. Clear golden with short lasting white head that leaves some nice little islands. Very flowery, soap, milk, basil, mint, grass. Lots of fresh herbal notes, but with a musty malt base. Light sweet and bitter.\r\nMedium bodied with slick feel.", "355 ml. bottle. BBF 06/2017. Clear golden, touch orange, decent creamy white head. Nose is dull oily, grainy, stale citrus candy, butterscotch, oily, faintly mineral, old bread. Grainy, dull bread, oily, old stale candy, touch butterscotch, little hop, rather bland, bread, light dried orange, mineral, lightly metallic. Carb is a dash high. Pretty dull & lacking much character. Anchor dates way, way back (oldest still functioning USA specialty brewer if I am not mistaken), they were craft before craft existed & this recipe appears to date back to 1975. They deserve points for many things, unfortunately this one comes across as dull & touch lacking compared to modern varieties. It tastes actually a bit like an old bottle of a newer style USA specialty beer despite being quite fresh looking at the BBF date.", "Aroma: hoppy, pine, resin, some zest.\nTaste: dry with moderate bitterness.\nFlavour: pine, citrus, light malts.\nBitter dry aftertaste.\n\nVery pleasant and not too complex.\nGood anyway.", "cereal, alcohol, amber, clear, medium sweetness, medium bitterness, lightly sour, lightly sour, medium body, creamy, average carbonation, long finish,", "5.9%abv. Purchased in Hippo Beer, West End. Great aroma; nice bread and alcohol mixed. Golden colour and frothy head. Balanced taste, however the alcohol taste is too heavy. Thin texture and average carbonation and abrupt finish.", "In bottiglia. aroma erbaceo, terroso, leggera frutta esotica, caramello, mou. al palato molto equilibrata tra un inizio dolce, di caramello e cereale ad un intensa luppolatura che dona erbaceo e terroso soprattitto", "Aroma:\n\n\nHops, citrus, tropical fruits, flowers, orange, caramel.\n\n\n\n\nAppearance:\n\n\nClear amber beer with a thick white head.\n\n\n\n\nTaste/Palate:\n\n\nStarts sweet with flowers and caramel, then gets slightly bitter with hops and fruit.", "schön gold bis kupferfarben, fast klar. Angenehme Bitterkeit bei fruchtig hopfigen Aromen. Ein gutes American Pale Ale", "Very nice beer. Great aroma and appearance. The taste is well balanced with nice citric flavors.", "Bottle from Albert Heijn in Holland. The beer is golden to orange colored and has a sticky and large white head, with livingly Co2. \r\nThe aroma is very hoppy, with nice notes of citrus, flowers and tropical fruits. The taste is light bodied, little watery texture and light sweet, with nice hop and fruit notes, little spiciness is noticable.\r\nThe finish is dry and medium bitter which is long noticable.", "-\tNot exactly delicate; definitely but not shouting “Freedom”; but definitely, definitely nicely done.\r\n-\tNose: Nice mandarin, some spice (coriander powder?)\r\n-\tBody: More caramel, and some stewed tea. Slight croissant-y vibe. Still a bit of citrus/mandarin. Bit fizzier than expected.\r\n-\tFinish: medium, dry. White pepper + spice (coriander powder?)", "Poured misty blond with an off-white dense head. The head faded slowly.\nAroma of herbs, bread, tea, citrus.\nTaste had fruits, apple, herbs.\nBitter finish.", "Can. Archer Road Beer Stop, Sheffield. Lightly hazy orange. Messy, clingy, thickish, off white head. Fruity, syrupy malts. Tea like spice. Damp hop. Hint of pine bark. Taste is fruity bittersweetness. More of the tea like spice. Palate is pretty full. Easy drinking, though. Finishes long, light, peppery bitter.", "Aroma bread, resin, citrus, \r\nAppearance golden, hazy, cloudy, white foam, \r\nTaste light sweetness, lightly bitter, \r\nPalate medium body, lively, \r\nOverall a nice citrus beer that would go well with an orange slice. I would suggest this beer to a friend.", "The aroma is fruity, the color is amber and slightly unclear\r\n it has a small head. T\r\nHe flavor is malty with the characteristic\r\n yeast, with notes of fruitiness and a good light bitterness.\r\n A really good beer.", "A: very pale gold/yellow. thick quick dissipating head\r\n\r\ns: candied lemons\r\n\r\nT: very fruity, citrus, very unusual. soft bitterness. almost pinapple. candy. pear drops! malt takes a back seat to fruit - slight pie crust.\r\n\r\nM: smooth. medium body. prickly carbonation.\r\n\r\no: much more unusual than I thought it would be! very pear droppy. hops not dominating aroma, but then i’s come a long way to Europe.", "Pours a light bronze with a white head. Nose is hops. body is medium. Taste is malt with a little sweetness and hops bitterness. 12 oz bottle", "Average fizzy off-white diminishing head with clear amber body. Hay malt, herb and resin hops and light soap and cheese presence. Medium thin body with soft carbonation and bitter finish. Average duration flavor lightly sweet and acidic with a moderate bitterness.\n\n---Rated via Beer Buddy for iPhone", "Bottle - Clear golde colour with thin but long lasting white head. Lot of citrussy hops in the nose with smooth malty aromas. It has a nice grapfruit taste, orange zest, resinous and refreshing hop aroma. Medium body, average carbonation and dry hoppy finish. I think its rather an ipa than a pale ale. Great refreshing beer with nice american hops.", "Helder goud weinig neus. Bitter in begin, zure nasmaak. Waterig. Gist, mout, beetje citrus. Mwah. Te weinig hop.", "Note di agrumi e erbacee dominano al naso, in bocca su una base dolce escono gli stessi sapori e floreali per finire con un discreto amaro molto persistente.", "Clear golden color, big white head. Pleasant tropical fruits aroma hint of malts and floral hops. Taste has fresh tropical fruits, floral hops with caramel malts. Medium body, average carbonation. Nice one", "330ml bottle at Redhot Munich. Aroma is bubble gum, light hops. Appearance is crisp golden with nice white foam. Taste is sweet, light bitter. Light carbonation, light dryness. Very light nice.", "12 ounce bottle into pint glass, bottled on 1/28/2015. Pours slightly hazy deep golden yellow color with a 2 finger dense and fluffy of white head with great retention, that reduces to a nice cap that lasts. Nice dense soapy lacing clings on the glass, with a moderate amount of streaming carbonation retaining the head. Fantastic appearance. Aromas of grapefruit, lemon zest, orange peel, light pine, honey, light caramel, biscuit, and floral/grassy earthiness. Nice and pleasant aromas with good balance and complexity of citrus/floral hops and moderate bready malt notes; with solid strength. Taste of grapefruit, lemon zest, orange peel, pine, honey, light caramel, biscuit, and floral/grassy earthiness. Good amount of pine/grassy bitterness on the finish; with lingering notes of grapefruit, lemon/orange peel, pine, honey, light caramel, biscuit, and floral/grassy earthiness on the finish for a good bit. Very nice complexity, robustness, and balance of citrus/pine hops and moderate bready malt flavors; with a great malt/bitterness balance and zero cloying flavors after the finish. Medium carbonation and body; with a very smooth, moderately sticky, and lightly creamy/bready mouthfeel that is nice. Alcohol is very well hidden with minimal warming present after the finish. Overall this is a damn nice pale ale. All around great complexity, robustness, and balance of citrus/pine hops and moderate bready malt flavors; and very smooth and easy to drink. This one straddles the line between an IPA and pale ale in bitterness and malt character, but I’d be much more inclined to think of it as a pale ale overall. A very enjoyable offering.", "Can from Glug Newcastle. Strong in flavour, malty, hoppy. Really robust, enjoyable beer", "Piana nieduża, jasna, średnio trwała. Barwa złota, klarowna. Aromat przyjemny, lekko słodki, są owoce tropikalne, pomarańcza, nuty kwiatowe i biszkoptowe oraz winogronowo-rodzynkowe, nieco przypomina American Barley Wine. W smaku delikatna podbudowa herbatnikowo-słodowa, niewielka morelowa słodycz i cytrusowa kwaskowość na finiszu. Goryczka średnia, lekko pikantna, długa. Nagazowanie średnie, drobne. \r\nProfilem to piwo przypomina mi bardziej nowofalowego lagera niż ejla. Bardzo pijalne, smaczne, fajnie współgrają ze sobą jego poszczególne elementy. Nic dziwnego, że takie piwo wyróżniało się na tle tradycyjnych \"koncerniaków\" w latach siedemdziesiątych ubiegłego wieku! Nawet dziś robi pozytywne wrażenie (choć nie jest już tak rewolucyjne jak kiedyś)", "Alone at home. Clear goldblond colored beer with medium diminishing white head and medium carbonation. Hopped spicy aroma. Full sparkling palate. Finish is hopped sweet bit spicy ending dry.", "Clear golden colour. Thick white head. Aroma is floral, some citrus maybe grape, definitely on the low side, probably from the long shipping to EU. Taste is very refreshing, citrusy, low body. Aftertaste has some malt notes and a medium long bitterness coming through at the end.", "Not alot of aroma, very bitter. I think the bottle was kept to warm. Best before date was 12.2016.", "Pours clear golden colour, with tiny, stable white creamy head. Visually high carbonation.\r\nAroma without note of an alcohol, with fruity esters of lemon and grapefruits.\r\nSimilar is flavor. Malt sweetness is medium, with notes of wheat, bread, and is perfectly balanced with hop bitterness (esters of grapefruit, lemon). Body is smoothy-soft, carbonation is medium.\r\nVery proper pale ale.", "Aroma is citrus, fruit, caramel, flowers. Appearance is amber with a thin white head. Taste is light sweet and moderate bitter. Dry bitter finish.", "Draught @ Waterfront Ale House. Faintly cloudy dark orange with small creamy off-white head, lightly hoppy sroma, slightly sweet hoppy taste, lavender flavor, orange peel, medium carbonation, smooth mouthfeel,\r\nlong bitter finish. Very smooth and drinkable.", "Bottle @home. I’ve had this one several times before. Pours golden/orange medium body, small but lasting off-white head. Rich hops aromas, orange, tangerine, citrus, sour fruit peels. Hints of malt, but hops prevail. Earthy aromas, a strong presence of citrusy sourness, bitter and dry finish, sour aftertaste. Medium, lively carbonation. Not my favorite one from Anchor, still an overall good one. Balanced and refreshing.", "Pours rust coloured with golden highlights; the head is off white and foamy. The aroma has notes of: toffee, grapefruit zest, and apricots. The taste is light bitter;there are notes of: butter, grapefruit zest, cereal, toffee, and a floral character. The palate is medium light bodied with light carbonation and a medium finish. Overall, it’s meh.", "Orange colored beer with a small white cup, low carbonation.\r\nTastes likes delicious hop bitterness, spicy, fruity, citrus.\r\nSweet bitter aftertaste, tasty APA.", "Clear deep golden. Creamy white head. Old school. Biscuit. Toasty. Caramel. Earthy hops. Firm Moderate bitterness. Good balance. Quality, well made beer.", "Light orange color, thin and quickly dissipating white head - Aroma: Light fruity aroma, hints of flowers and resin, citrus hops, biscuits and corn / grains in the aftertaste - taste is slightly sweet an bitter at first and gets more bitter towards the end, resulting in a rather dry finish - medium to full body, creamy, maybe even frothy, nevertheless crisp and fresh texture, average carb.", "Flesje gekocht @Albert Heijn (!). Goudgeel bier. De geur is vrij hoppig, maar smaakt meer naar een bitter pils, maar dan een pils met een body! Hoppig, bitter, metalig en wat fruit. Een lekker American Pale Ale.", "Aroma: Rich piney hop, hazy friuts\r\n\r\nAppearance: Thin creamy head, mild copper colour\r\n\r\nTaste: Subtle sour fruits and hop-bitter\r\n\r\nPalate: Light body, little astringent texture, medium carbonation and piney and fruity hop-flavour finish.\r\n\r\nOverall: Well-balanced, I never get tired of this beer.", "Bottle 0,33.\r\nPours copper with big head. Medium body. Medium carbonation. Aroma of fruits, apple, hops. Hoppy taste, some sourness. Well balanced.", "Was brewed the first time in 1975 to mark the 200th anniversary of Paul Revere’s famous ride in 1775, which marked the beginning of the American Revolutionary War. Paul was a member of the Sons of Liberty, I don’t know what the horse was called, but it must then have at least 50% of the credit for the ride, which, as you know was the beginning of America’s independence from the Britains. Very complexed floral aroma and slightly aroma of resin. Tastes a little sharp of hops in the beginning, but develops into a gentle sweetness, balanced with fruity flavors and dry finish. A very delicate and typical American ale. The plump bottle with screw cap is also very charming.", "Bottle at a bbq. Pours clear golden, nose is toffee, floral, taste is similar, sweet, dry", "Dead 50 weekend. Why not? Clear deep golden pour with a frothy white head. Left some good lace. Nice aroma of caramel malt and earthy hops. Touch of citrus but lots of earth and grass. Flavors were in line, very earthy, grassy, lingering dry bitter finish. Moderate carbonation with a slick mouthfeel. Dry and tasty. A snap shot back into history, American brewing at its finest.", "0.33l pour from chilled tap into a shaker pint a 4th of July party thrown by the US Embassy in Vienna. Decent, nicely bitter, fairly dry. A little too dry for me, in fact, but not a bad choice.", "Type: 12-oz. can\r\nGlass: Manzanita pint glass\r\nFrom: Trader Joe’s in Mission Valley (San Diego), Calif.\r\nPrice: $8.49 for a variety 6-pack\r\nPurchased: June 26, 2015\r\nConsumed: June 26, 2015\r\nMisc.: Can says 6 percent ABV\r\n\r\nPoured a honey, pale, clear color with 5-to-6 fingers of khaki white, rocky head. Settled to nice look on the top after a few minutes. Lots of bubble streams coming up from the bottom of the glass. Above average spotty lacing on the sides of the glass. Great retention on the top all the way down. (Sight - 4.13)\r\n\r\nSmelled wet Cascade, pine, lime, dish soap, floral, faint watermelon, faint cucumber and caramel. (Smell - 3.75)\r\n\r\nTasted similar to the nose, albeit with buttery notes. Got wet Cascade, soapy pine, lime, dish soap, buttery malts, caramel, honey, peas and green beans. (Taste - 3.50)\r\n\r\nMedium-to-light body. Oily-to-creamy texture. Average carbonation. Abrupt, buttery, bitter finish. (Feel - 3.63)\r\n\r\nI didn’t this was that good. Maybe six years ago this would have been good, but just an average IPA. (Overall - 3.50)\r\n\r\n3.59 81 B", "Fresca y de traguin de pouco a pouco. Presta asgaya.\nDeja un regustin nel paladar muy guapin. Pa da-y fasta reventar", "Dourada alaranjada,translúcida,espuma formou um belo creme volumoso e duradouro;aroma cítrico,terroso,resinoso;na boca um sabor inicial maltado seguido de um bom amargor dos lúpulos e do frutado cítrico(abacaxi,maracujá),final seco,retrogosto ácido,refrescante,boa \"drinkability\".Cerveja gostosa,equilibrada,seguindo a boa qualidade da Anchor.", "Bottled from AH in Mestreech. Clear orange color, white head and lacing. Hoppy nose. Aroma is hoppy and malty notes. Flavour is spicy, hoppy and having a subdued caramel malt. Dry, fruity hoppy finish. A very good beer.", "355ml bottle from Systembolaget. Clear golden, thick white head. Clean and lovely aroma, sweet malt, caramel, citrus, pine. Medium carbonated with a fresh and crisp mouthfeel. The taste starts with malt and bread, and turns to caramel, fruit candies, orange, blood orange. Grapefruit bitter finish. Well-made and well balanced.", "Crisp, flavorful pale ale with citrus hops and floral notes. Dry finish. From a bottle into a pint glass. Moderate aroma and body.", "Aroma intenso. Alta graduación pero sabor a alcohol equilibrado. Tomada en La Cantina de Avilés. De lo mejor que he probado", "Botella. @La Taberna de Hank, Luanco. 13/06/2015 color amarillo, aroma y sabores cítricos.", "Bottle @ deTolly, Tartu. pours golden with small white head. Aroma is fresh and hoppy, fruity, citrus, grass, some sourish notes. Taste is medium bitter and sweetish, fruity, citrus, really refreshing, Medium body. Dry-bitter finish. Good beer.", "Flesje van Gall & Gall, oranjekleurig bier met medium hoge witte schuimkraag. Frisse en zachte geur van mout, en bloemige hop. Het smaakpallet is verfrissend en droog, met een zoete toets van karamel. Het bevat tonen van mout, citrus, en een behoorlijke dosis zacht bittere aromatische hop, met een zacht parfum van lavendel en dennen. De droogheid en bitterheid houden elkaar mooi in balans en maken van deze Liberty Ale een heerlijk verfrissend en dorstlessend bier. De afdronk is medium lang, droog en bitter, door de dry hopping. Dit tweede bier wat ik proef van Anchor Brewing is na de IPA zeker weer een geslaagd bier, niet complex maar smaakvol door de goede balans en eenvoud.", "Pajiza amarilla con mucho poso. Poca espuma. Aroma bestial.. flroes y flores. Muy ligera en boca, confirmando el aroma en el sabor. Amargor final justo y toque cítrico. Notable.", "Not awful, but nothing special. The least memorable Anchor Brewing beer of the few I’ve had. Pours golden tan in color, the head is average. The aroma is nondistinct. The flavor isn’t offensive but isn’t memorable. A little bit of floral hop, a little bit of malt, thin finish.", "Poured from a can. Fairly clear gold color. Big, white head. A little lacing. Breadth aroma. Slightly sour taste. Not great.\n\n---Rated via Beer Buddy for iPhone", "Occluded orange pour with a bit of white head. Strong aromatic aroma of sticky floral hops and honey. Soft carbonation, viscous mouthfeel, clean finish. Juicy hop flavors of melon, lavender, some pine, a bit of biscuity malt.", "Ale americana bevuta sia in bottiglia sia alla spina ad ABC di Roma.\nColore ambrato/dorato, schiuma bianca, soffice e persistente, con un bel cappello pannoso. Al naso esplode in profumi floreali, tropicali ed erbacei, mentre in bocca le note caramellate e luppolate si equilibrano alla perfezione. Il retrogusto è delicatamente amaro e secco, a lungo, rendendola di facilissima beva e dissetante nonostante la gradazione alcolica, che non si fa mai sentire. Una birra ECCEZIONALE. È diventata subito la mia preferita, senza se e senza ma.", "Bottle, Albert Heijn. Pours clear dark golden. Thick white head. Nose of pale malts, biscuit and orange marmelade. Very balanced hoparoma, like lemon peel jam on toast. Balanced but slightly bitter aftertaste. Creamy texture. Close to the diacetyl threshold.", "Zurückhaltendes Pale Ale\r\n\r\n-Im antrunk zitronen,orangen und mango\r\n-Leichte ananas und passionsfruchtnoten\r\n-hoher kohlensäuregehalt\r\n-im abgang leicht bittere hopfennote und zitrone\r\n\r\ngut balanciertes PA,nichts für Hopheads.", "Bottle. Pours is pale clear golden with medium to big white head. Aroma of lime, toasty, malts, caramel and light grassy. Taste is medium bitter, light sweet with citric and lime notes, fresh. Medium body, soft carbonation. Good, but still just decent in my opinnion.", "355ml bottle. Pale gold to deep gold colour with suspended sediment. A towering, dense, creamy head with a buttery tinge. Wonderful head retention and some lovely lacing. Aroma of citrusy hops, biscuit, peach, honey and some caramel. Light to medium bitterness and light sweetness. Light to medium body, smooth texture; a wonderful mouthfeel. The finish is semi-dry but still managers to linger with a beautiful balance between the sweetness and the bitterness. A cracker of a beer.", "Out of bottle at grad party. Wish I had glass. Hoppy grainy aroma. Lightly hoppy taste. Medium bitter. Relativley smooth finish. Over all good tasting ale. Will have to try again.", "Hazy yellow color, medium sized white head. Hops are noticeable, but dominant scent is armpit. Notes of malt and citrus. Unpleasant and disappointing. Taste is a little bit better, but still boring. More sweet than bitter. Expected more. \n(Pivoljub 0,33 bottle)", "Last had this about 20 years ago and thankfully pretty much as I remembered it. Deep golden hue. Good beading. Rocky head. Mute nose. Deep husky raw hop flavour. Great mouthfeel and excellent. Potent too.  One of the very most iconic American beers ever made and Anchor continues to honour and brew with this beer as it always was and with love and respect.", "Slightly hazy golden color, average sized white head. Aroma of biscuit, some fruitiness, malt, caramel and sweat. Taste is similar, with citrus fruits and malts dominating. Medium body, soft carbonation. Not impressed.\n\n-- rated with beerbasher/winphone", "Light pleasant bitter dry hops rest on your tongue. Crisp with a fair amount of bite. Light body with oily hop finish. This aint a slouchy pale ale. A great lounge and relax kinda beer.", "Bottle; pours a light, slightly hazy gold with a white head; aroma is malty with some fruit and caramel notes; taste is bittersweet with malt, caramel, and some hints of fruits; finish is bitter; nice APA", "Bottle bought at Geers. Citrus-sour, almost lemonade-like, yeasty, different to say the least.", "Amber with a white lasting head and lacing all the way down. Aroma of citrus, honney and forrest. Chrispy and dry with a taste of malt, grain and fruit. Faint bitter aftertaste.", "A good pale ale. Sufficient hops, fruity notes, light palate, pretty smooth with a modest finish. Classic label.", "Cor âmbar, brilhante. Espuma de boa formação e baixa persistência. No aroma herbal, damasco e frutas amarelas em compota. No paladar cítrico, lúpulo, frutado e malte. Corpo leve. Retrogosto amargo. Alta drinkability!!!", "2015-04-26 - A very nice beer but I liked the Poleeko Pale Ale much better. I like the bottle though!", "Dark golden coloured, medium sized off-white head, hoppy nose. Moderate malty, piney hoppy, light caramel and fruity", "355cc bottle. Pour clear blond with thin head. Lovely floral, grapes and citrus. In the mouth I got some nice malt. Balanced sweet and bitter. Medium to light body. Very nice ale.", "Dopo averla bevuta più volte, non posso fare altro che definirla la birra più buona che ho mai bevuto finora, per la mia scala di valori e secondo i miei gusti. Dorata con una bella schiuma bianca e persistente, al naso è meravigliosa, un’esplosione di profumi avvolgenti e pungenti. Il gusto è perfettamente equilibrato tra le note dolci maltate e quelle amare dei luppoli. La struttura, semplice e non invadente, la rende beverina e fresca. Il piacevole retrogusto conclude un’esperienza fantastica. Sono curiosissimo di provarla anche alla spina.", "Pours a nice sparkling, lightly cloudy amber with an average size fizzy white head. A bit more head and it would have looked perfect. Aroma of hops, barley, light malt, yeast and citrus. Flavour has a nice hoppy bitterness to it well balanced with some caramel malt.", "Very nice APA looks great in the glass and very well balanced without any standout flavours", "White, frothy, fairly persistent head. Golden yellow, clear. Fairly intense and persistent at nose. Citrus, grapefruit, malt, herbal, orange peel. Average carbonation.", "Olor frutal y floral. Amargor medio. Con una carga de gas en su medida. Muy refreacante.", "Di un bel colore arancio acceso, ha una buona persistenza della schiuma, che risulta bianca e molto cremosa.\nAl naso come al palato pompelmo, arancia amara e note erbacee, a metà bevuta fa capolino il dolce del malto, subito riequilibrato dall'amaro dato dai luppoli in dry hopping.\nCorpo medio leggero, abbastanza beverina.", "Taste this bottle end january ’15 @ home, from Netherlands. bottle.\r\nAlmost clear golden color, with a creamy white head.\r\nAroma: sweet, caramel en honey notes. Medium body.\r\nTaste: bit sweet, some fruits, soft hopsbitterness. A hopsbitter ending.\r\nGood and refreshing.", "Bottle. Smells like fresh muscat, comfortable bitterness. Traditional great beer.", "spruce, citrus, golden, clear, white foam, frothy, light sweetness, lightly bitter, light body, slick feel, average carbonation, bitter\r\nInitial hop burst of citrus/spruce which fades fast. Malt is balanced with bitterness quite well for a mild effect. Pours golden with decent white foam that persists well. Mouth feel is slick, slightly soapy, with a mildly bitter finish. Not bad.", "Old rating. Good pale lager. Cereal body. Fruity finish. Crisp hops make it stand out.", "Ez a sör nekem nagyon tetszett. Friss, illatos, nem bántóan keserű (sőt, talán éppen hogy alig keserű). Véletlen választás volt, de tudatosan ajánlom kóstolásra minden komló kedvelőnek.", "Bottle at the Free Press, Cambridge. Dark golden with plentiful carbonation. Grain, apple, cereal, spruce nose. Hint of plastic. (Side note: I get this a lot from Anchor). Taste threatens bitterness, but delivers a syrupy sweetness on top of the hop bitterness. Yumsers. Long drier finish. Aftertaste tends more toward bitterness.", "Bottle. Average white head with medium retention. Sligthly hazy ligth golden colour. Aroma is citrus, hoppy, floral, with malty and fruity notes, complex and rich. Taste is fruity, some malty, sligth caramel hints and bitter finish. Very well balanced taste. A very good APA.", "Bottle. Copper with firm foam head. Fresh, fruity aromas of lychee, lime, cactus, pineapple. Taste is mildly bitter, with a development towards anise. Quite soapy. Fruity aftertaste. Ok.", "Pours a large frothy white head that slowly diminishes. Body is hazy yellow amber, sparkles are visible.\nAroma contains light malts (hay, bread, caramel), moderate hops (perfume, pine, orange, lime), light yeasts (horse blanket, dough) and banana, vanilla, pear, spices, raisin and grape.\nFlavor is light acidic, then light acidic and sweet, followed by light acidic, sweet and light bitter and finishing in light bitter.\nBody is light to medium with watery texture and soft carbonation.\nOk, lacking complexity and a bit too thin. Still, not bad.\n\n---Rated via Beer Buddy for iPhone", "Poured a golden yellow colour with a bit of bubbly head. Aroma is very hoppy, some floral notes. Good lacing and carbonation. Lemon/lime citrus type flavours, some malts. Mouthfeel is nice, tingly. Pretty refreshing. Good stuff.", "draught @ Cph Appearance: pours slightly hazy amber with small soapy white head and some lacing. aroma/taste: caramel, toffee, citrus and fruity and floral notes. palette: medium carbonation, medium body, some caramel sweetness, average to high bitterness, medium duration, dry finish and an oily texture. Overall: nice light APA", "Copper-orange body, medium sized white head, soapy lacing. Light floral and citric hops, backed by light biscuit malts, and a touch of pine. Medium bodied with moderate carbonation, mild bitterness, light sweetness throughout.", "Pours beautiful copper with large frothy head. Citric and herbal aroma, with some caramel aswell. Taste is nicely balanced, medium bitter and sweet. Lively carbonation, medium body and light bitter aftertaste, alcohol is present. Well made APA!", "Bottle from celler door, four oaks, Sutton coldfield. Golden beer with large foam head. Aroma is floral hops and light malts. Taste is floral hops, some vegetal notes, citrus and a little pine resin. Decent stuff.", "On tap at a Spring Training game. Amber color with one finger white head. Grassy and lemon aroma. Taste is similar and smooth. Good one.", "Beer in the glass is amber, fully carbonated and mounted with a nice foamy white head. The liquid is amber and a bit hazy. Lots of carbonation coming from the bottom of the glass, as said. Very good looking beer. Looks fresh! The nose is fully Pilsner-like oriented. Smells like a summer pils, but with a touch of fruity sugar to it that is not unpleasant. This beer has a medium body and a surprisingly complex taste wich brings back the aromas of citrus and fruits with more power than expected. Con: the carbonation is still running in the stomach a little too much for me. The beer is interresting, well balanced and easily drinkable. To be enjoyed during summer time with a fresh plate of watermelon!", "Cleat amber, medium white head. Light toffee and hop nose. Medium bodied, sweet and a bit bitter. Finishes bitter and nice. very nice.", "Tap. Aroma: little citrus with bread. Good appearance: nice head. Taste light bitterness, medium sweetness. Quite good beer.", "12oz bottle. No code date visible. Appearance: Hazy light golden. Nice white foam cap. \r\nAroma: Bready with light citrus. \r\nTaste: Bready, sweet malt that gives way a light citrus a moderate bitterness. Bitterness is not nearly as sharp as Sierra Nevada Pale. Grapefruit is very prominent. \r\nMouthfeel: Moderate body and carbonation. \r\nFinish: Leaves a pleasant grapefruit flavor and lingering bitterness. \r\nOverall: compared to Sierra Nevada Pale, this is a better balanced, less hop forward pale ale. A really nice easygoing pale ale. Could stand to benefit from a slightly stronger hop aroma.", "Typisches Pale Ale mit ansprechender Bitternote. Bernsteinfarbige Erscheinung und lang anhaltendem leicht bitteren Nachgeschmack.", "A hopped up pleasure. Nice balanced with a good fresh taste. Decent aroma and good overall beer.", "Pours pale copper. A taste of hops, some fruit. A very mild bitterness that has a quick finish, mixture of sweet and bitter. A refreshing, slightly bubbly taste.", "12oz bottle from Masuyo’s Liquor in Asagaya. Poured into an English pint glass. Beautiful golden amber color with an off-white soapy head. Great lacing throughout. Nice citrus and resin on the nose. Slightly earthy and malty on the palate along with the citrus notes mentioned before. Nice medium body and perfect dry finish. An all-around classic APA.", "Poured from bottle. Aroma of citrus. Pours a cloudy pale with white head. Has a medium bitter taste. Light to medium body and creamy texture. A nice refreshing ale.", "This beer pours a mildly hazy golden color with a thick creamy white heat that left plenty of lacing around the glass and has lots of streaming bubbles. The aroma is mostly floral hops, pine, earthy hops, citrus, and some breadiness. The taste is mostly hops but not pine, some citrus, caramel, and breadiness. The mouthfeel is on the medium side and it finishes rather dry.", "Ambar alaranjada, perfumada e intensa. Lúpulo bastante aparente no olfato e paladar. Frutado amargo, ótimo aftertaste. Muito boa.", "35.5cl bottle @ home from Bert’s Bierhuis Oost, Utrecht.\r\nBody is clear to opalescent, golden,\r\nHead is medium, white, creamy, fully lasting, excellent lacing.\r\nNose is honey,\r\nAroma is floral, caramel, honey,\r\nTaste is medium sweet, light bitter,\r\nFinish is long lasting medium bitter-sweet, later more hoppy bitter, light watery sidetaste.\r\nLight to medium body, oily texture, average carbonation.\r\nEasy to drink, quite refreshing, tasty one.", "355 ml bottle from Vinmonopolet. Small beige head. Clear orange body. Strong malt body. Belgian-like yeast. Apricot. Taste is a nice blend between sweet and bitter. Slightly sour aftertaste. Nice tangly mouthfeel.", "Lekker stevig schuim, heel klein beetje bitter. Niet zo bijzonder. Licht gouden biertje @home\n\n---Rated via Beer Buddy for iPhone", "Bottle at home. pours amber with a white head. Aroma has orange, light toast. Medium body, medium carbonation. Caramel, marmalade, lemon, pine, light candy, light wood... Drinkable enough. OK.", "335 ml. bottle at home. When it makes sense to me to ship a beer, albeit an APA, from California to Denmark, where we have so many great American hopped brews locally, then this must be something special. And to me it is! I struggle to find a more elegant APA anywhere. Perfectly hopped, deep yet refreshing, with just that touch of Belgian - dare I say it - Karmeliet champagne bubbliness and finesse. Shipping a beer half way round the globe is expensive and perhaps mad....but in this case, I appreciate that we are enough enthusiasts to make it worth the trouble. So if you have not tasted this elegant brew from the company which also makes the great Anchor Steam (best enjoyed on tap locally)... get going!", "33cl @ bottle. American Pale Ale per il solito ottimo birrificio di San Francisco. Non gli altissimi livelli che ha raggiunto con altri stili, ma una birra beverina con luppoli americani.", "Bottle 35.5cl. Slightly hazy medium amber, big frothy and sticky white head, recedes slowly, thin layer remains all the way, good sticky lacing; malty aroma, fruity (apricot, peach), caramel, floral and citrus hops; tatse medium bitter and sweet, good balance of malts and hops, fruity notes; medium body, oily to creamy texture, soft carbonation, dry bitter aftertaste, citrus, lightly spiced; quite mild for an APA, pleasant.", "Aromat: owoce, trawiaste akcenty, żywica, lekki karmel, wszystko stonowane i delikatne\r\nWygląd: zmętnone złoto, piękna piana, lacing idealny\r\nSmak: słodowa baza, skontrowana dość wysoką grejtrutową goryczką, sporo posmaków owocowych (porzeczki, winogrona) i żywicznych. Jest nieźle, ale siłą rzeczy człowiek spodziewał się czegoś...lepszego", "Smells of hops...and freedom! A nice pale ale. Good color, just a bit on the watery side. Could be because I’ve been drinking dark beers almost exclusively. Nice finish.", "Not too interesting aroma and taste. A little caramel, a little conifer, little fruit. Bitterness is small.", "355ml bottle into glass. Delicate floral nose, a little malt. Hazy golden beer with sudsy white head. Excellent subtle carbonation on the tongue. Hop bitterness followed by toasty malt finish. Moreish.", "Bottle at home. Has a slightly hazy orange colour, and with a creamy head. Aroma of berries, apricot, sweet malt, caramel and some lime and spices. Sweet flavour as well with more caramel, flowers, dried fruit and grassy hops. \r\nHas a slick mouth feel, and a balanced bitterness. A pretty malty and fruity APA with a pleasant bitterness in the end.", "En jarra grande. Color cobre claro. Espuma blanca no demsiado persitente, aroma a lupulo algo citrico no muy afrutado, malta y algo a levadura. En boca amargor medio, algo de dulzor, pero bajo, y un final a lupulo batante persistente y amargo...duradero. Una cerveza sin grandes sorpresas pero ningun defetecto. Me gusta....no es un cervezote pero es rica y recomendable.", "Im Glas hell, ordentlicher Schaum, tolles Aroma, Citrus und Orange. Im Trunk sehr weich, verhältnismäßig mild, Citrus, im Abgang ganz leicht bitter. Lecker, aber mir nicht kantig genug. Gut zum Wegtrinken.", "Bottle into IPA glass. Pours a clear light copper colour with a finger of white head. Aroma is bright citrus from the cascade hops. Taste is light malt with nice grapefruity bitterness. Excellent beer.-- rated via 'Find A Beer' for Blackberry 10", "Buen aspecto, espuma persistente y cremosa. Aromas a cereales, miel, caramelo... también se aprecian notas florales del lúpulo.\r\n\r\nEn boca es dulce, bajo amargor y fresca", "355mL bottle from Beer Cartel BB 05/2016\r\nPale gold body, slight haze, holds a tight white head.\r\nDecent intensity nose; pine, grapefruit rind, grassy hops, touch of peach & toasty sort of malt.\r\nMedium body, quite dry textually, moderate slightly creamy carbonation.\r\nStarts with a touch of toasty, light caramel sweetness, palate continues with grassy, woody hops, touch of peach & citrus rind, drying out with a firm bitterness. \r\n Reasonable APA, seems a touch different from most, textually perhaps? Different yeast perhaps? Unique in a sense, lacking the complexity of better examples though.", "DATE TASTED: January 16, 2015... GLASSWARE: Kisatsky Tavern pint ... OCCASION: a good week done... APPEARANCE: a storm of effervescent bubbles whirl violently below an absolute dreamy cloud of thick white head; hazy orange amber in color; lacing is ribbed and substantial... AROMA: sharp orange peel; some sugarlike cookie, vanilla, grapefruit and spring flowers... PALATE: creamy at the lips; slight pings of sourness at the teeth; effervescent but swift to the throat; light and mega-sessionable ...TASTE: citric flavors of grapefruit and lilac, orange and vanilla make this already a winner; the malt settles nicely, providing balance...OVERALL: why so long to revisit this most perfect example of the genre--as refreshing and flavorful as a pale ale can be...", "Poured from a 12 oz bottle into a tumbler on 05.09.14.\r\n\r\nA: 1 finger head with an aggressive pour. Crystal clear orange.\r\n\r\nS: Biscuity malt, citrus.\r\n\r\nT: Caramel is first, then sweet citrus. Bitterness on the back end, then lingering sweetness again.\r\n\r\nM: Crisp.\r\n\r\nO: This one is a classic IPA. It’s not at all hop heavy in comparison to the IPAs of today. It’s simply subtle and refreshing. The malt seemed more dominant than the hops, which is weird now, but it comes from a different time. It was a great gateway into IPAs for me.", "Bottle @ home. Pours with a clear orange colour, big long lasting rocky white head. Aroma is medium malty, medium hoppy, with lots of hoppy notes: hops in this beer seem to have been used mainly for their aromas, more than for their bitterness; the results are hints of flowers, resin, grass and hay; very interesting, even though it might be balanced a little bit better. Taste is little to medium sweet, little to medium bitter, slightly sour, slightly salty. Medium body, oily texture, soft carbonation.", "Aroma is pleasant and pretty strong from Cascade hops. The taste is well balanced and laidback. Modest taste of grass, hay and peaches. Light body. Actually it is a perfect beer, and I would never turn it down if I’m offered one, but it lacks that \"ooomph!!\" that I crave from my pale ales to be a real contender.", "It's a beer. It has a lot of flavor in the malt and hops but I almost wish it didn't. Teeters between really good and not good depending on the drink which probably speaks to the strong ingredients. I'll pass on re drinking this; it's flavorful but not my flavor each drink.\n\nBottle.\n\n---Rated via Beer Buddy for iPhone", "Bottle poured into a tumbler. Clear dark yellow / amber appearance. Little white head. Fruity nose. Taste is similar, aporicot, mandarie, orange, peaches... Some nice hops in the aftertaste. Very drinkable beer. I’d swap this for the usual European lagers anytime.", "Decent looking beer with a deep golden reddish color. Aroma is a mix of hops and sweet flavors, mostly citrus. However both aroma and taste are rather flat for me and a bit too simple to rate this beer higher. It is still pleasant on the palate, but just falls a bit short on the taste, especially aftertaste which is too watery for me.", "Currently I am updating my ratebeer with al the beers I drank but was too lazy to rate at the time. I give the scores I gave back than. If I drink the beers again I might re-rate them.", "Poured from a 12 OZ bottle into a pint glass.\r\nAroma- Has a strong hop and grain aroma.\r\nAppearance- A dark golden pour with a white head. \r\nTaste- A well balanced beer that has a nice hop flavor with a subtle grain background.\r\nPalate- A full bodied beer with a creamy feel that lingers in your mouth.\r\nOverall- Another great brew from Anchor Brewing. Cannot go wrong trying this one.", "Couleur orange très pâle, petite mousse qui disparaît vite. Nez houblons américains avec côté résineux prononcé. Amertume légère, bonne rondeur quand même.\r\nPas incroyable mais la bouteille manquait peut-être de fraicheur.", "Bottle - amber with a foamy beige head. Aroma of peach, light malts and some grass. Taste is a mix of roast malt and fruits; peach, mango and lemon. Bitterness to finish. Light body, low carbonation.", "Pours an amber body with a thick head. Faint hoppy aroma with citrus tones. Nice hoppy taste with a bitter end.\n\n---Rated via Beer Buddy for iPhone", "Blonde dorée, beau col de mousse blanche que se tient très bien. Nez très floral , épices et levure. Bouche un peu savoneuse? (soapy), florale (j’arrive pas à mettre un nom sur la fleur ...), coriandre, levures. Bonne carbonation, bien structurée, amertume moyenne. Pas tellement à mon goût, mais très originale pour une APA. Elle change des bières américaines ultra houblonnées et aux arômes très fruités.", "Liberty ale au pays de la liberté … quel plaisir … d’autant plus que c’est en Californie !!\r\nAle brassée depuis 1975, de 5,9 % abv, avec du houblon en dry hop.\r\nCouleur doré abricoté, avec un léger voile.\r\nBulles fines par dizaines partout.\r\nMousse beige bien crémeuse et épaisse, qui tient un nappage à 2 mm.\r\nArômes d’agrumes, vinaigre de vin très fin, camomille, prune blanche, miel.\r\n1ère bouche structurée sur les agrumes, houblon, malt clair, croûte de pain blanc.\r\nArrière-bouche à la très belle amertume.\r\n2ème à l’équilibre superbe malt/houblon, avec une délicate carbonation.\r\nArrière-bouche entière et longue.\r\n3ème à l’amertume fine, précise, pointue.\r\nArrière-bouche fine et longue.\r\nLa longueur suit la même ligne, sans autres vraies nuances.\r\nLes jambes sont marquées, en ligne.\r\nL’alcool est correct pour le genre, il gère tranquille.\r\nLa finale donne une belle amertume mais sans surprise.\r\nCONCLUSION : belle ale qui tient la route, mais ne surprend pas en finale, \r\nce que j’aurais beaucoup aimé !!", "Light yellow cloudy appearance, small diminishing head, sweet aroma mild on malt and hops fruity, well balanced fruity flavour with a smooth bitter aftertaste, nice drop but I couldn’t drink too many, would tire easily on this ale.", "Smell of caramel. Golden colour, high white head. Aroma of cognac, grain, oak. Medium bitter, medium sweet. Slightly oily.", "Bottle (355ml) at Transport Hotel, Melbourne. A straightforward easy drinking APA with citrus and floral notes and a fine crafted palate. Light-medium fruity hop bitterness. Hazy amber appearance with average white head.", "- 35,5cl flesje via Gall & Gall, Maastricht\n- Alcoholpercentage van 5,9%\n- Uitgeschonken in Kaapse Brouwers glas\n\nUiterlijk: goudoranje kleurig met redelijk dikke witte schuimkraag\n\nAroma en smaak: fruitig als abrikoos, bloemig, bittertje in de nasmaak\n\nConclusie: ale met veel smaak, zou hem wel niet geregeld willen drinken", "Bottle from the Rugby Tap. Aroma is of grape, grapefruit and some dank hops. Taste is grapefruit with some lemon in there. Spiciness is coming through at the end. A lot of Cascade in this one!", "Part of my Liquor Mountain Tasting Set & so served in the accompanying Anchor Brewing glass. Liberty Ale - 6% pours a crystal clear shinning copper gold with virtually no head. The aroma is a pleasing fruity & floral bouquet. Medium bodied with a very sweet, fruity flavor, a bit of minerality and some biscuity malt bite. I am also getting a bitter crisp finish with some buttery vanilla notes. It’s ok, I can see how in 1975 this would have wowed people but these days it is quite tame especially for something in the American Pale Ale category.", "Je n’aime pas la forme de la bouteille (même si la remarque reste totalement anecdotique ^^) mais le contenu est de très bonne facture ! Une belle amertume florale et peu sèche, très à mon goût. J’en reprendrais volontiers. ^^ Bouteille bue au bar La Tête à l’envers, Vincennes, France, le 01/12/2014.", "Butelka. W aromacie, cytrusy, kwiaty i żywica. Kolor słomkowy klarowny, z bujną pianą koloru białego. Piwo dosyć gęste, nagazowanie średnie, w smaku czuć hinty miodowe ale pierwsze skrzypce gra goryczka ziołowo cytrusowa limonkowa. Gładki finisz chmielowy, niezbyt mocno ściągający, przyjemny.", "Bottle. Pour is gold with a foamy head, aroma is fruity and sweet. Taste is fruity, sweet, pineapple, light bitterness, finish is gentle bitterness, body is medium, carbonation is soft. Decent", "Pours nice golden with small white head. Aroma is resinous/citrusy. Probably expected too much from this, based on all the positive reviews and the fact that I love a lot of the other Anchor beers. Overall a good beer, but nothing special.", "Pours clear yellow from with a medium bone-white head from a bottle. Nose has caramel and bread with hints of butter. Mouth has some grass with a typical malt body and hops. Medium body with a bitter finish.", "This beer has an odd flavor that really presented itself early in the process, it was smooth after the initial taste.\n\n---Rated via Beer Buddy for iPhone", "Nose combines malt and floral hops. Taste is bracing and sharp. Features a rich hops presence with limited bitterness on a subtle roasted malt base. Assertive, yet enjoyable. Along the lines of an IPA but not over the top. Dry finish. Tasty and well done.", "Bottle 0.5l at Pozarevac Ultimate Beer Tasting Serbia with ippopotamo36 and luttonm.Thanks to Alberto.Pour it golden color with small white head.On the nose hops.Taste and aroma of hops, sweet fruits.Ok good one.", "Tap - Nice golden color wit very small white head. Delicate aroma of honey and grapefruit. Very light in taste with notes of straw and good balanced bitterness. Easy drinkable but I was waiting for something more to come that would be at least a little bit surprising. In the end only one of many APA’s and not the best price-quality relationship.", "The dank, the dank! Stanky and danky, lemony cereal, caramel, caramel, fruity floral blast-off. This tastes like nothing I’ve had in this style before, big pungent resin and citrus hops blended with sweet caramel malts and some straw. A very pretty do, this would be as sexy as a blonde could get were this brew a woman, and one that smoked el ganja. Bitter be she, like the blondes I’ve left scorned. Punchy lemon hops, smooth caramel-coated corn flakes, poncho dank-o.", "355ml bottle purchased at GREAT supermarket in Hong Kong. Pale clear golden colour with a medium head which quickly disappears. Malty floral aroma - honey, caramel and grapefruit. Very bitter malt taste. Medium carbonation and lightly hopped. Dry malty aftertaste. A little too commercial for my taste.", "I didn’t even know what this beer was at first, so unique I thought it was its own style. Pours a hazy amber with a tiny white head. Aroma is very pleasant with hints of pine, toffee, and floral hops. Tastes of honey herbs, pine, and minerals. Has a smooth medium body with lively carbonation and great lacing. A very good take on the style.", "Rarely tasted a Pale Ale with such a strong aroma of hops and such bitterness. Very nice!", "Pale gold in colour, thick frothy head. Has a hint of caramel on the nose with some citrus and grass notes. Taste is not overwhelming, and is mostly dominated by the toasty malts...but there is enough Cascade in there to make it enjoyable. I can appreciate the history behind this beer (being the first modern single hop ale and the first dry hop ale etc...) but it does have that kind of generic American Pale Ale taste. That isn’t necessarily a bad thing!", "It’s got a strong chemical metal taste to it, very soapy head like what you get on cheap club beers, bitter but lacking hops flavour, the aroma is mild citrus and metal. I maybe got a bad batch, sun exposed, or maybe different places in the world get different brews because this doesn’t resemble any of the good qualities mentioned in other reviews. I lump this in with beers like Heineken and Grolsch, which are supposed to be completely different beers.", "Flasche (355 ml) von Getränkefeinkost, Berlin-Friedrichshain. - Mein erstes amerikanisches Bier vor einigen Jahren und eins der wenigen US-Biere, die ohne größere Anstrengungen in Berlin zu bekommen sind. - Helles Orangegelb, trüb; bescheidene Schaumbildung. - In der Nase köstlicher fruchtiger Hopfen: Grapefruit, Orange, Nadelwald. - Antrunk delikat fruchtig-hopfenherb mit Anklängen von Zitronenschale. Kaum süß. Mild rezent, schlank, trocken. Die fruchtige Hopfenherbe geht nahtlos in trockene, mild harzige Bittere über. Wunderbar aromatisch-hopfenbitterer Nachtrunk. - Geradezu elegantes Pale Ale, mit markanten aber nirgends übertriebenen Hopfenaromen. Deutlich subtiler als so mancher Pale-Ale-Versuch eines deutschen „Craft“-Bier-Adepten.", "From a bottle. Pours clear gold with a lasting rich creamy head, smooth and delicious hop flavours. I like this a lot.", "Draft at Toad in the Hole. Keg kicked mid-pint; beer is slightly hazy deep gold with tenacious meringue head. Light tangerine, floral, pine, and biscuit nose. Grapefruit is the dominant flavor note; I think one could nearly replicate this flavor profile with pink grapefruit juice and a spot of honey or malt extract. Carbonation feels especially refined, but finish has a touch of.. gastric.. acidity that precludes perfection.", "12 fl oz bottle. Clear yellow-orange with creamy white head. Some lacings on the glass. Fruity aroma of lemon, orange, mango and grapefruit. Low carbonation. Bitter and dry finish. Overall a good beer. Very refreshing, easy to drink.", "\"not as big with the citrusy hop aroma or flavor as i’d expect. pretty thin on the palate, but not a bad beer. there are just much more intriguing pales out there\"", "355ml bottle served in a shaker glass.\r\nA: Pours a clear orange color forming a big and very bubbled light yellow head. Medium retention forming some lingering thin lacings in the glass. \r\nS: Very malty. Strong notes of sweet pale malts and flowery and grassy hops. Caramel malts, roasted malts. Notes of dark fruits and grapefruit. Bubblegum. :) \r\nT: Slightly sweet upfront. Strong notes of sweet malts: Crystal malts and roasted malts. In overall, the taste is dry with a medium but persistent hops bitterness. Notes of caramel, grapefruit and grassy hops. \r\nM: Light body. Good and fizzy carbonation. Sweet caramel malts and grassy hops in the aftertaste. \r\nO: Excellent drinkability. Classic American Pale Ale. \r\n[ BA Review @ 1/15/2010 ]", "Well balanced and extremely tasty! A little bit more residual sweetness is the only thing keeping it from a near perfect score.", "Very solid beer. Has a light fruity aroma and smooth finish. Great summer or early fall beer\n\n---Rated via Beer Buddy for iPhone", "Liberty ale is a classic, however compared to other American pale ales I didn’t find it so exciting. Maybe it was revolutionary when it came out, but now its hop profile seems quite subdued. Shared bottle at Plonk.", "Butelka 0.33L.\r\n\nWygląd: Złote, klarowne z iskrą. Piana biała, obfita, drobnopęcherzykowa, trwała i ładnie firankuje na ściankach szkła.\r\n\nAromat: Aromat chmielowy słodki: dojrzałe mango, pieczone jabłko, żywica do tego toffee. Bardzo przyjemny.\r\n\nSmak: Delikatne, głównie słodowo, biszkoptowe, lekko owocowe z niewielką grejpfrutową goryczką. Minimalnie metaliczne.\r\n\nOdczucie: Nasycenie CO2 powyżej średniego, faktura kremowa, ciało poniżej średniego.\r\n\nCałość: Bardzo delikatne piwo, klasyczne APA, co na obecne standardy bardzo mało chmielowe. Wybitnie pijalne.", "Pours a slightly hazy golden. Smells earthy with a mixture of fruits. Pretty carbonated. Somewhat bitter and dry. Tastes are similar to the aromas, but more muted.", "355ml bottle from LCBO, Toronto, ON. Pours a hazy dark gold colour with one finger of foamy white head. Flowery aroma with notes of spice and some oranges. A very pleasent IPA-like taste. Not as bitter and spicy as your average American Pale Ale. It’s smooth and refreshing. Lacing clings to the side of the glass. Moderate carbonation.", "From a tap at the brewery.The pour is a very slight hazy pale yellow.A light to medium body with a hoppiness and grass notes.", "On tap at Salon piva 2014. Pours golden color, white head. Aroma is floral, honey, malty. Taste is medium sweet, alcohol, malty, bit fruity.", "Transfer from BA review from10-12-13-\r\n\r\n Poured from bottle into a pint glass\r\n\r\n Appearance – The beer pours a quite hazy orange-amber color with a two finger, thick and creamy white head. The head very slowly fades, leaving a nice level of streaky lace on the sides of the glass.\r\n\r\n Smell – The aroma of the brew is of a citrus nature overall with a good dose of sweet orange and some aromas of a more grapefruit like nature. Along with these aromas, were other smells of fruit, with apple, mango and pear all present. Some bready aromas and a bit of an earthy hop smell round out the aroma profile, producing a rather sweet and balanced IPA smell overall.\r\n\r\n Taste – The taste begins with a biscuit and grapefruit hop taste. There is a little bit of a caramel sweetness upfront, but this is rather light with it growing even lighter as the taste advances further. While the caramel fades, some fruit flavors of lighter fruits comes to the tongue. Along with the fruit flavors, so too comes more hop with more grapefruit as well as an earthy hop flavor coming to the tongue. At the end, a nice floral flavor come to the tongue, rounding out the flavors nicely and producing a drier and nicely moderately hopped flavor to linger on the tongue. \r\n\r\n Mouthfeel – The body of the beer is average in terms of its creaminess and thickness with a carbonation level that is on the average side. Both are rather nice for the drier and moderately hopped flavors of the brew, making for a very easy drinking beer.\r\n\r\n Overall – A very enjoyable and easy drinking, moderately hopped brew. Quite tasty overall.", "Tastes Like Hops And Cardboard. Aroma is sweet with sugars and grains. Nice pour with fair amount of Carbonation.", "Review based on the BJCP2008 guidelines (style 14B). Bottle 355 ml - Batch unknown. AROMA: floral and citrusy hop and esters aromas reminescent of grapes, oranges and some piny and resinous character. some sweet malt background. APPEARANCE: medium gold color and clear. nice moussy head of a slight ivory colour that persists. TASTE: citrusy and piny flavours more faint than the aromas. sweet malt background. medium-high bitterness that lingers into a dry finish. PALATE: medium-light body with medium-low carbonation. OVERALL: a nice APA that promisses in the aromas but doesnt deliver much in the flavours.", "Hazy amber color with rich white mediaum-lasting head. Medium carbonation. Aroma rich is fruits and floral hops, with citrus and sweet malts. Taste is very fruity and citric, spicy and hoppy. Dry finish with a slightly bitterness. Very balanced and refreshing.", "Light retention and light lacing. Smells of hops, light citrus and grapefruit. Tastes of sweet malt, grapefruit and pineapple. Light bitter aftertaste. \n\n---Rated via Beer Buddy for iPhone", "Ljusgul klar vätska med vit medelstor bestående krona.Frisk ganska söt doft. Smaken är ren och klar med vissa gräsiga inslag. Mycket välbalanserad med en lätt efterbeska. En bra ale", "Aroma of mango and other exotic fruits, fruity, light sweet taste, some weeds in there too. Not bad, not great either.", "So, this is the famous Anchor Liberty Ale? The original hoppy American pale ale? The beginning of the craft beer revolution? This sweet, sugary, pale malt infested, lager-like stuff? You’re kidding me, right? Ok, so the aroma has some citric notes blended in with the generic fruits and the wet paper, but to call this \"heavily hopped\" and mean it, you’d probably need a time machine set to 1975. The flavour is a tad more interesting, there are some stingy floral and herbal stuff in the finish, and the citrus is more evident. The finish is also moderate bitter, and back in the good old days that was probably what it took. This one might have been a great beer once, but today if feels under-hopped and totally and utterly uninteresting. \n\r\n[35.5 cl bottle, enjoyed 10 months before BB date, from Systembolaget Gårda, Göteborg]", "355ml bottle from the LCBO. Gold body, slight amber tint, with a thin off-white head. Citrus and peach are present in the aroma, floral aroma as well. Medium percieved bitterness. Thin body, very sessionable. Medium carbonation.", "355ml bottle. Pours a solid amber with an off-white head. Pine aroma. Robust hops to taste but reasonably smooth with a nice bitter finish. Nice beer.", "Bottle. Slightly bitter with only mild hops. A good flavor, just very weak overall. I guess I’m spoiled by Victory brews. Unimpressive.", "Clear dark golden with white lacing head. Faint aroma, a little citrus, and some sweet fruit. Decent hoppy flavor and a mild bitterness in the finish.", "Bottle. Pours clear golden with thin off-white head. Lots of lacing. Hoppy, fruity, flowery nose. Taste likewise, peaches, green apples, a bit of pine, grassy, some malty caramel, chemicals. Taste is light sweet to dry, medium bitter. Light astringency on the palate, medium high carbonation, watery. Long chemical bitter finish. Weird.", "(tap 0,3l @ OP (Brno))\r\n\nAroma : Fruity (peaches, sweet oranges), bubble gum.\r\n\nAppearance : Clear dark golden color. Minimal white head.\r\n\nTaste : Fruity, medium sweet, light bitter.\r\n\nPalate : Medium body. Light sticky texture. Long bitter finish.\r\n\nOverall : Interesting, balanced, unusual.", "Pours a bit paler than most IPAs. Smell is cleaner and less bitter than your average IPA. More piney, less grapefruit/citrus. Taste is similar in that its not your average IPA. Its more crisp and less overwhelmingly bitter. Mouthfeel is a bit thin, but this is expected. This isn’t my favorite beer, but I didn’t expect it to me. It’s not bad.", "355ml bottle at home. Clear golden with a medium white soapy head. Medium body with moderate carbonation. Well balanced sweet- and bitterness. Malts, caramel, citrus, grass, pine, herbs and banana. A nice tasteful and refreshing pale ale.", "35,5cl bottle from Systembolaget, Strömstad. Pours deep golden to amber with a slightly creamy off-white head. Mild malty aroma with fruity and hoppy notes, citrus, caramel and hints of herbs. Moderate to medium sweet with fruity and herbal flavours and a moderate bitter and slightly dry finish. Decent APA, but not as refreshing as I remembered it.", "Famous ale launched in 1975 to remember Paul Revere’s ride in 1775. Creamy, sticky head, warm orange blonde colour; delicate aroma, fresh fruitiness (peach, orange), soft sweet malt taste with fruity and citrussy accents and a long finish of dry-hopping with Cascade, very pleasant. Flawless and perfectly balanced, this lived up to the expectations I had of it.", "The smell is probably the best about this beer. Caramel, pine, banana - everything is mixed and everything goes right into your nose.\r\nThe taste is a bit less interesting - quite flat, with a little bitterness.", "Amberish golden in color. Good head. Nice lacing. Hoppy aroma with a pine hint. Hoppy taste with a citrus taste. Finish is a bitter hop. Good Beer.", "Pours clear gold with large white head. Hoppy fresh aroma with heavy pine, citrus, a bit floral. Body has a delicious malt base with biscuits, dried fruit and flowers which is contrasted by a decent hop bitterness. The balance is absolutely perfect and the mouthfeel is very creamy. Long bitter aftertaste. Really impressive.", "Bottle. Bright amber body with white head. Aroma is citrus with some alcohol and hints of bread. Taste is some honey with bread. Aftertaste is medium bitter with some herbs and alcohol. Classic.", "Very floral hop aroma. Clear golden colour with excellent head. Citrus and passionfruit flavours with bitter finish. Medium body and carbonation.", "While staying at my daughters place on holiday (Orange County) I thought would try plenty of local beers and secondly ’well thought of, multi rated’ beers of America that I had not drank before: this is one of those in the later category. Bottle on the balcony: 8th July 2014.\r\n\r\nGolden amber body with a full white head. I expected more of a hop blast to be honest, this was subdued and almost subtle in nature. Mildly citrus hops blended with some floral notes and a malty background in the nose and then on into the taste. Maybe having it side by side with a Victory Hop Devil did this beer no favours: even so this still didn’t carry enough character to merit a high score from me. I bit disappointed with a beer and brewery I have heard only good things about.", "Aroma of yeast citrus. Surprisingly lacks of much taste, but really waterish and refreshing. One can also feel alcohol which is surprising form a 5,9%. Great bubbly palate. The color is golden with thin head. Quite a good ale for the summer!", "Flaska från SB. Bärnstensfärgad vätska med tjockt skum. Blommig doft med en persikoantydan. Mycket fruktig smak med en skön beska.", "Aroma: Medium-high hops, woody. Light spicy, some tea-like aromas. Light malt, bready. No DMS, No diecetyl.\r\nAppearance: Clear gold body. Massive frothy/rocky white head.\r\nFlavour: Malt: light, bready. Hops: high, woody. High bitterness, slightly harsh. Bitterness lingers into finish. Dry finish. No DMS, No diecetyl.\r\nMouthfeel: Medium-light body. Light astringency, Medium carbonation, creamy.\r\nOverall: A decidedly bitter and hoppy beer, but the astringency and harshness is not to style. Otherwise great aroma and flavours.\r\n\r\n355 ml bottle, poured. Thanks Andre!\r\n14B. American IPA", "0,33 from Hietalahti alko @Antero Saimaa. Kirkas, iso vaahto. Tuoksu kompottimaisen hedelmäinen, mallasta. Maku humaloitu, lempeä.", "Vycap Richtar Jakub. Tmavsia oranzova farba, biela pena. Vona ovocna, kvetinova. Chut lahka, prazdnejsia, kvetinove tony, lahko citrus.", "Tap at RJ. Aroma nicely hoppy, fruity, orange, resiny, caramel. Clear orange colour. Short lasting head. Taste is going in the same direction. Really typical American ale, good, unimpaired by long journey. I like it, very good.", "Smell and taste as a good craft flower based soap. But isn’t a soap, it’s a good beer ;-)", "355 ml bottle @ Central Bierhaus Ottawa. Pours a very lightly hazed yellow with a good size, creamy white head. Aromas are plastic garbage bag, citrus, and faint hops. Tastes are a nice light caramel/grainy malt balanced against a moderately assertive bitterness. Light body, plenty of carbonation, and a short bitter finish. Nice ale despite some weird aromas, could just be an older bottle. \n\n---Rated via Beer Buddy", "Very refreshing as for apa. Nose of tropical and citrus fruits. The taste lacks this nice bitterness, real fruits. Nice light gold/apricot colour. Not havy at all, nicely balanced though.", "A damn good Ale that reminds me of freedom and how much I love living in America. All kidding aside, though, it’s an awesome brew with a lot of flavor that doesn’t scare away new drinkers. Definitely a beer to keep on stock for everyday occasions.", "Couleur dorée, belle mousse blanche. Nez houblon fruité, raisin, zeste d’agrume. Gout malté houblonné, avec bonnes notes de caramel et amertume en fin de bouche. Très douce a boire.", "Clear, light gold pour with a thick white head. Citrus, tropical fruit and malt on the nose. Taste is sweetish, citrusy, malty, quite clean, nice bitterness at the end"]}