{"reviews": ["Trüb bernsteinfarben mit weißer Schaumkrone. Malziger, hopfiger, eher leicht fruchtiger Geruch. Geschmacklich betont bitter malzig mit Citrus, Grapefruit und Anklängen an Karamell. Mittlere Süße mit hoher Bitterkeit, mittlerer Körper mit spürbarer Kohlensäure.", "Blik 35,5cl thuis gedeeld als Celebration Fresh Hop IPA. Pine, citrus, malten, licht plakkerig, tropisch fruit, bitter, bloemig, hop (cascade, centennial, chinook), caramel. English Strong Ale invloeden. (27-3-2022).", "Pours a deep amber colour with a pale tan-coloured head.  The aroma is grassy and slightly of cough mixture.  The taste is initially sweet with a moderate bitterness kicking in afterwards.  Overall a good quality beer.", "Can from Drankenhandel Leiden. Aroma is piney hop with grapefruit, malt, pine resin, orange. Hint of caramel. Bitter flavour with some sweetness. Medium body. Bitter, piney and malty. First brewed in the year of my birth, gotta respect the classics.", "Flasche 0,355l: Dunkles Bernstein, Kupfer, leichte Trübung, stabiler mittelporiger Schaum; sehr fruchtige + würzige Nase, leichte Süße, kräftige frische Hopfenaromen, leichte Zitrusnoten, dunkle/reife Früchte, kräftig Malz, Getreide, leichte Röstaromen, kräftige Hefearomen, fruchtig-würzige Bitterkeit; fruchtiger + würziger Körper, kräftige Süße, würzige Hopfenaromen, Zitrusnoten, leichte trockene Säure, dunkle/getrocknete Früchte, kräurige Noten, etwas Pinie, kräftig Malz, Getreide, Karamell, cremig, deutliche Kohlensäure, kräftige Hefearomen; fruchtig-würziger Nachgang", "12 oz can pours an almost clear copper color with lots of bubbles rising to a decent sized off-white head that both lasts and leaves some lacing.  Aroma has pine resin, grapefruit, and caramel.  Taste is definitely bitter.  Body is medium to full with average carbonation and a sticky mouthfeel.  Aptly named, this is one to celebrate.", "2021 can. Somewhat hazy dark amber pour with a big sudsy off-white head that has great retention and lots of sticky lacing. The aroma is rather piney with lots pine needles, twigs, and rye breads. The taste is bitter hops forward with lots of pine, grapefruit, orange peel and some caramel. Finishes long and bittersweet, Overall ;top shelf baby", "On tap at Melos pizza Danville Ca. 2021 Celebration “Fresh Hop” IPA much better than years past to my taste. Much more hoppy than malty for a Holiday brew…as the name suggests! Smooth wet finish that you could still enjoy by the old Yule Log too!", "Robe ambrée rousse avec une mousse assez très légère et fine\nSenteurs sur le caramel, le pin, les fruits rouges et de baies de sureau.\nPremière bouche surprenante dans sa forme, très discrète au début puis avec une amertume qui monte crescendo, des arômes de caramel, de citra et de raisins se distinguent et une belle finesse émerge de l'ensemble. On distingue aussi des sursauts de menthe et de thym faiblement perceptibles.\nDes arômes de pin et de pamplemousse et une belle rondeur houblonnée de fin de bouche terminent la gorgée, une belle amertume étrangement bien équilibrée entre la rondeur la finale sèche, Sierra Nevada confirme une nouvelle fois sa maîtrise du sujet et réalise une IPA complexe et accessible, preuve de son savoir faire.\nMerci à cette brasserie de nous proposer de belles découvertes !", "Bottle of 33cl. Pours ruby/amber. Aroma is mostly grapefruit and pinewood. Finish is dry with mid/high bitterness", "335 ml bottle poured in to a Tulip. Dark copper colour with a creamy off-white head. Fruity aroma with citrus, caramel malts, pines, floral hoppy notes. Taste is bitter. Medium bodied. Dry and bitter finish with pines and citrus accents. Nice West Coast IPA.", "Amber color without head. Malt, some caramel, brown sugar and hop aromas. Dry taste.", "Plutôt rousse, mousse assez dense et fine. Pas mal de corps, caramel, houblons américains cascade, centennial, chinook (pas ceux que je préfére). Assez sympa.", "355ml 2020 bottle. Pours unclear amber with a big foamy head. A lot of caramel, grapefruit zest, pine, tangerine, nuts, herbal hops. Hoppy bitterness, malty caramelly sweetness. Full bodied, oily texture, lively to soft carbonated, dry hoppy bittersweet finish. Nice classic IPA!", "Bottle. Clear dark orange/amber sporting a decent firm white head. Aroma of citrus fruits, resin and pine. Taste is all that plus a solid   malt base, some grass and caramel topped off with a herbal bitterness that keeps lingering on till the cows come home. Medium carbonation. Very balanced. Really good.", "12-02-2021; bottle; at home (bought at Saveur Bière, as part of their January 2021 discovery box).\nThe beer looks very nice. The colour is a nice golden amber, witha a lovely bright glow. The beer is absolutely crystal clear. Some nice fine bubbles can be seen rising towards the top. There they form a very nice silky smooth light grayish brown layer of foam. Foam retention is good and a decent drape is left on top of the beer. All in all, looking very good. \nThe aroma of the beer is nice. Malts form a nice bismuth base, with some notes of caramel and a touch of bread. Hops are nice and robust. They give strong aromas of pine, some nice resin and also nice zest, stone fruit, citrus. It is quite a hoppy beer, and definitely New World hops. Also some great spicy hop notes, giving it some holiday flare. There is some alcohol in there too. Nice aromas. \nThe taste of the beer is good. Bitter hops, some nice acidity from the hops too, and nice sweet malts. The result is a pretty well balanced beer.\nThe palate of the beer is also good. Medium body, slightly sticky texture and nice medium carbonation. The finish of the beer is nice and has nice bitter hops, with quite some nice zesty notes and some pine. All in all, a great IPA with New World hops. Reason for a celebration alright.", "2020 Celebration: Ein kupferfarbenes Ale im Glas mit leicht hellbraunem Schaum. In der Nase Malz und leichte Haselnußtöne. Im Mund deutlich bitter und dazu malzig, außerdem etwas Blutorange und wieder nussige Aromen.", "Bottle from Systembolaget. The heavy treacle like malts and nicely balanced by the hops. Dark amber colour. Just as in the aroma, it is a very well balanced beefy West coast ipa with a sort of English strong ale. It works rather nicely to be honest.  (7/2/21)\nSame conditions rerate. 3.5 to 3.6 came across as more mature ipa, very nice.", "Bottle from an online shop, drunk while Vietnamese take out is being picked up, yum. Thank goodness the Sierra Nevada cap reminded me to use a bottle opener; I've hardly any teeth left, from all the beers that forgot to mention this. Color is deep amber with a big cream colored head. Faint nose of citrus and caramel. The flavor has a lot of caramel, wow, wasn't expecting that. Bitterness is very present, the grapefruity not-so-pleasant variety that's the reason I don't favor Sierra beers. Definitely a powerful older-style USA IPA, I guess a lot of Cascade and C hops. On style, but just not my cup of pale.", "Bottle, 0.355l. Hazy amber/copper pour, one finger frothy off-white head. Good retention, lasting head, nice lacing on the glass. Interesting on the nose, citruses, ripe fruits, herbal and floral notes.\n\nMedium body, average carbonation. Smooth mouthfeel and texture, chewy, slightly creamy, very nice on palate. Malty sweet taste combined with strong herbal bitter kick. Aroma of caramel malt, ripe fruits, candy. Toasty notes, grassy, herbs and spices, peppery. Strong lingering bitterness. Nicely balanced. Medium lasting finish, dry, bitter, lingering spiciness.\n\nGood one.", "Een mooi gebrouwen IPA. Ziet er schitterend uit. De geur is niet al te sterk. De smaak is heerlijk bitter zonder zo'n vervelende hopburn.", "Dark amber colour, creamy head.\nAroma: caramel, citrus, malt, raisins, plums, apricot, some cream, fermented fruits, brown sugar. \nTaste: malt, caramel, yeast, brown sugar, bitter malt. Hint of molasses and spices. Dry finish.", "35.5cl fles. Helder amber kleur, fijne romige creme schuimkraag. De geur is citrus en ananas. Smaak is zoet, citrus, karamel en ananas. Medium body en veel koolzuur", "35,5 cl. bottle @ Rick.\nClear dark amber with an off-white head. Malty caramel aroma with some hops. Sweet taste with a long low-bitter finish. Very solid malty IPA.", "2020\nAR: Hopfen, Harz, Karamell, kräuterig, grasig, \nAP: trübes bernstein/kupfer\nTA: Hopfen, bitter, kräuterig, grasig, Tabak, Karamell", "12 ounce bottle at The Winking Lizard in Peninsula, Ohio. Scent of hops to the nose. Amber in color with a white head. Light taste of hops and sweetness. Well balanced and smooth. Little bit carbonated. Slight oily finish. Nice holiday beer. Cheers!", "Bottle. 12 pack only $15.\n\nSmells like sweetness.   It's yellow.\n\nTastes bitter and quenching. It's perfect.  Mouthfeel is easy and chuggable.\n\nA perfect beer at a perfect price.", "355 ml bottle, as 2019 Celebration Fresh Hop IPA. Amber colour, medium sized head mostly lasting, fair lacing, soft carbonation. Nose is hoppy, some strawberries and lemon, light pine, cereal malt. Flavour is moderate sweet, medium to intense bitterness, strong hops, grapefruit. Bone dry with a long lasting bitter finish. Pretty good!", "Aroma: citric fruit, pine, some pineapple\nAppearance: mildly hazy amber with a one-fingered beige head\nTaste: citric fruit, pine, medium medium-high bitterness,\nPalate: medium body, dry finish, medium-high carbonation\nOverall:", "A small bottle purchased locally in Vancouver from a private liquor store.\n\nA copper colored beer with modest white head and a hoppy, malty nose, confirmed on the palate. Plenty of hops and malt goodness in the same glass. This is what I call a big IPA. Good stuff! ✌️😊", "Some hops. Good palate. Not a fan of the hops but drinkable.........................", "Colore ambrato con riflessi ramati, schiuma fine cremosa e persistente.Sentori di luppolo fresco, agrumi, frutti tropicali. Note dolciastre, agrumate, caramellate. Retrogusto amaro e speziato.\nBottiglia da 35,5 ml - 6,8 %\nIPA India Pale Ale", "If IPA could taste like snow on an evergreen...this is it. Nice pour, beautiful head. Fresh hop softened. Pair with chili, crab cakes, nachos....crisp refreshing..seasonal treat from Sierra", "Copper, Bright, off-white Beerhead, with frothy, medium and lacing foam, Good retention. Intensive Hoppy flavors, such as Citrus, grapefruit, litchi. Slightly piney and spices. Typical American hops. Medium sweetness, High Bitterness, Soft carbonation, Smooth touch, The taste is mainly hoppy performances, like piney, citrusy, and also caramel malts, such as caramel, crusts, and little toasty. Overall, it's a complex beer and pretty enjoyable.", "Beautiful soft copper poor with beige head. Malt aroma of pine and floral hops. Flavor is strong pine and floral hops that linger on the palate for hours. Finish is slightly candy sweet. This is ok, but I wouldn’t go out of my way to get it.", "Rich copper color with lasting tan head.  Taste is strong bitter hops that lingers.  Slightly sweet malt at the end, but leans heavy to hops.", "Butelka. Lekko mętnawe o miedzianym kolorze. Piana również prezentuje się świetnie,wysoka,biała,utrzymuje się długo. Owoce,i wyraźne szyszki w zapachu. W smaku podobnie z dużym naciskiem na chmielem,spora goryczka ,łagodzona trochę przez owoce. Wysycenie małe,lekko oleiste.Super..", "It poured a 2” head, had a dark honey color and very mild citrus aroma. It’s a very drinkable, smooth beer but has a bit too much alcohol aftertaste for my liking.", "Pours clear gold with a white rocky head; atoms of grapefruit and pine; crisp delightful palate with a zesty finish.", "Found out of bottle. Pours a clear copper with medium foam that leaves a lot behind. Drinks like a smooth pale ale. Good winter option as it sits heavier than most for the style.", "Color naranja oscuro, cercano al marrón, turbia, translúcida. Espuma beige de casi un dedo de espesor y corta retención. Aroma intenso a resina y pino, caramelo, miel y flores de lúpulo, ligeras notas cítricas. Sabor en esa línea más maltas tostadas y ligero café muy equilibrado, final medio corto cafetoso y seco, alcohol bien integrado. Textura acuosa. Carbonatación media.\n\nMuy buena receta, limpia y equilibrada. Si ves llover por la ventana, mejor aún.", "Classic winter brew. Floral hop notes and an amber hued pour. Complex sweet malts and hops (maple sweet and pine resin and citrus bite). Smooth finish that is not all bitter bite due to the sweet malt taste. Cheers!", "Packaged on October 2018: bit old for the name 'Fresh hop IPA'\nVery juicy and full-bodied, while not fruity. Good balance.", "2018 edition, bottled in Oct 2018, so about 7 months old. 12 fl oz bottle, poured into a small tulip glass, where it appears a deep but clear amber shade, topped with a bog head of off white froth which is quite persistent. Aromas are muted floral hops, pine and resin, and a very malty presence. Taste is sweet malts to start off with, almost like a Belgian ale, followed by pine and resin bitter. Nice carbonation, medium bodied.", "Keg. Pours a dark brown colour with a fluffy white head,  malty aroma with hints of caramel, the taste is medium bitterness and fruity with a dry bitter finish.", "Did someone say Xmas in a glass.  A mate of mine describes my Belgian Strong as that.\nCelebration is something I always look for heading into Xmas.  Not easy to find in Aus, but was available in the last couple of years.  Best enjoyed with Family and Friends.\nJust that hint of spiciness from the Hops, another high on my list", "Bottle. Frothy, blooming tan head on an amber body. Grapefruit juice, berries, pine, grassy fresh hops, toast, light strawberry. Medium sweetness, tangy and tart, with slightly dusty, zesty medium bitterness. Slick medium body with natural carbonation and a deep, caramelic, hoppy and slightly dusty fresh hop feeling. Very nice!", "Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah.\n\n---Rated via Beer Buddy for iPhone", "4th beer review. Not knowledge enough to take apart the flavours in this beer but I thought I’d say what I can anyway.\nNice breads/biscuity and hoppy aroma, lovey 2 finger tan head, looks great. \nLots of flavours but not overwhelming, bitterness is reasonably long that lingers in the mouth nicely.\nA nice flavoursome beer but personally not my favourite; I’m sure others love it for what it is though.", "Bärnstensfärgad, lätt disig. Fruktig doft, inslag av tallbarr. Smak av mango, grape o tallbarr. Kraftig beska avslutar.", "Pretty solid. I don't like IPAs but the fresh hops helps. Appearance is lovely golden orange. Aroma and taste is lemon, grapefruit, and hops. Aftertaste is fairly bitter, but not so bitter that I wouldn't drink this at a get together.", "Currently celebrating my birthday with the 2018 vintage of Sierra Nevada's Celebration IPA, although we're at around three months since bottling this still tastes fresh and flavorful! Poured into a snifter, this brew featured a long-lasting white foamy head atop a slightly hazy and murky amber-orange-red colored body, looks a bit raw but not unexpected for a beer meant to capture the rustic note of a fresh hop harvest. Aroma is surprisingly malty with strong notes of warm caramel and red fruit, along with some citrus hops in the background. The flavor follows with a hearty rich caramel malt baseline that segues into fruity esters and piney hops. Finishes with a pleasantly moderate piney bitterness that leaves an aftertaste of caramel and warm apple. Overall very enjoyable and refreshingly complex, yet another solid beer from Sierra Nevada that is good but not stand-out exceptional to me out of their line-up of good beers. In short, I would definitely drink this again, but wouldn't feel the need to grab it every year.", "0,33 l bottle. Very good IPA in my mind but may be a little bit too bitter, but just a little bit :)", "2018 edition - written \"Fresh Hop IPA\" (packaged 10/22/18). Unfiltered amber colour showing some very tiny particles, with a warm yellowish frothy top, good retention and lots of wavy lacing. Fruity malt aromas with roasted, caramel and nutty hints. The taste is floral, a little perfumy, with a nice dry end. Feels like a bigger, dry-hopped red ale. Quite nice !", "Tap @ The Castle, Holland Park. Pours slightly hazy chestnut body with cream white head. Malts, caramel, citrus and some dark fruitiness. Refreshing!", "destrosa horra wellis dekklista hz, hombre terri drusti dell kunzi, kerris del juli andreetrir, hui", "Mörkbrun till rödaktig i färgen med ett beigeaktigt skum. Kraftfull smak med mycket beska från humlen. En aning äpple och citrustoner.", "Fra flaske.\nKlar ravfarvet med lyst skum.\nAroma af harpiks, karamelmalt, korn.\nSmager let bittert og sødt med medium fylde. God balance mellem den bitre harpikssmag og karamelsødmen. Klassisk og lækker", "Bottle. Clear dark amber color. Small size, off-white head, stays. Citrus, caramel, very malty in aroma and in taste. Fizzy carbonation. Drinkable brew.", "Tap at the White Horse pub. Clear copper with loads of bubbles and a lively cream head. Strong resiny and grassy hops. Christmassy spices with pine resin, a hint of chocolate and dark malts and a sweet sticky finish. An interesting and slightly different take on a seasonal beer.", "Very pleasant surprise!  I did not expect such a good beer!  Perfect balance, very refreshing with a big bitter finish!  Well done!", "Bottle at 100 õlle koht. Pours amber. Aroma is caramel, pine, fruits. Flavor is sweet and bitter, caramel, pine, malt, fruits. Finish is resinous. Overall: good, old school ipa.", "Celebration 2017. Spero di aver beccato una bottiglia sfortunata perché non mi ha convinto per niente. Amaro che copriva il tutto, aroma debole, birra di natale per finta. Una ipa classica e probabilmente conservata male. peccato.", "Bottle from 7-11. Copper coloured. Malty, pine hops, medium bodied. Fairly bitter. Pretty good.", "Pours dark amber with a thick creme head. Aroma of hops and pine. Taste is typical of a pale ale with a significant amount of hops to grace the tastebuds. Palate includes more pine and resin.", "Really not a Christmas beer, still it is one of the only beers I truly look forward too during the holidays, of course with the exception of the big boys that are released this time of year. Aroma is nice, noble hop, pine, resin, good malt characteristic. Appearance is reddish amber, nice off white head. Taste is typical pine, grass, dank, with a biscuit malt characteristic. Palate is nice medium boy with a dry and refreshing finish.", "Another IPA in the sheer endless range of IP variants California seems to have. I would call this one \"Christmas IPA\" Darker and Heavier in mouthfeel and spiciness from spices or hops (should ask the brewer which one) \nThe bitternes is the longest lasting taste of this beer and tends to be a bit unpleasant in the end. Also noticable is the long lasting thick and heavy foam. Aat the end of my beer, I still have foam in my glass.", "Ultimate Christmas beer. Santa gets jealous of it because people start singing “Sierra Nevada Celebration Is Coming To Town”. Mrs Claus fantasizes about it  while diddling her cookie and Rudolph keeps it stashed in his cowboy flask on Xmas eve. Yuletide in a glass! Hohoho.", "Smooth aroma,  smooth taste definitely a beer for a relaxing night on the couch, also beautiful citrus taste also aroma.", "Quite possibly the best beer ever... perfectly balanced- big malt and fresh hop bite- not a malt monster not a hop bomb- not a imperial high alcohol double whatever- just a absolutely outstanding ale.", "Updating review for 2019 version of Celebration. Aroma has a nice subtle pine aroma, bit of hops no caramel notes like last years.  Same color. This year I get less chocolate and roasted malts, this is more of an IPA. Tastes increased to 7. Nice bitter finish. Overall rating increased to 13, for the new score of 3.6. In other words this batch is better than last years.\n\n\nOld Review 3.3 total\nAroma-7\nApp-5\nTaste-5\nMouthfeel-4\nOverall-12\n12 oz bottle. Smell has a bit of pine and some caramel notes. Very clear and amber colored. Tastes of chocolate and roasted malts, mixed with grapefruit and pine. Has a piney bitter finish. The tastes clash for me, makes me think of a Marzen mixed with an IPA.", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "Smells like fresh hops, pine, herbal and malt characters. Dark reddish in color with dirty white head. Taste is smooth hops, cherries, pine, amber notes, and malt backbone with a slightly bitter finish.", "From a bottle to a glass. Pours a slightly hazy copper/amber color with a medium frothy silky creamy head. Aroma is faint earthy hops and slight tobacco. Taste follows the aroma with notes of slight cranberry, cherries. Very great malt backbone and very balanced with a excellent silky smooth medium to almost heavy mouthfeel. So tasty and balanced!", "Copenhagen 24/9 2018. 35,5 cl bottle. As “Celebration Fresh Hop IPA”. Drawing of House covered in snow on the label. \r\n\r\nPours hazy, dark reddish orange with medium-sized white head. Settles as 0,5 cm thick layer of foam covering the surface of the beer. Substantial Lacing. \r\n\r\nAroma is sweetish and dominated by exotic fruits. Peach, sweet melon and mango. Noteable odor of tangerine nd Grape fruit. \r\n\r\nMedium carbonation. Slightly thick, lively prickly texture. \r\n\r\nFlavor is medium sweet followed by stronger citric bitterness. Aftertaste is bitter and lingers for a while. Finish is semi-dry. \r\n\r\nNice if not exactly Ground Breaking IPA with a good balance between the sweet and the bitter.", "the aroma is hoppy and fruity with hints of orange, grapefruit, pine, some tropical fruits and spicy herbs... the taste is fruity and hoppy with notes of grapefruit, orange, pine needles, kumquat and spicy grasses... bitter and dry aftertaste...", "Poured from 12 fl oz bottle (2017 vintage: 10/26/17). Copper with off-white (almost beige) head. Malty, mild caramel with resinous hops. Would've been great in the 90s/early 2000s. It's still good, but not outstanding.", "Amber with nose of sweet malts and some hops. Taste also slight bitter with tones of sweetness. Palate not very long but hoppy and nice.", "355ml Flasche. Klar und dunkelbraun mit minimaler Schaumkrone. Malzig. Mit Röstaromen. Ordentlicher Körper. Leicht herb.", "330ml bottle. It's the 2017 version, so it's kinda old. Still has a nice malt profile, the hops are decent for old hops, but the fruitiness is completely lacking. A rerate is in order, but this is drinkable.", "The beer has got a hazy amber colour with a steady head and medium body.  Aroma of malt and hops. Taste of hops,  malt, pine, vanilla, caramel and bread. Mild malty, hoppy finish.", "Sierra Nevada Celebration Ale pours a hazy dark amber color with a beautiful and long-lasting off-white head and very nice lacing. Very pleasant floral notes from the hops dominate the bouquet with light orange peel and caramel notes from the malts. The caramel becomes more apparent upon taking a mouthful as it is the main component of the attack, a mid-palate of molasses, pine, flowers, and grapefruit follows and leads to a spicy, dry, and warming finish with strong, persistent bitterness with a hint of roastiness. The warming and dark character makes it a great choice for gloomy winter days, although when combined with its rather bright fruitiness, it makes one wonder where exactly this brew wants to be placed.", "355ml bottle. (2017 vintage) Pours a hazy copper with a large, frothy, long lasting, off-white head that leaves chunky lace. Aroma of caramel malt, grapefruit rind and pine needles. Sweet flavour of caramel malt, toffee, orange, grapefruit, lemongrass and pine resin with a dry, spicy hop finish. Medium body with a smooth, oily texture and soft carbonation. Nicely balanced, easy to drink.", "Santas Little Harzer!! Bloody Like Fresh PineOil & messerscharfer IBU-Hunter mit Muffsocks! Need water😉 Honey, Malt & Cake too👍..355ml Bottle. 2017er Edition. CRAFT BEER STORE HH.", "En wederom een extreem hoog gewaardeerde sierra nevade en weer ben ik niet echt onder de indruk...", "Bottle 355 ml (12 oz), 2017 release. Pours hazy amber with small to medium white head. Aroma is malty, citrussy and floral. Maybe a bit pine. Taste is malty and pine, a bit floral and orange peel. Medium body, small carbonation. Long bitter aftertaste. A nicely balanced IPA.", "Shared bottle @Cafestes1, Sabadell. Pours amber with thin white head. Aroma is malt, citrus, pine. Taste is caramel, citrus, grass.\n\n---Rated via Beer Buddy for iPhone", "Bottle at Cafès Tes Sabadell. Subtitled “Fresh Hop IPA”. Amber/Copperish with white head. Pine and caramel aromas. Bitter start, but sweet as well. Noble and refreshingly balanced. Easy and solid beer.", "Aroma of malt, fruits, bread and hints of caramel and pine. Amber with a off- white head. Medium sweet and medium + bitter. Medium body with a average carbonation. Dry and bitter finish. Overall a decent IPA.", "35,5cl Bottle @ Okasional Beer, Barcelona, Spain.\r\nAmber colour with a thin white head.\r\nAroma is malt, hops, citrus, pine.\r\nTaste is malt, sweet, hops, citrus, resin, grass.\r\nMedium body, average carbonation.", "Fiery amber color. Pinecone, caramel and citrus in the nose. Medium full body, lots of pine, malty, medium full body. Rounded but punchy hoppiness. Nice", "CAN. My first taste would have been the 2014 vintage. Straight from can on this rating.. Piney heavy malt aroma.. Has big sappy malt upfront, goes to the piney hops, sappy.. Sourced cape cellara", "No aroma to speak of just caramel flavor not enough hops for me. My husband preferred my Drekjers wheez the Juice to his which was this\n\n---Rated via Beer Buddy for iPhone", "Pint from tap at the North Star. A well balanced mix of roasted malt, light hops and caramel. It improves its flavour when it warms", "0,355 l bottle, 2017. Pours copper with a finger of lasting tan head. Aroma is mix of sweet malt aroma, biscuit, caramel and piny, resinous and light citrus hop notes. Taste is quite sweet and medium to heavy bitter. Body is medium to full, texture is oily and carbonation above average. Finish is long, initial sweetness is overridden by quite heavy bitterness that lingers on tongue for a while.", "355ml Flasche „Celebration Fresh Hop IPA“. Flasche von 2015, gut abgelagert! Rot-braunes Bier. Luftiger Schaum. Intensiver süsslicher Duft. Starker Malzkörper. Melasse, Karamel, Rosinen. Dazu kräftig bittere Hopfenaromen. Langes Pinienfinish. Danke an R-to;-)", "From Decervecitas. 2017 version. In Teku glass. Playing Bloo Kid 2. Smooth feeling and great aspect, with a thick, persistent foam. Pleasant but surprisingly malty for a beer labaled as fresh hop IPA, with hops giving a soft bitterness but not much flavors", "2010 Edition\r\n\r\nThis beer was served out of a 12oz. bottle dispensed into a glass....\r\n\r\nPresentation - Label artwork is very tasteful and classy in the traditional SN style. Give one the feel of a sunny winter day. Always love SN bottles and artwork!\r\n\r\nAppearance - SNCA pours out a orangish/copper color with a loose white head that sticks around and laces nicely down the glass.\r\n\r\nSmell - This is def an IPA like it claims. I cold smell different hints of citrus and the classic IPA piney smell. Absolutely wonderful!!!\r\n\r\nTaste - I want to start of by saying that I love IPAs so and this is one of the 3 best that I have had!!!! Taste goes along with the smell. Citrus/Piney taste throughout with a nice smooth bitterness on the backend.\r\n\r\nMouthfeel - A thinner light bodied beer which makes for a smooth feel in the mouth with a nice amount of carbonation that gives the feel of a more full bodied offering.\r\n\r\nDrinkability - Very drinkable if you like IPAs. Smooth, tasty, and very enjoyable.\r\n\r\nI really enjoyed this offerening because it was an IPA which is different from most holiday offerings. I would definitely recommend this to any IPA lover as a good holiday brew(Note: 2010 edition).\r\n\r\n\r\n\r\n2011 Edition\r\n\r\nThis beer was served out of a 12oz. bottle dispensed into a glass....\r\n\r\nPresentation - Same label and look of the 2010 edition only has 2011 stamped on it. Very nice.\r\n\r\nAppearance - SNCA2011 pours out the same beautiful amber color with a light and airy 2 finger foam golden white foam head that slowly fades to a nice frothy coating.\r\n\r\nSmell - Smells of strong floral/citrusy/piney hops. Some hints of bready malts as well. A very nice, big smell.\r\n\r\nTaste - Tastes very piney on the front end before the floral/citrusy hop flavor takes over. In my opinion SNCA2011 was a bit more hopped than the 2010 edition.\r\n\r\nMouthfeel - Very nice amount of carbonation with a medium bodied feel. In my opinion SNCA2011 has a bit more body than the 2010 edition and has a slightly creamy feel.\r\n\r\nDrinkability - Excellent taste and smell to go along with being medium bodied and moderately carbonated make this an extremely drinkable offering.\r\n\r\nCelebration never disappoints. While the profile is slightly different from year to year it is always an exceptional brew!!\r\n\r\n\r\n\r\n2012 Edition\r\n\r\nPresentation: SNCA 2012 sports the same basic label artwork and setup as 2011 with the exception of the 2012 marking on the neck. Neck label gives a fine description of the beer and has the 2012 marking. Front label has the festive artwork in the traditional SN style. Rear label has a nice back story on the beer, ABV info, and website info.\r\n\r\nAppearance: I poured this from its 12oz bottle into a 16oz English Pint. SNCA2012 pours out a clear copper orange color with a 2 finger white foam head of light density. Head retention is exceptional lasting a full 4min before fading to a thick coating and ring. Lacing was very good.\r\n\r\nSmell/Aroma: Smells of fresh hops with a citrus and piney scent very prevalent. A slight caramel malt scent can be detected as well.\r\n\r\nFlavor/Taste: Tastes follows the nose as the citrus and piney hops rule. A biscuit-like toasty malt flavor is detected on the front end that gives way to an intense hop bitterness on the finish. Very well balanced flavor profile.\r\n\r\nMouthFeel/Drinkability: Medium bodied with a slick almost creamy mouthfeel. Above average amount of carbonation. Insanely drinkable with an excellent profile across the board.\r\n\r\nOverall/Comments: SNCA is a completely different beer from nearly all that one will find offered in the winter seasonals. An excellent twist on the traditional classic American IPA. The fresher the better with SNCA. A true classic every year and SNCA2012 held true to form. Classified as an American IPA at 6.8% ABV. Consumed 1/11/13. \r\n\r\n\r\n\r\n2013 Edition\r\n\r\nPresentation: Awesome label in the SNBC tradition that the festive SNCA feel with awesome eye-catching graphics and colors. Front label gives a bit of brewery info. Back label gives web info, ABV info, and a nice backstory on the beer. Neck label give vintage (2013) and a nice description of the beer.\r\n\r\nAppearance: An aggressive pour from it 12oz brown bottle into a 16oz English pint led to a 3 finger white head of a medium rocky density atop a deep orange/copper/amber colored beer. Head retention was an awesome 5min 27 sec before fading to a thick coating and ring with phenomenal lacing. \r\n\r\nSmell/Aroma: Smell is of piney resin hops with nice herbal tone. Citrus aromas are very prevalent along with a nice caramel maltiness. \r\n\r\nFlavor/Taste: Tastes is of very piney resin on the front end with a sweet maltiness that balances out the resin very well. A sweet citrus hop flavor that blends nicely with a bready biscuit maltiness at the midpoint. Back end quickly turns pine hop bitter with a resin herbal aftertaste. \r\n\r\nMouthFeel/Drinkability: Medium bodied with a slick and creamy mouthfeel. The perfect amount of carbonation make this very drinkable. \r\n\r\nOverall/Comments: A truly great seasonal treat that I look forward to every year. The fresh hops are the star every year! A must drink! Consumed 1-21-14. Classified as an American IPA @ 6.8%ABV.", "Bärnsten med stort ljust skum. Doft av tropiska toner och lite sötma. Söt fyllig öl med lång beska. Något dunkel och len,önskar lite mer crisp! Fortfarande god!", "354 ml bottle at home. Pours a clear amber with an off-white head. The aroma is lightly hoppy with notes of pine, flowers and faint citric notes along with some biscuity malt. Medium to medium-full body with a medium bitterness and a very light sweetness. The flavor is medium hoppy with a distinct herbal bitterness along with blood oranges, grapefruits and some resinous and peppery notes with a discreet malt body in the back. Finishes with a good, hoppy (lightly metallic) bitterness. Built around the hop aroma yet not overly hop forward with a decent bitterness and good drinkability.\r\n\r\n\n\nAroma: 7 \nAppearance: 4 \nTaste: 8 \nPalate: 4 \nOverall: 13", "Pours copper red with medium white head. Aroma is hoppy, fruity, some hay, metallic, some fruit sweetness. Taste is fruity, fresh, hoppy, metallic, dry, hay. Very nice beer!", "12oz can from Kroger (Staunton, VA).  Piney aromas, resiny, some grapefruit.  Clear amber with orange highlights, and a fully lasting off-white head.  Dry, citrusy, resinous.  Medium bodied.", "Pours a cloudy, dark amber coloration with a large, fluffy, lasting head. Smells of biscuity, slightly grainy and caramelly malt and resinous, citrus hops, with notes of grapefruit and pine. Taste is an excellent balance of biscuity, caramel, slightly grainy malt and fruity, bitter and resinous hops, with notes of grapefruit, orange peel and pine, Finishes with a medium/strong bitterness and some grapefruit and pine lingering in the aftertaste. Smooth mouthfeel with a medium body and carbonation.\n\nThis makes for a great old school IPA with a certain East Coast vibe, the bitter, resinous hops being balanced against a strong, slightly sweet malt backbone perfectly. The first time I had this it was over two years old and I was really impressed by how much resinous bitterness was still left in it, although the sweet malts had clearly taken over. Now, at four months old, those bitter, resinous hops and citrus notes clearly shine through a lot more distinctly, makinf for and even more enjoyable brew. There certainly is a reason that this is a classic and I really wish that I could get my hands on this even more fresh and regularly, although it really is a beer that keeps up incredibly well.", "Keg at Rose and Thistle, Frimley. Not getting much aroma over food. Light chestnut. Creamy white head. Graduappy gains bitterness. At first had a caramel sweetness. Then hoppy bitterness gains prominence. Underlying malts. Medium bodied. Slick. Low key fizzy carb. Long finish with astringent bite. Not too bad. A malty IPA. Does leave a bad taste in the mouth I'm not entirely keen on. However works as a winter beer. 3.4", "1/1/18\r\nHad with Abby during the first quarter of Bama vs. Clemson sugar bowl. Roll Tide!!\r\n\r\nPoured from bottle. Deep hazy orange with a 1 finger white head. \r\n\r\nAroma is piney hops with a little sweetness. \r\n\r\nTaste is more piney hops with a fair caramel malt presence. Really well balanced. Both bitter and sweet. \r\n\r\nNot too much carbonation and medium feel. Hoppy bitterness lingers on the finish. \r\n\r\nOverall, this is awesome! Balance is exceptional! Lots of malty sweetness with a great showcase of the hops. Would have assumed it was a Double/Imperial from the malt presence. I’ll definitely get it next year too!\r\n\r\nUpdate 11/11/2018 w/ the 2018 version.\r\n\r\nDense, floral and resinous with a fantastic balance of pine, citrus pith and a touch of malt. Killer IPA from Sierra Nevada!", "4 finger off-white head.\r\nClear, amber coloured beer.\n\r\n\nAroma is grapefruit, lemon peels, apricot, caramel, light passionfruit and pine.\n\r\n\nTaste is grapefruit, bready malts, pilsner spiciness and pepper with a boozy finish. Hint of clove and roasted malts.\n\r\n\nMouthfeel is semi-sticky with a slightly dry feel. Medium-high bitterness. Low carbonation.\n\r\n\nOverall: An OK IPA with a good maltiness but it felt quite anonymous most of the time. Pleasant but not something I'm longing for to drink again.", "An excellent winter time ale. Aroma is light pine a pinch of citrus and some roasty notes thrown in. Color is a medium brown to Amber. Flavor is a bit of pine with lots of rich caramel malt and toasted nuts, a medium bitter finish. Not too sweet and not fruity like a typical IPA. Just what I'm looking for in the winter to enjoy.", "Orange gold pushing light  mahogany color  and light head.  Some pine and citrusy hop aromas and roasted malty balance. Medium body mouthfeel and true to style. Crisp  finish.", "Celebration just made my Top 5 of any style. Pours a dark orange with a very thick, rocky, tan head which laces nicely and sticks around to the end. I like IPAs but was not sure if I would like fresh hops -- I do now! You get a tasty balance of hoppy bite and sweet malt delivered in medium body. If you like IPAs, but weren't sure if they were for winter --- this is your answer. It's delicious -- I normally don't buy beers twice because I like to keep trying new ones, but, I am definitely going to pick up another six for the holidays. Awesome.", "Poured from bottle dated 9/28/17 copper color with a tan head. Aroma is doughy malt light citrus floral notes and pine. Taste is caramel spice and a strong lingering bitterness.", "Pours a cloudy amber with a sudsy caramel colored head. Caramel malt and vegetal hop nose. Usual hop harshness from SN. 1) couldn’t believe I’d never had it; 2) went to one bar and three stores to finally find some; 3) regret that I got excited about it and paid $11+.", "12floz bottle, BOD: 11.07.2017, $8 six-pack, pint glass. Appears amber in color with clarity and a beige sticky head. Very piney with an underlying note of caramel in both aroma and taste. Mostly bitter and body is on the heavier range of medium. I used to look forward to this more, but it's still a good beer.", "Interesting, initial fruit then resinous, not malty, fresh and different. \nHops and floral are not strong, but nice overall taste. \n\n---Rated via Beer Buddy for iPhone", "Taster in Salling. Pours amber with an off white head. Aroma of resin. Sweet caramel malts, grassy hops, citrus and grains. Taste is bitter with some sweet caramel malts, grassy hops, pine and citrus. Old and old school.", "A rich powerful beer, full of hops and bursting with flavour. Perfect on a cold winters night", "Gezapft. Leicht trübes Amber. Körperreich mit Wacholder Note. Saisonales IPA über die Wintermonate. Würde dieses mal zu einem würzigen Wildfleisch versuchen.", "Pours a color of cognac, with plenty of head. Balanced taste of malt, hop, and pine. Malt in front, hoppy in back. Great with thanksgiving meal, terrible with cheese.", "This is the 2017 release, labeled as Celebration Fresh Hop IPA. Piney-citrus nose with s some bubblegum esters as it warms up and breathes. Mid-malty body with, alas, a harsh bitterness that's roasty, rather than hoppy. Slight stickiness to the maltiness. Harsh bitter finish. A disappointment--this one didn't work for me.", "Poured 12 oz bottle into a pint glass.\r\nAppearance is burnt orange with a thin head and minimal lacing. Aroma consists of slightly piney hoppiness and malt. First sip is malty with some hops and spice and then finishes slightly bitter. This is a beer to which I look forward and thoroughly enjoy every year.", "0,3 litre Bottle from Total Wine Boca Park. Cloudy Dark Golden with medium white head. Bitter.", "This has been and continues to be one of my favorite beers. It never disappoints!", "5 week old bottle > pilsner glass\r\nA: Poured a thick pillow of craggy tan foam atop a dark tawny orange gold body with very good retention and busy carbonation visible.\r\nS: Orange peel, pine and caramel. Amber-esque.\r\nT: Bitter piney hops and lots of orange zest. Light citrus pith and dark bread or wood. \r\nM: Medium thick body and more carbonation than expected. Fairly clean finish with very little resin.\r\nO: Thought this would be overly sweet but I don't get any extraneous spices etc. (fortunately). Been putting off trying it but found it pretty enjoyable.", "(12oz bottle) AROMA: good hoppy nose, grapefruit, green, fresh, grass, pine, resin, some sour malt .... classic IPA nose. APPEARANCE: amber, brownish, very nice off-white head that is quite lingering and sticky TASTE: toasted malt, touch of coffee, woody, smokey, solid hops PALATE: medium body, good balance, crisp up front, oily middle, bitter followthru, OVERALL: very drinkable IPA with good body and balance, classic west-coast american IPA hoppiness but not overhopped. A rich and flavorful IPA that you could drink regularly.", "ah it is finally celebration ale season again, the only good thing about daylight savings time. it has a nice hoppy resin pine smell with a red amber hue. It is a delectable balance of warming bitter hops and fruity malt backbone coming over on the aftertaste. One of my fave beers period and maybe my favorite sierra nevada one. Good for dashed 300 rise of an empire hopes with boo boo.", "Dark copper appearance covered by off-white head. Rich hop and caramel malt aromas. Well balanced sweet hops and biscuity malt up front. Good body and mouth feel. Long finish with pleasant bitterness.\n\n---Rated via Beer Buddy for iPhone", "The best APA that I have ever tasted. The barley malt to hops ratio is as close to perfection as I have ever experienced! If you haven't tried it, then you are in for a treat!", "The 2017 Sierra Nevada celebration Ale does not disappoint. It features a great mouth feel and perfect blend of bitterness that makes this beer so great!  The people up in Chico do it right!", "From Nov 2005\r\n\r\nPoured from the bottle(room temp) with a nice head that dissipated fairly slowly into a fine broken layer in the center and a fine lacing around the edge of glass. The colour is a very attractive and clear reddish gold.\r\n\r\nThe smell is a strong hoppy-fruity aroma that is very inviting, so compelling.\r\n\r\nThe taste is very strong hops with grapefruit notes that jumps at you early then settles down a bit in the middle with some malt tones and returns with a very nice bitterness in the aftertaste.\r\nWow! This is one of my favourite brews of *any* style!", "Optisch schonmal super, Schaum perlt noch derb hoch nach dem Einschenken. In der Nase malzig, fruchtig, grasig, grünhopfig eben. Im Trunk komplex, süffig, Keks, Malz, Frucht, dann bitter, ein bisschen Spekulatius, wie ein leichter Barleywine. Sehr lecker!", "12oz bottle at home. Pours slightly hazed reddish amber with a sticky off-white head and good lacing. Great IPA character with grapefruit, orange, pine resin, caramel malts, lots of hops bitterness offset with semi-sweet caramel malt. Lively spicy hops finish. Delicious.", "Bottle, UK import, source not recorded. Backlog entry. Entering my historic scores for US beers whilst visiting New York. No tasting notes kept, just rating.", "Forgot to rate this one, been a while back. Just remembered it being very full body and strong. too strong for my meal really. Maybe by itself it would have been better.", "Aroma fersken, humle, malt. Utseende halvmørk gylden med offwhite skum. Smak fersken, humle, noe alkoholsmak. Bra balanse på smak, god bitterhet, lang bitter ettersmak. Flaske på The Bishops Arms Luleå 35,5cl 6,8% BF290917\n\n---", "Hop malt caramel spice aroma. Murky red Amber colour good head and lacing. Caramel chocolate malt flavour. Smooth palate.\n\n---Rated via Beer Buddy for iPhone", "More of an earthy taste. Kind of a toffee taste. The hops are overpowering everything else. Expectations are misleading.\r\n\r\nReviewed - A Brew With You, Ep. 62", "Originally rated on 1/18/2009. Had this one today at Opal Devines in Austin. Flavor of floral hops with a nice bitterness, with a decent malt backbone. Normally you wouldnt think of an ipa as a christmas brew but this is a pretty good beer no matter the season", "355 ml bottle. Unclear reddish amber body with a medium sized off-white head. Aroma has malt, caramel, citric fruit and flowers. Flavor is sweet, smooth malt with some caramel, citric fruit, spices and moderate bitterness. Fine balanced body and long lasting, pleasant aftertaste. Not the most bitter IPA in the class, but sure a fine ale anyway, smooth, tasty and balanced.", "Pours a beautiful copper amber color. Lots and lots and lots of head. Some black sediment at the bottom of the glass, it never was suspended, went straight to the bottom. Excellent lacing, excellent retention. WOW!!\n\nAroma is like sweaty socks...yeah. I’ll call that earthy hops. Light citrus and citrus rind. Some tropical fruit. Meh\n\nTaste is pretty good. Malty, hoppy bitter. It’s more bitter, but it takes a few sips to really kick in. There’s some good tropical fruit salad stuff going on here. \n\nMouthfeel is medium bodied, bitter, but takes a while to kick in. Oily. Lingering bitterness.\n\nOverall, it’s pretty good. It’s somewhere between an IPA and a DIPA. The lacing and head retention on this are amazing, and it’s easy to look over some of its flaws because it does look so amazing. I acquired this through a trade, and it’s a shame. I’d like to have a couple more. I’d recommend it, and I’m thirsty for more.", "Draft Half Pint at White Horse Old Ale Festival 2009, Parsons Green, London in Nov 2009 - Intense hoppy aroma and intense taste. Very Hoppy; resiny spicy peppery floral American hops. Very fruity; bitter oranges. Solid Malty base; caramel, toffee, hint of honey and almonds. Fruity sweetness leads to resiny hoppy bitterness. Very dry bitter hoppy finish. Lovely Beer! (2009-11)", "On tap. Pours clouded dark copper, large tan sticky head. Aroma of pine, grapefruit, orange, cedar, dark fruit, roasted caramel malts. Taste of same with lots of roasted grain and grass to balance the quite bitter citrus, spicy hops.", "Pours a dark copper color, with a foamy white head and ample lacing. Aroma of dark fruit, some malt, sweetness and bit of grain. Taste is citrus, pine needles, malt sweetness. Nice bitterness and a fairly dry finish. Medium body, creamy with a nice blend of citrus and malt character. Enjoyable beer", "Tried once at a beer fest. This time was a single 12 oz. bottle. It is a gorgeous medium amber and a slender whitish head. It smells of malt and perhaps a slight citrus. It tastes better the more you have of it. Moderate hoppiness, bitter start and bitter finish. The 6.8% abv is well covered. Very decent, just that there are others that are better.", "I am sampling the version from 2020, a year that many would rightfully say wasn't much of a celebration. This has been one of my favorite beers for many, many years. I anticipate the holidays every year for, among other things, this beer. I've posted reviews here every years since 2017. Every year I've given it a stellar rating because it's consistently good. This rating is a composite with others from the past three years. 12-ounce bottle pours a slightly hazy copper color, creating a two-finger, off-white creamy head with lots of clingy residual lacing. Aroma is hard to make out, but I detect the spicy hoppiness along with caramel-glazed popcorn. The flavor is stellar: I make out caramel, butter cookies, white pepper, candied blood orange, toast, pine resins, and a woody and smoky bitterness.The mouthfeel is medium. This is the perfectly balanced bittersweet brew -- not too astringently hoppy, not too cloyingly sweet.", "Rich deep amber complexion. Almost looks like a marzen. Off white sticky head leaving plenty of lacing. The aroma is fantastic. On the palate, the raw hoppy character hits you first followed by a malty sweetness. I got a little lemon rind and pine. Creamy mouth feel with a dry finish. Outstanding winter IPA.", "B+. Pours a murky copper color with white head. Well balanced and good flavor", "Bottle pours a clear copper with a two-finger off-white head and good lacing. Aroma is sweet hop. Flavor is a decent standard hop and malt. Nothing really notable. Bitterness is mild and aftertaste is pleasant.", "Bottle purchased at France 44 and consumed with blonderedhead. Served up in a tulip style glass. Nose is a pleasant hoppy citrus and pine combination. Leads one to believe it’s going to be very fresh. Pours a copper/amber hue. Taste is obviously hop forward like most Sierra Nevada offerings. A malty characteristic kicks things off with a caramel sweetness before giving way to a hop bomb. There is a resiny quality that comes heavily into play in its mouthfeel. Finish is aggressively hops and it lingers for quite awhile. Good overall and a quality choice as a winter seasonal.", "Bottle. Pours a copper orange with a lasting foamy off white head. Aroma is of pine, grapefruit, orange, caramel. Taste is of pine, caramel, grapefruit, bread, hint of tropical fruits. Oily mouthfeel, soft to medium carbonation.", "Flaska från SB. Bärnstensfärgad kulör med orangevitt skum. Doft av citrus och rostad malt. Halvsöt kropp med mediumbeska och lätt bitter avslutning. Smak av citrus, torkade aprikoser och rostad karramemalt.", "Leicht trübes Bernstein mit reichlich Schaum. Malzig, etwas Karamell, leicht fruchtig, Grapefruit, etwas Kiefer, leicht bitter.", "Bottle from Taniguchi. Pours bronze with a light beige head soapy like sea foam. Has a toasted malt aroma, floral hopping, pine, brown bread, light chocolate. Toasty flavour too, wheat crackers, light caramel, pine hops. Drinks wonderfully, creamy body with good carbonation, moderate bitterness, quite full. A no-nonsense beer that does what satisfying beer should - has all the parts to make it go down well.", "Nothing says Christmas like a Sierra holiday brew. Definitely full of that IPA hop.", "Bottle. Hazy reddish brownish color with minimum white head. Not much aroma, passionfruit, citrus, malts. Bubblegum. Light mouthfeel, small sweetness with kinda harsh bitterness in the back.", "On tap at The Burger Bar. Pours a copper colour and is a dericous hop slap with a heap of pine and spice.", "One of my favorite seasonal beers. Head takes forever to dissipate and from there it’s wonderful pine and resin hop flavors.", "Bottle from Liquor Barn. Pours a hazy copper with white head. Aroma of hops with a malt finish.", "Bottle from systembolaget. Pours a amber colour beer with a medium head. Fruity and hoppy with tropical fruits and pine. Dry finish", "This is a gorgeous looking beer. Clear amber with a fluffy cream colored head that lingers a long time. Aroma of pine and citrus hops. Flavor is hop bitterness balanced with malt that is significant but not too sweet. It’s well balanced. Hop bitterness in the finish with a bit of spiciness. Tremendous beer. I forgot how good this was.", "35.5cl bottle, 2017 release. cloudy amber colour with a medium sized slightly dark white head. hops, malts, citrus, caramel, pine. high bitterness. medium carbonation.", "Rich dark amber pour with beige cap that fades to a ring. Aroma is earthy hop, floral notes with a hint of pine and just-noticeable bready malt. Flavor follows identically as the well-balance ensemble of flavors meld with a slightly hop-forward advance throughout the sip. Super tasty, and very pleasant aftertaste. I usually have this each year and enjoy it, but don’t remember it being damn good.", "Pours a clear coppery orange-red with an off white foamy head. Light aroma of pine and malts. Fairly smooth with a malt base and a slightly bitter but smooth finish. Flavors remind me of a lighter version of Weyerbacher Double Simcoe or Founders ReDankulous. Very enjoyable.", "amber pour from bottle with decent foamy head. aromatics and flavors of spicy malts, citrus, pine, resin, and some earthiness. good medium body. goes down fairly easy and isn’t too filling.", "I had it on tap. It pours amber with an off-white head and lacing. The aroma is piny hops and caramel. The taste is caramel malt, roasty, and hops. There’s a really nice balance here. This is very good.", "balanced aroma that has both hop and malt aromas. amber and clear in color with a nice lasting head. Taste is beautifully balanced beginning with nice malty, slight roasty flavor, followed by nice hoppy finish.", "Dark amber with slight haze and a white lacing head. Bold, piney fresh hop aroma. Malty character with a hoppy bitter finish.", "Bottle pour into shaker pint glass from One Stop Market. Appearance is clear, reddish amber with massive sparkle, 1 1/2-finger width rocky, foamy beige head with good retention and light, sudsy lacing. Aroma is bready malt balanced with tropical fruit and light resin hops. Taste is sweet tropical fruit balanced with the bitter resin over caramel malt backbone. Palate is light-to-medium bodied with slick texture, average carbonation and bitter slightly dominating over sweet at the finish. Overall, a really attractive beer with more of an APA feel than IPA. Good.", "Bitter IPA; good stuff. Nice thick head, lots of lace and a clear dark amber color. Fresh hop, malty aroma. Flavor’s like nose, much more bitter than sweet, very piney.", "Cloudy, dark amber pour, with a thick brownish white head. Aroma is really nice, strong with pine and spiciness. A little bitter bite on the first sip. Solid IPA taste, with some of the peppery taste I smelled earlier coming through. A tad sour on the back end. I like it, but maybe a rung below some of my favorites.", "12 oz. bottle. Poured amber, with a lasting off white head and good lacing. Aroma of pine, pine needles. Taste was medium bitter, piney hops, peppery.", "Fresh. Bottled less than a month ago. Pours deep amber with slight hazyness and a perfect 3/4 inch off-white head with excellent retention. Lacing is also very good. Aromas are piney American hops with some spice and some herbal overtones. Earthy yeast and some fresh baked bread from the malt is also present. So drinkable. Medium/light body, resiny texture and crisp carbonation and just a slight astringency makes for great palate. Flavors are all a close to perfect balance of hop flavors, mild malt sweetness, and enough bitterness to qualify it as an IPA. Beer finishes dry with the hop IBUs making a late appearance.\r\nThis is an old-school IPA that contrasts with today’s IBU bombs and less bitter English IPAs. - So drinkable and a classic!", "355ml bottle. Clear dark amber with nice off-white head. Malt, barley, spicy, bread and floral aroma. Taste is sweet at start with malty notes and it is followed by bitter notes. Overall, a tasty beer.", "12 Oz bottle. Pours clear amber orange with a frothy brown head leaving huge lacing. Relatively mild aromas, orange, sugar malt, and some floral and piney hops. Medium sweet with floral and rasiny hops up front, long, piney hop linger. Medium-full body with a slick mouthfeel and average carbonation with cloying sugars. Overall, well balanced and drinkable, but nothing noteworthy.", "On tap. Pours a dark copper color with bit of a foamy head and ample lacing. Aroma of dark fruit, some malt, sweetness and bit of grain. Taste of citrus, malt sweetness and bit of grain. Nice bitterness and a fairly dry finish. Medium body, creamy with a nice blend of citrus and malt character. Enjoyable beer", "Sierra Nevada brews their Celebration even better than the year before. It’s a tribute to the Brewers did they get it right and you’re after year", "355 ml, bottle conditioned. Very hazy, dark golden reddish amber, lots of powdery sediments, thick beige head, fantastic lacing, low carbonation. Not much hops to the nose, but great caramelly dark malts coming through. Mouthfeel is creamy, dry at the end. Taste is sweet, malty and somehow some dark fruits at the back.", "12 oz bottle. Pours a deep copper color with a dense, bubbly off white head. Heavy lacing. Aromas are pine, toffee, sourdough bread, and florals. Some earthiness, hop bitterness primarily in the finish, caramel, grapefruit, dried sweet fruits, and grass. Medium body, pretty fizzy.", "Visual: Pours dark copper brown with a small dissipating head, ringed retention with almost a full layer, singular tight steady streams.\n\n\r\n\r\nNose: faint generic light citrus hop oils, faint barley malt. (lvl-2)-pungency\r\n\n\n\r\nAttack: crisp bite, tingly-micro-fizzy\r\n\n\n\r\nMid-palate: toasted barley malt (lvl--sweetness), tangy-almost lemony citrus, medium bitterness\r\n\n\n\r\nFinish: pine, dandelion, lingering bitter hops on the tongue.\r\n\n\n\r\nSummary: Is this really a fresh hop IPA? I don’t get any green in the hops at all; The barley malt body is quite big and almost too aggressive without letting any fresh hop shine through. Overall it’s above average, but unstructured and incoherent at points. (10/31/16 Note: mine had a packaged date of 10/19/15 so that’s undoubtedly why I didn’t get fresh hop oils in it.)", "Draught @ Elizabeth Station. Pours a clear amber. Nose of sweet grain and malts. Flavour is essentially bitter hops with a slight malt sweetness.", "[backlog] 25-06-16 // bottle at Sixties, Mainz. Pours amber copper coloured. Sweet malty body, some barley. Some caramel. Then nice herbal bitter hops.", "Bottle. Pours deep golden with an off-white head. Aroma of malt, bread, some herbs and floral notes. Flavor is sweet and malty with some bitterness, herbs and bread. Medium body, average carbonation.", "Amber body, offwhite head. Aroma has caramel, malty bread, spices, some earthly notes, grapefruit. Flavour add dried fruits and some nuts.", "Deep red with bubbly white head. Citrus, caramel and burnt sugar. Sweet, harsh tea and green finish. Overall: nope. Where’s the hops?", "Mørk gylden med høyt hvitt skum. Aroma av humle og karamell. Smaker søt, så en vag bitterhet. Bær av noe slag? Medium konsistens.", "Lukt: Citrus og karamell.\n\r\nUtseende: Honning farge.\n\r\nSkum/kullsyre: Dekkende skum.\n\r\nSmak: Citrus og karamell.\n\r\nHvor: Kjøpt@VP Kvadrat, Nydt@Tasting kveld hos Untapd Jostein med Bryne.\n\r\nMedium: Flaske@330ml, ABV@6,8%, Når@28.07.2016\n\r\nDrukket Som Alias@Sierra Nevada Celebration Fresh Hop IPA", "On bottle from Vimonopolet Norway. Deep golden color, slightly hazy with good foam. Medium/high\nAroma intensity; hops, caramel, malt and some fruitiness . Medium body & complexity. Some immediate sweetness,\nOk bitterness - ends up a little\nBit too sweet. Very enjoyable\n\n---Rated via Beer Buddy for iPhone", "Bottle. Hazy dark amber with nice lasting head. Aroma is caramalt, pine, floral and malt. Taste is much like the aroma but the malty parts stands out. For beeing a malty ipa I think its very good.", "Dark orange color. Sweet caramel aromas, fruits and alcohol, some hops. Sweet bread taste, caramel, sugar and pine hops.", "Bottle from Vinmonopolet’s BU. 2015 version, in other words, way too old... Pours close to clear copper. Medium sized, slightly orange head. Malt, orange and some metallic nose. Malt, herbs, some grapefruit, resin and pine flavour. Bitter. Medium, oily body, soft carbonation. Sadly, too old.", "How : bottle Appearance : almost clear dark golden with a small white head. Aroma : caramel, dried fruits, citrus, spice, wood, spice, pine and grass. Palate : medium body, average carbonation.", "Aroma: caramel, pine, some red berries.\r\nTaste: moderate sweet and below moderate bitterness.\r\nFlavour: candied fruits, hops, caramel.\r\n\r\nGood.", "Bottle poured into nosing glass, pours amber with thick white head. Nose is mango, Passion fruit typical westcoast style IPA lots of fruityness. Taste is intense bitter fruity slightly alcoholic. Finish is light fruity astringent with grassy subnotes... Good one!", "Bottle, Nov 2015. Amber color with big head. Aroma is herbal hops, piney, resinous, toasty malts. Taste is the same, quite bitter, nice toasty malt body. Bittersweet finish. More English than I would have expected from an American Fresh Hop IPA... Okay though. Why is this still within its European best before date?", "Das Celebration Fresh Hop IPA 2015 aus der Flasche vom Händler des Vertrauens. Fast kupferfarben mit massiver, nahezu undurchdringlicher Schaumkrone im Glas. Feine Pinien- und Zitrusaromen im Antrunk und auch später. Wenig Restbittre.", "I took this for a wet hop ipa and drinking it just half changed my mind: aromas of ripe pineapple and a kind of wet hopped aspect to it, with its peppery and subtle honey notes. Taste brings more pineapple, honey and pepper. Very pronounced bitterness at the finish. Some alcohol fumes. Interesting flavour profile.", "2015er edition. Fresh intense floral beginning. Lots of fruity hops. Grassy floral hops. Pine with a nice malty body. The aftertaste is floral malty smooth, great round with a moderate bitterness.", "355ml bottle, 2015 at Beer Station, Xiamen. Pours hazy amber with a white head. Aroma of pine and resin. Bitter finish.", "2015 version from bottle. Pours amber/copper with a stunning head, the bubbles were nearly hexagonal. Aroma features orange peel from the hops and this carries through to the palate. A very solid brew.", "Slightly cloudy, red brown. Spices, pine resin. Bitter, sweet through the finish. Mid heavy body, mid carbonation. Well balanced.\n\n---Rated via Beer Buddy for iPhone", "24 December 2021. Opaque amber color with an off-white head. A nice Hoppy and malty balance. Piney. Citrus. Caramel.  Thank you Mr. Grossman I need to put this in my Christmas rotation. Rating 4.2. \n\n26 November 2020. Bottle. Amber color pour with a thick off-white head that left fair lacing. The hoppy aroma was floral and pine. The taste is mildly bitter. It is very good. Rating 3.9. \n\n\nApril 10, 2016:  Draft in Growler. It poured an amber color with a thin white head and minimal lacing. The aroma was light floral hops. The taste was tropical fruit and some caramel malt. I kept the beer overnight in the growler so I will try this one again. Rating 3.4.", "On tap @ Sur & Bitter, Sandnes. Pours dark golden, with a creamy, off white head. Aroma is hoppy tropical notes of mango, apricots, pineapples and oranges, floral notes and malty notes of bread and toffee. Creamy body, with average carbonation. Flavour is bitter hops, with pine, orange peel and tropical notes of mango, apricots and litchi, as well as malty notes of bread, caramel and honey. Sweet, hoppy finish.", "Homályos sötét borostyán szín, közepes, tartós hab. Illata enyhe, ipás. Kellemesen kesernyés, lágy ipás ízvilág, nem túl sok gyantával. Utóíze keserű, enyhe citrussal és gyantával. Közepesen testes.", "Had this one a while back. Pours a bright orange and gold. Dank and heavy with tons of lacing and sticky head. Pine and grapefruit abound. Just so, so drinkable with moderate bitterness and mild sweet malts. Holy crap, so fresh and frutiy!", "330ml bottle served in regular glass. Enjoyed in Hong Kong.\n \r\nA: Pours a beautiful slightly cloudy amber color forming a big and creamy, light beige and soapy head with good retention. Forms tons of soapy and lingering lacings in the glass.\n\r\nS: Caramel malts and fruits. Strong notes of grapefruit and orange zest. Hints of pine, honey, grass and pineapple. A bit boozy finish.\n\r\nT: Slightly sweet upfront. Strong notes of caramel and grapefruit. Pine, honey, orange zest and grass. Great, intense and delicious bitterness.\n\r\nM: Meidum body and carbonation. Great bittersweet balance. Grassy and pine persistent aftertaste.\n\r\nO: Excellent drinkability. Excellent IPA. Sierra Nevada quality.", "Poured from a 12 OZ bottle into a pint glass. The appearance is a clear orange-amber color with a medium sized white head. The aroma is a refreshing smell of pine. The taste is a great hop flavor. An excellent seasonal.", "Very good IPA, goes perfect alone or with a good burger off the grill (not McDs or BK)", "Hoppy and crash aroma, a dark nice colour \r\nTaste is full and round with a clear hop presence\r\n\r\nNice beer", "Pours a very slightly hazy copper. Aroma is hoppy, but balanced. Slightly floral, pine and grass. Also some malt.", "Bottle from Systembolaget, BB 25/10/2016. Amber appearance with a decent lasting foam. I quess this bottle hasn’t survived in the best way the trip overseas and then the Systembolagets way of keeping the beer, meaning that most of the aromas that should have been there has disappeared. Well, well, my nose can anyways feel som subtle piney aromas, not much citrus and that is pretty much it. Nice mouthfeel, well balanced with a lasting bitterness. A good and solid beer for the season.", "@ Kristoffers väg 22/2-16. Bottle from Systembolaget. Fruity with malt, some hops, pine needles and caramel. Body is medium, the finish is dry and medium bitter. Probably been stored for too long.", "12 oz bottle from De Bierkoning @ home, bottled 2 Oct. 2015, enjoyed 16 Feb. 2016 (had this before but looooooong ago). Clear, red/copper color. Nice big off white head with good lacing. Aroma’s: hops, bready malts, earthy. Retronasal it’s earthy bitter, fruity, light malty. Flavor us bitter with a moderate sweet backbone. Medium bodied. Long, dry and firm bitter finish. An American classic.", "SB MoS , flaska. Frisk arom som klart överlevt Sauronbolagets hantering. Bärnstensfärg. Fin vardagsIPA om den nu fanns att tillgå.", "Rejäl, smakfullt maltig, fin humlearom och balanserad beska. En bra öl helt enkelt!", "Halvljus och grumlig. Trevlig frisk doft med fruktighet och lite tallbarr. Smaken är balanserad och trevlig lite för mycket beska för min smak\n\n---Rated via Beer Buddy for iPhone", "12 Fl oz bottle into shaker. Orange/copper beer with solid two finger head. Carbonation is constant and fine. Nose is subdued fruit toffees. Flat clean mouthfeel with aspirin bitter finish. Quite light and easy to drink, surprising given its ABV. Nice albeit one-dimensional. Of course it’s meant to be a Winter beer but here in Sydney it is 25 Celcius at 11pm so I’m drinking it straight out of the fridge. Probably better a little warmer.", "Flaska från SB. Mörkorange klar vätska med högt gulbeiget skum. Frisk doft av citrus, koriander, örter, selleri, tuggummi, blommor, färskt gräs. Åt det sötare hållet med en del maltighet undertill. Medelstor kropp. Frisk beska från början. Något torr. Inte lika mycket fruktighet som i doften, mer aggressiv i humlen. Maltigheten drar åt pilsnerhållet. En ganska lätt öl, men samtidigt med bett i. Välhumlad och trevlig.", "A: Amber coloured, huge off white head N: Floral, caramel, lots of hops, hint of liqourice T: Decent bitterness, quite deep wooden flavour. O: Lots more malty than expected. Still a good beer though.", "Poured from 12 oz bottle into tulip glass\r\n\r\nAppearance: pours a 3\" pillowy off white head that falls very slowly and leaves abundant lacing behind. Color is cloudy reddish-amber.\r\nAroma: strong pine and citrus dominate but there is an evident malt in the background.\r\nMouthfeel: medium bodied, viscous and quite sticky with a quite dry finish.\r\nFlavor: fine balance between the hop notes with a bready-sweet malt.\r\nOverall: extremely well done. I am a rare IPA drinker but this one is definitely worth having.", "Aromas of lemon rinds and caramel. Taste is lemon rind, red grapefruit, caramel malts, and some peppery biscuits.", "Bottle into IPA glass. Pours a clear copper colour with off white head. Aroma is earthy and grassy. Taste is grassy hops with a nice maltiness to go with a pleasing bitterness. Good beer.", "Poured from a bottle. Ruby mahagony Brown hue with medium vanilla head. Spicy malt flavor with citrus, pepper, and slight juniper. Like the subtle bitterness balanced with the malt. Still has a nice dry finish.", "Sierra Nevada Hop Celebration 2015\r\n\r\nThis fresh hop winter IPA pours a deeper russet gold that kind of makes me think of Aki no Kimagure.\r\n\r\nIt’s got a great fragrant hop bouquet juicy fruits(mangoes & guava) with minty lemon as well.\r\n\r\nNice full body and very bitter hitting you with a pine whallop, then a hearty dose of fruits and finishing with a nod towards the malts. Even though it’s bitter it remains balanced good stuff.\r\n\r\n---Rated via Beer Buddy for iPhone", "33cl bottle\r\ncloudy dark orange~brown colored\r\naroma full of hop, grass\r\ntaste malty, dry finish with less bitterness\r\ndrinkable IPA", "Tap at Saddle & Sabre. Light copper color with white head. Leaves a lot of lacing. Slightly piney aroma and taste with caramel, grapefruit and floral notes. Well balanced, warming and quite pleasant.", "12 ounce bottle. Strong hop aroma that changes as it warms. Starts out hoppy with citrus and pine, gets more earthy as it goes. Sweet flavor at first with a bitter finish that lingers.", "A 12 fl oz bottle with a packaged date of 19th October 2015. Poured into a Spiegelau IPA glass. It poured a clear dark copper colour with a two finger cream coloured head that had great retention and left lots of nice lacing. Aromas are citrusy lemon, apple, piney hops and sweet but slight biscuit malts. There was also some herbal and spice here and there. Tastes of light citrus and hop bitterness before it kicks in with some strong maltiness and surprising booze but nice spice. Creamy, medium bodied with moderate carbonation. Overall, this was definitely more malty and boozy than I expected (and not in a good way). However, I will retry this again to make sure, but at the moment, I definitely prefer Hop Hunter and Torpedo IPA over this.", "Bottle 0.355l. Cloudy, orange to red colored. AROMA- honey sweet, red fruit and berries, strawberries, rowanberries. FLAVOR- slightly sweet with dry finish, bitter, red fruit and berries, needle-leaves. Lightly full bodied.\nVery good.", "#420\nBottle 0.355l as 2014 Celebration Fresh hop IPA. Copper-amber slightly hazy body, medium white head. Nice aroma of strawberries, rowanberries, honey, mango, red berries. Taste is bitter and sweet in balance, a bitvof tartness of berries. Rowanberries, cranberries, ground poppy seeds, hint of needle-leaves. Medium to full body, slightly carbonated. \n Pleasantly balanced red IPA, really good one.", "Poured a clear dark coppery colour with a two-finger off-white frothy head that retained very well and laced very well. Carbonation high and fine to medium. Aroma strongly of pine with a hint of citrus. Taste of sweet malt, strong pine and grapefruit. Medium body. Crisp and refreshing with a lingering strong bitterness on the finish. (labelled as 2105 Celebration).", "Aroma is malt forward with some toffee and caramal. Taste has some herbal hops along with toffee. Nice", "Complex taste with hint of bread and toast, reminds me of of taste of a porter. Full body, sticky, average carbonation, long finish. Overall quite nice but not my favorite.", "Really enjoyed this one.  Dark copper appearance with big hop flavor balanced by malt sweetness.  Very good \n\n ---Rated via Beer Buddy for Android", "Deep orange brown color. 2-finger head upon pouring from a 12oz bottle. The head recedes a bit, but stays a bit foamy with the replenishing bubbles from below. This is fairly hazy as well.\r\n\r\nIt smells slightly tart and citrusy like from fruit and hops. There’s an earthy aroma that smells woodsy.\r\n\r\nKicks in with bitterness that is pretty powerful. It quickly moves to an earthy funk that you can’t quite describe. At first is seems like it has went bad as it is a strange and unexpected flavor. It fades rather quickly and kicks into sweet malty flavors. It starts to get bitter once again and the funk seems to come back. As the flavors fade, you are left with citrus / pine / bread and malt aftertastes.\r\n\r\nLight side of medium on the mouth feel. Not thin and a bit slick. Stays fizzy which is quite nice.\r\n\r\nDecent IPA. I believe that hops used for this (wild ones?) gives it the funky flavor. Tastes like they threw in the hops, the vines, roots, and dirt all in this one. Very earthy. It is ok to drink a few, but I don’t see myself buying a 6 pack or a 12 pack of it. Worth a try though.", "Pours a copper from a bottle. Smells slightly of toffee, not much else in the nose. Flavor is very piney, some tropical notes, maltiness is nondeScript but present. Good beer.", "Orange, disig med stort, fast skum. I doften finns tropiska frukter, aprikos och ananas. Stor fruktig smak med fin sötma som balanseras av en rejäl beska. De Klomp 2015-11-28", "Very piney aroma and flavour, but manages to be refreshing. Very bitter. Decent full mouthfeel for a bottled beer.", "Bottle. Pours a hazy copper colour with a light nose of hops, with a finely laced off-white, long lasting head. Good carbonation. Taste is bitterly hopped, grapefruit and pine. Oily mouthfeel, long finish.", "Smells malty, hoppy, and sweet. Pours with a small head. Color is deep copper. I’m always happy to see this beer every year. One of my favorite offerings from Sierra Nevada. The taste is malty, hoppy, sweet. with a nice finish of bitter. Over all I really like it. I had this from a bottle.", "12/24/15 Chicago (Pour from bottle into pint glass). \r\n\r\nCopper pour with off-white head, decent carbonation. Aroma of pine, malt and spice noted. Nice mix of malt and sweet taste, enjoyed the texture and felt good going down. Very good beer and I’m looking forward to more of these down the road.", "Pours a clear dark golden with a small white head that leaves good lacing. Nose is of fruits and pine, pleasing. Taste is moderately bitter and lightly sweet with more fruity hops, caramel and cereals. Body is medium, carbonation too and mouthfeel is a bit oily. A bit old style but still really enjoyable. A fun hoppy beer, just what I needed! Merry Christmas people of RateBeer!", "Bottle - pours deep amber with a white head. Caramel, pine, citrus and a bit of nutty malt. Taste is hop across the palate, but this is balanced with the malt. Palate is creamy with a bit of fizz.", "Not the best notes as no internet access. Going from recall: Amber color with decent head. Piney, hop taste. Decent malt back bone. Not quite sure what was making it a holiday beer - was expecting some additional notes. Didn’t get that, but got a pretty solid dry-hopped IPA.", "Amber color. Bubbly, white head. Nice aroma. Very hoppy with mostly pine and some citrus notes. Very well-balanced, and not overly-carbonated.", "Pours a nice Amber color with a light brown head. Aroma is nice and not super strong but good. This is very full bodied and finishes pretty bitter. Mostly piney notes. A little more malty than some other IPAs. Nothing really Holiday about it, but a descent standard IPA!", "Keg at The Font, Manchester. A hazy deep amber colour with a foamy off white head. Aroma of orange, pine, caramel, slight toasted malts, some wood and herbal hops. Taste of orange, slight grapefruit, a little raisin, resin, some nuttiness, slight wood, subtle pepper and earthy, herbal hops. Medium bodied, a slick texture and soft carbonation. A dry, lingering, resinous hop bitterness in the finish. Lots of citrus and resin in this beer, close to an imperial IPA in texture too. Well flavoured and boozy, I like the big, brash flavours but a little bit too hoppy, which I rarely say.", "On draft at York River Landing. Another great beer from Sierra Nevada -- clear and red, with a lot of great hop aroma and flavor. Even though this is more malt forward than most IPAs, it doesn’t taste at all cloying or out of balance.", "12oz brown bottle. 2015 bottling. Unfiltered deep golden appearance. The head is creamy and small, lots of lacing for those who like that kind of thing. Lovely hoppy nose featuring citrus/orange peel. Taste has mild sweet malts, hoppy notes of pine and citrus. Big hoppy aftertaste and bitterness, aftertaste is leafy and piney. Mouthfeel is medium with nice carbonation. A solid brew.", "Murky dark brown colour. Frothy tan head, about an inch thick. Pleasant malty aroma, brown sugar, some caramel. Quite strong taste, bitter but not too sharp. Lots of barley. Has nice mouthfeel, soft and moderately thick. Good as an IPA, very well suited for the winter season.", "Pours Amber, light white head. Aroma is caramel, faint pine and citrus. Taste is biscuit and caramel with pine and faint citrus hops. Moderate bitterness, medium body, fully carbonated. Not a bad beer!", "Bottle from Premier, 2015. Pours coper with lots of frothy had and tons of lacing. Nose is maybe a hint of cinnamon and lots of grapefruit. Flavours of grapefruit, some pine, juicy fruit. Taste medium bitter, light sweet. Full sticky body with lively carbonation and lasting bitterness. Great!", "Sampled on draught at The Tilted Kilt on S Wabash in Chicago. Orangey brown colour with a beige head. Bready aroma. The taste is very full and malty, with a strong flavour of orange zest and Seville orange marmalade with hints of pine and grapefruit skin. Excellent mouthfeel. This is a really first-class IPA.", "Aroma is roasted malts, honey , caramel and clove. Taste is sweet malts and caramel. However the rich full hop provide is the star here. Rich clove, deep earthiness, and citrus here. Light tang but overall a well balanced and smooth execution. Appearance is a hazy amber with a thin pearl head that retains fairly well.", "2015 vintage poured into a taster showing dried/tanned orange peel brown with sparse white foam on the top. \r\n\r\nThe nose shows a strong background of sweet round malts with moderately intense notes of lemon and pineapple. \r\n\r\nThe palate is medium bodied and well carbonated. The palate show a first impression and mid-palate of very light round sweet malts. The finish shows a sharp IPA bitterness. The linger shows hints of orange zest.", "Poured from a 12 oz bottle into an snifter. Pours a Amber orange color with a finger an a half of off white khaki head with a consistent flow of bubbles streaming from the bottom. Smells of pine, spice, floral, grapefruit and orange peel. \r\n\r\nTaste: very easy drinking for an almost 7% abv beer. has big notes of spice, floral and pine on the front end and is balanced out greatly by the citrus in the fresh cascade hops. The Carmel malty finish in this beer leaves your pallet begging for another sip. Awesome hop forward winter IPA.", "Pours copper orange/amber with a medium khaki head. Head retention is ok. Lacing is minimal. AROMA: malty, herbal hops, peppercorn, grapefruit, citrus, pine resin, bubblegum, herbs, roasty, caramel, spices, slight cinnamon, coriander yeast esters, tropical fruits and black currants. TASTE: malt bitterness, hop spice, coriander, citrus, peppercorn, caramel, pine bitterness, cinnamon, earthy, boozy, biscuity, leaves, tropical fruits, brown sugar and molasses. AFTER TASTE: coriander, hop spice, malty and bittersweet citrus with an oily slightly thick spiced/bitter finish.", "Appearance: clear pale amber with two fingers of rocky ivory head, good retention and moderate lacing. (4/5) Aroma: pine, citrus, floral, caramel. (8/10) Taste: moderate sweet, moderate-strong bitter. (8/10) Palate: medium body, moderate carbonation, off-dry lingering bitter finish. (4/5)\r\n\r\nI’m a little baffled by what makes this a “holiday” beer. Don’t get me wrong: I don’t need an excuse to drink a good IPA, and this is in fact a good IPA. Actually, I did a little reading, and understand this is one of the first of the modern A/IPA’s, and could legitimately take the credit for spawning - or, at least, helping popularize - one of my favourite styles. But any spiciness in this is strictly hop-derived - there’s none of the “usual suspect” gingerbread spices usually associated with Wintereenmas here. Big bitter nicely balanced with pleasant caramel malts, and an off-dry lingering bitter finish. (16/20)", "This IPA poured a beautiful amber colour with a quickly living, frothy, off white head. Scents include pepper, malt and hay. First swig was a little thin on the mouthfeel but robust on flavour. Spicy malts and lots of hop flavour most prominent. Finish is bitter with malty flavours lingering...", "From bottle. Pours a copper color with a one-finger yellow head. Aroma and taste of pine and malts. Strong malt flavor, but bitter rather than sweet. I caught a fleeting taste of rose petal. Medium mouthfeel. Bitter finish.", "Yum! Nice copper/amber pour with an off white head (into a Spiegelau IPA glass). Minor lacing. Nice burst of fresh floral hop bitterness with notes of pine and resin.", "Strong balance of malt and hops. Holiday spice. Definitely a holiday type beers smooth and well made.", "Growler pour into tulip glass smells of floral citrus and grapfruit.nice lasting head with lacings all around the glass.Taste is hoppy with medium body with a slight dry finish.Excellent example of a seasonal ipa!", "Bottle from Albertsons. Surprised its taken me this long to get to this one. And a bit disappointing to boot. I guess was expecting a bit more from SN for a seasonal. A touch more bitterness and bite than the norm. Still good, but I was hoping for a bit more \"Wow!\"", "Bottled. Has a nice dark brown. Has a wet hoppy taste. Not dry. It is tastes like a dark floral.. This is a excellent beer", "Similar to torpedo but less intense pine aroma and taste, a little sweeter and malty as well. Mid palate very nice sweetness with medium bitterness. Very tasty beer for the winter months when want a milder and sweeter ipa. Pretty dry finish as well. Would buy again.\n\nUpdated review 11-2016: \nSubtle hop flavors and aromas, malts and bitterness up front and center. Pleasant sweetness. Very enjoyable", "It pours a cooper color with slight hazing with a large off white head that leaves plenty of lacing. It has a malt aroma of nuts and caramel. The hops are piney and citrusy with floral being prominent. It has flavors of nuts and a hint of caramel with the pine and floral flavors taking over the majority of the flavor sensation. The are hints of dark fruits as well. It is meduim bodied in texture with a bitter knock on the palate that is long lasting, but enjoyable.", "12 oz bottle, 2015 edition. \n Amber with a tight, lasting tan head, and nice lace pattern. Fresh floral and pine aroma, combined with caramel and crystal malts. Flavor is sweet caramel malts, followed by spruce hops. lengthy bitter finish.", "Nice aroma of fresh pine, some floral notes and a hint spice. Deep orange red color, with a huge tan head. Rich malt up front. Sweet. Caramel and fresh bread flavors. Huge richness in the malt. Bitterness cuts in nicely. Fresh pine and notes of pepper on the finish. Full rich mouth feel. Malt bill must be huge on this beer. Should be an everyday beer. Outstanding.", "Pours amber, half finger of tan head. Aroma citrus, grassy, spruce. Taste is a mix of pine needle hops and sweet malt. A nice IPA.", "12oz bottle pours clear toasted amber-red with 2 finger head. Nose is mango, fruity orange, melon, slighty sticky pine and citrus. Taste is crisp, round light-sweet toasted malt with orangey fruit and some grassy pine bitterness. Finishes with medium bitterness, citrus, melon, orange, toast.", "Btl pours a slightly hazy Amber color with red highlights. Monsterous,billowy off white head lingers forever leaving huge puffs of lace clinging to glass. Aromas of fresh baked cookies,pine trees, and citrus notes. Tastes of sweet caramel, orange and resin. Medium body, soft mouthfeel, adequate carbonation and a nice mild bitter finish. I don’t know what it is about this beer but every year I try one bottle and end up going back to the store for a 12pk! Big malty backbone balanced with the fresh hop flavors and aromas make this beer perfect for the holidays. Get this beer right when it hits the shelves and you will understand why it has such a huge following.", "IPA fresh hop style with a heavier malt backtone that makes it a bolder, cold-weather beer", "Bottle from liquor store\nnice copper color with nice white head\nExcellent hop aroma with pine and citrus\nGreat lacing on the glass\nVery good maltiness to balance the hops. \nSierra Nevada yeast is very clean\nA great beer.", "Piney aroma. Clear darkish amber with a huge foamy off white head that lasts forever. Lots of malt. Lots of pine. A hint of sweet. Pretty good.", "Bottle. Pours a hazy medium red/amber colour with a beige head. Aroma is of pine, malts and hops. Taste has a slight caramel sweetness to it while the malty flavour shines through. A lovely holiday season beer.", "Excellent beer and even better IPA. For those of you spent on the current fascination with absurd amounts of citrus/grapefruit hop madness this is a welcome old friend. A far more balanced IPA with a full spectrum of hi’s, mids, and lows. Wish this was available year round!", "Bottle, 2015 bottling. Sort of a ramped-up version of SNPA. Lots of stinging bitter piney hops set in a set in a rich malt base. Very tasty and satisfying.", "Aroma has lots of malt for a SN beer, but still maintains their signature background of earthy piney hops. Beautiful medium amber color. Almost see through, but not quite with a fluffy cream colored head. The taste has pine hops that are subdued by the added malt, although there is not as much malt in the taste as there is in the aroma. Bitter and slightly sweet aftertaste that lingers for a while. Good slick palate, the carbonation is turned down a bit for this one. Overall this is a very enjoyable option from Sierra Nevada. A little too similar to several of their other IPA’s (I would like more creativity from a seasonal release), but I can’t really knock them for sticking with what works.", "Amber. Kinda bitter. Super IPA/APA flight with John (Schlafly TIPA, Founders Harvest Ale, Pliny the Elder, Zombie Dust, Alpha King, Sierra Nevada Celebration ale)", "This one is one of my favorites. I look forward to its arrival each year. There are slight variations from year to year but all are excellent. I also have a minor issue with it in the IPA category. It’s incredibly well balanced, loaded with taste, only mildly hop forward despite the generous fresh hopping. It’s piney, mildly citrusy, has a strong malt backbone which lands it in the low 60’s IBU’s despite being loaded with hops, and with a luscious consistency to the finish. It has the completeness of a beer which the brewer knows intimately.", "Bottle. Hard to imagine that I haven’t rated this yet, given all the times I’ve had it. Colour...light amber with a thick ecru head. Nose...initially musty hops and then the hops be one bright and fresh with a piney lean. Palate...full, dry and earthy with tightly wound hops that ooze with piney goodness. The whole palate is dry and fairly lush with hop resin and the finish is brisk and lively.", "Bottle @home. Pours amber cloudy/hazy with an off white head. Malty and caramel on the nose but then you get a big hop kick to the nose as well. Taste is a wee bit sweet which was a surprise with the hop nose also a bit thin, good but not great.", "- N: Orange squash and pine/white pepper\r\n- B: Sweet (caramel)\r\n- F: A small sweet, butter-y biscuit on the way home\r\n- Slightly fruitier and lighter than Torpedo Extra IPA.", "Great hop aroma from Amber to light red pour fluffy head. Somewhat sweet and cloying from medium maltyness. Very heavy good for holidays as it says. One and done for a session.", "One of my favorite brews. So big and complex, curious it is mentioned an IPA. So much more in malts here than a typical IPA. Biscuit and toast along with the big huge pine hops. Great complex finish.", "Bottle from Cotteridge Wines; light copper pour with a creamy beige head, aroma has caramel plus some hints of pine, taste has caramel, mellow pine, some grapefruit, quite a bit of malt action, bitter finish.", "Orange copper beer with white head. Heavy malty body with piney hop character. Bitter finish. Okay.", "12oz bottle on 01/08/2015. Hazy reddish brown colour with a thickish beige coloured head. Sweet aroma of fruit, pine, spices and malt. Medium bodied and carbonation. Rich flavour, although a little on the sweet side of biscuit, malt, fruit and lots of hops. Nice bitter hoppy finish. A nice ale to sip.", "Served on tap. Red Orange with a thick white head. Orange melon hops aroma. Medium heavy body. Malt hops citrus bitter flavor. \n\n---Rated via Beer Buddy for iPhone", "Amber with off white head - Fruity hop aroma - Good malt body with some caramel notes with a good hop profile with fruity tones and hints of peppers - Fruity hop finish that has some pepper in the back - This was nice", "Bottle shared at Black Swan, post CBC - fuzzy amber coloured pour with white head. Tropical and citrus fruity, hoppy and malty, some caramel, toffee, orange, pine, grapefruit, bitter finish. Decent.", "Inget är som det borde. Jorden ruckas en aning ur sin bana för här här vi ett Sierra-öl som inte får hjärna och hjärta att slå frivolter av lycka. Men så har Sierra en helt egen måttstock som är lite mer kräset kalibrerad än alla andras. Det här kan med andra ord vara en braksucce, förklädd i en annan etikett.", "Punertava väri, tiheä luonnonvalkea vaahto.Tuoksussa märkää nahkatakkia ja sitruksista humalaa. Maultaan maltainen, katkera ja täyteläinen. Tasapainoinen ja suutuntumaltaan virkistävä olut.", "Bottle; pours cloudy amber with a khaki head; aroma is caramel, grapefruit, and malt; taste is malt, citrus, caramel, and a hint of spice; finish is bitter with some spice notes; nice IPA", "On tap @GarricksHeadPub. Lots going on here, but it rounds out into a smooth, very palatable brew. Lighter and easier than I expected -- good balance of multiple hop strains that don’t overwhelm a solid malt base.", "Bottle 2014 edition. Not as pungent as a torpedo but pretty fruity. Some distinctive Sierra Nevada tones filter through. A good drop.", "Ett år gammal flaska. Mörkt bärnstensfärgad öl med inslag av rött. Ljusbeige skum. I doften finns storkaramelldoft, malt men även mycket humle, främst i form av tallbarr men även en del fruktighet som drar åt jordgubbe. Detta går igen i smaken. Bra humlebett trots att flaskan var ett år gammal.", "T:\r\n-starts with sweet malt and strawberries\r\n-then huge resiny,piney notes\r\n-orange,citrus,mango,peach take the backseat\r\n-well carbonated\r\n-finishes with grapefruit and a huge hoppy note\r\nO:\r\nnice, but too bitter for my tastes", "Bottle.(2014 vintage)\r\n\r\nPours a nice dark amber.\r\n\r\nTaste. Very bitter and very grapefruit forward, also with a slight pine and sweet caramel backing.\r\n\r\nOverall. Very bitter and not for the feint hearted, whilst i think this is a very redeeming quality, this would get another couple of rating points if they kept or maybe even toned down the bitterness, to let the non bitter flavours of the hops present themselves better.", "On tap. Light aroma and orange color. Medium cloudiness, slightly fruity start on this and a little bitterness on the finish. Weak. Really not a good beer.", "Bottle from Total Wine, to Shaker.Appearance: orange/ red, persistent huge head. Aroma: cereal, conifer, floral. some fruit/spice.  Taste: Sweeter than the Torpedo, more malty, slight spice, plenty of bitterPalate: Medium body, bitter complex finish. Really good stuff.", "Very rich aroma, reddish colour with a white lasting head. Medium to full bodied with an equal balance of hops and malt, bitter in the front with fades to a good malt backbone.", "Very fresh citrus flavors with mild pine notes. A touch on the bitter side.", "Bottle from Damian Beer. Amber color with medium off-white head. Nice citrus hoppy aroma with malty notes. Taste, solid malt backbone with caramel, followed by light citrus hoppy touch with herbal notes. medium long hoppy bitter finish with herbal touch. Good, but not stellar.", "A nice, dark amber colour, bordering on red ale colours with a creamy beige head. Beautiful hoppy aroma, lots of sweet malt scents with hints of cinnamon and a piney undertone. Very malty, biscuit and toffee to taste with a pine and citrus pinch as a result of the hops. Well balanced. A nice velvety finish, creamy almost. Subtle carbonation and those malts make for a melt in your mouth crescendo.", "Láhev 355 ml. Aroma je příjemně chlebové s jemným závanem zrajícího sýra. Pěna je zlato bílá, jemná, vysoká a držící. Barva samotného piva je sytě měděná a jemně kalná. Chuť je bohatá, má příjemný sladový základ s chutným komponentem šťávy z exotického ovoce a jemným nádechem vlašských ořechů, finiš je příjemně chmelově hořký a držící. V ústech pivo působí plně, má střední říz a je dobře pitelné. Jaká to lahodná IPA, opravdu velmi povedené pivo.", "I liked this better than their regular IPA as well, maybe not as hoppy with some spices added instead to make it a tad sweeter. May be better than their regular pale ale as well. Pours a redish-copper color. A nice bitter-sweet flavor. A decent seasonal winter brew.", "Amber color, off-white head. Grapefruit nose, caramel, lemon, hints of peach and passion fruit. Grapefruit taste, resin, light sweetness, moderate bitterness, caramel, rich malty. Medium body, soft to average carbonation.", "Bottle at home from drinkstore\nhazy dark amber with dense beige head. Light peach and orange pith, herbal bitterness, full body moderate carbonation, dry finish. Unfortunately past its best.", "Released in Sweden December 2, 2016. ABV: 6.8% \r\nBest before September 29, 2017. \n\r\n \n\r\nDeep amber colored and a little hazy beer with a huge 4-finger high beige, fluffy, head. A lot of lacing stays on the glass. \n\r\n \n\r\nNose: Dark fruit, orange marmalade, caramel malt, bread, pine and resin. \r\nTaste: Bitter hops, dried fruit, red berries, pine, caramel malt, orange and some grapefruit. \n\r\nBody: Medium body and carbonation. Great taste with balanced bitterness and sweetness. \n\r\nI have to change my rating for this beer. I little bit higher than 2015 edition.", "Bottle.Amber colour with medium head.Aroma is fruity of dark dried frutis hops and roasted caramel malty and bready with good medium body and hint of hops and barley malt.", "12 oz bottle poured into a tumbler..copper color with fluffy white head...aroma of pine,resin,spices..spicy,hoppy but just didn’t do much for me.", "Bottle from Biervana, Munich, 27th March 15. Pours dark amber, big head that dissipates, aroma is a bit metallic. Taste is better though, good sweet malt and hops, lingering bitter hop finish. Pretty nice.", "10.1.2015. Copper orange. Aroma of sweet caramel malts, resin, tropical fruits. Taste has caramel, piny and resinous hops, grapefruit, grass. Lingering grassy bitterness. Solid balanced IPA with early sweetness and lingering bitterness.", "Orangebrun klar med to fingre høyt beige skum. Humlepreget av fersken, ananas, grapefrukt og vanilje. Søtlig fruktig start før kraftig bitterhet overtar. Bitterheten sitter lenge. Medium kullsyre. Tørr.", "2016 Re-rate: Bottle from Val-U Liquor shared. Big, bold bready malt nose with some light grassy hops as it warms. Super-well balanced but definitely malt is the star on the palate. Nice hoppy bite on the finish though. Solid. Old rating. Bottle from Old Town. Hazy orange pour with a big soapy tan head. Nice lacing. Aromas of malt, whole-grain bread, caramel, pine and resin. Well-balanced malt and hops. Medium-bodied with nice carbonation. Slightly sticky mouthfeel with a nice bitter finish. More good stuff from Sierra Nevada.", "330 ml bottle, packaged 17 October 2014 (so drinking at ~5 months of age). Pour is amber with thin white head. Hop aroma has pine, citrus orange/grapefruit, high bitterness, medium carbonation and a hint of alcohol warmth. Displays the same Sierra Nevada hop character you know and love.", "Classic seasonal beer from this pioneer among American craft brewers. Egg-white, regular, medium thick, lacing, moussy head with excellent retention, over a deep orange amber robe with slow fizz, a bit hazy with some minute dark yeast bits floating around. Typical ’dank’ aroma of orange peel, pink grapefruit, pine needles, old cheese, bark, mango, roasted peanuts, sweet honey, warm butter, calvados, biscuit, sundried tomato, dry cookies. Fresh fruity onset, sweet orange, starfruit, pineapple and redcurrant, smooth with soft, supple mouthfeel, medium carbonation tingling a bit, very nutty, biscuity and toasted malt backbone providing support for a long, dry, resinous, peppery hop bitter finish, more earthy than citrussy (feeling almost ’English’), drying and cleansing the palate and very appetizing, with a malty ’juiciness’ underneath; dustier, more powdery and more ’basic’ bitter after adding the deposit. Very good, but probably even better when young (tasted sample was 2 years old).", "Humlig barley wine doft med kola inslag. Humlad kola nyans. Karamell malt? Trevlig humle karaktär. Eftersmak fin beska som ligger kvar strävt på tungan.\n\n---Rated via Beer Buddy for iPhone", "At Tolkien’s House, Zagreb. Thanks Filip! BB 30.9.2015? Misty amber-red body with a creamy off white head. Surprisingly tame, malty aroma, vague jammy fruitiness that partly likely comes from the hops... Strawberry jam notes in the taste, medium sweetness. Good medium bitterish hoppy note, vaguely herbal note. It’s a nice beer but by no means a thriller. Expected more from a Fresh Hop IPA. If the BB indicates it was bottled in late September, then it can be excused I guess and will retry at some point. Not worth it right now.", "A- gold AR- resin and citrus M- full, long finish T- rye, citrus, and pine O- very big and full beer.", "Semi-clear copper with an impressively long lasting, creamy, off-white/tan:ish head, leaving a lot of lacing on the glass’ walls. Aroma is hoppy, floral, pine, resin, grapefruit. Taste is very well balanced, wood, biscuits, mango, grapefruit, moderate bitterness. Medium body, medium carbonation. Long, hoppy, bitter finish. An IPA that’s often mentioned as a rather malty one, which I can’t really see with this bottle. Good one though.", "Bottle from SB. Very nice amber red color, aroma is typically IPA. The taste is a bit anonymous, though. A good beer, but not perfect.", "Bottle. Hazy reddish pour with tan head. Aroma has lots of peach. Balanced taste with malty base. Average carbonation", "Bottle from 2014. Really malty IPA. Butterscotch, bread, pine, caramel, some citrus and grass. Not that much taste to it. Medium sweet and medium bitterness. \r\nGoing to open the next 2014 next year. Hope it develops over the year since it’s so malty.", "Bottle at home on 07/02. I carried on drinking, carried on chatting. Nothing was stopping me anymore until it all fell apart. Good beer.", "Poured from bottle, hazy red amber with high off white head. Aroma with notes of caramel, dried fruit and some citrus and pine. Taste is really bitter, balanced with a good sized malt body that’s a little sweet and a long bitter finish. Yum!", "Bottle. Pours Amber with White head. Aroma of citrus and Pine. Flavour is very hop forward with a touch of caramel and a pleasant bitterness. Citrus and pine. Delicious", "Pretty hazy but still really good. Nice and hoppy with a subtle fruity sweetness. Definitely could have been crisper.", "Aroma is a little hoppy but mainly leaning towards the maltier side with flowers and pine on top. The taste is medium bitter and it is a little thick in the mouthfeel. There is taste notes from sweet apricots and pine oil mixed with all kinds of darker berries and fruits. The finish is pleasant and comes with very mild spices.", "Good hop profile, enough bitterness and as well hop presence is strong. Good", "Bottle @ home. 2012 Vintage, meaning i wont rate this as an IPA, it is now somewhere in the midlands between IPA and American strong ale. Usually it is one of few IPA:s i find worth aging for a year or so, although 3 years...i had no expectations \n Pours an amber liquid with some particles, and a white head with really nice lacing. Resinous and tropical fruit aroma (pine apple, mango) with pine needles and backing malt/caramel/toffee/biscuits. Flavor is sweet with mango, pine apple, pine needles, maltiness, caramel. Aftertaste has a clean and sharp bitterness with grape fruit lingering.", "2014 vintage. Pours chestnut brown with big off-white head. Nice bouquet with balanced malty and hoppy aromas, some pine cones, herbs, a slight hint of tropical fruits and grains. The palate is predominantly malty with some caramelly notes. Medium bodied, good freshness and only moderate bitterness. Nice, british style IPA.\n\n---Rated via Beer Buddy for iPhone", "355ml bottle. Golden brown drawing slightly towards red-ish with large airy cream white head. Warm resiny grassy citrusy aroma with some sweetness. Initial light bitterness leaving way to somewhat roasted, chewy malts finally passing to lasting bitterness. Not very fruity but a nice hoppier winter ale.", "From 0,355l bottle, BBD: 08/10/15. Pours amber apricot liquid, big frothy tan to light orange head, Aroma: hopy, floral, caramel malts, cherry, citrus, pine, Taste: medium sweet, medium to heavy bitter, light sour, citrus, pine, caramel, Palate: medium body, thick texture, average carbonation, long bitter aftertaste, Overall: nice very bitter, citrus piny IPA with more sweet, caramel like body.", "Bottle from Systembolaget. Strong hop aroma, smells sweetly of foam candy. Nice fruity flavor, strong malt, chewing gum, candy, peach. Happy holidays!", "Flaska från systemet - fräsch blommig nästan fruktig doft. Bärnstensfärgad med vitt skum. Fruktig smak och en mycket tydlig beska. \n\n---Rated via Beer Buddy for iPhone", "Bottle from Cotteridge wines. Amber beer with large foam head. Aroma of grapefruit, pine resin and passionfruit. Taste is pine resin, grapefruit, some caramel and malts. Good, but expected more.", "Strange this is listed as an IPA...heard it wine gabf in some other categories. Never the less great great beer with biscuit and bitter hop flavor and the awesome typical Sierra hop aroma.", "0,355 l bottle \r\nspruce, citrus, cereal, amber, hazy, frothy, white foam, light sweetness, medium bitterness, medium body, oily feel, slick feel, soft carbonation, long finish,", "0,355 l bottle, best before 8/10/2015. Clear, medium amber to almost orange with a frothy, stable, tan head. Aroma is full of resin, grapefruit and tangerine with hints of mango and passion fruit. Medium bitter taste of grapefruit, resin and tangerine. Medium long, quite bitter and grapefruitish finish. Medium body, creamy mouthfeel, soft carbonation. Really nice beer with less fruitiness than expected but with a very solid maltiness that backs the hops perfectly. Absolutely enjoyable but not outstanding.", "Bottle. Clear amber, with small, longlasting white head. Aroma is caramel, herbs, pine. Medium bitter. Taste is hops, pine orrange. Bitter finish.", "-2014 Fresh Hop version- Bottle into shaker. Thick creamy prevalent head, tons of sediment, this thing looks gorgeous. Smells like pine, berries, orange. Taste orange, smoke, mixed berry, sweet red wine. Really enjoyed this, perfect after a long day on the slopes!", "Poured a orange Amber with white head and lace. Aroma was malty a bit of pine. Taste combo comes out like Dawn dish soap. Not impressed with this one. Bitter finish.", "Good but not outstanding. Reasonably hoppy. Not as aggressive as I would like\n\n---Rated via Beer Buddy for iPhone", "355 ml bottle from Bier-Deluxe.de\r\n\nCopper, moderate hazy body, with a big, creamy, off-white head.\r\n\nAroma of sweet berries, peach, some tropical fruits, biscuit, some bubblegum, soap.\r\n\nWonderful taste of citrus candy, pine, peach, berries, orange, biscuit, black tea, some spices and wood.\r\n\nMedium, quite creamy mouthfeel, with an average carbonation.\r\n\nFinishes bitter, subtly sweet malty, a bit dry, piney, quite zesty, a bit spicy.\r\n\n\n\r\nDelicious! Surprisingly malty, while there are still loads of fruity and piney hops. Pretty unique, with a very distinctive, bitter-sweet-spicy balance, that on the one hand fits the holiday season perfectly and on the other hand makes this an easily recognisable beer, I guess. Overall even better than I expected, exactly how I want a Red IPA!", "On tap at wildflowers too.\nBrown color.\nA bit flat.\nTaste: soapy , Ashy, Spice, caramel.\nDisappointed.", "Orange colour, white head. Aroma of honey, caramel, soap. Taste is light to medium , slightly sweet. Light body, thin texture, average carbonation.", "Draft - Sweet piney arroma. Appearance light reddish with an off white head. Taste sweet with a low citrusy aftertaste.", "350ml bottle, vintage 2013, from a forgotten place in my cellar. Thanks to djoeye. Rocky off-white head blanketing the glass. Close to clear amber coloured body. Mid-sweet grapefruit, wood, and brown malts on the nose. Mild spiced dried fruits, citrus peels, caramel and bread are present to the taste buds. Smooth leafy hop bitterness to the finish. Pleasing and with fine drinkability (Tromsø 29.01.2015).", "Bottle labelled \"2014\" from a Wild Plum shop in Steamboat Springs, Colorado. Pours orange-amber with a nice persisting, off-white head that leaves a lot of lacing. Lots of hops here, with citrus, grapefruit, pine on strong malt base that balances the heavy bitterness. The taste is heavy bitter with a smooth, full body, not unlike an IIPA.", "Pours I don't know, drank in the bottle. Aroma is piney, flavor is distinct west coast bitter piney hops, nice. \n\n---Rated via Beer Buddy for iPhone\nEarlier Rating: 11/5/2005 Total Score: 3.7\n2005 version. Great hop aroma, and a bit of a sweet smell underneath. Not a great looking beer, small head, copper color. Tastes like a strong IPA, but it has a fairly watery palate. Still very good.", "Draft - Fresh Woody and leafy notes. Clear gold with a rich white head. Woody, vegative and bitter with some pale malts. This tastes a bit old and stale, will try again.", "Let’s dispense with the pretenses and admit that despite its size, Sierra Nevada puts out a great product . Celebration is no exception. 2-3 of these will have you flying high. The taste for me isn’t quite as good as the Torpedo double IPA. It’s a little spicier, but it’s nice to have a season alternative to Torpedo.", "Pours amber with a white head. Light to medium body. A good amount of bitterness from the hops with hints of citrus, ginger and nutmeg and finishes sweet.", "Amber with small white head. Sweet malty aroma. Sweet malty sour and bitter taste with gingerbread notes. Light bitter and sweet aftertaste.", "355ml bottle from cornelius. Pours hazy amber, big white head. Light sherbet on the aroma, light floral hops, caramel. Taste is sweet, thin. Kinda missing something in the middle.", "12oz bottle from favourite beers Cheltenham. Pours a clear amber with slowly dissipating pillowy head. aroma is caramel, weak spices, malts and hops. smooth hoppy taste with a little fruity/berry twist and a dry finish.", "Geruch nach Hopfen, frischem Gras, weißen Trauben. Geschmack dann sehr bitter, vor allem im Nachgeschmack astringierend und seifig.", "Geruch nach Citrus, leicht bedeckt. Im Antrunk nicht allzu suß, aber ein schöner Hopfenvorhang, der sich in den Rachen legt. \r\n\r\nEin bisschen grasig, aber langanhaltend bitter.", "this beer is an exceptional seasonal. a fantastic ipa with a very slight spicy nose that really defines the season.", "IPA  \n香り高く、甘くて苦い", "Nice sturdy brew with a wintery harsh roughness to it that is quite pleasant. Distinct bitterness that is somewhat harsh without becoming overwhelming.", "Clear red/amber with a medium off-white head. Citrus, floral hops, sweet malt. Sweet with a bitter finish. Oily texture, low carbonation. Really nice.", "Aroma: Resina, aghi di pino e qualche fiore bianco che arriva dai luppoli. Leggermente percettibile è anche la presenza di un po’ di biscotto, Litchi e suggestioni di lamponi, un po’ Di uva..\r\nAspetto: Ramato scuro, quasi sul rubino, molto limpida.\r\nSapore: Sapore forte di luppolo, con qualche frutto come litchi e melone, uva, . un po’ di caramello per un buon bilanciamento complessivo. .\r\nSensazione al palato: Delicata, corpo medio senza essere astringente,poca \r\ncarbonatazione, buona secchezza con il luppolo che picchia forte sul finale, dando un sapore vegetale e resinoso. Tessitura leggera, buona birta.", "2014 version. Pours ruby red with large off-white head. Fresh hops aroma, grass, citrus, pine. Taste is caramel, oranges, loads of grapefruit. Fruity hoppy fresh with solid malt backbone. A winner!", "Bottled 09.30.14.\r\nPoured from a 12 oz into a tumbler on 11.11.14.\r\n\r\nA: Caramel and flower. Sweet smelling.\r\n\r\nA: 1 finger head. Hazy red, burnt caramel body.\r\n\r\nT: Flower, citrus, and caramel dominate. Honey, and a slight sharp pine bitterness, along with sweet graham cracker are subtle.\r\n\r\nP: Crisp and bubbly.\r\n\r\nO: This was pretty subtle for an IPA. It actually seemed more like an APA. It had the typical balance that Sierra Nevada has mastered. The flavor of flower was front and center, though. It had a really nice honey, graham cracker, and flower aftertaste. Sierra Nevada says that fresh hops can be dried, but wet hops are un-dried. So a lot of the fresh hop ales are wet hop according to them. However they define a fresh hop ale, theirs is good.", "Poured deep copper with a big, foamy head. Floral and grassy aroma. Taste is grass, grapefruit and orange peel. Good IPA.", "Drinks more like a DIPA, with loads of hops, but a solid malt backbone. Great, long bitter hop finish.", "Bottle from Jane’s Beer Store. Fruity aroma. Bitter taste, also sweet and fruity with pine notes. Long bitter finish.", "Pours clear golden amber with a thick, long-lasting head. Aromas of pine and floral hops with sweet aromas from the malts. Tastes nutty with caramel and finishes with moderate hops flavor both grapefruit and mildly grassy. A well balanced, full-bodied IPA. Not a hop bomb, but has a respectable hop presence and finishes with a lingering bitterness and nutty sweetness. A very nice and very drinkable IPA.", "Pretty good ipa from Sierra Nevada. Good hoppy flavor from the start and has a nice finish.", "Draft. Pours a rich amber / copper. Aroma is a bit subdued relative to the taste, which carries a big West Coast hop punch. Still tasting super fresh. Lacks some of the flair / enigma / magic of my favorite IPAs but clearly expertly designed and made.", "Thx! 355 ml. bottle sampled @ “Nog-een-half-jaar-tot-de-volgende-EBT”. Bottled on 10/11/2014. Hazy orange, solid white head. Sweetish thick grapefruit nose, light sugar. Taste is orange, bitter peel, caramel, some malt sweetness, bitter peel. Pretty solid malt backbone. Decent brew.", "Bottle at \"Nog-een-half-jaar-tot-de-volgende-EBT\"-tasting.\r\nAPPEARANCE: clear blond beer, small unstable white head.\r\nNOSE: hoppy, caramel, sweet.\r\nTASTE: hoppy, caramel, sweet, dry, bitter.", "I'm rating this the day after drinking it so I won't try to describe exact color, aroma, etc. overall great beer. Aroma was excellent dank, wet hops balanced perfectly by the rich malt backbone. I thought it was very well done and would be excited if I brewed something that good\n\n---Rated via Beer Buddy for iPhone", "Pours amber with a thick off white head. Aroma is strong citrus. Taste is strong at first with notes of citrus and malt. Aftertaste is bitter and lingers forever. Very hoppy beer.", "2014 edition. Tastes like some sweet caramel malts, grapefruit and pine. Not nearly as into this beer as I was years ago but still a classic I look forward to every year.\n\n---Rated via Beer Buddy for iPhone", "Citrus hope at the nose. Taste is bitter and hoppy. MAybe not too complexed but good enough :)\r\nDry bitter finish", "On keg at a pub in Borough Market. Descent white lacing. Esb/barely wine type appearance.. Aroma is fresh dough, grains, barely, some nice perfume. Taste is a little chalky, barely, blackcurrants, heart warming alcohol, chico sickly sweetness from the yeast. I feel mine was a bit old. I also prefer the IPAs in London to this profile. I’m sorry!", "Celebration 2013, bue 2 mois après la DLUO. Belle couleur ambrée/rousse, trouble, mousse blanche d’un cm avec des reflets orangés qui se tient très bien et laisse une dentelle sur le verre. Premier nez de fruits rouges : fraises et framboises. Second nez sur les houblons résineux. Et enfin du caramel et des épices. Bouche amère sur les houblons résineux et épicés, pins, caramel, fruits rouges. Belle texture légèrement liquoreuse, bonne carbo, belle longeur. Très bonne IPA qui reste excellente malgré la date dépassée, j’ai hâte de la regouter dans des conditions optimales !", "I wish I discovered this sooner in the winter season. Delightful winter ipa. Fresh piney taste and awesome amber color. Can't wait to get this next season\n\n---Rated via Beer Buddy for iPhone", "Nice red color with a foamy head. Hops and resin and sticky and a bit bitter on the back end. Solid but I prefer citrus in my IPAs", "Apparently I'm not an IPA guy. This beer was good for an IPA, not insanely hoppy, but still too hoppy for my tastes. A bit too bitter in the back end.\n\n---Rated via Beer Buddy for iPhone", "Amber and cloudy, a one finger white head. Fresh hoppy, pine, orange aroma. Taste is orange, hop bitterness, creamy malt, pineapple hints, lemon, medium to full mouthfeel. Tasty.", "On tap \n\nA: Semi - clear caramel color with a thin white head.\n\nN : Pine and more pine. Earth. Biscuit, and some minor citrus - particularly grapefruit. Peppercorn and maybe some rye.\n\nT: Very bitter and only moderately sweet.\n\nM: Medium body, resinous, fizzing carbonation. \n\nO: A classic. This is the original palate breaker and it does not disappoint.", "I thought this tasted great, really moreish! I thought the aroma was pleasant too, a citrus smell, with a sweetness and a slight hint of alcohol.", "Aroma is fruity hop with some mild plum or spice. Clear reddish amber pour with persistent white head. Taste is a near perfect balance of malt and bitterness. Always a great holiday seasonal.", "Something like a full-bodied English bitter made with American hops. Very piney with lingering bitterness. Lightly carbonated, biscuit and caramel sweetness from the malt and sharpness from the hops.", "33cl 2013 bottle. Expired 2 month ago. Pours amber with two fingers of creamy off white head that disappears almost entirely. Aroma of sweet fruits, caramel and resinous hops. Taste is similar with some spices and some vegetal flavors. Bitter hoppy finish. Medium body, medium carbonation. Unusual hoppy winter beer, shouldn’t have forgotten this in the cellar last year!", "A sötétebb színe, fűszeresebb illata és íze teszi ezt a sört ünnepivé, ami kellemes, finom, de nem arra való, hogy az ember hekto számra igya, egy pohár és kész!", "Bottle. Bronze color with thick off-white head; substantial lacing. Pine and resin aroma. Malt and bitterness upfront with resiny hop finish. \n\n---Rated via Beer Buddy for iPhone", "Pours a bright copper color. A good 2 inches of head that sticks around almost until you finish your beer. Tropical fruit aromas. Tastes of fruit, chestnut honey and caramel. Quite complex. A little too bitter though. Overall a yummy beer to have with a cheese plate and apples.", "Keg in the Curler’s Rest. Pours amber, nose is pine and toffee, taste is crisp, cold, bitter. Not terribly impressed with the pub - poor service.", "Appearance: Pours a pretty clear amber/copper color with a medium off white head. Tons of tiny bubbles stream to the surface. Very pretty beer. Good head retention with a nice amount of lacing. \r\n\r\nSmell: Grapefruit, rubber bands, soap. Not getting much malt. A touch of alcohol smell but no means strong.\r\n\r\nMouthfeel: Medium bodied with lots of tingly bubbles. \r\n\r\nTaste: Upfront this is all hops. Citrusy in the front with a lingering bitterness calling back to the rubber band smell. The malt comes through at the very end and balances out what could be a hoppy mess without it. As usual, as it warms, the malt is allowed to shine through. \r\n\r\nOverall: It’s a good beer, perhaps a great beer, but it’s not what I want in a winter seasonal. It’s about what you’d expect from Sierra Nevada in terms of taste and aroma. It shows off the hop harvest well, so I guess it’s mission accomplished on that part. If I’m judging it on it just on taste, it’s a probably 8/10, but as a seasonal I’m giving it:\r\n\r\n7/10.", "Copper with a thick cream head. Smells piney, resiny. Pretty solid, very drinkable.\n\n---Rated via Beer Buddy for iPhone", "Pours a clear amber with light white head. A pine and citrus/floral hop aroma. A bitter hop taste with citrus, pine and some light winter spices. A dry earthy hop aftertaste.", "Pours a clear light copper with 2 finger light yellow head. Head is fairly resilient and leaves quite a bit of lacing. Lots of hops on the nose and the palate. There’s some nice caramel notes underneath, but not being a hop head, it’s a bit over the top hop wise for me (and very one note hop).", "Cans from Cornelius and The Hanging Bat. Clear amber body with a thick off-white head. Low carbonation. Faint lacing. Aroma of resin, pine and blood orange. Flavour of honey, cedar and freshly rubbed hops. Medium body with an oily mouthfeel. Light fizz. A hoppy, beautifully balanced IPA. I love IPAs with an amber/copper body like this.", "Pours copper with a medium, short lived head. Aroma of pine and biscuits. Taste of sticky pine with a bitter body.", "Pour is dark clear amber with a thick of white head. Nose is citrus and a bit spicy. A lot more taste than expected after the nose. Fresh intense citrus and floral hop flavors. Very fruity. The malty sweetness kicks in in the middle and gets overwhelmed by a long medium to high pine bitterness with a touch of roasted malt. Excellent IPA with lots of fresh hop flavors.", "355ml bottle from Wholefoods.  2014 release BB Oct 2015.  Hazy orange amber, sparkling, big foamy head with craters, some thin lacing.  Aroma is rubbery, lightly floral, leaves.  Body is medium, foamy, low-ish carbonation.  Taste is dry caramel and burnt toffee, slightly metallic, assertive bitterness and astringent hop character.  Overall, it leaves a ’soapy’ impression.  Decent enough.", "Orange with good white head. Pungent pine and citrus hop aroma with a rich malty sweetness. What can I say, the description is accurate. Solid taste of fresh hops and rich toasted malt. Well balanced. Hops leave a pleasant coating on tongue. Lingering toasted malt flavor. Super good\n\n---Rated via Beer Buddy for iPhone", "Appearance is small white head and deep amber. Aroma is a mix. Taste is bitter hops with a nice balance of sweetness and spice. Overall a good IPA.", "Hazy copper color with tan head. Aroma of musty bitter oranges. Taste; bitter orange peel and malty mouth feel (not much malt flavor though). It grows on you as it warms up, if its too cold it has a character reminiscent of dish soap, as it warms up it is more of a wintery, boozy IPA. The aroma never improves though... perhaps best consumed from the bottle directly. For the price (<$15 per 12-pack).", "Clear Orange/red with dense off white head. This one didn’t travel very well.", "Bottled 10/10/14. Pours golden pale color with a huge frothy beige head that lingers. Aroma is big bold hops, Lemon, orange, just tons of citrus. Little bit of malt backbone. Flavor is hop-forward, orange sweetness. mango, grapefruit. Very tasty, with a just slight maltiness. It’s definitely a hoppy IPA but it isn’t overpowering. Good flavor, fresh. Really good IPA that.", "I think the beer from North Carolina tastes different than from California. This beer was good. Now it tastes like soap. Anyway\r\n\r\nAroma is soapy. Oily. Watery. Little hops,\r\n\r\nLooks good reddish orange. \r\n\r\nTastes oily. Orange. Lemon. Hops are dull. \r\n\r\nPalate is watery. Pretty smooth tho. Medium body. \r\n\r\nOverall where did the hops go? Why do all Sierra Nevada beers smell and taste like soap now? Nope. Something is amiss", "It’s about damn time I had Celebration Ale. I’ve only been wanting this ale for two years or so. The wait is over, and I must say, it was worth it. Appearance is what I’ve come to expect from Sierra Nevada’s hoppy ales: heady and burnt orange. Smell and taste are fresh hop-forward. Pine, grapefruit, and some grassy notes dominate the aroma. Taste has more of the same with some herbal and spicy tones thrown in for extra goodness. THIS is a winter ale. Exotic spices be damned. Hops prevail. A holiday IPA is a real reason to celebrate.", "pours a rich copper with a thick and persistent tan head. Aroma is citrus and floral hops. Taste is good bitter with a hint of spice. Long bitter hoppy finish with good nasal linger. A very solid IPA.", "Tasty ipa...good malt to hops ratio...very easy drinking...............................", "12 oz bottle from Niagara Falls Wegmans. Pours a clear orangey copper colour with moderate-sized off-white head. Aroma is pine/cedar with a little citrus and some fruity malt. Flavour has nice piney hoppiness with some subtle citric notes and a solid bready/fruity maltiness, as well as some spiciness in the finish. Medium-full body. Quite good.", "Bottle.\r\n\r\nA- Citrus, pine, bready, hoppy.\r\n\r\nA- Copper color, clear liquid, off white head.\r\n\r\nT- Citrus, piney, bitter.\r\n\r\nP- Medium body, average texture, average carbonation, sweet bitter finish.\r\n\r\nO- Not what I expect from a holiday beer. However, that shouldn’t detract from the fact that this is a solid IPA. Lots of pine and citrus going on and very well balanced, especially considering as a California IPA it has all the rights to be super aggressive and it is not.", "A good clean, crisp and hoppy IPA. One of the best available in the winter months. Not world class but more than adequate for my favorite beer time of year in the winter when you need a break from the amazing bourbon stouts that are released this time of year.", "How good is this? The malt has a touch of roast sort of like a copper ale. Reminds me of a Fat Tire. But then the hops are wet, resinous, bright, and mouth coating. Grapefruit pulp. Great lacing. The enhanced malt body provides seasonal appeal. Excellent winter IPA.", "Great holiday flavor. Doesn't taste like a gingerbread cookie like other holiday ales I've tried. Somewhat hoppy with a good color. \n\n---Rated via Beer Buddy for iPhone", "12 oz bottle pour. A little surprised it took me this long to rate this. Pours a penny copper color with a tinted foam head. Really nice grassy hop aroma. Refreshing wet hop flavor. Nothing really to overthink here. If you like a nice hoppy IPA that you can drink all day, this one is for you. I enjoy this one time and time over. Today was no exception. Good stuff.", "Pours medium bodied with copper/red holiday hue. Sweet citrus aromas with clean, grainy malt bill. Light pine needle and cedar. Taste is unapologetically west coast, with dry, spicy, piney hops presenting themselves at first sip. Those hope provide a nice initial snap but there’s an underlying sweetness and light citrus bouquet that brings it back to neutral. Finishes dry with pleasant lingering sweetness. Easy to drink and nicely balanced. Look forward to this every year. Seasonal classic.", "A good solid beer, but more subdued than typical IPA. Also a little busy for my taste, nothing in particular stands out for me. Very good quality though.", "Light aroma and a burnt orange color. Medium cloudiness, slightly fruity start on this and a little bitterness on the finish \n\n---Rated via Beer Buddy for iPhone", "This is my favorite beer. Since it’s only available seasonally, I pick up Torpedo the rest of the year. I’m just a big fan of the hops SN uses which provides the perfect combination of hoppy flavor with a crisp citrus finish.", "Pours a dark copper body and two fingers of fluffy white head that recedes slowly leaving a nice trail on the glass. Floral nose balanced with yeast caramel malts. Piney taste with a good level of carbonation and a touch of malty sweetness. Finishes bitter with a hint of citrus.", "Big off white head, smell is light biscuit malt. Pretty drinkable but not a go to winter beer for me.", "Really good IPA. Balance flavor and aroma. Light to medium hope level. Golden nutty in color almost deep auburn color. Light carbonation and minimal fiz. Very high quality beer worth the try for you IPA lovers!", "Pours hazy copper color with off white head. Malty aroma with fruity notes and citrus . Dry biscuty malt start with grapefruit and floral hop bitterness.", "Tasted from bottle 12/6. Nice hoppy flavour. Goes down smooth. Nice ipa for the holidays. \n\n---Rated via Beer Buddy for iPhone", "This is one of my favorite beers. It has a wonderfully sweet bitterness to it. Perfect for the season.", "One of my favorites this time of year. Biscuity malt that has a touch of red in it with a hop blend that is super balanced in flavor and beats out the malt very appropriately.", "Pours a deep amber, clear, minimal head, white foam, medium bitterness, full body, lively, long finish, citrus, floral aroma, nice hops, one of my favorite ipa’s.", "This one’s a classic, I wish it was available year round. Super bitter and fresh. Whenever I have this beer I’m just always taken back by how fresh it is. The hops just burst in this one, it’s really great. Tons of bitterness and spice. It’s the perfect beer for winter. Forget stouts, it’s all about IPA. This one is just excellent. Plus the color is beautiful. It’s a gem of a beer really. Enjoy!", "Pint pour, crystal amber with light off white head. Nose is bright citrus hop and clean malt, light caramel but mostly shine from the hops, pine an resin. Flavor of resin and pine mostly with caramel malt. Nicely balanced. A seriously well made IPA.", "This beer has the most bombastic yet pleasant aroma of any beer I have drank. The pour is amber with a slight copper/tan tint to the head. The taste is full and the malt asserts itself through all the layers of hop. The beer is well balanced and enjoyable but not necessarily sessionable due to its heaviness. A great sip.", "Amber in color. Moderate carbonation. Some toffee malt flavors but definitely citrus hops. Sweet scent.", "Amazing that I haven’t rated this yet. I have enjoyed this since before it was cool to drink craft beer, and before this was a \"fresh hop beer\". I always waited around for this to come out and would quickly grab a case. Pours a cooper color, with floral hop aroma. Flavor was more of the same with a nice bitterness throughout. Very enjoyable.", "bottle @ Party Town / Florence KY --- Nearly clear dark amber, 1\" off-white head, streaks and bands of lace. Aroma of malt and bitter citrus. Taste is sweet malt that grows through the palate, bursting into the swallow, then yielding to good medium hops in the finish, the two sides intermingling nicely. A solid, tasty brew. Highly recommended.", "Malty, banana bread aroma, nice dark amber appearance, nice suds, some hop in the taste. Smooth. Good.", "Bottle. Pours amber, hazy, sligthly tan frothy head, decent lacing. Faint aroma: hoppy/citrusy, some fruitiness, milk (?). Taste: bread & caramel, grapefruit, spruce, tropical fruits, spices. Very nice.", "Bottle. Pours a slightly hazy brownish amber with a thin layer of off white head. Aroma and taste of malts, a bit of spice, and some fruit.", "I REALLY like this beer. One of my all-time favorite IPAs is Smuttynose (Finestkind), and Celebration is right up there, but with a darker, richer, spicier character. Hoppy with a perfectly delicious bitter finish, A great holiday season/winter IPA that could easily be enjoyed year-round.", "Nice looking amber beer with a thick foamy off white head. Rather tepid nose of light citrus, candied orange peel, and hints of spice, but you have to really search for it. Thankfully, the flavor is more pronounced with a resinous hop bite up front followed by light caramel malt that finishes with some nutmeg and cinnamon. Pretty good beer.", "Poured from 12 oz. bottle. \n\nClear orange with a 3-finger off-white head and excellent lacing. \n\nAroma of tropical fruit, pineapple, citrus and hay. \n\nTaste of pine, citrus, tropical fruit, pineapple and floral hops. \n\nFull/medium body and medium/low carbonization.\n\n---Rated via Beer Buddy for iPhone", "Rated based on notes taken 2011 and 2013 -- This is a nice spicy beer with some bright hop flavors.", "Bottle 0,355L. Foggy orange colour with large off-white, frothy head. Aroma of sweet tropical fruits - pineapple, tangerine, orange, peach and honey. Taste starts moderate bitter with a lot of grapefruit and orange. Finish is heavy bitter. Medium body, dry texture and soft carbonation.", "Wonderful beer for Christmas. Lots of malts and hops that have given this beer and complex mix that comes across so smooth and tasty.", "12fl oz bottle poured into a Dogfish Head IPA glass. Deep amber with ample off white head. Aroma is fresh flowery hops. Lots of citrus in the flavor with strong hops on the back end. Lasting bitter finish. Yum. \n\n---Rated via Beer Buddy for iPhone", "Pours a clear amber-gold, with medium head. Floral aroma, with pine and citrus--very fresh and biting. Flavor is very bitter-pine, some citrus, a good bit of underlying malt sweetness. Really nice IPA.", "12 oz bottle pours a bright, clear amber with a small head. Citrus hop aromas and sweet malts. Taste is oranges, hay, pine and grapefruit. Moderately bittered, yet ultimately very smooth. Very fresh tasting. Great IPA!", "Nice and malty with a smooth hops finish... Pours extremely thick and dark with a nice head and awesome lacing\n\n---Rated via Beer Buddy for iPhone\nEarlier Rating: 11/19/2014 Total Score: 4.6\nVery malty with a nice hop backing... Not to over powering. Pours very thick with a nice head and excellent lacing. One of my fav holiday beers\n\n---Rated via Beer Buddy for iPhone", "I am rating the 2014 version, poured from a bottle. Pours somewhere between a dark golden and light brown color. Head isn’t that large, but is a nice white color and comprised of tiny bubbles that stick around for quite a long time. Light aroma of pine and grass. Nice, full bodied flavor. Start rich and creamy in the mouth and finishes with a subtle but noticeable sour hop finish. Flavor is not overpowering but is well developed and the different flavors blend together nicely. Honestly, I think the aroma may be the weakest point of this beer, which is odd for an IPA. This a very solid beer and I’m happy to drink this type of IPA when it’s cold outside (like tonight).", "Bottle from ABC. Pours a beautiful hazy amber with a perfect frothy head and some great lacing as well. Aromas are a glorious combination of pine, citrus, and flower. Taste is sweet at first with a strong bitter finish with staying power. Mouthfeel is medium to full bodied, creamy and utterly satisfying. This has been my favorite beer for years, now, and Sierra Nevada once again have reminded me why. I’ll be stocking up soon. Acquire.", "A full pine hop aroma that goes well with the bready malt. Color is a deep orange almost amber with good lacing on the pour. Taste is citrus with a lot of pine notes from the hops but not an overpowering hop bomb. Balances well with the malt. Very refreshing and worth drinking again.", "Look: pours a very clear light copper. Off white head. Very thick lacing.\nSmell: very sweet aroma. Piney. Light citrus. Tropical fruit. \nTaste: piney. Light onion. Grass. \nFeel: dry. Medium carbonation. \nOverall: not a bad beer. Looking for stronger fruit taste. Not as strong of a west coast ipa as I thought. \nFirst drank: home 11/15/14", "Very nice hop aroma. Red in color with very nice soapy lacing that lasts throughout. Very dangerously crushable ipa", "Picked up a sixer as I felt this was a popular seasonal that I had yet to enjoy. Bottle pours a deep copper with good carbonation and a deep white head. The lacing here is fantastic. Clings satisfyingly to the glass. A really well balanced fresh hop IPA. The amount of balance between the hops and caramel malts along with a bitter back end is remarkable. Lots to celebrate here.", "12 ounce bottle into signature pint glass, bottled on 10/2/2014. Pours slightly hazy deep orange/amber color with a 2 finger dense and rocky off white head with great retention, that reduces to a nice cap that lasts. Nice spotty soapy lacing clings down the glass, with a moderate amount of streaming carbonation retaining the head. Aromas of big grapefruit, tangerine, lemon zest, orange peel, floral, grass, pine, caramel, toasted bread, and floral/grassy earthiness. Damn nice aromas with great balance and complexity of juicy citrus/floral hops and moderate dark/bready malt sweetness; with great strength. Taste of big grapefruit, tangerine, lemon zest, orange peel, floral, grass, pine, caramel, toasted bread, and floral/grassy earthiness. Fair amount of pine/grassy bitterness on the finish; with lingering notes of grapefruit, tangerine, lemon zest, orange peel, floral, grass, light pine, caramel, toasted bread, and floral/grassy earthiness on the finish for a while. Damn nice complexity, robustness, and balance of juicy citrus/floral hops and moderate dark/brady malt sweetness; with a great malt/bitterness balance and zero cloying flavors after the finish. Medium carbonation and body; with a very smooth, crisp, and fairly creamy/sticky mouthfeel that is nice. Alcohol is well hidden with minimal warming present after the finish. Overall this is an excellent wet hop IPA. All around great complexity and balance of juicy citrus/floral hops and moderate dark/bready malt sweetness; and very smooth and crisp to drink. A very enjoyable offering.", "Nice spicy winter ale. Little weak in flavor but really good for a cold night.", "12oz bottle pours cloudy amber with an off white head and heavy lacing. Aroma is subtle; mainly pine. A pine citrus taste with a malt backbone. Above average beer.\n\n---Rated via Beer Buddy for iPhone", "A well rounded and mildly potent IPA. Strong hops and caramel in the nose. Body is medium with a bold hoppy flavor. Bite at the finish.", "12 oz bottle poured in pint glass. Wonderful aroma with amazing fluffy thick head that rides for a long time. Tastes great as well, very hoppy and delicious, a perfect winter IPA.", "350ml bottle. Dark amber hoppy beer with small white head. Malted barley, fairly bitter, balanced and tasty. Strong beer - at 6.8% it’s a good winter-warming beer.", "Pours ruby red with a small frothy off white head and good lacing. Aroma is rich caramel and earthy malts with a moderate grapefruit and pine hop punch. Taste is a great balance of rich malts and fresh grapefruit and pine hops. So nice.", "Piney with a great malt backbone. A truly complete beer, very drinkable. Pours brown with good foamy head and some lacing. Medium bitter finish. Average carbonation. Bottle.", "I can’t believe I’ve been on here for 10 years and haven’t rated one of my favorite beers that got me into beer in general. This one goes back to when I was 20 and going to my grandparent’s place with my parents. We stopped off at the grocery store and while picking up a few other things there was a huge end cap display for Celebration Ale. I convinced my parent’s to buy me a six pack since it was Christmas themed etc. At that point I’d had maybe six tastes of beer in my life. I still remember sitting by our old Macintosh computer with a 36.6kb modem and looking up random crap on Christmas Eve while sipping on one of those bottles. Bitter and hard at first but such a great beer. Since then I’ve had this beer every year since 2000. I felt this was more true than a random review of this beer. Since then I have hoarded it and done the whole vertical which is insanely dumb with a fresh hop IPA. There is also no Christmas spice in this so I won’t mention that either. Love this beer.", "Bottle from pistáchio bar, Sintra, Portugal. Color is dark oragen. Head is persistent and thin. Body is medium. Taste is medium bitter and medium sweet. Aroma is hoppy, malty, bubblegum. Nice malty IPA.", "12oz bottle pours a cloudy amber with an off white head. Big pine and hop aroma. Pine citrus taste with a perfect malt finish.", "Granted this one has been around forever. But the last few year’s offerings have been blah....This year, AWESOME!! Cheers to staying power!!! As far as holiday flavor, not much. As far as awesome IPA flavor, EVERYTHING!! Full balance with malts & hops. VERY WELL DONE!!!", "Very popular, but I was expecting more with all the hype around it. Bright amber pour with an off white head. Lots of carbonation. Floral and piney hops and some earth, hay, and charcoal notes. It’s sharp and a little oily, with a good amount of bright, fresh hops. It’ an unoffensive and fairly satisfying fresh hop IPA, but not earth shattering.", "For the price one the most satisfying ipa with that spice twist. So clean with just the right amount of crisp bitterness. \n\n---Rated via Beer Buddy for iPhone", "deep amber color; slightly cloudy; nice, fresh, citrusy hop aroma; lots of citrusy hops with pine notes on a medium bodied malt base; well balanced with a solid malt base", "Little head with thick cream colored lacing. Fresh hoppy aroma. Lightly bitter from hops that linger on the tongue. Deep amber color. Really good Christmas beer. One of my favorites. Very different than the usual white ale or porter. \n\n---Rated via Beer Buddy for iPhone", "Nice mixture of malt and hops, a nice sweet initial taste with some hop bite and a smooth aftertaste \n\n---Rated via Beer Buddy for iPhone", "On draft. Cooper color with one finger head. Pine aroma. First sip is so much pine and ends with a little tropical fruit. really like it.", "Very subtle hop aroma with some malt notes. Very mellow malt taste and hops don’t feature too much. Just an ok beer. Nothing memorable", "Bottle. Pours a golden copper with light off-white head. Aroma of piney and floral hops. Taste is mainly of hops , grapefruit, and bitterness. Decent.", "Julie says that this is icky it is very hoppy and not her cup of tee she gives a 1.2", "Bottle to shaker glass. Pours cooper amber, nice two finger head, nice lacing. Aroma of light caramel and pine. Taste is malty sweet with light citrus bitterness. Medium body, lively carbonation, creamy mouth feel. Finishes bittersweet with notes of toffee, spruce, herbs and light pine. This ale isn’t bad but I remember it being better.", "Amber, frothy off-white head, and decent lacing. Floral, mild spice, lite caramel, and mild earthy notes. Medium bodied, floral hop notes front to back, sweet malt notes, nice balance, clean finish, and medium bitterness. \n\n\n---Rated via Beer Buddy for iPhone", "Thank god this tastes good again. I thought it was off and bitter last year. Ive lost what I has for Sierra Nevada but this classic still tops my list. Everything you’d expect from the traditional chinook cascade and centennial hop combined balanced by a healthy malt backbone that offers some toffee and caramel characteristics.", "12 oz bottle into tulip. Minneapolis. \r\n\r\nAppearance: Brown/copper in color. Moderate hazy to the beer. Large white head with superior retention. \r\n\r\nAroma: Hops - mostly bitter pine and grapefruit, some grass. \r\n\r\nTaste: Mildly bitter the whole way through. Dry.\r\n\r\nPalate: Medium/light body. Average carbonation. Long finish. \r\n\r\nOverall: More bitter than other reviews lead me to believe. Hops profile is very piney. Generally a decent beer to drink, especially for the price.", "Nose is spicy, fruity hops. Flavor is dank, melon, grassy, bready, biscuity, doughy, caramel, mild grapefruit rind. Really well balanced.", "Extremely well balanced IPA. Every note shines through at the same level - not overly bitter. Refreshing, mild spice profile coming from the hops, crisp and refreshing, taste a little bit of green apple rind - the same amount of very subtle bitterness.", "2014 is a good brew year. Good looking dark amber color offset by a quarter inch white header. Smooth taste-Nice piney and crisp feel in the mouth. If you are looking for a hop bomb this is not it. But it is a very good and nice beer to enjoy with company.", "2 full fingers of white fluffy head. Nice copper color with immediate lacing. Aroma is lots of grapefruit and some pine. Taste is much the same very clean with lemon and grapefruit. Slight alcohol warmth ont eh back end.This is a world class IPA that often gets overlooked.", "Bottle @ home from Saveur-biere.com - Color: clear amber beer with small carbonation and small heavy white foam. Really nice. Smell: grassy and hoppy domination small woody and forest nose. Taste: high hoppy taste with good caramel notes and malty well balanced. Aftertaste: nice wet bitterness. Really nice beer. I recommend it.", "Bottle from Bierhalle Deconinck, Vichte. Amber colour, creamy white foam. Aroma of tropical fruit, caramel and honey. Sweet with bitter hoppy finish. Very drinnkable and good!", "Great brew had in bottle...rich malts amber in color great use of PNW hops...real fresh and hoppy tasting...I loved way malts back this one up.", "\"i think this beer is quite a bit better than their regular ipa or flagship pale ale. it’s got a better aroma, and a nicer all around, hoppy flavor. their second best beer.\"\nRanges from 3.5-4.1 (2017 was a 3.5, 2021 was the first above a 4)", "Little foam top. Fresh first mouthful. Heavy bitter finish. Looks like a Christmas beer but doesn’t taste like one.", "Cloudy amber color, average sized off white head. Lots of sediment. Medium to full body, average carbonation. Nice thick body, it feels like it’s 10%, not 7%. Aroma of pine, tropical fruits, citrus. Medium sweet, medium bitter taste. Nice and long bitter finish. Very nice IPA.", "Şişe, delirium bar Brüksel.28/09/14. Bronz koyu bir renk, ortam karanlık ama bardakta gazlı görebildiğim kadarı ile. Köpük kırık beyaz ve bronza yakın renkte.. Koku tazelik.. yeni kesilmiş çimen, taze otlar, tatlı malt, ferah bir Pale ale-ipa \nTadım başta yumuşak, dolgun bir Pale ale gibi başlıyor, ağızda malt hafif baharat tınıları hissediliyor ancak sonrasında aroma (şerbetçiotu aromaları) ve hemen ardından acılık her saniye artıyor ve dili damağı sarıyor. Bitirişi bir Dipa havası ile yapıyor. Oldukça başarılı bir bira...", "12 oz bottle courtesy of Dan, served in a stem glass. Pours clear orange-amber with a small off-white head that fades to a thin remnant and leaves a small amount of fine lace. The nose has big piney hops, along with caramel, biscuit malts, and subtle citrus. The flavour is moderately bitter throughout, with resinous, piney hops balanced with loads of caramel and biscuity malts. The flavour is long and moderately bitter with a piney-spicy quality. On the palate it is medium in body with a smooth, milky texture and average carbonation. Overall, a very nice robust IPA that stands up to winter nicely. 2014-09-30", "Mörk orange/guld färg. En öl helt i min smak! Riktigt bra. Flaska från Systembolaget.\n\n---Rated via Beer Buddy for iPhone", "Butelka 33cl. \r\nOCZY : piwo ma kolor bursztynowej pomarańczy. Piana jest średniej wielkości o kolorze kości słoniowej. \r\n\r\nNOS : bardzo przyjemny zapach zdominowany piernym słodem o nutach tarty, piklowanym imbirem. delikatnie gotowanymi wiśniami. Do tego pomarańcza i cynamon, dojrzale mango i ananas, grejpfrut. \r\n\r\nUSTA : piwo jest symbolicznie nasycone i puszyste o tłustej teksturze. \r\nŚwietnie (czytaj nudno) wyważone pomiędzy gorzkimi nutami chmielów amerykańskich a słodkimi nutami słodu z lekką dominacją słodkiej tarty. Występuje również lekka pikantność przypominająca cynamon, imbir i skórkę pomarańczy. W posmaku jest umiarkowane lecz wciąż delikatnie pierne. Można wyczuć tym razem bardziej grejpfruta. \r\n\r\nODCZUCIA : Piwo jest smaczne ale bez zaskoczenia. Bardzo kompromisowe ale bezbłędne i przyczepiam się do niego na siłę. \r\n\r\nOCENA : \r\nsmak : 7/10\r\npijalność : 7/10\r\nstyl : +1", "Real thick pour, some decent hops, a little sweet maltiness, somewhat bitter....OK", "350ml bottle from Mondial de la Bière shop, sans bb. Upfront sweetish, near-medicinal nose of a pine, quince and pineapple rind reduction. Taste sees more of that same unripe orchard fruit bitterness best described as quinces, mercifully underlaid with some cookie dough caramels and honey. Lingering piney finish, bittering and aroma hops slowly working their way into palate and enamel. Balanced in all its brawny bitterness, although Chinook will never be my favourite hop... // Rerate 12oz bottle from BH 2016-4, as Celebration Fresh Hop IPA (pckgd 11/2015): resin marmelade, evaporated hop oils, pure piney bitters condensed into a jelly body...miles away from fresh exotic Beer Camp..", "Zapach z butelki: Intensywnie tropikalno-żywiczny.\r\nPiana: Ładna, kremowa, drobnopęcherzykowa. Średnio trwała, ładnie oblepia szkło.\r\n\r\nKolor: Jasnomiedziane, trochę zmętnione z pływającymi drobinami.\r\n\r\nZapach: Intensywnie chmielowy. Dominuje mango, trawa, żywica. W tle estrowe poziomki. Po ogrzaniu na pierwszy plan wysuwają się cytrusy.\r\n\r\nSmak: Średnia podbudowa ciastkowo-chlebowa. Intensywna chmielowa żywiczność i tropikalne, słodkie owoce.\r\n\r\nTekstura: Pozostawia delikatny osad i umiarkowane ściąganie w jamie ustnej.\r\n\r\nNasycenie: Średnio-wysokie.\r\n\r\nGoryczka: Wysoka, ziołowo-grejpfrutowa.\r\n\r\nPijalność: Wysoka.\r\n\r\nTo piwo okazało się być wyśmienite. Jestem skłonny uwierzyć, że zastosowanie świeżego chmielu daje się odczuć w postaci dużej intensywności aromatu. Dość zdecydowana, ale nie przesadzona słodycz fajnie kontruje zdecydowaną, ale również nie przesadzoną, charakterną goryczkę. Jestem bardzo ciekaw, jak to piwo mogło smakować dwa-trzy miesiące wcześniej, kiedy było ultraświeże. Zdecydowanie spełniło moje oczekiwania.", "Served on-tap at Al’s of Hampden into a nonic pint.\r\n\n\r\n\n\r\nA - Pours deep copper orange with a one finger tall white head leaving small streaks of lace down the glass.\r\n\n\r\n\n\r\nS - Smells of sweet caramel malt, pine resin, lightly toasted bread, and citric hops. The hops and malt are well balanced, neither really overpowering the other.\r\n\n\r\n\n\r\nT - Starts off with a nice dose of citric hop bitterness quickly giving way to a mix of sweet caramel malts, fresh baked bread, and some sticky pine resin. It is fairly well balanced but the sweetness is beginning to creep up. The finish is a mix of light sweetness and bitterness, lingering on the pallet for some time.\r\n\n\r\n\n\r\nM - Medium body and flavor with moderate carbonation. Smooth, slightly sticky, feel that makes it ever so easy to drink.\r\n\n\r\n\n\r\nO - This one remains one of my go to fall beers. The balance of sweetness to bitterness is spot on and it goes down easy. One of the rare IPA’s that gets better with age.", "Transfer from BA reveiw on 11-27-12-\r\n Served on tap in a pint glass\r\n\r\n Appearance – The beer is served an amber color with a two finger white head. The head fades slowly over time to give a decent level of lacing.\r\n\r\nSmell – The aroma is heaviest of some biscuit malt, hop, and a spice. The spice is light overall with the hop aromas are of a pine and grapefruit citrus in nature.\r\n\r\n Taste – The taste starts with a bready and roasted flavor. A light sweetness of fruit and caramel is present upfront, which fades as the taste advances further. Spice and hop flavors soon come to the tongue. The spice flavors are the light just as the nose would have suggested and with the loss of some of the sweetness and the new presence of a pine and grapefruit hop flavors, bring a bitter spiced and bready flavor to linger on the tongue at the very end of the taste. \r\n\r\n Mouthfeel – The body of the beer is medium in thickness with a carbonation level that is quite average. Not bad for the roasted and spiced flavors of the brew with the moderate carbonation level maintaining a good drinkability.\r\n\r\n Overall – A decent brew. A little bitter for a winter brew, as the bitterness and the spice don’t meld perfectly, but overall not bad.", "Old golden color with creamy big head. Nice malty and fresh hernal aroma, also citrus and piney. Light sweet with soft pleasant bitterness.", "Out of the bottle. Definitively enjoyed the wet hopped. A bit of good spice taste. \n\n---Rated via Beer Buddy for iPhone", "2013 Celebration. An orange beer with a big and blond head. The nose has caramell, citrusfruits and pine, some tropical fruits, also woods to indicate some aging. Taste has caramell, pine needles, also wood, nice and quite strong bitterness. Menthol and resin in the long-lasting end. Medium bodied, fresh carbonation, nicely smooth to drink. Unfortunately, the age has robbed the best aromaticity, but good beer anyway with a strong hoppyness.", "355 ml bottle as a gift by WheatKing at Q Club in SoHo, Central. Thanks Adam!\r\n\r\n\n\nLooks: Cloudy hazy amber honey colour with no yeast sediments;Three-quarter finger head and off-white foam which fades in 40 seconds; Excellent sticky lacing with near zero carbonation.\r\n\r\n\n\nAroma: Fragrant and sweet Ale malt, with fresh grapefruit, pineapple, floral nectar, honey, caramel, strong pine, resin, strong yeast, light lemon and thin grass.\r\n\r\n\n\nTaste: Mid to light sweet Ale malt, with grapefruit flesh and zest, light caramel, molasses, strong pine, very light resin, very light alcohol, earth, spices, light biscuits, light lime, bitter hops, and pretty sharp grass.\r\n\r\n\n\nBody: Medium; Slightly oily and oozy palate.\r\n\r\n\n\nMouth Feel: Moderate Ale maltyness with good touches of caramel. Good fruity citrus. Very strong pine but not really resiny. Lack of yeast in bottle means lesser biscuits. The rest are full sharp hoppiness. Pretty well balanced. Gooood!\r\n\r\n\n\nHoppiness: Fragrant grapefruit pineapple, floral nectar, strong pine in nose. Quite refreshing citrus zest, strong pine, light resin, earth, spice and light lime in taste. Bitterness is strong, smart and neat, but not as bitter and astringent as typical German Pils. Work well with the light resin for a lasting, mid-to-strong bitter finish.\r\n\r\n\n\nAfter Taste: Fairly dry after taste. Hoppy, spicy and delicate to mouth.\r\n\r\n\n\nComments: Most American craft IPAs I had were very malty and heavy, not this one: SN really know their stuff and this one is typically strong in pine and fruity aroma, yet the body, taste and hoppiness is lighter without being compromised. Everything is done with a delicate touch, which is well-suited for X’mas but what the hack. An excellent IPA!"]}