{"reviews": ["the aroma: caramel and fruity, hints of brown bread, nuts, raisin, cookies, honey...\nthe taste: caramel and fruity, notes of brown…", "Okay for me . Expected more and think it’s because I prefer a nice round hazelnut stout kind of taste and the brown ale was bit thin and more towards almonds. Nice looker but rather thin and fizzy too. Would take again though and would  love to try if it’s on cask", "Light brown and cloudy with an off-white head and a caramel nose. Nicely-carbonated with a medium mouthfeel and a caramel, chocolate Roman candy finish.", "Nut brown as advertised, whispy head. Coppery aroma. Rich taste of malt, dried winter fruits, hazelnut, biscuit, sweet finish. Fine brown ale.", "Aroma : Malty toffee, tiny hints of chocolate & nut with a light earthy hoppy note.  Taste : Medium body & texture. Moderately hoppy bitterness throughout with a tiny touch of sweetness in background. Overriding flavour is a strong malty toffee, with little hints of chocolate & Brazil nut. Decent Brown Ale", "Bottle from Beers of Europe. Clear brown with small beige head. Aroma of sweet malts, nuts, caramel, light aromatic hop. Taste is very malty with sweetness, toffee, nuts, some chocolate. Light to medium bodied and highish carbonation. Quite tasty.", "355ml bottle. Pours clear brown with a small beige head. Aroma is chocolate, malt, toffee. Taste is light sweet, toffee, nutty. Light bitter finish.", "Brown with a tan head.  Aroma is nutty and malts.  Taste is malty band barley.  Similar to a red ale", "Woody, Nutty, full of goodness, deliciousness and for those who loved the old Newcastle, some reminders of those notes are present. Samuel smith fan for years.", "Cerveza de color marrón caramelo con una cabeza de color canela y esponjosa no muy densa.\nAroma a malta tostado, caramelo y frutos secos.\nSabor a malta tostada, caramelo, nueces y algunos sabores afrutados. Hay una cuantía media de amargor en el paladar que perdura después de cada sorbo. Esta cerveza tiene un buen nivel de carbonatación con una sacudida en boca fresca.\nEn general, esta es una buena cerveza con unas esencias y sabores que la hacen bastante fácil de beber.", "Bottle Haket 2021-03-02 Göteborg \nAR: roasted malt, semi sweet nutty\nAP: deep amber, wee head\nF: roasted malt, semi sweet nutty, caramel", "500ml bottle delivered by the Blue Boar, Leicester and drunk at home. Light brown, cmear with a quuckly dissipating off-white head. Light malty aroma, some woddy notes, chestnut. Sweet nutty taste turns slightly bitter on the finish. A bit of woody tang in the aftertaste. Slightly watery body with carbonation on the heavy side. A step above your average British bitter, nothing vey terribly special but a nice drink all the same.", "En Almería (casa). Botella de 355ml. BestBefore: 02/22. Resvisión realizada según la Guía BJCP 2015 para el estilo British Brown Ale (13B).\n-Aroma:  bajo a malta tostada, bizcocho, caramelo, toffee; muy bajo a nuez, casi inapreciable. 5/12\n-Apariencia: color marron claro, rubí al trasluz. Claridad brillante. Espuma blanquecina, fina pero persistente. 3/3\n-Sabor: bajo dulzor a malta, bajo amargor. Balance maltoso con final ligeramente amargo y seco. 13/20\n-SB: cuerpo ligero, carbonatación baja. Sin cremosidad. 3/5\n-IG: Una Brown Ale que se ajusta al estilo pero sin destacar en ningún atributo. Se echa de menos algo más de cuerpo que podría conseguirse aumentando la temperatura de macerado. 6/10\nTOTAL: 30-MUY BUENA", "Pours clear amber with white head.  Moderate retention and good carbonation.  Browned malty aroma.  Strong cherry/concord grape taste.  Even mouthfeel with a dry, bitter finish.  Overall not a lot going on besides the grape thing; makes me wonder if it's out of code, but they didn't date the bottles.", "Barwa trudna do określenia. Czerwonawo rubinowo różowa. Słuszna beżowa piana. Drobna, sztywna. Tak na oko kremowej konsystencji. Krążkuje aż miło. Aromat słodowo orzechowy. Odrobinę przypomina koźlaka. \nBobrze nasycone. Puszyste i kremowe. Delikatna goryczka nie przeszkadza w delektowaniu się słodowością. \nOprócz orzechowych są i nuty chlebowe. Delikatnie słodkie. Odrobina wodnistości sprawia że piwo jest bardzo pijalne.", "Bottle from LCBO gift pack. Pours brown lots of frothy head and lacing. Notes are tea, hazelnut, light plum. Taste light bitter medium sweet. Creamy body light carbonation.", "Nutty and raisins aromas. Taste is dry, nutty-malty with nice hoppy finish.", "W aromacie orzechy, karmel, lekkie estry. Fajna ciemnobursztynowa opalizująca barwa. W smaku mniej orzechów, więcej nut herbacianych, trochę karmelowych i biszkoptowych. Finisz nawet całkiem wytrawny. Dobre piwo, nieskomplikowane ale charakterystyczne i pijalne.", "Some light rust and caramel. A little leather and black tea. Pours dark amber with ok initial head. This is probably a little highly rated - one of those posterity things. A touch of bark in the finish, and some woody cloying tang. Bottle.", "Una cerveza de color castaño rojizo, con notas a pasas, higos, bollería y en general dulces. Cuerpo medio y con acidez persistente en boca.", "White long lasting head, nut brown colour. Nice malty aroma with some chocolate notes. Good one!", "Rocky off white head left a froth on a reddish brown still body.\nMalt & sweet spiced aroma.\nMedium bodied, average carbonation & clean on the back.\nNutty, roasted, malt, syrup & liquorice tastes.\nIt's a good one.", "550ml bottle brewed in England at 5%. A clear ruby with shades of dark amber; not really nut-brown (when held up to the light at least, would pass as nut-brown in a dimly lit pub for sure), with a sizeable good-duration head. Aromas of chocolate and toffee with some tangerine resin. Moderate- carbonation. Sweet chocolate malt developing with a caramel tinge, a dash of tangerine, and some herbaceous bitter tang towards the end, where a mildly nutty aftertaste is born. A lively, hoppy brown ale, with good balance of sweetness and dryness - the 'modern' ale drinker really ought to try this offering from a stalwart English brewer in the rustic, 'old-school' style. Alternatively, fans of 'traditional' straightforwardly sweet (and straightforwardly brown) brown ales might not warm to this - but it's still well worth a try. Bottle a month past the Best Before; seems unaffected based on my memory of previous samplings. This is great drinking - not everything needs a gimmick or 'wow factor'; sometimes you just want a tasty balanced brew - it's no coincidence Samuel Smith lists a variety of suggested food pairings on its bottles.", "Flaske fra beer palace Oslo. Lys brun. Lukter av nøtter, sjokolade. Smak av sammen, tørr ettersmak.", "I have such a soft spot for this beer. It was the first \"craft\" beer I ever had, way back in college in about 1988. Rediscovered it recently at Purvis Beer in Melbourne. Still a great brown ale, all the lovely deep tones you expect. Ahhhh memories.....", "550ml bottle from deli in Northallerton. Pours dark mahogany/brown with a tan head. Aroma is toffee, malt loaf, nutty, Christmas cake, dark fruits and orange peel. Smooth mouthfeel with some soft carbonation. Taste is toffee, caramel, treacle, nutty, Christmas cake, dark fruits and some sugared orange peel. Subtle but traditional quality taste. Slight bitter finish. Really fantastic example of the style.", "550ml (5%) shared with Stuartyboy at home on 13 Jun 2020, purchased on 15 May 2020 (bbe Mar 2021): nutty, toffee aroma, amber brown, good pale cream head, no lacing, aromatic, toffee, nutty malt flavour, creamy, moderate fizz, some resin in the finish.", "Brown, tan head. Nutty, a bit sweet. Some dried fruit, a bit short aftertaste.", "Brown color with a fine fine foam.\nNose. Caramel, notes of grape juice, dried fruits appear when heated.\nTaste. Dry, malt, caramel, fried notes, dried fruit notes. In the aftertaste, light bitterness with notes of wood or walnut? Perfectly balanced ale. But there are no nuts here!", "500ml bottle from a corner shop in Gospel Oak.  Deep brown.  Aroma of brown bread, malt loaf and nuts. Fruit cake and bready malt flavour.  Fairly light.", "Bij het zien van het bier was ik eigenlijk al verkocht. Smaak houdt een mooie balans tussen het zoet en bitter met tonen van karamel en noten.", "Bottle from Varsity.  Dark thick brown with decent head.  Malty aroma.  Pretty dry with walnuts malt and a little grass.  Quite nice", "Pours a dark brown colour with a beige coloured head \nNotes of roasted coffee and cocoa nibs \nCask beer found at Wetherspoons in bury ST Edmunds", "Fles 35,5cl thuis. Droog, noot, caramel, rood fruittonen, roasted malts, zoetig. (3-4-2020).", "Wygląd: Barwa ciemnoczerwono-brązowa, klarowna. Piana beżowa, wysoka, drobnopęcherzykowa i zbita, opada do ostatniej warstwy pozostawiając lacing.\nAromat: Nienachalny. Na średnioniskim poziomie słodowość biszkoptowa, tostowa, orzechowa, herbatnikowa z akcentami karmelu oraz kwiatowo-korzennym chmielem i jabłkowymi estrami na tym samym poziomie. \nSmak: Podobnie jak w aromacie. W ustach półwytrawne i odrobinę mineralne, treściwość średnioniska, wysycenie średnie. Goryczka niska, korzenna, krótka, dobrze zaznaczona i przyjemna. Finisz wytrawny, lekko mineralny z korzenną goryczką i nutami słodowymi. \nOgólnie lekkie i pijalne, chociaż brakuje trochę więcej słodowości. Z kolei jabłkowych estrów mogłoby być odrobinkę mniej.", "55 cl bottle at Gyhallmanti’s. Appearance: clear brown with medium off-white head. Aroma: nutty, soy sauce, sweet malts and some biscuit. Taste: medium sweetness and bitterness. Notes of nuts, malts, some bread and soy sauce.  Palate: medium bodied, watery to oily texture and soft carbonation. Overall: okay", "55cl bottle split with SimonBlok and Richardvv. Pours a clear copper brown colour with a medium foamy off white head with decent retention. Aroma of caramel, caramalt, slight bitter hops, burnt sugar. Taste is moderate sweet, medium bitter with a medium dry finish. Notes of malt, caramel, slight yeast, burnt sugar. Texture is oily to watery, medium to light bodied with medium carbonation", "Slightly hazy copperish brown. Thin beige head with low retention. Aroma intensity 2/5. Nuts, chocolate and malt aroma, notes of blackcurrant. Vanishing light bitter syrup taste. Light to medium body", "Pours a dark bronze or maybe amber color.  Two finger beige head.  Okay retention and good lacing.  A little hazy. \n\nAroma is...oddly some sort of liquor staves, bourbon maybe.  Oaky.  Touch of nuts, malty.  Touch of vanilla. \n\nTaste is oaky bourbon.  Touch of vanilla.  Hazelnut maybe? \n\nMouthfeel is feels heavier than it really is, an illusion I guess because of bourbon staves.  It’s more or less neutral.  No aftertaste.  Neither sweet or bitter, it’s boring. \n\nOverall it’s a bummer.  The only real flavor is the, bourbon staves; and that was unexpected, unwanted, and unwelcome.  I wouldn’t buy it again and I wouldn’t recommend it.", "Good,clean ale.I don't have much experience froom brown ales.could be dryer.smooth taste,but could expect more of it.", "Clear brown color with tan head. Aroma of dried fruits and raisins. Dried fruit taste along with little bread and raisins. Light to medium body, average carbonation. Not too sweet and enjoyable", "Rich dark brown ale with nutty yeasty flavour. Hints of coffee and licorice with marmite umami in the background. Some figgy and prune sweetness. Nice winter warmer.", "Light brown color with tanned head. Aroma has caramel, dark malt, nuts and bread. Taste is malty sweet with long quite dry aftertaste. Flavors of dark malt, chocolate, nuts and bread.", "0,355 l bottle from Alko Ympyrätalo, Helsinki. Light brown, clear, big head. Taste is quite malty, but not that sweet. Ending is dry but not bitter.", "Liquide translucide, belle couleur ambrée, léger nez de fruits à coques. En bouche c'est agréable, fin amer mais pas de quoi y revenir. Correct sans plus", "Taste is a bit diluted, this type of beer will have difficulty surviving against more fulsome craft beers.", "Bottle 330ml at home. From Alko web shop. BBE AUG 2020. Pours brown with tan head. Aroma haa malts and dried fruits. Flavor has dark malts, bread, dried fruits, hazelnut, hops. Medium body, average carbonation, malty bitter finish.", "Brewed August 2018 (Lot no 18228, best before August 2019).\nDark brown / nutty colour. Medium lasting head.\nNose: Green apples, roasted malt, roasted nuts, yeast, hints of molasses. With air come notes of Christmas cake\nThe arrival comes with slightly sweet, medium roasted malt notes. \nOn the mid palate more of the medium roasted malt but drier. Also some fruity green apples. Fine, medium to rich carbonation. Good body. \nThe exit and aftertaste are both dry, malty and has some hops bitterness.\nA very nice and well balanced brown ale.", "A dark reddiesh-brown beer, a head is medium and light beige. Aroma has dried fruitness of raisin, some roastiness. Taste has dried fruitness, raisin, some breadyness, not too sweet. Almost medium bodied. Surprisingly, lots of dried fruitness.", "Copper, dark amber and brownish translucent color. Tanned head disappears fast. Aroma of chocolate and malts. Taste is malts, chocolate, light coffee and dry nuttiness. Quite decent and long aftertaste.", "Bière cuivrée, claire, avec des arômes maltés, sucrés, et une bouche plutôt douce. Une bière simple, dans le bon sens du terme, et assez légère.", "0.55l bottle. Dark copper/brown color with tanned head. Aroma is malty with chocolate, some caramel and nutty notes. Taste is sweet with chocolate notes and nutty flavor. Overall it's very good beer.", "Si sente molto l'affumicato, soprattutto caffè, tanti da rendere stucchevole la birra. Si beve con piacere ma non invoglia a berne ancora, forse da trovare un abbinamento giusto\nEarlier Rating: 9/5/2019 Total Score: 3.4\nSi sente molto l'affumicato, soprattutto caffè, tanti da rendere stucchevole la birra. Si beve con piacere ma non invoglia a berne ancora, forse da trovare un abbinamento giusto", "A tall can from Denman Liquor on Denman in Vancouver. Lots of tan head here and a mouthful of nutty malted goodness with a decent hop bitterness in the background. 3.8", "Bottle, 0.55l. Clear cola-brown/red pour, two finger frothy beige head. Good retention, medium lasting, lots of lacing on the glass. Malty, nutty nose with herbal notes in the background. \n\nThin to medium body, soft carbonation. Smooth mouthfeel and texture, a bit lightweight. Slightly roasted bittersweet taste, malty aroma. Caramel, roasted malt. Nuts, herbs and spices, fruity background. Short to medium finish, subtle lingering bitterness. \n\nNicely balanced and flavorful. Good one.", "Brown color, middle foam size. Caramel, bread, malt in aroma. Taste is in kvass style. Good beer.", "Simply a truly tasty and fulfilling beer. I’m not gonna pretend to taste notes of hazelnut, chocolate, coffee, etc.   I just know this is quite possibly my favorite beer of all-time. Hope you like it at least half as much as I do.", "Bottle 0,55L. Clear amber color with big off-white, frothy head. Aroma of nuts, roasted malts, caramel and honey. Taste starts light sweet with cocoa and walnuts, while finish is light to medium bitter with notes of burnt sugar and fresh nuts. I expected smoother body and something rich in taste, but didn't get it from this beer.", "Bottle. Dark ruby, thick brownish head. Aroma of hazelnuts, slight caramel, toast, toffee. Taste is medium bitter, hazelnuts on tongue. Light to medium body, slick texture, soft carbonation, long bitter finish.", "An english, foggy Brown Ale with creamy head. Aroma is caramel, light coffee, hazel nuts. Taste is bitter and light sweet.", "Much superior to Newcastle Brown. Flavoursome. Slightly bitter/sweet. Creamy and nutty with vanilla aftertaste. I had vowed after the tragedy of Newcastle’s Brown to avoid but this changes my mind", "This is a very easy drinkable beer. You don't find many browns about except that awful Newcastle bad. \nThis, it could be a bit more nutty, more sweet. But it does its beery job well.\nSlightly thin, but has gentle sweetness and a very delicate hazlenut taste coming through. \nEasy to drink and does go rather well with wenslydale.\nThis is like a nice stay at your favourite aunts. \nShe also has a lurcher dog. That likes to sit on your Lap when you sleep in the second best armchair.", "Bottle @ Home w friends/Panzer, Don, coffee patrol and Martinsen. Appearance: pours clear brown with good off-white soapy head and lacing. aroma/taste: caramel, nuts, light chocolate, bread, biscuit and light floral notes. palette: medium malty aroma, average carbonation, medium body, medium to notable sweetness, somewhat balanced by a medium bitterness, average duration and an oily texture. overall: nice malty brownie", "Bottle from Beers of Europe. \nAppearance - deep brown with an off white head. \nNose - hazelnut, walnut and pistachio. Toffee.\nTaste - walnut and toffee again.\nPalate - close to medium bodied, creamy middle. Rich but dry finish.\nOverall - great example of the style.", "Deep amber pour, tan head with good retention. Nose of molasses and brown sugar. First taste has some roasty, burnt dark malt notes and a nice nutty sweetness up front. Slightly sticky caramel flavor. A touch too watered down for my liking. Not bad, but there are much better Samuel Smith's offerings out there...", "Good, but my expectations were certainly higher after the brilliant Organic Chocolate Stout. Something persisted, though - it's still too watery! Smell is reminiscent of namesake nuts, but in the taste they're nowhere to be found. Slightly creame.", "Appearance: Pours clear cooper amber with a generous creamy off-white head, with lacing.\n外观：铜色至琥珀色，清澈，丰富细腻的浅黄色泡沫，有挂杯。\n4/5\n\nAroma: Hops, malt, caramel and yeast notes, with a slight hint of bread.\n气味：酒花、麦芽、焦糖和酵母香气，伴有轻微的面包气味。\n7/10\n\nTaste: Hoppy roasty malty flavor, with some nuts and caramel. Subtle sweetness followed by hoppy bitterness and some tartness. Bitter hoppy finish.\n味道：主要呈现酒花和烘烤麦芽风味，伴有些许坚果和焦糖味。入口是微妙的甜味，随后呈现酒花苦味以及些许酸味。尾韵苦，呈现酒花风味。\n6/10\n\nMouthfeel: Medium bodied, texture is smooth, moderate carbonated.\n口感：中等酒体，顺滑，杀口感适度。\n4/5\n\nOverall: Pleasant and easy.\n讨喜、易饮的酒。\n12/20", "Copper to brown color, medium beige head. Aroma caramel, roasted malt, cherries. Taste brown sugar, roasted malt, caramel, nuts, bitter, oil texture.", "A rich Dark Brown appearance, with sweet nutty aroma. Subtle smooth malt taste with none complex finish. At 5% this is a solid none session ale. A Samuel Smiths classic, I will buy this beer time and time again.", "355 ml bottle. Clear brown, foamy head. Roasted malt, caramel, dry citrus, breadcrumbs, metal. Malty sweetness, dry bitterness. Medium bodied, watery texture, soft carbonated, dry malty finish. Okay.", "This is one of the first breweries I got into when starting to drink craft.  For some reason, I missed this review.  Maybe I was waiting until I got this again to review fresh.  Anyways, been about 2-3 years since I had this, but recall it to be one of my favorite brown ales.  On the thicker side for the style. Semi-creamy texture.  Medium-brown appearance.   Nutty flavors balanced very well with the malts/hop combo.  Now that I am reading the other reviews, going to go this direction next time I go brown...not so much to get a refresher to my memory, but mainly because this is one of the best browns around.", "A fine ale with a fine head and nutty aromas. A fine eksample of how SAmuel Smiths keep a High quality\n\n---Rated via Beer Buddy for iPhone", "Pours dark brown, medium head. Aroma is sweet, nutty, caramel, toffee, cacao, cherry, roasted malts. Thick texture and cocoa, caramel, malty, marmalade, metallic and nutty flavor.", "Color marrón, cristalina. Un dedo de espuma amarillenta con retención media. Aroma a frutos secos y malta. Gusto dulce, malta tostada, azúcar moreno, toque sutil de avellana y cacao, ligero amargor al final del trago. Cuerpo acuoso. Brown Ale british de manual.", "Pours clear mahogany with three finger, light tan head.  Aroma is light roast and nuts. Taste is light raisin, moving to nuts and roast.  Finish is roast.  A drinkable brown ale.", "Piwo pite jakis czas temu, ocena na podstawie wspomnnień z degustacji, przeniesiona z innego portalu.", "Brown ale de 5 % abv, avec sucre de canne.\nMon exemplaire était à 11 mois après sa date.\nCouleur châtain roux foncé, à la clarté nette.\nMousse beige, soyeuse, stable à 2 mm.\nArômes de fruits mûrs, molasses, feuilles d'érable, candi.\n1ère bouche souple, à l'entame fruits/malt/fût.\nArrière-bouche quasiment de quadruple, avec pointe d'amande.\n2ème bouche superbe, à l'harmonie grandiose.\nArrière-bouche riche, longue, complexe.\nLongueur qui assure une très belle suite à cette entame du tonnerre.\nLes saveurs passent sur un registre moelleux et suave.\nJambes huileuses, longues.\nLevure souple, fine, belle ligne.\nAlcool superbe pour son niveau, mais il avait vieilli quelque peu ..\net il avait pris quelques grammes de plus !!\nFinale splendide.\nCONCLUSION : très grande brown, pour laquelle le brasseur donne \nquelques conseils de food pairing … eh oui !! Why not ? disait l'anglais ..\nPour ma part, je vous donne un conseil pour la bière elle-même : \nlaissez-la vieillir une petite année de plus que sa date limite ...\nlà elle est juste à point, et elle fera le dessert à elle seule, sans pairing !!\nPour une brown, un top absolu.", "Hadn’t had this old favorite for years.  Wow nice return to the ‘standard’.  Not so over the top sweet or chocolate or coffee - just plain good old malt presence with a bit of balance.  Drinks so easily.  So good and fresh from a 14.9 fl. Oz. Can.  A year later: poured from a 19 oz. bottle: same great, smooth Winter’s day Ale.", "Bottle from Rehills, Newcastle. Brown-copper coloured with a large white head of foam. It has a chocolate and nutty flavour with roasted notes, red fruit and a nutty finish. Very good.", "cette brown ale anglaise est mince, et sa mousse est rare mais présente. Au nez, notes très discrètes de sucre d’orge et de boisé. En bouche, elle débute sucrée et ronde, pour se finir sur une note âcre, à la limite amère. Aqueuse, elle recèle quelques céréales très tranquilles. Un brin décevante étant donné la renommée de la brasserie, mais elle manque définitivement de caractère, de punch, bref d’audace.", "Caramel, toffee,  malty with roasted almond, walnut and other nutty notes. This brown ale doesn't overdo it with sweetness and a syrupy texture like American varients often do.  A well balanced, warming ale", "Clear, brown colored with a red hue, medium beige frothy head. Aroma is of some toasted malt, toffee/caramel, light chocolate, some fruity esters, light nuts. Taste is medium sweet malt, caramel, bit toffee, toast and bit of chocolate, bit estery and some nutty flavor, light+ bitterness. Medium bodied, soft carbonation, bit oily.", "Brewed at Samuel Smith’s small, traditional British brewery with well water (the original well sunk in 1758 is still in use), best barley malt, roasted barley, yeast and aromatic hops. Nut Brown Ale is relatively dry with a rich amber-brown colour and nutty flavour derived exclusively from small amounts of dark malt. Brown ales are a specialty of northern England. Fermented in ’stone Yorkshire squares’.", "Sample@Ølfestival København 2018 (Day 3) - dark brown pour with a beige head. Toasty and roasted malty medium sweet with some caramel, some fudge, nutty accents throughout, medium body, sweet malty finish.", "Clear, reddish brown, with a fairly good head. The assertive aroma is malty and just slightly sour, with some bread notes along with hints of sherry and roastiness. There is no sweetness to speak of, but the bitterness isn't too kicky either (just right for the style, imo). The staccato finish is neat, dry and elegant. This is a fairly juicey and surprisingly nuanced beer - by far my favourite brown ale to date.", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "Couleur ambrée, petite mousse beige . Nez malté caramélisé, orge, avec noisettes fraiches et fruits murs. Gout malté, caramel, notes chocolatées puis noisettes et notes fruits murs. Fin sur le coté fruité noisettes assez seche. Mais nickel pour  5c°", "Bottle. Dark amber brown body with light tan head. Aroma is malts fruits nuts. Taste is nice malty caramel. Aftertaste is nice balanced.", "08-10-18 // taster at an event at Kuehn Kunz Rosen brewery in Mainz. Brownish with a light beige head. Great malty aromas, nuts, caramel, light roasted notes. Light bodied, could be a bit thicker. Very mild nole hop bitterness.", "55cl bottle from Abeervinum, Rimini, Italy. Pours dark brown, reddish, with minimal whitish foam. Aroma is nutty and caramel. Body is not particularly dense, with good carbonation. Taste is fairly sweet and toasted. Minimal bitterness. Finish is regular.", "355 ml bottle. Aroma is relatively weak, hints of walnuts and honey. Flavour is dominant malty, medium sweet, light bitter, nutty. Not the best beer from S. Smith, but still a nice one.", "0.35l bottle. Pours amber with off-white head. Aroma of walnuts, malt, caramel, an overall general nuttiness. Taste is malt, bitter roast, caramel, nutty (especially walnuts), almonds. Bitter finish. Decent.", "Can. Ar: Dried pineapple and red apple; earthy, slight licorice hop aroma; bread crust. Ap: Red-brown and crystal-clear; large off-white head with very good retention, settling into an airy cap of foam with chunks of lacing along the glass sides as it recedes. T: Dried pineapple and red apple, very similar to the nose, sort of like an un-spiced fruit cake; low sweetness; bitterness is low, slightly tannic, with a black tea and licorice accent of flavor; bread crust, biscuits; finish is black tea and apple skin. P: Medium-light body with medium-high carbonation; finish is medium-dry. O: A quaffable English brown ale; malt and fruit flavors are pronounced but not over the top.", "(uk, onctueuse sur light acidité de fruits, last fruit amer-terre, pas complexe pour un shilling, à boire au cask)", "Aroma is reminiscent of cherries and there is a slight presence of caramel.\r\n\r\nInitially some sweetness is detected but subsides into bitterness. I get nutty finish.\r\n\r\nInitially a nice carb bite. A nice silky texture on the finish. \r\n\r\nAftertaste is all caramel and malty bread crust.\r\n\r\nMedium body.", "God og velsmagende brown ale. Masser af fylde og god aroma. Tilpas med bitterhed", "Bottle. Malty aroma, hopy notes, caramel, roasted malts, nutty notes. Tastes the same as aroma, light sweet notes, light to medium bitter. Medium body, malty caramel bitter sweet finish. Good.", "One of the all time classic British nut browns. Has all the traditional qualities of the style in spades. Great to finally try it on draft.", "Samuel Smith Biere finde ich sehr gut. Meist qualitativ sehr hochwertig. Auch das Nut Brown Ale macht da keine Ausnahme.\r\n\r\nOptik\r\nRecht dunkel mit schöner, mittelbrauner Krone.\r\n\r\nGeruch\r\nMalz, Karamell, Toffee und Nüsse.\r\nSehr angenehm.\r\n\r\nGeschmack\r\nKaramell/Toffee, Malz, Nüsse.\r\nSehr aromatisch, sehr angenehm und ausgewogen. \r\n\r\nAbtrunk\r\nEtwas würzig, ansonsten wie der Geschmack.\r\nDie Nüsse kommen etwas intensiver zum Tragen.\r\n\r\nFazit\r\nEin sehr gutes Brown Ale. Sehr aromatisch und ausgewogen. Typisch Samuel Smith.\r\nIch habe mittlerweile schon einige Biere der Brauerei Samuel Smith probiert und wurde noch nie enttäuscht.\r\n\r\n\r\nEmpfehlung zum Probieren ? Ja.\r\nEin Bier für mein Sortiment.\r\n\r\nZum Wohl.\r\n\r\nVolker.", "Ttadicional. Agua dura. Maltas frescas y predominantes. Buen equilibrio. Bebible (a quien le guste el estilo). Muy inglesa.", "Bottle in Seattle. Nice thick cream on a lovely ruby brown with clear edges. Syrupy Brown malts on the nose, sip is much lighter with crisp nutty caramel. Some licorice leading in to a bitter malt bite. Strong roast note deep in the body. Medium weight, a surprising bitterness, fruity malts otherwise. Very clean. Lovely.", "Bottle at Princess Louise, Holborn. Sliglty sickly caramel floral aroma. Red tinged chestnut. Thick off-white head. Swet and sour with a bitter edge. Tinned fruit and caramel. Light bodied. Soft mouthfeel abetted by the carbonation. OK, better than a boring bitter.", "Аромат карамели с оттенками патоки. Цвет темно янтарный. Пена небольшая но постоянная, которая преследует пиво даже после полного употребления. Вкус неожиданно солодовый. Также ощущается карамель и патока, некое присутствие меда. Послевкусие мягкое сладко-карамельное. Пиво очень питкое и водянистое. Ему явно не хватает немного яркости во вкусе, но даже без этого Самуэль Смитс снова держит высокую солидную планку.", "Bottle from Stanislaus Brewskovitch, Zwolle. Aroma is malt, caramel, toffee, nuts, and a hint of cocoa. Flavour is medium sweet and light bitter. Body is medium. Nothing spectacular, but pretty decent Brown Ale.", "550ml bottle. Pours a clear amber-brown with a medium, creamy, long lasting, beige head that laces nicely. Sweet aroma of toasted malt, bread, caramel and nuts. Sweet flavour of toasted malt, biscuit, toffee, caramel, molasses and walnut with a dry, bitter hop finish. Medium body with a creamy, smooth, oily texture and soft carbonation. Very nice, easy drinking.", "Reviewed on March 4, 2018. Date code SF20Q1 (June 20, 2017), so it is a bit old. But, if the brewer is satisfied to have beer this old for sale, it is fair game to review it, IMO. Aroma of fruit, caramel, some nutty aroma in there as well. Slightly hazy to clear reddish brown with a tall tan-to off-white thick creamy head. Sweetish caramel intitially in the taste, with fruit and toast. Feel is thin, creamy and smooth. The middle begins to get bitter, with the bitterness intensifying into the finish. As the beer warms, the aftertaste becomes more unpleasant. This beer no doubt suffers from its age, but as it stands, it is not particularly outstanding. OK at best. \r\n\r\nPS: I reviewed this side-by-side with the Ale Asylum Madtown Nutbrown. Not as good as the Ale Asylum. I need to find a fresher Sam Smith brown.", "355ml bottle @ Beijing China\n外观 红宝石色透亮酒神 中等量棕白颗粒泡沫色表面绵密 持续时间不长\n香气 麦芽 焦糖 巧克力\n味道 咖啡 少量太妃糖 烘培麦芽味道 略有酸感\n回味 整体较平淡 有咖啡香和苦味回味\n口感 酒体中等 有滑腻感 沙口感中等 苦感强烈 涩感无 酒精感微弱", "From bottle at Cardinal with HDI 14.02.18. Clear dark copper. Beige head and lacing. Aroma and taste of caramelized malt, dried berries and moderate hop bitterness. Good quaffability!", "Moderate biscuity aroma and high malty-sweet caramel flavor with robust toastiness that yields gracefully to a moderately dry finish....\r\n\r\nMedium bodied beer with moderately-high carbonation which adds to an initial body and bloom to the mouthfeel. \r\n\r\nFirst English Brown Ale I've had - the bar has been set high, I think.", "Bottle at The Princess Louise, Holborn. Pours clear pale to mid brown with a lasting slightly creamy off-white head. Aroma of toffee, nut, roasted malt and dried fruits. Medium sweetness, light to moderate bitterness. Medium body, slight oily texture, average carbonation. Enjoyable.", "Brun med fint skum. Herlig blanding av nøtter og flytende karamellsaus i duft og smak. Smooth, litt tykk munnfølels.", "Aroma: 70%\r\nAppearance: 80%\r\nTaste: 70%\r\nPalate: 80%\r\nOverall: 75%\r\nTotal Score: 74%", "Aroma-10/12\r\nAppearance-3/3\r\nFlavor-8/20\r\nMouthfeel-3/5\r\nOverall Impression-4/10\r\nTotal-28/50\r\n\r\n风格：British Brown Ale\r\n酒精度：5.1%vol\r\n原麦汁浓度：12.5°P\r\n灌装日期：2016.09.01\r\n\r\n饮用日期：2017.12.25\r\n饮用温度：10℃-12℃\r\n\r\n香气：明显、浓郁的麦芽焦糖、太妃糖、面包皮气息，较轻的酒花泥土、花香、药草气息，还有些深色水果的酵母气息稍带一丝丝不明显的酸感。\r\n\r\n外观：；酒体为透明的红棕色或棕褐色，色度约22，边缘带一些黄色高光；酒头极如咖啡奶泡一般，米白色混合浅棕色，丰富但不持久，消散后维持薄薄一层完全覆盖在酒体上，挂杯也不错。\r\n\r\n风味：入口明显的焦糖、太妃糖风味，还稍有一些烤坚果的气息，中下的酸味，并转出酒花中等偏下的苦味和一些泥土气息，收口柔和稍干，焦糖味与酒花药草味平衡；回味以明显的酒花药草味为主，配合被压制的坚果气息。喝了两三口之后麦芽焦糖、太妃糖气息更加弱化，酸味、酒花泥土药草苦味更明显。\r\n\r\n口感：酒体中轻，入口柔和，略有水感，沙口中等。\r\n\r\n总体印象：整体平衡偏向英式酒花的泥土、药香的一款英式棕色艾尔，也有可能是放置时间太长导致酒花苦味及明显的酵母酸味更突出。如果风味能更偏近香气的风味，使麦芽焦糖、太妃糖气息不被酒花压制，则感受要好很多，现在这个入口后明显的中药酸苦味真是不好喝。", "Toffee, caramel aroma. Dark brown color, small tanned head. Medium sweet, light bitter, a little dry. Medium carbonation, light body.", "Botella en Vivalabirra (Oviedo) Color marron bastante transparente y limpia, sabor maltoso ligero, algo dulce", "Very nice ale, amber in colour.  Nutty and toffee type taste.  Would definitely buy again.", "Undated imperial pint > pint glass\r\nA: Clear mahogany or tea color with a short tan head that falls to a stubborn film.\r\nS: Sweet chocolate, a little stone fruit or fig, dark bread and faint alcohol. \r\nT: Unsweetened Chocolate and bitter hops blend nicely with bitterness lingering. A hint of tart cherry and hazelnut. \r\nM: Light and crisply carbonated. Slight resin on an otherwise fairly dry finish.\r\nO: Haven't had this in years and it's nice to revisit. Old standby still recommended.", "Bottle. Clear chestnut brown. Moderate off-white head. The nose is caramel, toffee, minor nuts, cocoa. Light body. Fairly dry tasting. Really nutty here. Rich toffee and caramel. Flavourful. Lightly hoppy ending. Floral. It's OK because of the entire dryness. A very pleasant brew.", "Pours a clear, dark amber/mahogany colour with average carbonation. Aroma is earthy, lightly roasted malts, slight nuttiness and some caramel. Taste is sweet, nuttiness shines through along with some caramel and fruitiness. Well balanced with slight hoppy bitterness. Medium-bodied, very enjoyable beer. Paired really well with Thai Red Chicken Curry - robust enough flavours to stand up to the dish; carbonation and hop bitterness help to cut through the spice and cleanse the palate whilst malty sweetness blends together with sweetness and spices in the dish to make a great match!", "12oz bottle at home. Clear medium brown with a frothy off-white head. Caramel, nuts, cocoa, wood, dark fruit, dark bready malt. Medium-light body. Lingering nutty, mildly malty finish. Don't drink this too cold.", "Clear light brown red, 2 fingers of foam, off white foam. \r\n\r\nVery nutty aromas with caramel and butterscotch, sweet overall. \r\n\r\nNutty taste, some butterscotch, burnt malt, medium bitterness in the finish. Nice end reliable.", "Pours clear brown with low bronze brown head\r\nAromas and taste has malty notes of butterscotch, nuts, caramel, hints of cherries and red berries", "355 ml bottle. Med gashåndtag. Dark amber colour with a medium sized lightly tanned head. Sweet aroma with caramel malts, nuts, fruits, candid sugar and a lightly toasted note. Taste is light sweet. Medium body with a creamy texture and an average carbonation. Finishes slightly drying with caramel malts and fruits. Liquorice. A nice classical Brown Ale.", "Color marrón, translúcido y rojizo si le da la luz, con capa de espuma de un blanco amarronado de tres dedos de grosor (pequeñas burbujas y buena retención). Carbonatación media. Textura oleosa. Aroma a malta tostada, caramelo, cacao, frutos secos, reminiscencias herbals. En boca mucho caramelo y menos cacao, azúcar, algo de avellana y nuez. El sabor va ganando profundidad a medida que uno va bebiendo. Mucho fruto seco en postgusto. Brown Ale de manual.", "On bottle @Ølfred - Aarhus Streetfood\r\n\r\nPours hazy brown with small amount of foam.\r\nBoring and watery, malty, woody aftertaste", "Belo aroma e sabor maltado, castanhas, amêndoas bom final seco. Cerveja histórica.", "Thick and mild. very heavy in the belly. tastes great but nothing staggeringly fantastic. really it just seems like its made authentic. not a bad price either.", "Clear, brown.\r\n\r\nAroma: fruity, roasted, nutty, light woody hops.\r\nTaste: light sweetness, light fruity tartness.\r\n\r\nGood.", "Bottle at the Rising Sun in Smithfield. Poured well with a big foaming head and a nice dark colour in the glass. It was served way too cold and it took a while for the flavours to really appear. Wood, malt, a definite nuttiness and a sweet mouthfeel. As it warmed the aroma really started to appear and there was a definite hint of hazelnuts. A pleasant beer, but by the end the sweetness was a bit too much for me.", "Poores dark brown but minimal head. Strong aroma of caramel, chocolate black current and - nuts. Taste is sweet with a good bitterness. Very good!\n\n---Rated via Beer Buddy for iPhone", "Pours a clear, dark amber with a medium, off white head. The aroma is a heavy balance of nuts, earthy malts, and floral hops with some weaker bread and vanilla. The taste is a little sweet and dry and unfortunately, kind of weak. Having both toasted and earthy malts, its big on nuts and toffee. Minor licorice and raisin are found as well. Easy toffee aftertaste lingers. Medium bodied, thin in texture, adn average in carbonation. Not bad really. Just not all that special.", "Bomber into a pint. Pours a clear dark brown, with a medium khaki head that lasts, leaving good lacing. Nose is dark malt and nuts. Taste follows, with a long finish and medium mouth feel. Moderately bitter, not at all astringent. Classic British brown. Good stuff, easy drinking.", "Bottle - average size foamy head, pretty dark amber/brown color, sweet malty aroma and flavor with some mild nut flavors, mild hop balance, pretty easy drinking and tasty overall", "Вкусный коричневый эль. Хороший вкус и легкий аромат, а так же горькое послевкусие.", "Shared bottle. Clear light brown colour, durable tan head. Aroma of bread, caramel, nuts. Taste is light to medium sweet, light bitter, caramely, bready, nutty. Medium- body, rather thin, with average carbonation. Tasty, nutty brown ale.", "Ravfarget klar med fingerhøyt beige skum. Luktet honning og nøtter. Lett. Noe søtlig noe brent karamell og nøtter. Lite bitterhet. Kort.", "Botella de 99Cervezas. \r\nVierte en un bonito color ámbar oscuro, transparente y bastante brillante para este color. Buena formación de espuma cremosa tintada en vainilla y con burbuja pequeña. Persistencia y adherencia media-baja. Buena carbonatación. \r\nIntensidad media-baja en nariz. Quizá la primera nota es el plátano muy maduro, enmarcando un aroma claramente dulce. Las notas florales y herbales son muy tenues. También algo de toffee y tras atemperarse, notas de Jerez (requiere dejarla respirar un rato y que coja temperatura). Complejidad media. \r\nDe entre los sabores principales destaca el dulce, aunque de una manera mucho más fresca de lo que daban a entender las notas en nariz. El amargo aparece a continuación de manera suave pero clara y expresiva, estableciendo un fantástico equilibrio con el dulce. También hay algunas notas saladas.\r\nEl postgusto muestra notas ajerezadas muy interesantes que resultan francamente agradables. También toques de pasas. A pesar del dulce inicial, no resulta para nada empalagosa, sino que casi parece intentar conseguir un final seco (casi). La persistencia es media y suave pero no se echa de menos una persistencia mayor. Sobresaliente en sabor. \r\nLigera en boca y algo efervescente. Extremadamente refrescante a pesar de que las notas dulces en nariz parecían indicar otra cosa. \r\nUna cerveza que destaca principalmente en boca, aunque se queda un pelín corta en nariz. En cualquier caso, siempre vale la pena tomársela, ya que resulta especialmente agradable y tiene un enorme bebestibilidad. Totalmente recomendable.", "Birra dal colore marrone. Schiuma color nocciola, cremosa e poco persistente. \nAll’olfatto sentori di caramello, toffe, malto tostato e nocciola. Al palato mediamente corposa con note che si sono già manifestate all’olfatto, caramello, nocciola e toffe. Nel finale lievemente amara. Una grande birra da bere soprattutto sui dolci.", "Nice rich smells of brown bread. Pours a clear mahogany brown with a big buff head that dissipates to a steady mix of tiny and medium sized bubbles. Lots of lacing. Nice round tastes of pumpernickel and pecans with a sweet short finish. Medium carbonation. These guys are in the business of defining british beer categories - very nice brown.", "Deep, almost opaque brown pour with beige, dense, persistent foam. Toasty malts in the nose with a little coarseness. Medium body, smooth texture, light fizz and a clean finish. The taste is rich caramel malt with a little grassy touch. A touch of chocolate as it warms up. Rich on the tongue and a good cold weather beer. A benchmark example", "Bottle. Brown in colour, with reddish tinge. Malty; very nutty, caramel, toasty malts, hint of chocolate. Mild/moderate hops. Mildly bitter-sweet, rich, smooth, nutty malty. Relatively dry. Tasty. Easy drinking. Nice beer! (2009-02)", "Bottle as gift from my son. Pour was brown/reddish, foamy off white head. Aroma was sweet malt, nutty, fig. Taste was sweet, walnuts, toasted malts.", "Bottle. Pours brown with light tan head. Biscuit malt aroma. Biscuit malt with caramel and nut notes. Excellent. \n\n---Rated via Beer Buddy for iPhone", "Butelka 550ml.Barwa brązowa z refleksami, piana biała, mocna osiadająca na szkle. Aromat orzechowy z karmelem. Smak to słodkie słody karmelowe z orzechami, niska goryczka. Piwo pijalne choć mogłoby być pełniejsze w smaku.", "Bottle at home. Clear copper brown, cappuccino head. Ceramel, brown sugar, liquor and nuts. Cocoa powder, truffles and walnut almond aftertaste.", "La Nut Brow Ale es una cerveza de un color marrón limpísimo. Su espuma es de color beis, muy sedosa pero a la vez escasa.\r\n\r\nCon su aroma me ocurre algo curioso. Siempre me ha parecido al olerla una cerveza más alcohólica de lo que realmente es (un discreto 5%). Además de ese aroma “licoroso”, se perciben claramente frutos secos y algo de canela.\r\n\r\nEn boca aparece un malteado deliciosamente suave. Avellanas, almendras, pasas y caramelo. En resumen, un conjunto dulce que da paso en su final a un amargo muy tenue y elegante. El conjunto nos llena perfectamente de sabor y de postre un final seco pero muy rico.\r\n\r\nUna cerveza que jamás pasará de moda.", "Taki naprawdę porządny brown ale. Barwa brązowa, aczkolwiek prześwitująca. Piana biała, kremowa, gęsta, bardzo wysoka i trwała. W aromacie orzechy włoskie, nuta toffi, słody karmelowe i nuta czekolady. W smaku słodycz, kremowość, słody karmelowe, a także orzechy, które rozciągały się również na ledwie zauważalną goryczkę. W aromacie na dodatek bardzo delikatne estry. Nagazowanie średnie z małym plusem. Lekka wodnistość. Ale ogólnie bez większych wad, a z masą zalet. Smaczne.", "Bruno scuro con riflessi rossastri, la schiuma è nocciola, cremosa e abbondante, poco persistente. \n\nNaso molto invitante che regala note di toffee, caramello, biscotto, noci e frutta secca. In sottofondo una lieve nota terrosa molto piacevole. In bocca si rivivono le stesse emozioni. E’ una birra morbidissima, che ha poche bollicine e un corpo medio. Nocciole, noci, mandorle avvolgono il palato accarezzandolo in maniera intrigante. Il finale si spinge verso territori amarognoli e terrosi, che bilanciano benissimo la bevuta.", "12 oz single bottle from Molly’s Spirits. Nutty, rich, malty, smooth and creamy. Notes of caramel, light chocolate malt, light earthy yeast and hints of roasted grain. Solid brown overall.", "Bouteille achetée chez Drink Of The World - De couleur brune presque ruby avec une mousse beige qui redescend assez vite - Au nez des arômes de noix, de noisette, de fruit rouge, légère torréfaction, une point de chocolat,caramel, biscuit, sur la fin, superbe - En bouche on retrouve ce côté noisette, noix, un pointe de café fait son apparition, cacao, chocolat, biscuits mais plus de fruits rouge - Corp léger/moyen, amertume légère/moyenne, carbonation pétillante, sèche , final malté et noisette - Une bière de coeur une de mes première bière special à l’époque et je la trouve toujour aussi complexe et bien réalisée un défaut trop de carbonation pour le style et la provenance", "Pours a translucent deep brown red with a beige head that leaves lacing. Nose is slight roasted malt. Taste is dark chocolate with toffee hints. Body is medium light. 12 oz bottle SC291P on the neck", "Tasted by Cannery Row Beer Club. We found this one slightly above average for the genre. Cheers!\n\n---Rated via Beer Buddy for iPhone", "500ml bottle, Bispham hotel, Blackpool. Pours chestnut brown. Taste is of chocolate, caramel, weak malt. I found this to be too fizzy, thin and neutral, and whilst drinkable, i was left feeling abit uninspired. Maybe it was an old bottle, and if it had been on tap i would have had a second.", "Pours a glowing brown color with an eggshell colored, smooth head.\r\n\r\nTastes of bready, earthy malts with a nice, subtle sweetness to it, revealing a toasty quality and bakers chocolate.\r\n\r\nHas a smooth medium carbonation with a soft, refreshing finish, showcasing a light, pleasantly malt defined beer.\r\n\r\nTastes of bread, church candles and slightly chocolaty malts, which receive a good earth coating. Very rustic, yet smooth and a litte creamy on the tongue, this also features a nice toasty quality. Finishes clean and soft with a short, sweet malt peak among a watery quality.\r\n\r\nPretty light, but well composed with a nice, bready malt profile.", "Flasche 0,355l: Mahagoni, klar, mittlerer feinporiger beiger Schaum; sehr süße Nase, Malzzucker, dunkle Fruchtigkeit, Backpflaumen, schwarze Johannesbeermarmelade, geröstetes Getreide, dunkle Schokolade; würziger Körper, kräftige Röstaromen, Getreide, Röstmalz, angenehme Bitterkeit, cremig, deutliche Kohlensäure, trockener werdend, leichte Säure, ungeröstete Kaffeebohnen; angenehmer langer trockener Nachgang", "Poured from bottle...nice creamy brown pour with huge head...light lacing...nose is all roasted chestnuts some hops and malt....flavor better than the smell would suggest.", "I bought this bottle at drink of the world in Zürich. I drank it tonight. This beer is not bad, average. The taste is close to a German Bock. The body is brown and the foam is thin, average carbonation. The taste is a little smocked, dry malt, plum and discreet note of nuts at the final, a bit watery, some hop.", "- rot-braune Farbe mit leichter, schnell zerfallender Schaumbildung\r\n- leichte Aromen nach Toffee, Nuss und etwas Dörrobst\r\n- passende Carbonisierung\r\n- der Antrunk ist unaufgeregt mild \r\n- der Körper bleibt schlank, ohne ins wässrige abzugleiten\r\n- alle Aromen verbinden sich zu einem runden, gut trinkbaren Ale\r\n- im Abgang kommen die Bitterelemente etwas stärker zur Geltung, was dann\r\n aber auch erstmals zu einer leichten Wässrigkeit führt\r\nFazit: Gut trinkbares Ale, ohne Höhen und Tiefen", "From estucerveza. In Ikea’s pint glass. After dinner. Raisins, nutty, with a good amount of bitter hops. Amazing in aroma, pretty drinkable and good taste", "Great color mahogany brown slight head that dissapates quickly. Medium body but great nutty dried fruit raisiny with a bit of hop and opens up more as it warms a bit\n\n---Rated via Beer Buddy for iPhone", "Mørkebrun med skum der hurtigt forsvinder. Hasselnødder og brændte mandler, men uden at være sødlig.", "Pours a very slightly reddish brown from a bottle, off-white head leaves some lacing. Aroma is a bready toffee. Flavor is like bread dough with some caramel, rather watery, a little metallic although that’s fading as I drink it. Good beer.", "Pours an amber-reddish colour, with a big head. Great retention, creamy big lace. Aroma ff nuts, malts, notes of chocolate and caramel. Madiumto light body body, thin texture. Garbonation is great. Taste of nuts, caramel, liquor, notes of chocolate. Good, but not great.", "Nutty and malty with the flavors coming from the malts. Has the classic slightly rusty sam smiths taste (which is surprisingly pleasant it tastes of bronze and tradition)", "550ml bottle from Beers of Europe. Pours a clear brown with foamy beige head. Nut dominated aroma, some caramel and malt. Malty flavour, with nutty, caramel and fruity notes.", "Aromas: nutty, toffee and caramel. Mouth: malt, caramel and hoppy bitter. Foam: light brown, medium. Overall: 3,25/5.", "From 2011 notes:\r\n\r\nWhen I first tried this beer about 20 years ago, I thought it was probably the best beer I had ever had. (I was probably right). Having one for the first time since joining BA, I had high hopes but some anticipation that it could be disappointing - I’ve tried a lot of beers over the past 2 decades. Well, it was not at all disappointing. Perhaps not the very best brown ale I’ve ever had, but excellent, upholding its reputation as a gold standard of English browns. \r\n\r\nPlenty of caramel malt in the aroma. Tastes only slight nutty at first, but a more notable nuttiness in the excellent malty finish. Perfect balance of flavors. Slightly fruity.\r\n\r\nMouthfeel - a tad thin; otherwise excellent, with perfect carbonation. \r\n\r\nO - outstanding example of style. Refined and superbly crafted.", "550 ml bottle. Pours clear copper with a light brown head. The aroma is moderatly malty - bread and roasted malt together with some grassy hoppiness and also a little yeasty. Pleasant creamy mouthfeel with soft to lively carbonation. The flavor starts light sweet with some fruity acidity and a bitterness that becomes more pronounced towards the finish. Roasted malt with some caramel and nuts and mild coffee in the aftertaste - all aromas a little hidden. Overall not too exciting but a nice brew.", "Gyönyörű mahagóni szín, közepes, nem túl tartós hab. Illata édeskés, aszalt gyümölcsös, diós. Íze édeskés, karamelles, pici kakaóval és aszalt gyümölcsökkel. Icipici keserű, alacsony karbonáció, közepes test, jó összhang.", "Bottle - hazy brown with a small head. Notes of toffee, nuts and caramel. Light malty body.", "Klares rotbraun mit durchschnittlicher Schaumkrone. Malzig, Röstaromen, etwas Karamell, nussig, trocken, leicht bitter.", "330ml bottle at home. A classic for every occasion. Nice brown colour with little foam with a bready and very biscuity aroma. Some caramel and maybe some chocolate. Quite thick mouthfeel. Flavour is quite complex, very biscuity and lots of caramel, chocolate and a hint of herbal hops. Great classic.", "500ml bottle. Brown amber colour, white foam head leaving lots of lacing and aroma of malt, nutty, caramel. Taste is bready malt, toffee, caramel, dried fruits, raisins, and some earthy bitterness. Medium bodied, soft to medium carbonation, dry nutty bitter finish. Quite drinkable.", "Dark red Amber with plenty of carbonation and a thin head with some lacing when poured into a pint glass from a bottle. Very nutty taste comma slightly bitter, and a lingering bitter aftertaste. Some notes of coffee.", "Bella brown ale, tonaca di frate con poca schiuma, aroma fantastico di nocciola, invece al palato spicca meno.", "Aroma - nice malt roast, caramel, and nut. \r\nAppearance - a clean brown in color, and a 1\" off-white head. \r\nTaste - roasty taste with hints of nuts and caramel. \r\nPalate - medium body, creamy texture, average carbonation, and roasty nut finish.", "Aromas a caramelo con toques a Malta tostada\nBuen aspecto y carbónatacion correcta con espuma hasta el final \nEn boca tostado y caramelo\n\n---Rated via Beer Buddy for iPhone", "Good Brown Ale as a nice change to zingy Golden Ales or bitter Bitters, saucy. Very good with crisps and nuts, better at home with pie and chips. prefer it to Newcastle Brown ale, not as heavy. Not necessarily a winter only drink but not a light summer night session brew.", "Nut Brown Ale is relatively dry with a rich amber-brown colour and nutty flavour derived exclusively from small amounts of dark malt.", "Thoroughly enjoy this beer Sam smith has quite a few great beers and I always recommend this one and the oatmeal stout! ---Rated via Beer Buddy for iPhone", "Vierte marrón oscuro con media corona de espuma beige, presentando buena retención, aromas a caramelo, frutos secos, maltas tostadas y licor; en boca entrada media, maltosa con ligero amargor que se mantiene constante a lo largo del trago, cuerpo medio-ligero y correcto carbónico, notas terrosas y caramelo, correcta y bien balanceada cerveza que se bebe fácilmente.", "355ml Flasche. Braunes Bier, wenig Schaum. Nussig und malziges Aroma. Vollmundiger Geschmack. Röstmalz und Nüsse. Bitteres Finish.", "Great’’6gkgkgkgkckcoglgkgåjfphdoydoydoydotdotdotdotdotdotdotdotdotsotdoydoydoydoydoyd", "C- Pours a clear brown color with white head. Not a great flavor, almost sour", "clear brown liquid with frothy tan head. aroma of roasted malts. Taste is light smoky, roasted malts, light sweet, medium bitter, light sour. light body, thin feel, average carbonation,", "Aroma:\n\n\nMalts, caramel, bread, nuts, roasted malts and hops.\n\n\n\n\nAppearance:\n\n\nClear/hazy ruby/brown beer with a small off-white head.\n\n\n\n\nTaste/Palate:\n\n\nStarts medium sweet with malts and caramel; ends slightly bitter and dry with bread, nuts, roasted malts and hops.", "butelka, na szybko: niczym specjalnym nie zainteresowalo - glownie karmelowo-chlebowe, gdzies w tle faktycznie orzechy, praktycznie bez goryczki. wodniste kapke, ale lekka lepkosc ratuje w tym temacie. niezobowiazujace\n\nOcena potraktowana skryptem do przeliczania ocen (uzgodnienie UT/RB).", "Bottle 50cl. Poured into a shaker. Clear deep amber brown, tall thick frothy tan head, mostly diminishing, good lacing; aroma roasted malts, cbitterness towards the end, aramel, dried dark fruits, molasses, nutty notes; taste light heavy sweet and light bitter, malty, butterscotch, nutty notes, with average to long duration, sweetbitter finish with gradually more bitterness developing; very nice traditional ale.", "Dark brown with a large white head. Aroma of roasted malts and caramel. Taste adds, molasses and some booze in the end, very nutty. Well balanced, creamy and pleasant. Very nice ale.", "Espectacular, una cerveza compleja, muy equilibrada, con muchísimos matices, la verdad un gran descubrimiento, 100 por 100 recomendable, de lo mejorcito que he probado últimamente.", "Large creamy offwhite head. Excellent lacing. Mostly diminishing. Clear thick dark orange-brown body. Aroma: moderate toasted malt, light coffee, milk chocolate. Initial flavor: moderate sweet (malt and chocolate). Final flavor: Moderate sweet light bitter; long duration. Palate: light medium body, lively carbonation, oily texture, metallic finish. Tasty, even 2 months after expiry date. Malty character, fits right into the style. 100s", "Bottle from Bains Wines, Netherton. Brown beer with large head. Aroma is nutty and malts. Taste is malts, some caramel, nutty and a little hop bitterness. Good.", "Bottle into pint glass. Pours a slightly hazy brown colour with tan head. Aroma is nutty with some stone fruit. Taste is a little nutty with some chocolate notes.", "Bottle. Murky, dirty brown with a cream head and medium level of lacing. Aromas of nuts, caramel and sugar. Nutty, caramel favours with underlying sweetness. \n\n---Rated via Beer Buddy for iPhone", "From a bottle. Pours brown (surprise) with a Vegemite and hazelnut aroma, minimal head, sweet caramel flavours with a yeastie finish.", "Dark brown/cider color; Medium slightly creamy body; Aroma malt, nuts, & some caramel; Flavor of roasted malt, caramel, nuts, and some chocolate; Good brown ale.", "Bottle. Clear amber body with a thin off-white head. Steady carbonation. Faint lacing. Aroma of brown sugar, brown bread and dried leaves. Flavour of tea, salted caramel, nuts and a hint of soy sauce. Medium body with a slick mouthfeel. Light fizz. Impressive balance and complexity. I’d love to try this on cask.", "Clear brown, nice tan head. Malty, nutty aroma. Not a lot going on flavor wise, mildly bitter finish. Texture was thin and watery. Disappointing beer, but then again, I’ve never had a brown/nut brown ale that was worked for me.", "The aroma is close to perfect for this English style Brown ale. Very earthy, delicate and roasty nose. The appearance is a clear btown in color. The taste is exactly what I think of in a English beer and a Nut Brown ale. Very, roasty taste with hints of nuts and caramel. It’s got a moderate amount of thickness in body. Overall, this is a world class Brown ale from a world class brewery. My go to English Tavern beer and brown ale. Would highly recommend to anyone who likes the malty Brown ales", "Bottle. Pours a brown clear beer with a nice amount of off white head on top. Aroma is cookie, slight roasty, big hint of caramel and some earthy notes. Flavor is moderately sweet, loads of roast and toasty notes, A bit thin in the mouthfeel, yet the flavor is quite full. Aftertaste is long and mildly sweet, carbonation is really soft. Quite nice.", "De couleur cuivre avec eaucoup everfesssance avec col blanc .on n’a des notes de malt caraméliser avec note de noisette . En bouche c est mélangé des deux mais là noisettes est très présente en bouche le Caramel vient complémenter le tout . C’est une Biere correcte", "Too dark to tell appearance but has Thin head. Aroma is pungent of dried fruits and a good Côte de Rhone. Light mouthfeel with moderate carbonation. Taste is on the high notes of the malt with a clean dry finish. \n\n---Rated via Beer Buddy for iPhone", "Bottle from Whole Foods Market in Redwood City, CA. Aroma is raisins, plums, some spicy / yeasty bits. Taste is prune juice, dark fruits...a bit tinny. Was expecting something more woody. Sorry old horse.", "550ml bottle into a glass. Great aroma of toffee and raisins but didn’t get the nuts that was promised. Could easily be me. Dark reddish hue with an off white heading towards tan. Flavour was lighter than expected and middle of the road. Minimal sweetness and far less malty or nutty than expected. Plate was a bit weak and short. Expected better.", "Classic English brown ale so it’s about time to taste it... Thick, moussy, pale greyish beige head retaining quite well, over a clear deep reddish bronze coloured beer with burgundy hue, translucent. Aroma of caramel candy and butterscotch, damp cloth, wet paper, candied cherry, honey, hazelnut paste, dried tree leaves, ’haemoglobin’ iron, sugared English tea, lots of fig. Clean, sweetish onset of fig and dried banana countered with a dull elderberry sourishness, soft carbo, very smooth and slick body, very caramelly maltiness with nutty accents, a bit metallic, going from sweet to subtly bittersweet in the end, very juicy but with the bitterness further enhanced by a dash of earthy, leafy hops, lingering in the back of the mouth for a while. CAMRA has tried to distinguish between northern brown ale and southern brown ale and apparently this one belongs to the former category, like the famous Newcastle Brown; yet it seems to surpass its renowned congener in subtlety and balance.  I would recommend this to anyone who wants to get acquainted with English brown ale: this is a classic in many senses of the word.  Thanks to Samuel Smith for keeping alive waning English beer styles - did they not reinvent porter and imperial stout as well?", "(Bottle) Pours deep brown with good dense off-white head. Nice aroma - toffee, hops, hints of nuts. Great carbonation gives smooth creamy palate. Nice taste too - foretaste is mainly toffee or dark treacle with some grassy hoppy balance; in the mid plate nutty notes and some dark roast bitter notes start to develop; these dark roast bitter notes are joined by some hop bitterness for good finish. Excellent.", "Bottle, 550 ml, Trader Joe’s, Fort Lauderdale. Decent, malty, aroma of nuts, maybe coffee. Small bitter finish.", "Clear red/brown body with a pale beige head.\n\r\nFruity aroma with some caramel malt and hops.\n\r\nModerately dry and bitter. Malty and hoppy flavours dominate. The bitterness increases in the finish.\n\r\nMedium body with average carbonation.\n\r\n\n\r\nGood brown ale with solid bitterness.", "Poured from a bottle. A translucent deep brown with a medium tan head that disappears quickly to a thin ring. Aroma of sweet malts. Light carbonation, smooth, full mouth feel. Light, sweet malt taste. Not watered down but not very bold flavors. Refreshing - not bad but not that great.", "Bottle from Cotteridge Wines; clear chestnut brown pour with a frothy light tan head, aroma has nutty action and toffee, taste has sweet toffee, malt loaf, nut brittle toffee, autumn leaves, traditional brown not like the hopped up juans, I’ve had recently trying to be BIPAs.", "Rated from old notes. Medium bodied, creamy, with nutty and sweet caramel undertones. Tart, fruity slightly winey aftertaste lingers on tip of the tongue. Smooth. Remains consistent for the duration, but also fails to develop further. Pleasant.", "Dark Amber color, soft, pillowy off-white head. Lots of lacing. A beautiful aroma of carrot cake muffins, fruitcake, personality bursting out of the seams! On the palate, a good dose of caramel and a hint of toffee on display, a bit of bran muffin flavor. Superior thick mouthfeel and medium to full body with a lingering, memorable finish. A true work of art in this beer category.", "Aroma of malt, nuts and light caramel. Taste caramel, malt and ofcourse nuts. Some bitterness in the aftertaste. An ok beer, but not super...", "Currently my Favorite Beer of All-time, that is good to the last drop:) Glad I can find it at my local Wegmans:)", "The cleanest amber color with a persistent tan head. Aroma of red fruit, caramel, floral hops, a little spiciness, subtle chocolate and nut hints. Watery, noticeable cleanness, medium bitterness with a spicy and long lasting finish. A real good one.", "Bottle at work. Pours clear brown with almost no head. Aroma of malts, light nuts, caramel, light roast. Weak palate, the taste is rather sweet, caramel malts. Light bitter. Decent", "Marrom avermelhada, espuma bege de aspecto cremoso, boa formação e persistência. Aroma de frutas vermelho escuras, prevalescendo uvas passas, nozes. Paladar volta com a sensação de uva passa, dulçor leve/médio, baixo amargor torrado. Corpo leve um pouco abaixo do esperado, média carbonatação. Aftertaste mostra mais o malte e o torrado. Final levemente seco. Com mais tempo no copo, perde um pouco do aroma adocicado, ficando mais amarga e torrada.", "Brown colour, medium beige head. Aroma of caramel, malt, nuts, toffee, herbs, hops. Dry sweet taste, bitter hoppy finish and aftertaste. Thin to medium body and good carbonation. Nice brown ale, very drinkable.", "Nut brown colour, beige head. Aroma of caramel, lemon, candy sugar, toffee, hazelnuts. Taste is light sweet. Very well balanced, with clean flavours. Light body, slick texture, soft to average carbonation.", "I poured it from the bottle into a pint glass. The aroma is nutty, caramel, and toffee. The taste is caramel, dried fruit, toffee, and nutty. It’s smooth with a roasty finish. This is one of the best browns out there.", "Review based on the BJCP2015 guidelines (style 13B). Bottle 35.5 cl - Batch L15092. AROMA: slight dark caramel aroma with a light fruitiness. APPEARANCE: dark ambar color and clear. moderate ivory head with good retention. TASTE: malt flavour dominates with notes of toffee, dark caramel, slight biscuity and dark chocolate. medium-low bitterness with balance towards malt. no hop flavour discernible. finishes medium-dry. PALATE: medium-light body with moderate carbonation. OVERALL: a nice english brown ale with a lot of caramel notes.", "I didn't take any extra notes when I tried this beer for the first time but I'm gonna try it again and update my comments.\n\n---Rated via Beer Buddy for iPhone", "Shared 550 ml. bottle. Brown color, tan head. Aroma of roasted malt, caramel. Tastes of roasted malt, caramel, some nuttiness. Smooth. Simple but nice.", "Aroma: caramel, bread aroma with a touch of grass; Appearance: reddish brown, clear, with pillowy head; Taste: sweet with bitter notes; a little twang of something; Palate: fairly full body with average carbonation with some lacing; long finish with unpleasant aftertaste; Overall: disappointing; could be partly the style and partly the execution; would not buy again.", "Nutty, malty, not bready. Lightlly hopped, earthy. Pours a dark brown, softly carbonated. Fairly thin. A refreshing fall dinner beer.", "Everything that you could want in a brown. This type of beer is quickly becoming one of my favorites, and with the very fair price of these, it could very well become one of my \"go to\" beers.", "Dark amber colour with a small layer of head. Tastes of nuts, earthy hops, toffee, spruce and hints of caramel. Medium body, somewhat aggressive carbonation and a nutty finish. A fine nutty ale", "Poured from a bottle. Strong hazelnut and caramel aroma. Ruby & brown color with frothy white head that sticks with nice lacing. Toffee and nutty notes that linger to a hoppy profile of herb and earthy with a good bite. Crisp and snappy mouth feel as the malt is kinda thin. One of my favorite nutty browns that I wish we would appreciate more from across the pound.", "L:\r\n-pours a clear ruby-brown with copper tinges and a medium to big,foamy,beige head\r\n-medium carbonation visible\r\nS:\r\n-caramel,toffee,strawberry,chocolate,cherries\r\nT:\r\n-caramel,toffee,vanilla,chocolate,raspberry,syrupy,cinnamon,toasty finish\r\nF:\r\n-medium to high carbonation (overcarbonated)\r\n-light to medium body\r\nO:\r\nGodly Brown ale", "Clear brown body with a Lacey white head. Aroma of caramel and some dried dark fruits. Taste is sweet with caramel and has a nutty finish.\n\n---Rated via Beer Buddy for iPhone", "Tolle Farbe, schönes Braun. Cremefarbener Schaum.\r\nHolzig, nussige Geschmackspalette mit einem trockenem und leicht säuerlichem Abgang. Nur ganz leichte Hopfennoten und dezente Bitterkeit. Leichtes, süffiges ale das zwar nicht so viel hergibt wie die Farbe verspricht aber im Grossen und Ganzen alles bietet was man von einem Brown Ale erwartet. Gutes Bier für zwischendurch.", "Farbe braun bis dunkelrot. Geruch komplex und leicht säuerlich. Leichte Nussnoten (Einbildung?) Im Geschmack mundvoll, aber nicht süß, eher säuerlich. Im Abgang nur leichte Hopfennoten.", "It’s been a while since I last enjoyed a brown ale, then the joy is great at again having such a glass. This brown ale smells of caramel and some dried fruit. Taste-wise, it has a syrup sweetness that quickly followed up by hazel- and walnuts. Dried fruits such as raisins and figs carries it into a pleasant hoppy bitterness with dry aftertaste. Caramel malt lies in the background all the time and gives good fill. A delicate and brewed brown ale.", "Botle from 100 piv. Dark Amber color with thick off-white head. Caramel, nuts, light coffee in aroma. Sweet caramel malt with coffee, light hoppy bitterness in finish.", "355ml bottle (Pudel, Tallinn)\n\r\nNice dry nutty aroma, some bitter. Mellow body. Nice brown, tight persistent head. Just sweetish bready malts. Finish brief. Nothing big or clever just a really tasty drinkable nutty brown ale. Does what it says on the tin.", "355ml bottle. Clear hazelnut brown color. Medium size, beige head, stays. Sweet, caramel in aroma. So simple aroma that there is almost no aroma at all. Twiggy, very mild hops grassy hops, slightly metallic and limestone in taste. It might be some aids left in me, but everything is so mild and hidden.", "0,355L bottle. Pours copper with beige head. The head stays. Aroma is malt, grains, caramel. Flavor is sweet and bitter, caramel, fruits, nutty. Finish is dry bitter. Overall: ok.", "Amber brown\r\nSmells of prunes and nuts and, a bit of green weedy hops, a tiny bit of soy sauce\r\nDry, mild bitterness and sourness. Caramel, prunes, and a bit of green weedy hop.\r\n\r\nVery good. Much easier to drink then I knew a brown ale could be.", "0,355l bottle @ Underground, Santa Fe. Pours clear chestnut with a low head. Aroma is malts with loads of nuts. Flavor is nutty malts with some hops. Good.", "From 0,33l bottle, BBD: JAN 16 Pours cloudy dark brown to red liquid, medium frothy white to tan head, Aroma: malty, biscuit, caramel, nuts, flowers, peach, Taste: light to medium sweet, light to medium bitter, light to medium sour, malty, caramel, biscuit, nuts, light fruity, Palate: medium body, creamy texture, average carbonation, long biscuit nutty finish, Overall: fine brown ale, bit too much original style - boring, but nice representative of the style. Enjoyed.", "Clear reddish-brown beer with a bubbly head which quickly dissipates (this may be because I had to cart it home in my backpack.) Nutty malt scent with a flavour to match, as well as having a bit of fruit in there and a rich, earthy chocolate taste in the aftertaste. A pity it went a bit flat but very nice all the same.", "Brown Ale que representa bem o tradicionalismo do estilo. Equilibrada, saborosa e com excelente drinkability.", "Pours thin from pint bottle with large but very weak head, almost foamy like an ALB. Reddish brown to amber color. I got a very distinct aftertaste from this and after pouring it into my glass warm I finally picked up on the scent, it is exactly like a Tootsie Pop right when you are reaching the inside. Which brings me to the taste. Very fruity but very easy to drink, wan’t getting much nuttiness. Fruity but not zesty and sharp like an IPA. Not a bad beer but it’s mediocre all around and just as watery without as much biting carbonation so easier to drink even than an ALB (American Light Beer).", "355 ml. bottle. Pours brownish red with a decent beige head. Aroma of fruit, caramel, and malt. Taste is dark fruit, malt, grain, caramel, and nuts. Decent enough.", "Clear brown pour with short lived white head. Good balance between sweet and bitter. Lacked complexity, bit boring.", "Bottle. Color clear brown with medium head. Aroma malt, light caramel. Taste caramel, malt, some bitterness, nuts.", "Bottle. In aroma caramel, nuts, malty. In taste medium sweet with caramel, hazelnuts, toffee. Medium to low bitterness. Decent beer.", "drink cool 10-14°C.\r\nEye: pours a cola brown color with a rather quickly dissipating white to beige head and medium to low carbonation.\r\nNose: sweets, cassis, berries\r\nMouth: wild berries, hops and nutty malts\r\nPalate: milky, oat meal, somehow dusty, and nuts as well as nut shells and leaves\r\nOverall: nice beer, not as chewy as I expected it to be.", "355ml embossed gold foiled bottle. Amber/brown pour, light tan head. Aroma is dark dried fruits, raisiny, lightly vinous. Flavor is dry and fruity, some nutttiness, mild bitterness. Pretty ho hum i think.", "550ml bottle from the Golden Baal, Scarborough. Pours clear brown, thin beige head. Aromas of toffee, nuts, burnt sugar. Taste is more burnt sugar. Not my bag, grandma.", "Nut-browncolour with a fine off white head. Aromas of toasted malts, some caramel, hazelnuts, walnuts and somewhat dried fruit develop. Light carbonation, light slick and medium-full bodied. Nutty sweetness offers also hints for a light floralness. Medium finish.", "Aroma caramelo, amadeirado, boa espumação, marrom escura.\nEncorpada mas equilibrada, sabor amadeirado com amargor leve.", "550 ml bottle, pours dark brown with a small bubbly head. Aroma is caramel malt, toffee, dried fruit and nut. Medium to full bodied. Creamy texture with soft carbonation.", "Strong aroma and taste of nuts, caramel and roasted malts. Strong brown appearance with small tan foam head. Has some sweetness with medium body. not much carbonation or lacing", "Caoba, brillante. Deja pasar la luz ligeramente. Bonita espuma ligeramente manchada y bastante consistente. Aroma tostado, de frutos secos, almendras…Cuerpo ligero, carbonatación media. Y en el sabor, rica malta aderezada de frutos secos… almendra amarga. Porque el final lo es. Otra buena cerveza de la casa, aunque no entre sus mejores..", "Aroma caramel, nuts, toast, roasty, dough, \r\nAppearance brown, clear, tan foam, \r\nTaste medium sweetness, caramel, nuts, toffee,\r\nPalate medium body, average carbonation, soft carbonation, \r\nOverall a really solid beer that I would suggest to a friend", "Poured from a 12 ounce bottle into an english pint glass; thin aroma to go with a thin, tight head; nice, dark cola brown color; almondy nuttiness flavorings; medium body; overall, a pleasant, comfortable brown ale.", "First English beer I had, not a bad brown ale, but no better than cheaper US made brown ales.", "Aroma: Roast, some fruit, fresh nuts\r\nAppearance: Dark red, almost ruby like. head is brown and very nice.\r\nFlavor: Similar to aroma but a bit of roasted malts as well as a bit of wood.\r\nPalate: Some dryness and sweetness with some other background flavors, mix of stuff. Very nice\r\n\r\nA personal inexpensive favorite", "Bottle during CBC weekend -15. Clear brown with beige head. Aroma of chocolate, raisin, roasted malt, nuts, dark sugar and caramel. Taste is light roasty, nutty, biscuit, light chocolate, raisin, spicy and earthy hops.", "Clear brown pour with thin tan foam. Aroma of caramel and biscuit with a slight, not-unpleasant astringency. Flavor is remarkably balanced - sweet caramel malt offset by a semi-dry nutty finish. This is smooth and delicious. A favorite of the style.", "Color is brown with tan head. Aroma of nuts, caramel. Taste is sweety, with lightly bitter finish. Very good beer, but I’m missing something, maybe a bit stronger taste.", "Pours dark amber. Tan head.\r\nAroma is cola nut, coffee, iron.\r\nFizzy, creamy, full body. Nice metallic touch. Not very long bitter finish.", "Bottle. Pours a deep brown colour with a foamy off white head. Aroma of chocolate, raisin, roasted nuts, some brown sugar and caramel. Taste of roasted nuts, chocolate, raisin, caramel and spicy, earthy hop bitterness. Light bodied but quite a watery texture. A dry, bittersweet, nutty, cookie finish. Really nice malty flavours with great British hop bitterness. Shame it’s so thin for a 5 percenter.", "Beige, frothy head. Fairly persistent. Coppery with orange shadows. Fairly clear. Fairly intense and persistent at nose. Dark honey, caramel, toffee, a bit of dark chocolate, nuts. Light body, good carbonation. A bit of acid in the mouth. Sweet preminent with a roasty bitter", "Drunk from 50cl bottle bought at Bierhuis in Ossett. Enjoyable classic brown ale.\n\n---Rated via Beer Buddy for iPhone", "Bottle from Saveur-Biere.com - Color: clear brown beer with no carbonation and small brown head. Smell: chocolate and roasted malt and small vinegar finish. Taste: good chocolate, nuts and roasted malt taste. Small vinegar finish. Watery. Aftertaste: chocolate and nuts.", "Belíssima cor marrom envelhecido. Aromas intensos de malte com notas de caramelo, nozes, toffee, chocolate. E no paladar, corpo médio com os sabores seguindo a linha dos aromas. Excelente!", "had this awhile ago..shared with a friend..light brown with a fluffy white head..aroma of roasted malts,nuts..dry,malty taste..not horrible.", "beautyful appearance of clear reddish-brown colour and 1 inch beige-ish off-white head; aroma of toffee, hints of cocoa, herbal notes, some fruitiness and nuts; taste of caramel, roastedness, herbal notes, slight fruitiness and nuts; masterpiece of brown ales", "550 ml bottle bought at Gorgeous Wine & Cigar in Yuen Long.\r\n\r\n\n\nLooks: Deep amber brownTwo finger head with crumpety light beige foam which lasted for 2 minutes. Beautiful sticky lacing with active small carbonation.\r\n\r\n\n\nAroma: Fragrant and sweet roasted Ale malt, with strong caramel, light almonds, sticky toffee, sugar, rich chocolate, raisins, yeast and light grass.\r\n\r\n\n\nTaste: Mid to light sweet, light-roasted Ale malt, with light roasted nuts, strong metallic, tartness, strong caramel, light toffee, molasses notes, very light red fruits, dry biscuits, yeast, fair lemon, low bitter hops and grass.\r\n\r\n\n\nBody: Light body. Watery and dry palate.\r\n\r\n\n\nMouth Feel: Very malty but in a very watery body, maybe due to wheaty influence as there is potent tartness. Very strong caramel with thin red fruits, toffee, sweetness fairly light. Strong biscuit, dry low hops to round. Quite good so far.\r\n\r\n\n\nHoppiness: Light grass in nose, Lemon and grass in taste. Bitterness is moderate for a lasting, fairly astringent malty finish.\r\n\r\n\n\nAfter taste: Very dry. Malty and fairly bitter to mouth.\r\n\r\n\n\nComents:After Sam Smith’s great Imperial Stout and Oatmeal Stout, I was expecting more or less greatness from this one. Well, only half really: nice head and neat roasty aroma aside, the palate is too watery thin and very dry, the empty Northern Brown Ale taste strikes again. It has the looks but only has half the substance. Decent but not worth buying again.", "Bottle: Chestnut brown pour with moderate translucency, creamy beige head on top. Aroma of caramel malts, nuts, woodchips, & a modest stale twinge somewhere in the back. Almost papery? Flavor is a bit sweeter up front, but the sweetness is quickly blunted by a dry caramel dust & nutty attack that sends you into an abrupt finish. Well attenuated, perhaps a little too well for the style. Nothing lingering in the finish. A hint of mid-palate earthy bitterness offsets the caramel malts. An okay brown ale at best; there are many others I would choose over this.", "nutty aroma, apear brown without any head, taste light bitter, average carbonation medium bodied and a short bitter aftertaste.", "Pours clear medium to deep amber with one fat finger of light tan head diminishing gradually to a thin skim, moderate lacing. (4/5) Nose is toffee, raisins, nutty. (7/10) Taste is moderate sweet, mild bitter, slight tart. (7/10) Medium bodied, moderate carbonation, dry finish. (3/5)\r\n\r\nPleasant, mildly fruity nut brown. A good example of the style. (14/20)", "Bottle. Big off-white head with average retention. Reddish dark amber colour. Prune, toasted malt, toffee, dried fruits (raisin) and caramel aroma. Taste is roasty, dried fruits acidity and caramel tinge. Watery medium creamy mothful, medium carbonation and lasting fruity Aftertaste. Very good.", "550ml bottle at princess Louise, holborn. Pours clear relatively light brown with a large off white head. aroma is nutty, malty, slightly burnt toast, toffee. It is quite a thin, watery beer but great tasting. Roasted malts, nuts and toast. Dry burnt toast finish.", "Thats a well brewed ,greatly balanced brown ale of wich kind im not used to here in quebec. The complex nose of bourbon-ish woodness brings me some sweet subtle pear. A little thin in mouth but the subtle sweetness in mouth with light caramel and roasted malt bitterness carry on a long and great finale. Great.", "Pian niska, nietrwała, szybko gaśnie do kożuszka, barwa brązowo-miedziana, klarowna. W aromacie zioła, karmel, rum - generalnie delikatny zapach, nieintensywny, przypominający angielskie ESB. Po ogrzaniu dochodzą rodzynki i miód. W smaku też mało intensywności, czuć lekką karmelową słodycz, ciemne pieczywo, kwas chlebowy. Kontra w postaci ziołowo-korzennej goryczki również na niskim poziomie. Wysycenie średnie do niskiego, pełnia niska. Obiecanych orzechów nie wyczułem. \r\nAngielski Nut Brown Ale niestety również nie zachwyca. Może jest dość pijalny, ale zdecydowanie zbyt wodnisty, cienki, zapach bardzo nikły, smak jednowymiarowy.", "Old rating. Pours a medium brown with a beige head that dissipates fairly quickly. Nice aromas of hazelnut, pecan, toffee and caramel. Taste is more of the same with a good bit of toasted malts. Mild nutty finish with a slight sour undertone. Great stuff.", "Bewertung importiert von bier index: \r\n 8\t/\t6\t/\t6\t/\t5\t/\t4\t/\t6\t/\t6\t/\t6\t/\t60", "(Flasche) Es hat eine kupferne bis bräunliche Farbe, ist klar filtriert mit einer leicht bräunlichen Schaumkrone. Der Geschmack nussig, karamellig, nasses Holz und dunkle Schokolade. Der Geschmack ist wässrig, sonst wie das Aroma, etwas spelzig und spritzig. Die Bittere kommt zusammen mit Röstaromen nur leicht durch", "Bottle from cellarbrations super store in hami hill. Pours browny amber with a thin tan head. Aroma is fairly mild but you do get quite a bit if caramel and hazelnut up front with perhaps a tinge of grass from the hops. Body is light and carbonation low. It drinks pleasantly but nothing really jumps out. There's some caramel and hazelnut like the aroma suggests with a slight hoppy finish. It becomes slightly sugary as it warms up too. Not too bad but nothing out of the ordinary", "Bottle (355 ml) bought @ Winooski Beverage Warehouse.\r\n\n\n\r\nAppearance: Hazy amber/brown with a small off-white/beige head and little lacing. \r\n\n\n\r\nAroma: Quite nutty with toffee along light fruitiness and roasted notes.\r\n\n\n\r\nTaste: Mild. Hazelnuts, light toffee, hints of fruits and light roasted notes.\r\n\n\n\r\nPalate: Medium body. Moderate to medium carbonation. A bit thin mouthfeel. Mild nutty finish. \r\n\n\n\r\nOverall: Mild, but well balanced and easily drinkable nut brown ale. Tasty despite being mild.", "Botella de @Vivalabirra, Oviedo. casa. 21/02/2015 Color marrón. Transparente, espuma blanca. Carbonatación baja y cuerpo medio. Sabor a caramelo.", "Weak aroma of malt and hazelnut. Pours a reddish brown, short lasting tan head. Pleasant mild taste of nuts and malt. Medium body with a hazelnut finish.", "Poured from a bottle. Medium brown color, medium frothy off white head. Mild hazel nut aroma. Medium body with a slight tart flavor and a medium finish. \n\n---Rated via Beer Buddy for iPhone", "It pours a medium brown color with a small off white head. It has the aroma of nuts, toast, cereal and caramel. It tastes like caramel, toffee, nuts and toast. This is another great beer from this brewery. I’m glad that I bought it and will try to drink more from this brewery in the future.", "550 ml bottle, pours dark brown with a small bubbly head. Aroma is caramel malt, toffee, dark dried fruit and nut. Medium to full bodied. Creamy texture with soft carbonation. Finish is balanced.", "ASPETTO: mogano abbastanza scuro con riflessi rubino, schiuma fine, poco abbondante e poco resistente. AROMA: caramelloso e fruttato, note di marzapane. Molto invitante. GUSTO: vari sapori, tra i quali emergono caramello, marzapane, frutta secca. Emerge anche un acidulo che si sente. A lungo andare è leggermente stucchevole al palato, con un corpo tendente un po’ all’acquoso. Carbonizzazione bassa. CONCLUSIONE: buona birra, veramente piacevole. Peccato per la sua \"acquosità\" e lieve acidità che un po’ stona, altrimenti le avrei dato sicuramente più punti.", "Bottle, 550 ml. Pours dark brown/ruby with a finger of cream coloured head. Moderate lacing. Rather spicy on the nose, with the likes of nutmeg, vanilla and coriander at the forefront of a solid caramel and brown sugar malt base with plenty of almonds. A few dark fruits, milk chocolate and even a bit of navy rum also make appearances. Lots going on here. Wholemeal bread and muscavado sugar dominate the taste, with the spicy and nutty edges sticking around though perhaps less distinctively so. Finish is very dry with further nutty elements, more specifically walnut and hazelnut now. Body is decent medium with oily texture and average carbonation; no complaints here.", "Pours a deep mohagany with fiery highlights, few carbs and topped by a finger or so of tanned foamy/creamy head. Retention is medium-low and I got some spotted lacing. The nose explodes with nutty malts, toffee, caramel, dark honey. The hops come through with a floral element. As for taste, the brew is nutty backed by a sharp burnt toast where the hops express a nice earthy bitterness. Mouthfeel is medium dense and the brew finishes with the previously mentioned bitter hops. Pretty nice product but with its low ABV, look for a fresh bottle and don’t age it. Cheers!", "355ml bottle. Pours hazy reddish amber with one finger of fine textured creamy light beige head. Aroma is sweet malts, caramel, molasses and yes, some nuttiness along some light dark fruits and vegetal notes. Taste is similar with the initial sweetness balanced by a mild final dry bitterness. Nuts and dark fruits again. Light to medium body, medium carbonation.", "One of my personal favorite beers. This beer pours a dark amber/red color with a thick khaki head. There is a lot of streaming bubbles. The aroma is burnt wood, dark fruits, malty, nuttiness, sweet, caramel, brown sugar, and breadiness. The taste is creamy hazelnut, dark roasted malts with very little bitterness at the end. This beer is sweet but not too much and also has a rich hazelnut and brown sugar flavor.", "(Bottle 0.55l , half o bottle) Clear, brown colour with dark red flashes. Off white, medium sized, medium fast falling head. Medium body, low to medium carbonation, watery texture. Aroma: Medium sweet, mostly malty, caramel,toasted malts, bready, slightly hoppy, herbal, earthy aromas. Taste is malty, light sweet with toasted notes, medium strong nuts, soft caramel. Nuts in short to medium long finish. Mineral mouthfeel, toasted aftertaste. Pleasant malty beer, mostly toasted, very easy to drink.", "Not quite sure what the fuss is about this stuff. It’s got a nice nutty/toffee aroma, but it’s also kind of watery, and has way more mineral taste than I’d like. Decent but kinda blah", "Good white head that persists. Moderate carbonation. Sweet toffee aroma. Taste- balanced sweetness, toffee & caramel. low-mod bitter finish. Great beer.", "550 ml bottle. Pours a clear dark golden brown with lasting light tan head and thick lacing. Aroma is mild and sweet: malty, with a hint of roasted nuts. Flavor is same, with malt dominating upfront, and nutty character in the finish. Thin to medium bodied, moderate carbonation, malty sweet finish.", "550 mL bottle poured. Love these uniformed bottles by the way. Pours a copper color with a lasting head. Super sweet candy malt aroma. Flavor is really mild. Slightly nutty, not quite as much as I expected. Dry malt finish. Another pretty good beer from these guys. Enjoyed it.", "Still probably my favorite nut brown. Delivers on both taste and nostalgia. Good flavor.", "Amber with medium low carbonation, light caramel and chocolate aroma and flavor, the nutty character is very subtle. Well attenuated, dry and crispy. A good beer, good brown ale, English style.", "Toll malzig-nussiges Bier. Nicht zu süß, schön trocken-malzig mit tollem nussigen Unterton. Schöne Ale-characteristik, leicht herber, nussig-malziger Nachgeschmack. Lecker!", "Poured from 12 oz bottle into pint glass\r\n\r\nAppearance: pours a thick, sudsy off white head that slowly recedes with moderate lacing. Color is a mostly clear light brown with plenty of streaming carbonation.\r\n\r\nAroma: rich roasted malts, caramel, nuts, earthy hops.\r\n\r\nMouthfeel: medium bodied, frothy, with a wet finish.\r\n\r\nFlavor: terrific combination of roasted malts, sweet caramel, ripe fruit, and a definite nuttiness. There are some tangy and earthy hops in the backbone.\r\n\r\nOverall: a world class beer for sure. Perhaps the standard by which all other English style Nut Brown’s should be judged.", "Poured from bottle. Pours a clear brown with rich, thick soft khaki head. Aroma - malt, toffee, touch of milk chocolate. Taste - definitely some malt, nutty, touch of English hops. Smooth and delicious.", "550ml bottle at Beer Station, Xiamen. Pours mid brown with a white head. Aroma of chocolate, caramel and toffee. Bittersweet creamy finish.", "Clear medium brown pour. Tan head. Nutty malty aroma. Rich nutty malty with slightly bitter finish. Good served out of the fridge for a while with some funky nutty cheese.", "nutty aroma, apear brown without any head, taste light bitter, average carbonation medium bodied and a short bitter aftertaste.", "Bottle. Clear brown color, beige head. Aroma of nutella on toast. Taste is similar.", "50cl bottle. Clear brown colour with a thin tan head. Toffee, caramel, dough, vanilla and nut fruits in the aroma. Average carbonation and medium body. Taste is more on the bitter side with some fruity notes and a dry/sour finish. Overall, a very good beer.", "Bottle. Dark copper with a beige head. Caramel and toffee aromas. Sticky toffee with a molasses and dry finish.", "Gusher. Fawn head, copper to hazel clear body with red tones.\r\nAroma; dough, rye bread, dark wort, dark malts, fruits.\r\nTaste; nutty caramel malts, sweet hazelnut syrup, prunes, fruity mild hops.\r\nNormal body and carbonation. Sweet finish.\r\n[35.5cl brown bottle, abv5%, BB.NOV14]", "Bottle from The Vineyard. Clear brown, thin off white head. Nutty brown malt nose. Lovely flavour, loads of hazelnuts, touches of coffee, some fruity bitterness from the hops. Decent body, fairly high carbonation, complex finish. Really beautiful.", "Drinkable, but not one of my favorite from the wonderful selection from Samuel Smith's wonderful brewery.\n\n---Rated via Beer Buddy for iPhone", "A malty and quite sweet aroma. Smooth and quite rich texture. Full flavoured with a nice balance of sweet versus dry.", "Pours reddish brown with a foamy tan head that lingers long. Nose is a bit like raisins with a hint of caramel. Taste is on the dry side with a touch of bitterness. Not particularly appealing to me. Medium body. Vigorous carbonation. Nice brew.\n\n---Rated via Beer Buddy for iPhone", "Bottle by a friend. Aroma fruity, dark fruits, also caramel . Clear amber to brown colour. Taste is mostly bitter, lightly metallic, otherwise light roasted malt and some mild grassy hoppiness. Thin bodied. Overall average beer.", "Reddy brown appearance. Shines like a ruby. Clean tasting with a hoppy hit. A little fizzy. Strong fruity aroma. \n\n---Rated via Beer Buddy for iPhone", "rra marrone, color mattone, schiuma a frana grossa beige, persistente e compatta. Aroma di caramello, toffee, un po’ di cioccolata. Cioccolata fondente, caramello, tanto tofee, polvere di cacao. Finale amaro e astringente. Carbonatazione media, buona struttura. Consistenza media, ottimo equilibrio. Corpo rotondo. Ottima birra", "Pours a nut brown (?) with a just off white that sticks around. Aroma opens up a little after the head bubbles down: caramel, floral, dough, and some vanilla. Taste is very well balanced but nods a little heavy towards bitter/sour. Palate is fairly clean with some sticky bitter. Good brew. Would drink again. Would not buy again.", "Beautiful amber brown color. Hints of roasted nuts. Full bodied but drinkable. Very good beer and a nice switch from the pale ales and IPA’s I normally drink.", "550ml bottle. Aug 14. Pours a reddy, amber-brown colour with a dense light tan head which lasted well and left some nice lacing. Aroma of sweet butterscotch and nuttiness. Medium sweetness and an underlying medium bitterness. Creamy, smooth body with a surprisingly thin body. Bitter, almost dry finish. Plenty of interesting things going on here but not really my cup of tea (or glass of beer).", "In short: smooth drinkable chocolate beer.\r\nAroma: sweet chocolate, with no roasted sensation, and prunes.\r\nTaste: sweet in the perfect measure.\r\nPalate: a little chocolate biterness, very creamy.", "Bottle 55 cl from Barleywine in Copenhagen. Deep brown red with a very nice beige head. Black currant, raisins, very nice bitterness, nutty, some caramel, . Medium/light body, medium carbonation, bitter finish, dry. Felt a bit thin, could maybe have some more malts to back up the flavours. Otherwise very nice and interesting taste combinations.", "Aroma is black currant, nuts, chocolate, honey and raisins. Taste has a short interlude of pears followed up by a moderately bitter nuttiness and raisins. Clear EKG presence in the bitterness. Body is a bit to thin and carbonated. A really good brown ale with ale the malty nuttiness you’d expect. Could have had fuller body though.", "Brown with an off white head - Malty aroma with some caramel - Good malt body that has sweet caramle malt - Caramel and sweet malt goes into the finish - This was nice", "good ale, no wow factor, but can you really expect a wow from a traditional brown ale? this one is perfect for the style. thin in body, but with a great taste and classic nose.\"", "brown beer with a little light brown head. Some hints of caramel. Tastes bitter and nice: nuts hard to discover till the finish.", "Brown bodied, tan head. Biscuit malts, nutty, lager like fermentation, caramel cookies. Light body, soft malt sweetness, not that expressive. Nice but I expected more, a bit too clean. (33cl bottle from Saveur Bière)", "Great beer. Amazing aroma. Very complex. Thought it tasted a bit like carmel and coffee and nuts.", "Bottle Pours dark brown with an off-white head. Aroma and taste of roasted malt dark chocolate and an underlying slightly earthy dankness Dry palate throughout. Decent brown but I am more of an American brown fan than of the English style browns.", "Poured from a pint bottle, into a giant Paulaner dimple stein at around 50 degrees F.\r\n\r\nA: Poured a clear brown, not unlike watered-down cola, though holding it to sunlight reveals a beautiful bronze red-amber beer. A thick pale head formed with large bubbles, which dissipated somewhat quickly, leaving only a ring around the very edge of the glass. No lacing formed at all in the glass. Plenty of bubbles appear along the bottom of the beer, occasionally shooting upwards as single bubbles rather than streams.\r\n\r\nS: Toasty caramel malt woven through with a heavy hazelnut / chestnut presence, the nose is primarily sweet and warm.\r\n\r\nT: Opening with toasted caramel malt with the usual hints of toffee, the flavor opens nicely into a blend of nuttiness, featuring the aforementioned hazelnuts and chestnut. There is a hop presence that also appears, which stays in the background and takes the edge off the malt sweetness. The finish ends quickly, without much lingering aftereffect.\r\n\r\nM: Sparkling and medium-bodied, this is a lively ale to drink.\r\n\r\nO: A salute to Tadcaster on an all-around enjoyable brown!", "330ml bottle served in a chalice glass.\r\nA: Pours a nice very nice dark amber color forming a creamy and solid medium tan head. Good retention and lots of thin lingering lacings left in the glass. \r\nS: Great fruity nose. Strong notes of roasted and caramel malts. Strong notes of brown sugar, grapes, dry fruits and roasted nuts.Hints of wood and scotch. Flowery hops.\r\nT: Great mouth too. Slightly sweet upfront. Strong notes of roasted and caramel malts, grapes, dry fruits, nuts, brown sugar, oak, scotch and grassy and a bit citrus hops profile. Medium hops bitterness in the end. Good bittersweet balance.\r\nM: Medium body. Average carbonation. Roasted and fruity aftertaste. Strong notes of brown nuts left in the mouth for a long time. \r\nO: Great drinkability. Classic and delicious British Brown Ale.\r\n\r\n[ BA Review @ 4/19/2010 ]", "duft: næsten ingen duft:\r\nsmag af malt karamel. lidt citrus, lidt tør eftersmag", "Bottle: Chestnut brown color, creamy off-white head. Nutty caramelic Aroma, flavor is malty, caramelic, light roasy.", "Bottle @ home. Pours with a clear deep red colour, big frothy off-white head. Aroma is medium malty with notes of bread, very slightly hoppy; additional fruity notes, especially almond; good aroma, but not very strong. Taste is medium sweet, slightly bitter. Medium to heavy body, creamy texture, soft carbonation.", "bottle from Utah liquor store park city. pours light brown with a thin khaki head. leaves some lacing in the glass. not a lot on the nose. has a bit of nuttiness on the tongue but feels muted. clean finish. I’m not feeling this one like the other Samuel smith’s I’ve had.", "Pours a brown color with a slight reddish tint, has a small whiteish head. Malty aroma of nuts, toffee and some slight earthy and leathery tones. Taste is more malts and hops are in the background. Smooth creamy texture, slightly sweet and soft carbonation. Good beer.", "Botella de 35.5 cl en el lúpulo en octubre de 2012. color marrón oscuro y algo especiadas con toques dulces de caramelo y azúcar moreno tostado. Buena.", "Brown color with a creamy beige head. Smell is roasted malt. Taste is roasted, bread crust, and nuts. Light bitter finish. Nice.", "Bottle@home. Two finger foam. Brown clear. Caramalty notes. Sweet dry bitter nutty mint taste. Medium body. Nice.", "Bottle. Clear mahogany liquid with light beige head. Light to medium body, medium carbonation. Bitterish with aroma of roasted sugar. Touch of caramel. Medium sweetness. Watery.", "Dark brown color, big off-white head. Caramel aroma, but really weak and mild again. Finish is slightly bitter. Thin body, average carbonation. I’m not amused with this one. And I don’t get why weighted average is so high.\r\n\n(Dobro Pivo Pri Ščurku 0,55l bottle)", "W aromacie słodowość i orzechy a także lekki chmiel. Połaczenie aromatów przywodzi mi na myśl jakąś oranżadę, taki słodki, nieco cukierkowy. Wyczuwam także lekką żelazistość. Ciemnobursztynowy kolor przechodzący w rubin, piwo przejrzyste, piana obfita, drobnopęcherzykowa z ładnym lacingiem. W smaku słodowe, lekko chmielowe, także lekko orzechowe. Goryczka co najwyżej średnia , lekko słodki posmak także jest. Nasycenie wysokie a także całkiem wysoka pijalność. Nie zaskakuje natomiast ani smakiem, ani aromatem. Warka do 05.2014r.", "Clear brown color, average sized tan head that quickly disappeared. Medium body, soft carbonation. Aroma of caramel and nuts. Sweet with very little bitterness. OK I guess.", "Bottle from greens and part of my adventure of getting through the most rated list. Molasses. Lots of molasses some caramel and a bit of light but flavors. Almond. Finish is a touch sweet and caramel again. Decent but not worth adding to a regular rotation.", "Bottle at 28 Springs. Pours medium brown with two fingers of head. Aroma is slight roast nutty slight maltiness. Flavor follows. Slightly bitter. Nice beer. Medium to light bodied. \n\n---Rated via Beer Buddy for iPhone", "Transfer from BA review on 12-10-12-\r\n Poured from bottle into pint glass\r\n\r\n Appearance- Pours a light brown- mahogany color with a big off white head. The head has a great level of retention hanging around for quite some time with it very slowly fading to give a great level of lacing.\r\n\r\n Smell - The aroma is of a malty and nut aroma. The malty aroma is mostly of a brown bread nature and is complimented well by a caramel and toffee sweetness smell. The nut smell is a nice blend of a walnut and almond aroma which when combined with the sweet smells creates a great nut brown aroma overall.\r\n\r\nTaste – The taste starts out with some sweet caramel and a malty flavor of a brown bread nature. Nutty flavors of a mostly walnut nature become more and more prevalent as the taste advances. An almost cider like flavor also develops more toward the middle of the taste. This results in a sweetening of the beer, which over time then starts to fade as the caramel and toffee loss some ground. A grassy and earthy hop flavor come to the taste at the end, bittering the taste ever so slightly. With the lessening of some of the sweetness that was originally upfront, a bready, walnut, and lightly grassy hop flavor are left to linger on the tongue.\r\n\r\nMouthfeel – The body of the brew is a little on the thinner side with a carbonating level that is on the below average to average side. Not bad, although a little more creaminess and chewiness may have been better for the nut and bready flavors of the brew.\r\n\r\nOverall- A easy drinking nut brown. Not the smoothest of flavor transitions and a little weak in body, but still one to try if you get a chance.", "Roasted caramel malts and gently sweet fruits, but a little too little of both. Ultimately a bit watery and forgettable.", "Tastes fairly similar to Newcastle, but has a stronger, more pronounced flavor and bitterness as well as a nice chocolatey aroma. Still seemed a bit watery on the palate.", "Pours chestnut in colour, clear, with a big pillowy off white head. Nutty, malty, caramel, and hops in the aroma. Medium to full mouthfeel, nutty, almond, hop hints, lots of malt, dark fruit hints, some chocolate in the background, raisin juice, some carbonation. Very nice ale.", "Mørkbrun farve med lys beige skum. Lukt av røstet malt og karamell. Smak av røstet malt og karamell. Fruktig. Melkebaren.", "Fin gyllen kastanjebrun farge. Duft av rosiner, nøtter og syrlige frukter. Tynt lag skum, ring langs kant. Smak av nøtter og noe eikepreget.", "30th July 2014\nBottle in the lovely Princess Louise. Bright clear amber beer, good pale cream colour head. Smooth airy palate with light fine carbonation. Tangy malts with touches of unsweet toffee and molasses. Light dried fruits, some bitterness. Finishes dry and crispy carbonated nibble. Decent malt led beer.", "Aroma of nuts, biscuity malt. Taste is malt forward, followed by a nice nutty finish. Very good!", "Bottle\r\nAroma-caramel, nuts, \r\nAppearance-ruby, clear, tan foam, \r\nTaste-light sweetness, lightly bitter, lightly sour, \r\nPalate-medium body, slick feel, lively, long finish\r\nOverall-very good", "550ml bottle from Mitchell’s Wines, Meadowhead - Superb clear red brown body, thick white head, lacing all the way. Very pretty. The smell was nutty and malty leading into a decent sugary note but not overbearing. The taste was sweet and nutty/malty leading into a decent rich malty aftertaste and dry finish. I expected a bit more from this, but it still puts a lot of others to shame.", "Appearance is dark brown with ruby highlights and a thick off white head. Aroma is all malt, mostly caramel and toast. Taste is very malty, with a combination of caramel, toast, toffee, and bread. Sharp hop bitterness helps balance the high malt character. Mouthfeel is medium with a medium carbonation. Finishes dry on the palate with a crisp bitterness and slightly lingering malt. Overall, seemed very rich in malt as opposed to a lighter, slightly nutty character I was expecting", "Bottle. Pours more red than brown. Nice white head. Malty aroma, maybe a little nutty note, but could be just a suggestion. Taste is also on malty way, some melanoidin is present too. Low carbonatedm", "Bottle. Redbrown beer with a little light brown head. Boring odour with hints of caramel. Tastes equally boring and too bitter. Taste of nuts is hard to discover. Too bitter in the end.", "Dark, rich, deep flavours with a nutty and bitter finish. Very drinkable. One of Sam Smith's better brews.-- rated via 'Find A Beer' for Blackberry 10", "Brown with a tinge of red, little head. Medium body. Aroma of malt and strong tea, accompanied by over-ripe fruit in the taste. Nuttiness comes in mostly at the end. Very good.", "Aromes de nous, crosta de pa i caramel. En boca trobo café, xocolata amarga, pa i nous. Bona per postres dolços.", "Színe az elnevezése alapján nem okoz túlzottan nagy meglepetést, mogyoróbarna testére vastag habpaplan kerül. Illata némiképp visszafogott, akárcsak az íze, mely kissé fehérborszerű zamatokkal indít, majd előkerülnek az enyhén pörkölt, malátás jegyek is, valamint szinte önkéntelenül is mogyoró, dió aromáit véljük felfedezni benne, a címke által sugallt mandula megjelenéséhez azonban kissé talán nagyobb képzelőerő szükségeltetik. Egy nem túl harsány, viszont mindenképpen hangulatos és kellemes ízvilágú ale.", "Bottle 355 ml. Pours mahogny in color with a tan head. Dark bready dough, roasted malts and nutty notes in aroma. Malty notes in taste, some sweetness is present but also some dark chocolatey vibes are there as well. Dry, slightly nutty finish.", "0.55 bottle. Clear, brown color with a reddish tinge and a small, off-white head. Malty aroma of chocolate, wood, nuts, coupled with slight earthy and leathery tones. Taste strikes a balance between malts and hops as it introduces some herbal tones and a generally fresher sensation. Medium body, creamy texture, and soft carbonation. Finish generally follows the taste with its malty-herbal forest blend. Overall the beer is alright but it lacks a strong, definitive taste; much the same can be said about the finish which is mediocre at best.\n\nI am a moron. Do not listen to my ratings. I am very Polish.", "Pours a nice dark brown color with tan head. Nuts, roasted malt, and caramel malt on the nose; follows onto the palate. Very nutty on the finish.", "A nutty taste with desent aftertaste full malty taste and hoppy aroma. I think it isnt as good as samuel smiths imperial stout but a decent one.", "Bona cervesa molt equilibrada i gustosa.\r\nBuena cerveza muy equilibrada y sabrosa.", "Botella de 330ml. Copa Pokal. Color cobre con tintes marrones y esponjosa corona beige con bastante buena retención. Aromas florales, de leve sulfuro y pasas redondeados por notas de chocolate por detrás. Entrada vivaz con sabores caramelizados y chocolateados que aportan una sensación balsámica. Cuerpo medio y carbonatación medio/baja. Textura sedosa. Final seco y leves toques de frutos secos en el retrogusto. Bien equilibrada, de trago fácil y deliciosa!!\r\n330ml bottle. Footed Pokal glass. Brownish copper color headed by beige foam showing good retention. Floral, banana, very low sulfur & slight raisin aromas rounded by chocolate notes on the back. Crispy upfront, caramelized & chocolaty flavors providing balsamic sensation. Medium body. Medium-low carbonation. Silky texture. Dry finish & slight dried nuts on the aftertaste. Well balanced, easy drinkable & delightful beer!!", "It builds a thick and foamy head with a creamy tan color over a dark reddish brown body. The body has good clarity and some visible carbonation. The head has very good retention, lasting until the last sip, and it leaves light tan lacing on the glass. The aroma has a strong malty character with notes of mixed nuts and mild hops. It has a malty, sweet bread character that’s doughy and nutty. The presence of hops is mild and only noticeable towards the finish. Its carbonation is mild and the body is about medium making the texture smooth and creamy. This is a very enjoyable brown ale.", "355ml bottle. BB nov 14. Dark brown in color, lacing, light brown head. Bready, sugary sweet, nutty aroma. Flavor has dark bread, sweetness, toasted malt, hops. Dry finish. Sweetish. Not really to my liking. Sweet dark bread I don´t like.", "Un liquide roux limpide qui a une mousse respectable, qui n’a cependant pas beaucoup de prestance et réussi quand même à baver une dentelle lorsqu’elle se résorbe. Un nez de fraîcheur, en fait, de journée venteuse où on arrive à sentir peu d’odeurs. Il y a quelque chose qui peut ressembler à du caramel, qui lui est en harmonie avec du malt et des écailles de noix. Plus intéressant en bouche, avec une amertume bien douce et des saveurs poivrées. Les noix sont palpables sur la langue et procurent un bel apport au gouter. Une légère acidité vient un peu brouiller les cartes. M.A. Mars 2015 (1073-140514)", "Bottle from Dobbies Newcastle. Pours dark brown colour. Rich, strong flavours make this a nice late night beer", "Pours nice dark amber colour, malty aroma, but other than that it’s pretty boring. Nuts come out a little bit with the bitterness. Boring, generally", "Bottle. Pours clear nutty reddish brown with small white head. Aroma is sweet malt, caramel, brown sugar, toffee, raisins and dried figs. Taste is initial light sweet, then medium bitter, medium sweet and light acidic. Body is oily with lively carbonation. Finish is long and bitter/sweet with notes of caramel, nuts, dried fruit, milk chocolate and chalk. Very well balanced.", "Aroma: bread malts, very light caramel. Appearance: clear dark brown, small beige frothy head. Taste: light bitter. Palate: light bodied, light carbonation, bitters remain light and refreshing, slightly intensifying towards the average-long finish. Overall: a very pleasant Brown Ale, on the light side, yet very refreshing. Bottle from Whole Foods Market, Kensington.", "Poured from bottle - lighter brown in color . Faint nutty aromas . Taste is well balanced , slight bitter hop note . Quick sharp finish . Good . \n\n---Rated via Beer Buddy for iPhone", "I’ve been looking forward to try this brew for a while, and it does not disappoint! Pours a beautiful brown amber color, solid off-white head. Aroma is roasty malt and caramel sweetness, anticipates the taste. The taste is excellent, malty, earthy bitterness, nutty, all as promised. Highlight is the strong flavor intensity! Finishes clean and dry, with a strangely satisfying mustiness. Didn’t notice any hoppy notes but I don’t mind that for this style. The only detractions are for a thin body and light mouthfeel that seems out of proportion with the full flavor. Overall a classic English brown ale, more flavorful than most.", "Bottle. Clear medium brown with thin white film. Heavy malt aroma with hazelnut, toffee and earthy notes. Flavor is mildly sweet with a dry finish. Lighter body with a watery feel.", "Bouteille de 550 ml achetée à la LCBO Rideau à Ottawa. Dégustée le 15 février 2009 (mug). Bière brune limpide. Col moyen beige, crémeux, persistant. Peu effervescente, bulles fines. Odeur de noix grillées, de toffee. Très douce, un peu sucrée, peu amère. Saveur de noisettes, de noix de Grenoble. Manque un peu de corps, un peu mince.", "BOTTLE 55CL.\r\n\r\nLook: clear chestnut brown with a light beige frothy head.\r\nAroma: fruity, esters, light toast, nutty.\r\nTaste: fruit/plums, caramel/sweetness, light nutty spicy bitterness. \r\n\n\nNice, but a bit too heavy on esters. Some hop flavour will be nice to have too.", "Good nutty and caramel aroma. Smooth pour with a nice thick head. Color was an amber brown with a hint of ruby red. Able to see through it up to the light, but it was a medium dark color.\r\n\r\nThe taste was like roasted nuts with a hint of caramel. Slight malt aftertaste and a little dry after it hits the throat. Not bitter, not sweet. What was disappointing was that it was such a light taste. I didn’t expect this to be a really heavy beer, and the carbonation was good, but I would have loved it if there was more body. Overall this was a decent beer, but I would opt for a heavier beer similar in taste and style if possible.", "A good but not great beer. Too malty and bitter for me. A nice color and not to much aroma.", "Marrón, con espuma abundante. Muy dulce, ya en el aroma tira para atrás el azúcar, en el sabor igual, azúcar por encima de la malta tostada. Como una belga dulzona más floja de alcohol.", "Poured from a big bottle. Nice deep brown coloring with a small foam head. Smells of malty chocolate. Tastes of bitter chocolate. Slightly bitter after taste. It's decent.\n\n---Rated via Beer Buddy for iPhone", "Ins Glas ergießt sich ein dunkel rötlichbraunes Bier mit schöner Schaumkrone. Geruch röstmalzig, nussig, Karamell. Geschmack röstmalzig, Karamell, nussig, leicht schokoladig.", "Una delle più buone che ho assaggiato di Samuel Smith. Gusto molto intenso di nocciola, con note di caramello, malto e un tocco di cioccolato. Notevole!", "Bottle, pours a coppery color with a white head, tastes of bread, chocolate, and hint of nuts. Very nice beer.", "Botella de 35,5 cl, adquirida en Cerveceria Internacional. Color marron. Sabor a malta, con regusto a caramelo y chocolate.", "Great nutty aroma. Pours a deep brown with two fingers of light brown head. Quality caramel malt flavors come through, complimented very well with a nutty flavor. Nice and clean on the palate. An excellent beer, especially on a cold day.", "Backlog. Bottle at Green Lion Inn. Caramel, butterscotch, chocolate, floral aromas and grass.", "This nut brown ale is a great tasting ale with good malt taste but aftertaste is slightly off for me. Although good, it is not how I remember the beer. A decent pint to enjoy during the spring thaw.\n\n---Rated via Beer Buddy for iPhone", "Bottle 355ml kindly shared by Dominique. Nose is on toasted caramel and light chocolate. Aroma is sweet, toasted, caramel like, bitter chocolate, light nut notes, quite complex for this level of alcohol, grassy and floral touch, light red fruit notes, massepin, good.", "Medium amber, clear, good lacing. \nMedium body, watery middle, refreshing mouthfeel, with good acidity which makes up for the low alcohol. Avg length, flavorful and faintly nutty, dry finish. \nModeratly bitter, dry, \nRoast malt, rusty, little hop presence, besides bitterness. \nInvigorating, keeps you awake, not a relaxing, comfort drink. \n\n---Rated via Beer Buddy for iPhone", "sweet nuts aroma,golden, light brown foame,light sweetness, lightly bitter, light body, creamy, soft carbonation, nice nuts and light bitter finiah.", "In my humble opinion, there is no easier beer to drink than this one. Pours a cola-like brown into the nonick pint glass, normal pillowy head that lasts for awhile, nice lacing on the glass. Nose of bready sweet malts, toffee, some roasted flavor, walnuts. Taste is liquid velvet, caramel, buttery toffee, absolutely delicious.", "The nicest English real ale I’ve had since I was in England and had Owd Roger. Very smooth with a good aftertaste.", "Good brown ale. Good flavor and nice finish. Leaves a good taste after as well. \n\n---Rated via Beer Buddy for iPhone", "2\" tan head thick consistency and good lacing. Clear light reddish to orange brown. Moderate roast malt flavor, some nutty, well balanced with light hops. Moderate body, finishes very clean. Easy to drink and enjoyable exemplary brown ale.\n\n---Rated via Beer Buddy for iPhone", "From 550ml bottle. Pours a dark, blood dried brown with one finger of beige head atop. Clean smelling, with limited nuttiness on the nose. Some brown sugar there as well. Flavor is pleasant malts (nothing dominate) with metallic roundness and hazelnut burn through. Only the metallic taste detracts.", "Bottle. Poured dark hazy brown with thinning beige head. Aroma of grain and dark fruit yeast. Med carb and bod. Nutty fruityness.", "Poured from a bottle. Very clear pour with a slight head. Nutty, caramel aroma. Dry fruity taste that leaves the palate looking for more. I'll take another!", "Color rubí limpio con espuma color crema. Aromas de azúcar moreno y toffee. En boca es ligera, los sabores van desde un dulce inicial algo tostado a un final amargo seco. Bien.", "Bottle. Nice nutty nose, caramel, light fruit, some grassy hop. Sweet and malty, fruity tang, lightly hopped but rather dry finish. Good Brown.", "brown with a thin off white head. aroma is yeast, malt and nut. flavor is malts and nuts with a hint of cocoa. soft carbonation", "Pours medium leathery brown and clear. Nose is immediate yeasty tartness, toasty malts and some light nutty character. Flavor is toasty and medium light crackery malt character. Light body but has a slick fullness that I can’t pinpoint. Pretty solid but I could ask for some more complexity and malt sweetness.", "We conducted a blind taste test with this beer and 5 other brown ales to objectively determine which one was best. The 5 beers were: Samuel Smith’s Nut Brown Ale, Lost Coast Downtown Brown, Big Sky Moose Drool, Newcastle Brown, and Wychwood Hobgoblin. You can view the video here:\r\n\r\nhttp://youtu.be/oz0hSSylY70", "English ale fruitiness is dominant in the aroma, with caramel malt and subtle bread crust. Caramel malt, bread crust, nutty malt flavors. Gets sweeter in aftertaste. The fruity ale flavor is there--but much less prominent than in the aroma. Also some subtle dark fruit; maybe from the malt rather than the yeast?", "Bottle from Siri. Pours clear deep amber with a big creamy off-white head. Aroma of red ripe fruits and nutty malts. Taste is light sweet nutty malts, toasted caramel, medium bodied, light hops at finish, nice one.", "nice mild nutty scent with a good malt back up pours nice dark brown with a medium head mild sweet hazelnut flavor and almost no carbonation very well done", "Bottle. Clear ruddy amber with a light head. Aromas of dough, grain, and grass. Taste is similar with nutty notes. Sweet with a light palate and a fruity, almost sour finish.", "Flavors of almonds, toasted oats, nutty caramel, wheat bread, grass and hints of lemon. Exceptionally crisp finish.", "12oz bottle from Brewmasters in Wilson. Reddish-brown hue, murky clarity with fully lasting frothy off-white head. Sweet malt aroma, some light fruit. Light sweet fruity taste with medium average fruit finish. Okay", "Color is a medium brown with a good head. Malty, roasted, aromatic aroma. Some sweetness, malt, nutty, and a bit of bitterness to taste. Aromas and flavors blend well and are smooth and a joy to the palate. One of the first beers I had that turned me on to \"good\" beer.", "Medium minus beige head over dark amber brown beer, fruity toasty aromas with hint of sour. OK weight with not too lively mouthfeel, malty fruit and toasted flavours, medium finish but for me not enough carbonation. OK.", "Appearance: Clear dark ruby with finger thick ivory head.\r\nAroma: Bread, nutty and fruity.\r\nTaste: Low/medium sweetness, low bitter and sourness.\r\nPalate: Thick grainy texture, light body, average carbonation, lingering malty, nutty quite dry finish.\r\nComments: Tasty and glass lace.", "550 ml bottle. Pours clear mahogany with moderate head. Aromas of figs and brown sugar. Flavors of nuts, dried dark fruit, and roasted malt. Has a metallic hint but does not distract. Nice.", "550 ml. Bottle. Poured clear reddish brown with a nice tan head that left nice lacing on the glass. Aroma of malts (caramel), nuts and dark fruits. Taste is consistent with the aroma, sweet, earthy, it does had a slight bitterness from hops, but overall very drinkable and enjoyable. Very good beer.", "Bottle, 550 ml. Brown colour, just a bit sweet. Caramel aroma.  Decent ale.", "Bottle. Pours a nice copper tan with a slight tannish head that leaves pretty thick lacing. Tastes of malted nut in the front with a hop bitter finish. Not as good as I was expecting but not bad either. \n\n---Rated via Beer Buddy for iPhone", "Bottle @ home, picked up at Supermarket Liquor Fort Collins. Pours a hazy, reddish orange appearance with a tan head. A bit roasty, big cookie, caramel, somewhat earthy hoppy aroma. Burnt toffee, cookie, lightly roasted coffee, hazelnut flavor. A bit thin and possibly a touch dated but still pretty good.", "Pours from the bottle with a nearly opaque earthy brown color and a foamy tan head. The aroma is pretty one-note, with a dry, nutty, mineral-like quality and only a little bit of caramel sweetness creeping in. The sweetness is more pronounced in the flavor, but the dry nuttiness dominates again, and the fine but active carbonation keeps the beer relatively light and dry. Maybe I’m just missing some of its nuance, but this beer is merely solid in my mind.", "this is one awesome ale, the english have the best beers, that come’s with all those years of brewing, of coarse all sam smith beers are of the highest quality and taste!!!!!!", "Bottle.\r\n\r\nA- Nuts, malts, bread.\r\n\r\nA- Brown color, hazy liquid, minimal head.\r\n\r\nT- Slightly malty, nutty.\r\n\r\nP- Medium body, thin texture, average carbonation, malty finish.\r\n\r\nO- A fine brown ale. The nut tones are very prominent. The British are some of the best brown ale makers and this shows it.", "The Brits are known for their Brown Ales, and this one certainly doesn’t disappoint. It has a sexy mahogany color and a mild, hoppy aroma. The flavor seems more complex than that of your average brown ale. Nut Brown Ale has a very malty profile that is sweet and smooth. As you’d expect, it has a distinct nutty flavor that also has subtle amounts of hop spice. It’s a near-perfect representation of the style.", "My all-time favorite beer. Dark, delicious, beautiful dark brown color, wonderful flavor. Great nutty flavor but not over powering.", "bouteille de brune de 500ml. arome de caramel et de café léger. au gout assez léger également assez accessible comme bière", "An old stand by that one can’t go wrong with. Nice amber color, nutty smell, and flavor.", "Clear brown pour with a cream colored head. Malty aromas with notes of toffee and bread. Biscuit malt flavor upfront with some bitter hops coming through in the finish. Standard issue brown ale. Decent for what it is but nothing incredible.", "About 15 years ago I sampled several Samuel Smith beers and enjoyed them all but times have changed.\r\n\r\nNut Brown Ale pours a dark amber with close to 2’’ of head that stayed for awhile and eventually left some lacing. Aroma is caramel and nuts. Taste follows the nose. Medium bodied with a dry finish. That isn’t much of a description but there really isn’t much for me to describe. \r\n\r\nI think Samuel Smith is living off of its reputation earned when craft brewing was in its infancy. Although being very easy to drink there is nothing exceptional about this beer and the one word that comes to mind is bland.", "500ml bottle into a dimpled mug. Pours a deep chestnut brown with a light cream-coloured head. Light caramel and toffee aroma with a hint of nuts; rich, malty, hazelnutty flavor. Very tasty, revisiting one that has gone untasted for several years.", "Bottle in the Anchor, Guisborough. Chestnut coloured with a good cream head. Nutty malt flavour with caramel and toffee. Uncomplicated and drinkable.", "Pours a clear dArk reddish brown. Aroma of maple syrup. Taste is brightly toasted up front followed by a semi-sweet turn in the middle. This is interrupted by a sharp bitterness that balances out the malt and leaves a clean finish. \n\n---Rated via Beer Buddy for iPhone", "Bottle date: unk\r\n\r\nA: pours brown, single finger of peanut head. Brilliant clarity. Spotty on cobweb lacing. \r\n\r\nS: Hazelnut, caramel, praline, brown sugar. Good nose. Malts are sweet and easy. Slightest hints of metals.\r\n\r\nT: Whoa, the metal is forefrontal. Sweet, subtle molasses and hazelnut falls in here. The beer is relatively simple, and surprisingly, there is a hint of alcohol, weird. \r\n\r\nM: Medium to light with low carb. Mouth watering. Pretty good for the style. Used to a little more dry, and prefer this take.\r\n\r\nO: Good beer. For brown ales, pretty much in the top rankings I’ve had. But I am not particularly impressed with the beer as a whole personally.\r\n\r\nServing type: bottle\r\n\r\n05-24-2011", "Bottle into goblet. Dark Amber/mahogany color, slightly off white head. Dark malt nose hint of chocolate. Full bodied malty body. Light cleansing hops in the misplaced. Lingering finish with chocolate notes. Quite good ale, and the best of the Samuel Smith line I’ve had thus far.", "nuts, herbs, brown, pale, minimal head, white foam, white foam, light sweetness, medium bitterness, medium body, thin feel, average carbonation, soft carbonation,", "Livligt skum, frisk, blid carb. Let smag og mundfylde. En smule syre og bitterhed i eftersmagen. Imponerede ikke mig.", "Bottled, 0.55l. Clear dark ruby brown color with a nice beige head. \r\nAroma is sweet (raisins) nad nutty with a hints of caramel and coffee. \r\nSweet malty taste with a little bit dry and bitter finish. \r\nMouthfeel is pretty thin, was expacting more. Good but not great.", "Pours brown and leaves the same colored body that gives a spectacular one finger foamy off white head. Some nice spotty foamy lacing is observed. The body is too dark for any carbonation to be seen rising; the aroma has a fair amount of nuts, caramel malts up front, hops slightly in the background; the flavor is exactly the same; its fairly easy on the palate with a good creaminess all around; overall well worthy to come back to", "It's ok but not again. \n \n\n\n\n---Rated via Beer Buddy for iPhone", "From 22oz bottle to shaker. Pour is a deep brown, thick off white head. Nose is alcohol, nut, roasted malt. Taste is medium to heavy bodied, sour with hop bitterness balancing it out. Little thicker texture as well, finishes very crisp. Samuel Smith never disappoints.", "Nutty soft aroma,dark golden appearance with minimal head, nutty taste with hops, slightly harsh finish with", "5% bottle from Rakuten served in a pint glass. Slightly reddish-brown pour with a light beige head & a sweet caramel & molasses aroma. The beer is medium bodied with a zesty carbonation & a sweet syrupy flavor that gives you caramel, maple, molasses & some nutty notes in the finish. Pretty good, a cut above the average English ales I’ve had in Japan.", "Dark brown with a foamy white head. Maybe it was shelved too long, but I didn’t find much of a flavor here. Has a watery feel as well. Not very memorable.", "Clear, copper colour with medium and quickly disappearing head. Moderate aroma of malts, caramel and nuts. Taste is sweet with caramel, resin and nutty note. Over carbonated. Thin body. Medium sweet finish. Nothing special.", "550 mL bottle. Pours crystal clear, medium brown with a tight tan head. Aromas of almond, apple sauce, toffee, cocoa, and earthy hop. A hint of sweetness back by good hop bitterness. Moderate body with low to moderate carbonation. Palate coating. Get’s better as it warms, solid.", "Usual 550ml Bottle: BBD Apr 14, poured into an Abbot Ale glass tankard at home on 17th Nov 13.\r\n\r\nLooks impressive: clear body of redwood (teak/mahogany), a deep blanket of beige foam sits on top, nothing moves as you stare at the glass, apart from carbonation bubbles rising through the body. One of those moments to savour.\r\n\r\nThe nose is dry, as is the taste: malts rule the roost here, nutty (obviously by the name) and slightly over roasted in smell and flavouring.\r\n\r\nThis is a fine beer and I’m glad I found it after years of not having any since my youth. An old school Brown with nothing fancy or clever about it, just good ingredients and blended well, then left alone to sort it’s self out.", "Malty and nutty as advertised, but nice dry bitter finish. Gets better as it warms up in the glass.", "Poured a medium brown color with a small sized off white head. Aromas and tastes of caramel, some nuts, and lighter chocolate.", "A very nice but brown. Pours a cloudy red with a thick grey head. Smells very nutty. More nuts in the taste, with some sweetness coming in halfway through. Finishes nice. Had on tap at Billcos.\n\n---Rated via Beer Buddy for iPhone", "Poured from bottle to glass. Smelled caramel and nutty. Mahogany color, off-white two-finger head with some brown intermixed. Taste brings out the malty character but is balanced by hops. Finished dry. Overall, a pleasant drinking ale.", "Pours intense copper reddish (more reddish) with beige soapy top, minimal lasing. Aroma - dominant malt, reminds of Czech dunkel, dark lager with bready, cookies like nose, pleasant. Taste is light to medium sweet with light sour touch and light bitter from darker malt. Interesting balance between less sweetness and sour lightness. Flavor seems quite rich, multifaceted. Dry finish, medium body with not very long finish. Interesting brew, I’m still pretty new with brown ales and what it is but the shapes are becoming more certain.", "Clear Reddish Brown Color, Good Head, Light Spotty Lacing. Faint Malt Aroma. Lightly Toasted Malt, Lightly Bitter. Over carbonated, watery, with light creaminess at the end. Did not get nuts nor sweet sugars. Dry finish with slight sour aftertaste. Drinkable, nothing too fancy. Classic example of lost in translation... When I see Brown Ale, I think of thick, sweet American version that is not too far from Porters, while here I get Toasted Darker Shade of Lager... Meh... I’ll pass Next Time...", "Bottle. Pours clear brown with thick white head. Aroma is malt, nuts. Flavor is malt, hops, nuts, candy.", "550 ml bottle poured into a pint glass. Appearance is a clear ruby-brown liquid with a large, pillowy, tan head. Aroma is rich caramel and malts, raisins, light chocolate, and bread dough. Taste mostly follows the nose. Mouth is fairly watery and leaves a very dry, bitter feel on the tongue. As good as this is, I must admit that I was hoping for better. I guess my expectations were a bit too high.", "Another good beer from good brewery ). Copper color with small average head.Aroma of malt and caramel. Good bittersweet taste. Decent brown ale.\n\n---Rated via Beer Buddy for iPhone", "(Bottle): Pours a copper colour, tan head. Aroma of rich, sweet malt and chocolate. Tiny bit of nutty aroma but was expecting much more from the name. Malt, chocolate, roasted chesnuts, toffee notes in the taste. Overall pleasant but lacks something.", "Caramel and some kind of dried fruits in the aroma. Brown colour with a white head. Nice sweetness with a light bitterness that freshens up. light to medium body with a lively carbonation. Overall a nice brown ale, enjoyable.", "Bottle@home, 550ml. Head: delicate beige foam. Colour: clear, copper brown. Aroma: hops, roasted malt. Taste: bitter-sweet nuts, Palate: smooth, dry, nice bitter-sweet finish, lively CO2. Overall: very nice.", "Bottle from Asao. Nice nutty nose, caramel, light fruit, some grassy hop. Sweet and malty but not cloying, fruity tang, lightly hopped but rather dry finish. Nice.", "This ale is indeed nut brown. It has a medium head and a fairly dark color. It is medium bodied, with a nice balance between the slightly caramelized malt and the hops. It is a pleasant ale, but not remarkable.", "Poured from a bottle it is a reddish brown ale with a disappearing head. The aroma is of coffee and caramel. The taste is a strong rosary coffee flavor that lingers on the palate.", "From a 550 ml bottle shared in Avon NC. Pours a clear cola brown with a tan head. Malty nose with flavors of toasted nuts with some licorice and caramel. Highly carbonated. Crisp, dry finish.", "Bottle. Poured a dark copper with a nice tan head. Nicely balanced sweetness with dark malts. Very good brown ale. \n\n---Rated via Beer Buddy for iPhone", "35,5 cl. flaske.5% En ok mørk øl. En lidt gennemsnitlig oplevelse. Købt i super Brugsen på tilbud til otte kr.", "Aroma - pleasant, but simple - mainly chocolate, but some nut, licorice, and raisin\r\n\r\nAppearance - Orange/Brown. Clear with limited, tan head and minimal lacing\r\n\r\nTaste - Light sweetness, very little hops flavor I can detect. A hint of sourness at the end.\r\n\r\nPalate - light to medium body. Thin/dry feel. Good carbonation.\r\n\r\nHonestly not blown away. A good beer, but nothing out of the ordinary for me. I would drink again, but have other browns i would choose first. Definitely better than Newcastle, but overall simple and no surprises.", "Serving type: bottle\r\n\r\nAppearance- Pours a very nice reddish brown with a good thick tan head and nice lacing on the glass.\r\n\r\nAroma- A rich malty smell mixed well with a hint of sweetness (chocolate and caramel) and also a hint of fruit.\r\n\r\nT/P- A nice well balanced brown with traces of sweetness and roasted nuts. The mouth feel is very nice as the beer is not overly carbonated.\r\n\r\nOverall- This is a very drinkable Nut Brown, I was sad that I only bought one at the store. I will defiantly get this one again and again.", "355 ml bottle poured into a Pint glass\r\nAppearance....... brown beer with head colour beige of 2,5 fingers\r\nAroma............... wet wood and hops with a touch of malty aroma\r\nTaste........ almond and peanut, , not sweetness in mouth, some hop notes and light dryness at the end\r\nMouthfeel........... medium/full body and soft carbonation\r\nOverall............ much better than other brown ales that I have tested in North England, refreshing beer too.", "Ładny, orzechowy zapach, choć w smaku orzechów raczej brak. Leciutkie nuty karmelowe w posmaku, przyjemnie nagazowane, szybko rozpływające się w ustach. Niczego nie urywające piwo.", "Lightly sweet. Lots of roasty malty flavor with good depth. Barley or perhaps oats. Smooth with a bit of sourness.", "Bottle - Malty, brown sugar and a bit vinous. Clear amber brown with a rich beige head. Dark sugars, toffee, toasted malts and I get a slight vinous sourness (bad bottle?). Finish is long and like some others I don’t really get the nuts.", "tasted in August 2011.\r\nNose not sticking out much. Color is brown with a thick creamy head. Malt is very tasteful and showing good complexity with caramel, hazelnut and wood accents. A good bitterness as finish. Good traditional English Ale.", "Sam Smiths Nut Brown Ale is dry British ale with a rich brown color and a slightly nutty flavor. \n\n---Rated via Beer Buddy for iPhone\nI just had a couple of pints of Guinness-excellent", "Bottle from fish&beer, copenhagen. Clear reddish brown color, small white head. Aroma is little roasty, nuts, sweet malts. Medium body, suryp, some hops, sweet malts.", "Overly sweet brown beer, with some nutty characteristics, along with the toasted malt. Dark brown with minimal beige head. Medium weight, somewhat dry finish and sweetness lingering afterwards.", "Poured from a bottle, San Diego. Sharp malt aroma. Deep brown body, mild creamy head. Hops come through the malt. Interesting, solid beer.", "Nice clear brown poor out the bottle. Smmoth and soft is how I would describe this beer. Some soft caramel flavor with a smooth taste.", "Definitely a quality brew here just not exactly what I was expecting. Quite different than most browns I’ve come to know. It’s almost sweet initially and then finishes dry as advertised. Fairly complex at 5%. It has an attractive deep brown pour w/ a nice tan head that leaves good lacing. Aroma is semi-sweet malt. This is good! Could certainly have a few of these in a sitting!", "Bottle. Nutty brown-chestnut colour and cloudy. Almost rotten roasted chestnuts, floral and sweet aroma, tastes is sweetish, spoiled chestnuts. Gently carbonated, medium-bodied, long, mellow bitter finish. Pretty good and balanced.", "Bottle. Thin white head. Not sure how to describe it - dryish, some metallic notes, some bitterness, slightly grassy afterthought but a bit watery (or just \"light\"?). An ok ale but not something I will go running out to buy. \n\n---Rated via Beer Buddy for iPhone", "Bottle from Top Cellar, Edinburgh [190813]\r\n\nCaramel brown, big frothy off white head, good lacing\r\n\nAroma of caramel, soft toffee, hint of yeast, good caramel malt aroma, slight toasted malts\r\n\nTaste - Caramel brown malts, soft nutty malts, dab of sweet toffee, soft sweet malts, touch of bitter hops\r\n\nPalate - Soft carb. medium body, quite sweet. Finish as main flavour, little dry, bitter toasted malts in linger\r\n\nOvreall - Malty brown ale, one of the best Sam Smith’s beers", "Cerveza color marrón, con espuma densa. Olor a maderas, especias y café. Sabor amargo, algo especiado, chocolateado y café y caramelo. Cuerpo medio, refrescante, aunque mejor no muy fría. Buena calidad.", "Clear brown with small but sticky head. Aroma of nuts, toffee and some chocolate. Taste of nuts and roast,some chocolate. Fairly dry finish", "I really love nut brown beers, but this one is my standard. The aroma is toffee and nuts. Not much head on the pour. Good roasty, nutty character with a little malt on the back end. Long story short; I am a superfan of this beer.", "bottled, thanks mowbeer for sharing. nut brown colour, minimal head; vanilla aroma; some hints of cocoa, wood, burnt butter and a surprising amount of bitterness", "Bottle. Pours, well, brown. Nice white head that lingers. Very little visible carbonation. Nice nut aroma. If there is a better brown ale out there, I have never had it. Nuff said.\n\n---Rated via Beer Buddy for iPhone", "Pours a deep brown bordering on red with a thin offwhite head that leaves persistent lacing. Aroma is malty with a light roasted presence. Taste is sweet but it is balanced out by the roastiness giving some nutty impressions. Flavors are mostly taken by roasted malt and noble hops. Body is a bit too light for my liking and feeling a bit watery. Still, a fair brown ale.", "Nice brown color. Quite nutty. Delicious. Semi sweet. I could drink several of these.", "Nötfärgad med fint skum! Bra öl med en fin blandning mellan malt o humle! Helt ok!", "I love a good brown ale. This one pours a gorgeous amber brown with a fluffy white head. A huge malty nose with coconut, vanilla, fresh dough that is very pleasant. Sweet and bready caramel malts round out the medium body. This is a nice Brown Ale and probably one of the most consistently on the market year round.", "pours medium amber-brown color with small head which has some retention. aroma is sweet, light hint of fresh herbs/grass. Taste is caramel/bready blending to toasty, nutty, toffee flavors. Finishes with a light, well blended spicy aftertaste. Medium-bodied with lasting carbonation, which gives a light finish. Overall it goes down very easy and smooth.", "Expected -due to the ratings- a high class tasting experience, but got let down quite quickly. Pours out alright: Light cloudy, deep dark brown colour with low unsteady head and medium body. Nose of malt and wet grass. Taste of light malt, leaves, roast, woods, basement and light unfresh hops. Heavy hints of roast. Finishes thinner and more watery than expected. Didn’t enjoy it a lot. Not refreshing, not nice to drink, not even quaffable. Average one.", "When you look at that beautiful bottle you might think that this one is definitely the best beer in the world. Nah, sorry. It is not. Well, it it has a bit of chocolate in, but also some grain and lot ot...water. Yes, it´s watery and makes the beer a bit dull. I would call it simple from start to end. And I really wanted to like that one. I did. But not in the way I could have.", "Bottle. Pours clear copper brown with airy but stable beige head. Clear aroma of malt, caramel and hops. Sweetish flavour of caramel malt, interspersed by regular hoppy notes. Bitter finish with a touch of roast and nuts. A very nice Brown Ale.", "Mmmm. Virkelig godt øl. Smak av karamell, nøtter og kaffe. Fyldig og lang ettersmak. \n\n---Rated via Beer Buddy for iPhone", "simply wonderful brown ale, my favorite currently. Very rounded and full bodied with just the right amount of alcohol", "This pours a beautiful, translucent brown/red. Sweet caramel and burnt sugars aromas that continue on into the flavor. Hop bitterness works well as a counterpart to the sweetness. Thin and a little dead feeling in the mouth, but leaves with a pleasant aftertaste.", "Medium brown with red hues and tannish head. Sweet aromas of malty nuts, sweetened coffee, milk chocolate, a little fig. Taste is like the nose, a little subtle. A fine example of an English brown ale, however I’d prefer more hops to balance out the sweetness.", "Bottled, 0.55l. Clear ruby brown color with large frothy light brown head and flat visible carbonation. Aroma is nutty, caramel, light chocolate, light herbal hoppy with some cask wood hints. Taste starts with rich and sweet maltiness, then followed light acidic with long spicy mouthfeel. Finish is heavy astringent hoppy with moderate strong alcohol note. Full body, thick texture and flat carbonation in palate. So good to go nuts :)", "Pours a copper color with a medium off white head. Aroma is whiskey and molasses! Taste is almost identical to the aroma up front, but it kinda blends into a nutty flavor for th mid palate. Finish is an easy molasses inflected bitterness. Overall this one is thin & slick with a lot of flavor.", "Pours a clear amber with a big, creamy, light tan head that dissipates slowly into a cap and leaves some nice lacing. Strong aromas of caramel, butterscotch, toffee, and some nuttiness. Bold malt flavors, nice creamy body. Long sweet, toffee like finish. Solid brown ale, the finish brings it down a tad bit for me."]}