{"reviews": ["Poured from the tap (choosing this versus the draft version due to the ABV - thinking this may be the “special draft”). Clear copper gold with small white head. Mild caramel malt with mild citrus and pine hops. Okay.", "Amber body and white head. Sweet floral and some fruits aroma. Sweet fruity, some malts and hops taste, low bitter. Medium body and carbonation. A good beer.", "Aromat delikatnie słodkawy. Barwa złota, delikatnie mętne, średniej wysokości bąbelkowata piana. W smaku ciekawe połączenie chmielowej goryczki i owocowych nut, delikatnie kwaśnawe. Bardzo dobrze zbalansowane, dość orzeźwiające.", "12 oz can poured into a pint glass. A classic APA and the unofficial beer of the Grateful Dead. Looks good and tastes good. One can never go wrong by drinking this beer!", "Medium head, soft tone. Relatively clear copper color for a pale ale. Fresh flavor of American hops. Round finish. Very enjoyable", "Clear golden pour. Aroma of grapefruit, resiny pine and floral notes on a subtle malt base. Flavour of citrus and malt with a grapefruit/pine finish with subtle bitterness.", "Heard great things about this beer. Pretty good. Personally I prefer more of a malt flavour in my ale. So not really my cup of tea.", "This reminds me of Blue Moon, but a pale ale version! It's zesty and light malty - lime, orange peel, wheat/bread notes. Light hops. Very refreshing beer and smooth mouthfeel.", "Nice taste, flavour of citrus and hope, Smoothie and light Braun colour, handrcrafted in a bottle\n\n---Rated via Beer Buddy for iPhone", "Refrescante cerveza de color ámbar, ligeramente turbia, de mediana actividad de carbonatacion, formando una espuma marfil de poca retención y persistencia.\nEn nariz hay una nota frutal muy agradable de entrada, mango, papaya, guayaba, ligeramente floral. \nEn boca es muy balanceada de entrada, entre la nota frutal pero sin ser dulce, y al mismo tiempo el amargor, da una sensación de frescura y permite que sea fácil de beber y agradable al paladar. Al regusto persiste un poco la nota amarga pero sin ser molesta.\nCuerpo medio a ligero y de carbonatacion media.", "Das Pale Ale 🍺 von Sierra Nevada steht klar mit einer schönen Schaumbildung, die Farbe ein dunkles Ocker, das ins Rötliche geht. Fruchtig, der Geschmack nach Bitter Orange und Mandarinen 🍊, recht herb im Abgang.", "Amber with a creamy, white head. Orange zest, lime, caramel and bread-like aroma. Taste is moderate bitter with a bit of a citric twist. Medium-bodied, moderate carbonation. Decent.", "Used to b a Favorite, not enough happy ness, one gets spoiled by bigger tastes", "Pours gold with just right carbonation. Light hoppy nose, balances with the biscuit malt. By recent hop fest  standards it may seem a little bland, but it's an honest,  solid can't go wrong beer.", "Clear amber color and a white head. Crisp, grapefruit-peel and nice citric hops .", "Clara dourada,límpida,translúcida,espuma com bela formação e manutenção;no aroma,cítrico e floral se destacando,malte e caramelo ao fundo;no sabor um agradável equilíbrio com o dulçor do malte e caramelo no primeiro plano,leve amargor dos lúpulos finalizando;corpo médio,boa carbonatação,final seco,retrogosto com dulçor residual.\nAPA clássica com boa drinkability.", "Ottima American Pale Ale da manuale, con perfetto equilibrio tra malto e luppolo.", "355 ml\nAroma tipična za APA-u (tropi i citrusi), boja odlična (bakrenasto zlatna), pjena slabašna... Okus gorak, posebno na završetku, veoma pun i ugodan... Vrlo dobro pivo ukupno...", "Poured from a 12 oz can into a glass. \nThin head does not last, but some lacing.\nA nice slight citrus, orange aroma.\nBeautiful semi clear orange color.\nA nice mellow bitterness right upfront.\nHigh drinkability, good tasting.", "7-11 Taipei. 109 nt dollars! Pours a deep orange with fluffy head. Lovely sweet notes of clove on the nose. Strong grapefruit flavour..not as overpowering or cloying as some of the newer IPAS...thankfully.  Rounded bitter sweet mouthfeel with a lasting bitter finish. People rave about it. It is nice, but not that nice..and at 109 nt ...it is a lot.", "Amerikansk stil av en amerikansk öl, som inte överraskar. Däremot en fin törstsläckare som har smak, dock med övervikt på majs.", "Cerveza de color ambar con una leve espuma de retención media. Cuerpo ligero y carbonatación media. Aroma a naranja, limón y mango. Sabor dulce afrutado con un leve amargor en su final.", "Golden red shining colour. Medium head. Aroma of orange, some apple and citrus. Taste is sweet with a good balanced bitterness.", "Bottle. Slightly hazy deep golden color with a medium thin frothy off-white head. Aroma of floral hops, some soapy notes. Some sweetness in taste. Medium bitter finish. A bit oily feel.", "Puszka. \nOko: ładny, klarowny, bursztynowy kolor. Jasno kremowa piana ze średnimi oczkami, dość szybko opada. \nNos: przyjemne aromaty; herbata, przyprawy, cytrusy, trochę owoców egzotycznych,\nPaszcza: średnio nagazowane, wytrawne, odrobina goryczki chmielowej, przyprawy, trochę jakby uczucie pikantności na koniec, ciało średnie, lekko oleiste. \nOgólnie bardzo dobre, żadnych wad. Jedno z lepszych jakie piłem w tym stylu.", "Couleur miel ambré, mousse serrée ivoire peu persistante laissant un léger voile en surface. Nez herbacé à basse température, puis de mandarine et de fraise en se réchauffant, poivron rouge aussi. En bouche, une bonne amertume et des saveurs herbacées et fraîches. Une Pale Ale bien amère pouvant en remontrer à certaines IPA.", "12 fl oz can from an online retailer; 6 months old. Pours a nice clear amber with a lot of head; aroma of tons of passionfruit, mango, lemon and other esters, very nice. Taste of a fair bit of hops and resin, together with a malty backbone, and quite a bit of oxidation. Still a very nice beer at this point. Would have been 3.7ish fresh.", "Rusty orange to amber golden pour with 1/2 inch head, of which some remains for the duration of the glass. Healthy amount of up draft carbonation. Fresh citrus orange lemon smell. Bite on the cheeks bitter which stays, though not off putting. Lemon rinds in the taste balanced by the yeast still fresh in the bottle. An after work before meal brewski yes - and quality here.", "Can shared at work. Pours copperish golden with a lacing white head. Nose is restrained, vague floral and fruity hops with a malty touch. Taste is more intense tho, it shows floral, citric and resinous notes with a good amount of bitterness. Light to medium bodied with average carbonation. Well rounded with a nice balance, nothing revolutionary obviously, but classic for a reason.", "Amber colour when poured. Thin head that disappears quickly. taste of malt, hops, fruits. Not bad!", "Can from Edeka Hamburg - clear golden color, white head. Tropical fruits, some resin, bubblegum. Quite IPA like. Nice of course.", "Appearance: bright, great head and carbonation \nAroma: sweet malt, light hops \nPalate : medium full\nTaste: malt, caramel,  light hops", "Buena cerveza, mantenerla bastante fría. Fuerte y bien trabaja. Buena para comprar para una actividad y compartir.", "355ml bottle from online store. Pours orangy amber with thin white head. Good and fresh aroma of malt, floral hops, pine, tropical fruit. Taste has malt and grapefruit flavours, citrus very smooth and hoppy with dry and high bitter finish.. light body and very easy to drink apart for the high bitter at times. Good, crisp and refreshing not the most sweet flavours and very high bitter hops at end, somehow a bit simple almost like it lacks something and not the strongest at 5.6% abv still very appreciable. Good but also a bit overpriced here.", "Blik. Prettig biet. Aroma wat fruit, citroen. Niet schokkend, beetje droge afdronk.", "335ml bottle from Waitrose as part of a 3 beers for £5 offer. Dated as best before 01/2022. Served fridge cold into a tumbler. \n\nThe beer pours a proud dark amber colour with a two finger orange hued head. Uniform and thick. \n\nMedium level aroma of citrus pith, floral hops and caramel. Bittersweet.\n\nThe taste follows the aroma. More of the caramel notes than I was expecting making this beer nicely balanced. More bitter citrus as it warms. \n\nNice length on the finish, bittersweet in the mouth, more citrus skin on the palate. \n\nA decent beer. Nicely rounded.", "Weak aroma and taste, some fruit and malty, caramel notes and bitter aftertaste. Well balanced APA, medium hopping in modern realities and nothing more than outstanding taste.", "Dark copper colour. Very small head. Very bitter with very strong hints of citruses. Alcohol is a bit higher for what I expected from such a beer (5.6%)", "I'm getting older and my memory is not doing so well. I think early stage Alzheimer's is a possibility. So i am going to start recording my thoughts on beer lest I forget. This one, SNPA, has been my go to beer for decades I always have a sixer in the beer fridge. The taste of piney C-hops is a refreshing treat that reminds me of happier days. The malt base is some bready 2-row mix that handles the hops well. Salud old friend.", "IM glas ein minimal trübes Bernsteingelb mit weißem Schaum. In der Nase Hefe, Gras und etwas Malz. Im Mund malzig und dahinter Haferbitterkeit, gefolgt von getrockneten Südfrüchten. Süffig, aber schlicht.", "A gentle floral + pine smell on opening, but nothing too distinctive.\n\nNice frothy head, and a clear golden and amber body.\n\nMildly bitter and hoppy flavour, with highlights of grapefruit.", "Bottle from an online shop. Golden amber, moderate cream colored head, citrus and honey-caramel nose. The flavor is vibrant, nicely C hopped, pretty smooth bitterness (not as I remember from many years ago but maybe my taste has changed). Nice light crusty-beer-bread hints on the cara side of the body. Truly a classic!", "A perfect example of west coast American IPA with pine notes and resin notes of American west coast hops. Cascade stands out strong.", "Amber clear with small white head. Malty aroma with hoppy notes. Remarkable maltiness immediately followed by quite strong hoppy bitterness. Slight bitter aftertaste.", "Buy in Kaufland. Bottle 0,3L. Classic American oldschool beer. It is not something special, and very boring. Classic cascade hop old pale ale. I will drink it again, but I am not impressed. Regards to tradition and legendarity and great label, but beer is average, and very very expensive for 0,3 little bottle (2,5 euros).", "Très bonne pale ale, une couleur magnifique, et le goût amertume est au rendez-vous !", "This beer made me feel prodigious after every sip. Would definitely recommend it to everyone", "Klassinen jenkki pale ale, alkon perusvalikoimassa hyvästä syystä. Kuiva ja sitruksinen, mutta raikas janonsammuttaja kyllä passaa näin talvellakin, mutta parhaimmillaan kesällä hiillostetun kasslerin tai ribsien kanssa", "Clean, medium bodied with a lovely biscuit malt finish. Citrus is the showboat here. Grapefruit aplenty as one would expect from cascade hops. Glad to have tasted a stalwart of modern brewing but might be a little unremarkable by today's standards, not that that is a bad thing per se.", "copper with good white head. caramelly malt with mint/herbal hop aroma. piney hops mixed with strong and straightforward malt. balanced feel just verging on bitter. soapy, full body. good\n\nfairly dated feeling and not perfectly executed, decent beer but would not get again.", "Pours clear amber producing an off white head and mild aroma. Initial taste is citrus, bread, with a light floral scent. A refreshing brew for a light dinner.", "Bottle @ Wordenskjolds. Appearance: pours clear amber with good off-white soapy head and lacing. aroma/taste: barley, bread, citrus, pine, light biscuit and grassy notes. palette: strong us hoppy aroma, average carbonation, medium body, medium sweetness, balanced by a medium to notable bitterness, average duration, watery texture and semi-dry finish. Overall: enjoyable hoppy classic", "Poured from a can in to a pint glass. Appearance is Frothy, golden, see-through, with enough lacing and head for enjoying several minutes worth. Aroma is pine, citrus, forest floor scents, and some good malt whiff in balance here. Taste is light-bitter and forest malt tastes here, still the one. Palate is balance, never out of whack and USUALLY fresh at local stores. Has the same palate impact of old school IPAs back in the day, but with a brightness the latter could not match. Overall a great drinking pale ale, after all these years.", "Clear amber pour, lavish head with light carbonation. Aromas nod to malts with pine and citrus highlights. Solid almost nostalgic apa.", "100 pleople, 100 different appetites. No head, caramely feeling, very little citruses. Tasted better APAs", "Klasyka - zbalansowane, cytrusowe, z wyraźną goryczką. Pijalne, odpowiednio nasycone.", "[Tasting - Beder]\n\nAroma: Barley, grass, honey, malt, slight florla and hops\n\nAppearance: Clear dark golden orange \n\nTaste: Mildly sweet and moderately bitter, barley, malt, hops and caramel\n\nMouthfeel: Oily texture with moderate carbonation\n\nOverall: Nice Pale ale :)", "Aroma of lemon, malt and barley\nNice amber colour with small head\nTaste of mild malt, hops and bitter hops\nMedium carbonation with thick mouthfeel\nNice", "Huge floral aroma. Hoppy stuff. Huge pines aroma. Skunky. Classic pale ale. Awesome.", "Colore ambrato chiaro, cappello fine e abbastanza persistente. Carbonatura appena eccessiva. Aromi e sapori tipici della pale Ale, senza sorprese: frutti esotici, resine, un po’ di agrume. Finale gradevolmente amaro e adeguatamente persistente. Senza infamia e senza lode.", "Schaum Farbe: rot Gold fast klar\nGeruch ist verhalten, aber dennoch etwas fruchtig. \nGeschmack: malzig und süß . Später etwas bitter und trocken", "Yes, this beer is awesome. \nIt's hoppy and citrusy, balanced well with malt. \nI love everything about this beer. If you wanna taste cascade, go get this beer.", "Piwo okej. Bardzo przyjemne; smaczki typowo amerykańskie z miłą, karmelową nutą. Budzi zachwyt w świecie; świadczy to chyba o niskiej dostępności polskich piw oraz małej świadomości tego, jak wysoki poziom potrafią trzymać.", "Bottle. Cloudy amber in the glass, low off-white head. Aroma is quite faint, with notes of pine resin and exotic fruits with nuisances of citrus. Taste is semi-dry, average bitterness. Flavors of citrus, pine resin, slight exotic fruits. Pine resin in the long aftertaste. Full body, slick texture, medium to high carbonation — slightly over-carbonated.\nSo, here we go, finally tasted the legend! An old-school, unprecedented pale ale. As with all classics, it's had for me to rate it objectively, but it's surely enjoyable.", "This. \nYou know the national archives of the most significant things in history? Yeah I feel this is in there somewhere. Sierra Nevada Pale Ale is an anomaly. It lives in it's own world. It's not really a pale ale. It's not an IPA either. It's what I call a gateway. This is the beer that opened the door to the hop world as I was progressing through the beer ladder. This ale is something special. It's skunky. It's dry. It's piney. Beautiful color. Its got all the skunky west coast IPA attitude with aroma and flavor - but reigned back on the dryness and heaviness. The flavor is fantastic. Fruity, hoppy and very piney. But it's clean. Doesn't have the background bite that have. Finishes with just nice notes. This is one of the best beers ever created for multiple reasons.", "Bitter pale ale, rich in flavour. I get a slight caramel flavour with a light hop aroma. Would definitely purchase again", "A classic pale ale with a rich fruity and hoppy aroma. Orange colour with a white head.", "bottle.  have had several over the years, just never remember to rate it.  Very solid pale ale, always good", "Pour from a bottle is clear copper with nice 2 inch thick head that laces nice. Malted and bready with a long bitter finish.  Light bodied and sticky.  More nutty than fruity.", "Amber and clear with a thin head.\nPiney smell with a pear note. Balanced taste of hoppy bitternes and malty sweetness, all with a pear note.\nA nice, drinkable beer.", "Bottle with commonmac. Copper with medium white head.  Malt grain and hop balance in nose. Taste is bitter with malt backing. Classic pale ale, they don't make many of these anymore.", "Nice aroma of fresh pine, hint of grapefruit, and some malt.  Orange gold color with a thick off white head.  Rich sweetness up front.  Fresh caramel malt with some body.  Hints of grapefruit.   Bitterness is peepery and grows on the finish.  Light to medium mouthfeel.  Finish is echo of sweet malt with slight bitter sting on the tongue.  Great malt backbone and solid all the way through.", "Amber pour, small white head. Pine and citrus aroma, particularly orange. Hoppy and malty with a surprisingly strong body and a soft carbonation. Very subtle pale ale in the modern craft ale world but it hits the right notes.", "355 ml bottle. Cloudy orange almost amber, foamy head. Pine, bitter orange and orange zest, grapefruit. Hoppy spicy bitterness. Medium bodied, oily texture, lively carbonated, bitter finish.", "Amber color with sticky foam.  Hop aroma of citrus and pine.  Flavor is bitter hops first followed by some sweet malt.  Bitter aftertaste.", "The APA. The Classic. The starting point of craft beer. Not joking around. And this can is reasonably fresh (June 9, 6 weeks old). Hadn't had this for 5 years, and I'm not proud of it. OK, now revisiting it: pour clear amber, firm frothy head, good carbonation and nice lacing. Aroma of old times, fresh hops, bready, fruity, piney. Tastes moderately bitter, grapefruit peel, not much tropical illness like modern days. Crisp and smooth, with a lingering bitter finish. What to add? An awesome classic beer. The reference for any American Pale Ale in beer history.", "Up there with the best. I liken this to a trump that manages to sneak forward and gently tickle your balls. Pleasurable and discreet. Great stuff.", "33cl bottle. Pours almost yellow with a diminished white head. Light peachy and grapefruit aroma. Flavour is mild fruity and grapefruity dry flavour following. Light fruity and hops finish with a slowly growing finish.", "Hoppy, citrusy aroma and a bitter taste. Pretty good pale ale, a bit overrated.", "0.355l bottle. Slightly hazy orange color with white head. Aroma of hops, grasd, citrus, malt and soap. Taste is medium bitter and little sweet. Somewhat light, at least lighter than expected.", "Bouteille de 35,5 cl achetée chez Super U. Robe dorée sombre et trouble avec une légère mousse blanche. Arômes maltés, houblons, agrumes, résineux. Texture crémeuse, carbonatation moyenne, faible amertume, légère. Notes résineuses, agrumes, pamplemousse. Finale sèche et amère.", "Colore giallo opaco.\nSchiuma persistente, profumo e sapori di agrumi.\nAmara nel finale.", "355ml Can and many 330ml Bottles over the years.\n\nGolden coloured with a thin white head of foam. It has a bitter pine and toffee flavour with grassy notes, biscuit and grapefruit on the smooth, warming finish. Very good.", "Absolutely disgusting. One of the worst beers I've ever tasted on 34 years.\n\nTastes like water soap with a horrible metallic aftertaste.", "The craft beer that started it all. Sierra Nevada has become a nationally sold commodity but it still holds true to a classic craft pale. Abundance of hops with a very caramel  finish", "Great amber colour. Light taste of barley and malt. Nice taste of hops. Refreshing and very easy to drink, nice bitterness.", "Creamy white head,moderate resistance. Orange color, moderate carbonation. Nice balance, medium body. Citrus aroma lasting when taste. Bitter finish, and lasting bitter aftertaste. Nice one.", "330ml can - classic. Nothing I'll be able to add that 5,000 others haven't already done. Decent go to APA.", "Benchmark version of the APA style.  No surprise that Sierra Nevada's brew is the best selling pale ale in the US.  Now celebrating it's 40th Anniversary!  Their bold application of Cascade hops and the perfect balance of toasted malt made this ale an instant classic in 1980.  I picked up a 12-pack of bottles with the retro label at the local Safeway for $13.99 - can't beat that value.  https://draughtlinesmag.com/hop-art/sierra-nevada-pale-ale-goes-retro/", "Pours a relatively clear golden colour with a 1 finger white head. Not much on the nose, but a spicy flavour with a slightly bitter finish. Good price and availability.", "Bottle from Systembolaget. I really loved this one when I first tried it in 2005. It's still a pleasant one in 2020. Golden with a medium white head. Aroma of hops, citrus and some flowers. The same in the taste, also some caramel. An easy to drink one. RIP Mattias.", "Pours hazy golden with a medium sized lasting head. Aroma of hops, bread, butter. Taste of butter, bread. Thick and creamy. Medium carbonation. Hoppy bitter aftertaste", "16 ounce can at the Winking Lizard in Copley Ohio. Slight hopped aroma. Golden in color with white head. Film on glass. Taste slight happiness. Light and drinkable. Slight hop aftertaste. Fairly mellow got the style. Cheers!", "Thought I would try this\nNot my usual choice American craft\nAlways avoid these at London craft festival\nAmber in colour white head that disappears quickly\nNotes of pine and citrus\nA heavy feel with little aftertaste", "Colore ambrato con riflessi dorata, schiuma compatta e persistente. Aroma fruttato, corposa. Sapore amaro e luppolato.", "Respect for the influence this beer has had, but not my sort of pale. Really malty and quite sweet. Hops overwhelmed. Feels quite heavy to drink at the ABV.", "Pours deep amber. Hops and pine on the nose. Tastes malty and delicious with treacle on the palate. Go-to sipping beer. Bloody love it.", "The beer that started it all off for me, as far as 'craft' is concerned. Pours a nice deep gold with a frothy white head, the aroma is citrus fruit and pine needles, but in a subtle fashion. The hop bitterness hits the taste buds immediately, but again in a subtle way, and this glides down down very smoothly", "A delicious American Pale which doesn’t taste as heavy as it is, could easily drink again!", "Can. Poured a rich amber color. Has a very outdoorsy, natural pine taste. Kind of made me feel like I was out in the wilderness pictured on the can. A very solid beverage!", "Amber, hazy, small off white head.Floral hay aroma, nice bitterness, balanced, drinkable.", "Una de las que nunca decepciona, tiene un buen equilibrio en cuanto a su sabor, no muy dulce ni muy lupada, con un lindo color dorado que la acompaña. Excelente opción para esos días en que solo “quieres tomar una cerveza”", "Nice copper colour , pine and caramel quite distinctive. A good solid pale ale. One of Brewdogs great inspirations \n\n---Rated via Beer Buddy for iPhone", "In plain and simple terms I found this very bland and disappointing. Aroma was average. As was the taste and the beer.", "Aroma : Lightly toasted caramel malt, subtle lemon, lime & orange citrus notes, with a big pine tone.  Taste : As aroma. Thinnish body with light oily texture. Bitter citric bitter bite throughout with a dry finish. One of the better APA's, has some depth of character that this style so often lacks!", "SKÅL, CHEERS, SALUT, KIPPIS, YAMAS, L’CHAIM, PROOST,  SALUTE, KANPAI 🍻🙏😎", "DLU : 27/08/2020 \nOrange color, white foam that falls very quickly. Little nose, on cereals, and on tropical fruits. Poor palate on cereals, mango, passion fruit, lemon.\nAverage bitterness. A little disappointed.", "Bottle on 17th April 2020. Pours coppery amber with shallow off-white non-lacing foam. Hempy hops and caramel malt aroma. Grassy hoppiness in-mouth and a balanced finish. Zingy mouthfeel and a light body.", "I love this beer. Great hoppy aromas and flavor without being overpowering or too boozy. The perfect beer in my book.", "Full taste, enjoy PA while IPA’s are often too pungent. This is a great session PA and could suck down 4-5 of these suckers", "Sierra Nevada Pale Ale 5.6%. Dark Amber, sweet tropical fruit aroma, medium bodied, caramel malt, pine, citrus, grapefruit. Lovely Californian Pale Ale 🍻🇺🇸", "Not too sure why everyone raves so much about this. A decent pale that refreshes and tastes good but not standout. Subtle hops and citrus. Grassy notes. More interesting pales out there in my opinion.", "Smell - weak maybe hops and malt.\nFoam- thin, hops, pine, intense hops. Head is large, sticky, orange-white color.\nAppearance - nice brewer bottle cap and appealing bottle, I kind of like how it put together. Appearance is clear, orange, brown color, weak carbonation.\nFrom - pint glass\nTaste - quite intense hops, pine, in both foreground and background. Hops stay in back for quite a long time, there are some fruit notes somewhere but it is all killed by hops. It seems a bit harsh for my taste but people might like this.\nSimply not my style.", "Lovely stuff. Classic West Coast IPA - clear, clean with strong pine and resin flavours.", "amber colour, slightly hazy, visibly carbonated\nthin white head that dissipates immediately\naroma of honey, biscuits, bitter fruit, metallic undertones\nfirst quite bitter and crisp, then mellow and dry, bitter, rose/flower, lasting bitter finish, dry on the tongue\noverall a typical IPA, heavily hopped and thus bitter and fruity", "Copper coloured, medium large head and body, fruity and malty. Quite okay pale ale.", "THis is another go to beer for me.  One of my favorite pale ales.  No too strong or hoppy.", "Gran descubrimiento. Me la recomendaron y no defrauda. \nCítrica y resinosa al principio y con toques de malta y caramelo al final. No puedes beber solo una.", "Bouteille 35,5cl\n\nMousse : Fines couche et collerettes blanches\n\nCouleur : Robe orangée  à ambrée\n\nNez : Malt épicé, houblon herbeux, douceur fruitée tropical\n\nBouche : Attaque douce, bouquet malt et houblon, herbe, biscuit. Seconde bouche miel, épices, houblon herbeux, fruité, caramel épicé et touche résineux / amer et citron. Finition complexe : malt doux bonbon au miel à caramel, épicé, fruité, résineux et en toute fin retour sur l’amertume herbeuse très persistante en longueur.\n\nAvis : Superbe complexité et originalité, saveurs riches et puissantes,  pour titrage modeste, qui va bien au-delà d’une simple Pale Ale.", "Taster showing medium amber with half a finger of clean white foam. \n\nThe nose shows moderately intense notes of malt, pine, and citrus. \n\nThe palate is well carbonated and medium bodied. Malt forward with a moderately intense background of pine and a mild bitterness with more malt on the finish. Standard west coat pale ale but it works.", "Not as fresh as I am used to it but what can you say, a decent Pale Ale. Crunshy, light malty with a flavoursome citrussy hop profile.", "12oz bottle from Tesco, Watford and drunk on 14/03/2006.  If it’s still fairly fresh, it’s a classic pale ale and so for good reason.  Always a great fall back beer and just a solid, reasonably bitter west coast pale.", "Not much to say except Sierra’s Pale Ale is an outstanding beer.  It poured a 1/4 inch head, had a honey color and had little to no aroma. Taste is near perfect.", "AROMA: Bajo aroma a maltas, lúpulos florales altos con notas cítricas de lúpulos del Nuevo Mundo. Ligeras notas de alcohol. Sin ésteres. APARIENCIA: Color cobrizo muy trasparente, espuma blanca de una retención media y no muy abundante. Sin piernas ni encajes. SABOR: Malta alta con notas de miel, amargor bajoy lúpulo medio con notas cítricas. Balance bastante equilibrado en el que la malta resiste al sabor lupulado. Final seco en el que se imponen los caracteres cítricos. Fermentación limpia. SENSACIONES EN BOCA: Cuerpo medio, carbonatación medio-baja con ligeras notas de calentamiento por el alcohol y una muy ligera astringencia causada por el lúpulo. Sin cremosidad. IMPRESIÓN GENERAL: Una muy buena cerveza, refrescante y sabrosa con un muiy agradable final en boca. Bebebilidad muy alta.", "Couleur miel ambrée, huileuse, transparente et limpide, elle arbore une belle mousse qui s'estompe peu à peu\nLe nez fait grande place aux résineux avec une légère touche de pamplemousse et de miel\nUne attaque très douce se profile pour donner le ton sur les résineux et le pamplemousse, quelques touches herbacées, de caramel, d'orange amère et de citra et une belle amertume finit par clore la mise en bouche\nTrès équilibrée, c'est une belle création qui est devenu désormais un classique de Sierra Nevada Brewing Company qui en fait une APA très bien maîtrisée et rafraîchissante, d'une simplicité et d'une efficacité étonnante, félicitations !", "Pours:  Cloudy dark amber, short foamy head\nNose: Hoppy crisp notes, some fruit\nCarbonation: medium\nFlavour: Light, crisp, slightly bitter but refreshing. Mild hops & lager flavour. Nothing too special", "Robe orange ambrée, mousse blanche qui se dissipe vite pour laisser un voile fin. Léger trouble à froid. Arômes caramel, biscuit, candi, agrumes orange résineux, herbal, floral, madérisé. Goût à l'amertume un peu marquée mais contrebalancée un peu plus fot par le sucré du cara. Texture fluide, un peu huileuse. Carbonatation très fine, un peu faible.\n\nUn classique, sans défaut.\n\nUn début d'oxydation malheureusement (DLUO 14/04/2020, bue le 21/11/2019)", "0,355ml bottle Livadi - orange Amber with a vanishing head - sweet with a bitterish finish - trad taste of something original", "Bottle from Waitrose on special offer. Had one of these years ago. It’s certainly lively. Foamy sherbet fizz on the tongue along with alcohol. Ultimately, it’s let down by a lingering saccharin aftertaste. Not nice.", "Piney, with some malty some balance. I like this, and will most certainly be buying this again. Its not the best by far, but totally drinkable and smooth. I see why it gets the high marks that does.", "Classical pale ale that took me to the american stylish beer world 10 years ago, it more about memories than a bottle of beer.", "Flot gylden klar farve. Lækkert skum.\nAroma: tropisk frugt - mango, citrus/grapefrugt og ananas.\nSmag: lækker maltprofil med sødme fra karamelmalt, der giver plads til bitterheden. Medium let fyldig krop og afbalanceret øl. Tør finish med en hængende bitterhed.", "Une pale  ale américaine classique que l on trouve facilement. Un goût incomparable, une de mes favorites !", "Juicy, relaxed pale ale with a lovely mouthfeel. Nothing that moves mountains but it's a great one for a Sunday evening. Good amount of bitterness.", "Tried from a german supermarket Sommel in dresden. It was still 9 months before expiration, but clearly oxidized stale, which i k ow are not characteristics of the beer.", "I was very curious how this famous beer it taste and was little exciting before drink it.. Also it has one awesome label outside and your imagination flying.\nAnyway the aroma remind me a lot the \"Belgium Pauwel Kwak\" beer and also little the colour.. The taste was something between \"Lager\" and some \"Belgium\" beer in the aftertaste.. The first mouthfeel was slightly bitter and remind you a lot \"Lager\" beers and the aftertaste was very malty and remind some \"Belgium\" beers like \"Leffe Blond\" and \"Pauwel kwak\".. This combination little trouble me but definitely i enjoy that beer despite is not my style.. I like more sweet beers and less bitter..\nOverall a very refreshing and good all around beer to drink but can't touch the stadards of some \"Belgium\" and \"German\" beers out there..", "Like the aroma, typical IPA. Also the package of the bottle. Popular, widely consumed here in TX.", "Can't believe I've never rated this, I've had it a few dozen times.  Solid, drinkable, workmanlike pale ale.  Good balance, clean finish.  Superlative.", "Bottle 355ml (weird I haven’t listed this yet...). Pale golden, a bit ”boring”, almost. White frothy head. Some light citrus and grass in the aroma, which feel somewhat weak. Taste fresh of citrus and resin but also rather malty sweet. Good go-to American Psle.", "Poured from 12oz bottle. Beautiful amber color with nice fluffy white head. Pine and flora aromas. Notes of pine, citrus, and biscuit madly in the flavor. Wonderful, refreshing pale ale that is not overwhelming (in a good way).", "Dunkles gelb, flacher schaum, schönes kräftiges hopfiges Pale Ale mit Kräuter und Frucht Noten schön herb, passt", "We did not smell anything so we were sceptical whether this could do us any good. But the tast was convincing and a long last in the back of the palate.", "Light fragrant aroma.  Pours a clear, dark amber/copper with a medium head that produces good lacing.  Well balanced flavour between the malt and hops, giving it a sweet, slightly grassy taste and subtle hoppy aftertaste.  Moderate carbonation. Nice and at 5.6% ABV it allows you to have a couple.  However, nothing outstanding.", "Good hoppy beer with overtones of zesty fruits but not that overwhelming. A well rounded IPA", "Aroma fra cascade humle, balansert bitterhet og malt sødme. God allround øl som passer til det meste. Muligens noe \"gammeldags\" og mye har skjedd på Pale Ale fronten etter den kom ut. Men den er absolutt verdt å smake på, den funker og den skremmer ingen. Den er lett å like.", "Average white head on top of a clear golden body. It smells fruity in ready, so like fruitcake? Great beer with lovely flavors, too bad I'm just not a fan of the style. It is more bitter than beers I prefer to drink, and I'm not a fan of the aftertaste. But it does have good flavors and a well-balanced and it's not killing my pallet like an IPA does so I'll give it higher marks", "Great go to standard American pale ale. Never a regret purchase. Not that a little sediment floaties is terrible, but ive never boughten this with any sediement ever. Its always crisp clean and refreshing.", "Copper color high carbonation thick soapy head citrusy fruity taste citrusy fruity smooth", "33cl bottle. Almost clear dark golden with a big off-white head. Citrus, caramel and grassy. Overall, nice but a bit watery.", "Belle robe orangée, transparente avec un col mousseux assez faible. Au nez c’est un peu herbeux mais faible. En bouche, un peu gazeux mais des notes boisées et herbacées assez soudaines. Attaque de réglisse et saveurs légèrement sucrées, plutôt caramélisées. Une amertume bien équilibrée qui accompagne l’arôme. Belle longueur de l’amertume. Un goût sucré en fin de bouche, curieux. Une bière intéressante", "How: bottle @ San Francisco. Fridge cold.\nHead: two finger, white\nColour: deep golden\nAroma: citrus fruits, some tropical fruits, berries, some grassyness.\nTaste: thin/medium body, lively carbonation, citrus fruits. Medium long citrusy aftertaste.\nA classic apa.", "you want my description of this? here it is...It tastes like 52 year old left over Brussels sprout piss water. The only enjoyment you'll get from this, is it's not actually piss. It tastes like a cat took a dump in the bottle, then it was left on a radiator for 15 years straight. Swamp water has a better blend than this swill. Drink moldy bong water left out in the sun to save you the trouble...", "Esta é uma cerveja leve, sente-se o gás. Amarga q.b., pronunciado no fim. Adorei", "Another one that I have surprisingly never rated. Drafts and bottles but most recently had this at a flyers game. Pours copper orange with medium head. Notes are perfect west coast old school hazy ipa. Oranges, pine, grapefruit, cracker, and a very bitter finish. Medium bodied. When fresh, this can be amazing.", "Lattina. Un arco olfattivo dominato dal fruttato. L'intensità olfattiva è normale e la maniera in cui permane è sufficiente. Il manto birroso superiore è caratterizzato da una schiuma che resiste abbastanza. La grandezza delle bollicine è medio-fine. Il liquido è di consistenza limpida e anche qui la grandezza delle bollicine è medio-fine. La carbonazione è persistente. Il colore è ramato. Il corpo è pieno. L'amaro è pronunciato. La forza gustativa è elevata e si prolunga in modo sufficiente. Il gusto è piacevole. Le sensazioni boccali finali risultano di birra beverina. Il retrogusto è di decente intensità. L'aroma in bocca porta i segni di miele, rabarbaro, luppolo, agrumi, mango e mora.", "Bottle.copper pour with off white head. bready malt with citrus note. Went down pretty good. Would buy again", "12 fl oz bottle. Interesting take on a classic pale ale style, quite distinct from the typical American pale ale, which boasts a sharper hop profile. Appearance of this brew is a clear amber, topped with a finger and a half of white froth which is fairly persistent. Aromas are floral hoppy with only a slight tinge of fruitiness, and malts. Tastes are dominated by sweet malts, caramel as it warms a bit, and more piney bitter as it gets even warmer. Again, quite a different hop profile here! Mouthfeel is nicely carbonated, decent, medium bodied.", "Bottle \n\nPours fairly clear amber with thin head. Aroma is light and floral. Slightly sweet and malty, hoppy with a little bitter finish, perfectly drinkable", "Seriously, I've not rated this before?!? It's still the malty and properly bitter yardstick by which all APAs are measured - and most are found wanting.", "This pale ale has an atractive, smooth smell of herbal hops mixed with tropical fruit. The taste is surprisingly bland, with slight hoppy bitterness. Otherwise it goes too much in the direction of a regular pilsner beer. Overall, this was disappointing.", "Bottle\n\nAroma is lightly lagery. \nSome sweetness/malt in the taste. Rasonably hoppy, decent.\nBody is nice, rich but not too hot. \nNice solid all rounder - possibly overrated for historic reasons?", "Miałem nie wrzucać zdjęć podczas wyjazdu, ale w sumie czemu nie, dziś absolutny klasyk, a dla mnie pierwszy kraft pity na wyspach.\nW aromacie zdecydowanie na pierwszym planie cytrusy, trochę zioła i żywica.\nSmakuje tak jak zapowiadał to aromat, cytrusowo-ziołowo. Goryczka średnia.\nLekkie i przyjemne piwo, nie ma tu nic wyszukanego, ale w styl wpisuje się idealnie.", "Lekkie, delikatnie tostowe, żywiczno - ziołowe, pijalne i dobrze zbalansowane.", "Where craft beer started.  Great example of a Pale Ale, if slightly on the heavier style.  Love the Cascade Hops and have been fortunate enough to tour the brewery.", "Grapefruit, delicate carbonation. Mellow bitter finish, very refreshing. Nice colour.", "Botella de 355 ml. Color dorado, espuma blanca abundante y retención media. Carbonatación media.\nAromas florales y herbales (pino). En boca es equilibrada, notas florales, algo cítrica y amargor medio. Redonda.", "Bottle poured in sniffer. \n\nAroma: Light pine, floral, tropical fruit. Not pungent scent, relatively subtle. Some degree of malt scent in beer.\n\nAppearance: copper color with white head, good head retention. Clear body with good lacing. \n\nFlavor: malty with piney flavor. Light bitterness. Some tropical fruit aroma, but mostly presenting a balanced flavor of malt and hop. Medium body in mouth, light hoppy aftertaste. Not sweet, slightly citrusy.  \n\nMouthfeel: The body is quite rich, and the finish is quite smooth. Medium level carbonation. Easy to drink. \n\nOverall: This is a great beginner pale ale to drink with low level of bitterness and a rich body.", "Found this super hoppy and full of flavours, the almost wet how are long and lingering on the palate.", "Аромат неплохой, во основе цитрусовый, хорошо ощущаются лимонные нотки, а после легкие травяные нотки американского хмеля. Цвет прозрачный хоть и с осадком, пенка очень кремовая, держиться крепко. Вкус питкий, цитрусовый, немного апельсина, лимон а также легкие елочные нотки. При глотке солод, снова немного елочных ноток, а также хмелевая и цитрусовая горчинка. Очень хорошое и гармоничное пиво. Порадоволо.", "En ljus och klar öl med en söt doft. Len och mild smak, men möjligen en aning tunn. Ingen överdriven stor beska utan mer söt syrlig smak med vissa grapefrukt och citrustoner. Sammanfattningsvis en god öl utan att det räcker till ett toppbetyg.", "Classic - perfectly balanced pale ale. Compare all other pale ales to this.", "Zapach średnio intensywny, słód, cytrusy, zioła, karmel, trawa. Kolor bursztynowy, klarowne. Piana średnio obfita, drobna, średnio trwała, lekki lacing. W smaku słodkie, średnia pełnia, słód, cytrusy, karmel, żywica, zioła, trawa. Goryczka niska, wysycenie średnie.", "bottle bring my collegue (budapest) orange colour, normal body, average carbonated, fruity smells, nice fruity taste, bittersweet, easy to drink, fresh & light", "Colore dorato e schiuma compatta, abbastanza fine. Al naso è molto intensa:si sentono dei frutti tropicali. Il corpo è pieno e al primo assaggio si sente una carbonatura importante. Poi prevalgono gli amari, anche se una certa dolcezza di miele rimane sul palato. La carbonatura porta ad una piacevole secchezza dopo l'assaggio. In pratica ti fa venire voglia di berne ancora un sorso..", "Traditional beer golden orange color. Smooth and hydrating mouth feel that travels in waves and silkens your mouth as it passes leaving a brink of bitterness in a medium aftertaste which is maybe a tad too strong for my liking. Beautiful.", "AR: Hopfen, kräuterig, karamell, Zitrus, Harz, Gras\nAP: klares bernstein/kupfer\nTA: Hopfen, kräuterig, karamell, Gras", "First of all, I am not an IPA guy. That being said, I find this beer rather enjoyable. The hoppiness is not over done and makes it fun and interesting for my taste buds. A pretty decent beer overall.", "Bottled at Eldorado Hotel and Spa, Santa Fe, New Mexico, USA. Really smooth pale ale, one of the best session ales of this trip.", "Aroma ha una buona quantità di carattere di luppolo fragrante, un po 'fruttato, un leggero ananas", "One of my favourite beers of it’s type, with a delightful gold to amber colour, with a slight haze to it. Plenty of citra on the palate with a hint of bitterness, making for a wonderful pale ale that goes down without a hitch.", "Nice dark golden color with a slightly hazy appearance. Nice taste that epitomizes an IPA for me. Long lasting hops after taste. Overall a nice IPA.", "Pours amber with a thick white head. Citra notes on the nose, hops dominate. Taste is malty, nicely layered hops on the tongue. The palate contains very slight notes of pine resin as well as a nice array of hops on the nose. This is the baseline by which all other IPAs are judged.", "0.355 l bottle. Pours clear deep golden with decent head. A: malty, fruity,  T: medium saturation, medium body, malty, Bitter, smooth, citrusy, nice balance between malts and hops which brings good drinkability.", "Pours a clear golden to amber colour, medium head with average retention and nice lacing, soft carbonation. Nose is sweet malt, melon, honey. Flavour is medium sweet and bitter, round mouthfeel, pale malt, hop with some fruity notes. Very drinkable and as always very impressed with Sierra Nevada's commitment to quality.", "Bottle. Floral hop aroma with notes of caramel malt and grapefruit citrus. Pours clear amber colored with a half a finger of off white head that has excellent retention and good lacing. Starts with caramel malt and grapefruit citrus flavors. Finishes dry with some bitter floral hop flavors. Solid pale.", "Könnte von den sehr runden Aromen gerne etwas mehr haben. Tropische Frucht, Zitrus, leicht malzig süß und frisch grasiger Hopfen. Minimal bitter. Wirkt leider etwas wässrig.", "Pite z butelki, fajna etykieta. Aromat nikly, słaby. W Sanoku już lepiej, czuć goryczkę, chmiel, żywica. Pijalne, bardzo przystępne piwo", "Bottle pour to IPA glass. Light brown pour solid butter-colored head. Malt and light citrus hops in the nose. Taste is well balanced between malt and hops. Light to medium body. Crisp finish. Not surprising that this is a popular IPA. Nothing here to offend although nothing jumps out in any way.", "Smooth and hoppy light ale. Great bottle art and brand recognition. The brand is highly sustainable and quality-first focused.", "355ml bottle. Pours light amber. Aroma of slightly black sweet malts and fruity hops. Taste is also a very nice blend of caramel malts and mild/medium hoppy bitterness which gives it a nice crisp feel. Well balanced pale ale. Very nice!", "Bottle.Clear orange appearance with bubbly white head. Hoppy and citrus aroma and flavour,", "*DaveFave* top three of my IPAs very laid back and cool beer. Not extremely popular but reserved for good times. Will pack a punch of alcohol and hops.", "Light Amber color medium persistent neck. Good lacing. Nose pleasant, but some sweetness. Light body medium body, with a remarkable pleasant  bitter after taste. Tasty beer to me with a medium long run drinkability.", "Jolie robe translucide, ambrée avec des teintes de blond.\nMousse éphémère et blanche avec de légères teintes d'orange.\nNez léger floral et houblonné.\nToute petite carbonatation.\nBouche houblonnée par le bon Citra on ressent une sensation proche de l'IPA en plus légère et douce.", "Gefunden in einem Supermarkt am Westbahnhof Wien. \nEs ist ein typisch amerikanisches Bier. Weniger tiefgründige Süffigkeit, aber eine frische Hopfigkeit. Dadurch erzeugt es einen fein erfrischenden, leicht fruchtigen Geschmack.\nEin Bier das so richtiges West-Coast-feeling erzeugt. Mit ordentlich Aromahopfen und ausgewogenen, herben Aromen.", "355 ml bottle. Clear golden to amber colour, medium head with average durability, fair lacing, soft carbonation. Nose is sweet malt, melon, honey. Flavour is medium sweet and bitter, round mouthfeel, pale malt, hop with only minimal fruity notes. High drinkability, a classical one!", "Earlier Rating: 1/11/2019 Total Score: 3.6\nEarlier Rating: 1/11/2019 Total Score: 3.6\nEarlier Rating: 1/11/2019 Total Score: 3.6", "Bottle. Citrus and lychee hop aroma. Golden, amber foam. Medium light mellow body. Light sugar sirup and resin sweetness, classic citric, grass and lychee hop finish.", "Garrafa. Coloração vai do dourado envelhicido ao cobre. Espuma de boa formação e retenção ok para o estilo.  Aroma é discreto, maltado com nuance cítrica/pinho. Sabor acompanha o aroma. Carbonatação leve/média. Final com leve adstringência. Aftertaste equilibrado e agradável.", "La brasserie Sierra Nevada sait réellement faire de belles bières équilibrées et agréables. C’est la troisième que je teste, et celle-ci est dans la même veine que les deux premières avec une jolie amertume accompagnée d’arômes fruités et quelque peu épicés l’accompagnant de fort belle manière. Surtout que celle-ci a également un titrage alcoolique limité, à 5,8 % ici. Sur la longueur, nous avons également la même limite avec une final un peu court. Mais bière très plaisante au global. En verre, nous sommes sur une robe blond doré avec aucune mousse à sa surface. Aux nez, les arômes d’orange, de pomme, de miel, légèrement herbacés sont très appréciables. L’attaque est d’un bel équilibre en amertume et malt, entre fraîcheur et douceur. On y retrouve le nez avec des épices en complément. La deuxième bouche prend bien le palais avec une bonne complexité et un poivre qui arrive donnant un peu de caractère. L’arrière bouche est pour sa part plus amère et tranche bien (IBU de 38 pour une impression légèrement supérieure). Le final parachève bien la dégustation, davantage sur les agrumes et sur un bon élancement. Celui-ci est toutefois un peu court. Belle réalisation.", "Příjemná lehká vůně. V chuti sladový nástup přecházející v střední hořkost (taková ta typická cascada), tělo plné, říz přiměřený stylu. Pitelnost vysoká.", "Color ámbar con tonos dorados y naranja. Espuma blanca y abundante de buena retención. Carbonatacion media.\nEl aroma es uno de sus puntos fuertes, muy floral con notas a pino y resina.\nEl sabor sigue la línea del aroma, con más pesencia de la malta, notas a cítricos (algo de limón y pomelo), y un final amargo muy característico de Sierra Nevada (pino y resina). Me recuerda a la torpedo pero en versión más suave. Muy equilibrada, aromática y refrescante.", "Aroma grass some malt. The taste is very straightforward in its simple hoppy and slightly malty flavour, but it has depth and stays beautifully on the palate. Good no messing beer.", "Enfin après de si longues années goutée en pression grâce a l'attrait mousse.\n\nUn \"must drink\"", "Nice easy drinker with a bitter taste. If you like the taste of IPA but not as bitter and easier to drink, this is what you want. Can smack a sixer of this", "7 mois avant DLC avec Mikabrel. Arôme fruité très agréable et également résineux. En bouche, résineuse et fruitée. De l'amertume et le tout tres bien équilibré. Une très bonne bière !", "Enjoyed: Poured from a bottle into shaker glass.\nAppearance: Deep amber colour; small head. \nAroma: Malt, caramel, hops, fruits.\nPalate: Full body; gentle carbonation.\nTaste: Malt, caramel, bittersweet, hops, bitter aftertaste.\t\nOverall impression: Nice fragrance, well-balanced, very enjopyable. Nice label.", "Fine carbonation, pillowy light off white head. Aromas of tropical fruits and light toffee notes develop. Briskly sweet with a solid hop bit and a light dryness on the back of the palate.", "Flaska 355 ml från Systembolaget. Guldfärgad och lite disig  med fint skum. Doft av hymle,torkad frukt och apelsin. Smak av humle, aprikos, apelsin, honung och tallbarr. Tydlig beska.", "Bottle at Slakter Sørensen. Clear amber, weak white head. Fruit, citrus, caramel. Light bitter, light sweet. Bubbly. Good one", "Dal colore ambrato carico tendente all'arancio. Aroma luppolato ed agrumato abbastanza pronunciato. Al palato note agrumate con amaro leggermente presente. Una birra discreta.", "Bottle. Pours golden color. Aroma of citrus, pine, malts, caramel, sweetness. Medium body, not very bitter. Good balanced APA, fruity, easy beer but still has some taste in it.", "Nice dark golden colour with thin white head and persistent lacing. Aroma of apricot and caramel malt. Minimal bitterness, satisfying malt, restrained pine resin spice and citrus. Very balanced, very drinkable, not particularly exciting but very reliable.", "Trovo questa birra al supermercato e decido di provarla ...la birra ha un colore ambrato e la schiuma non è corposa...non ha molti sapori forti e si beve volentieri", "12 oz bottle. Smells of malts with a fleeting hint of citrus. Reminds me of how some lagers smell. Very clear with a warm orangish amber color. Tastes of barley malt, the hops are there, but don;t stand out. The sweet and the bitter neutralize one another. Good balance, but with the good balance nothing really stands out to me. Very neutral and clean finish, a bit of bitter. Not a favorite, but a solid beer nevertheless. Quite an easy drinker.", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "Pale Ale de cabecera, siempre es bueno resetearse con estos clasicos, para recordarte la cantidad de mala birra que se hace, ojo tambien hay muy buenas, cerveza fiel al estilo, una gran Pale Ale, eternamente buena.", "Bottle poured into my tulip glass.   Deep caramel gold with a two finger head.   Aroma is floral and pine.  Taste is deep pine,  caramel,  grapefruit, and floral notes.   Assertive finish.  Always a good beer", "Pours clear, vivid golden colour with white head. Aroma has a good amount of fragrant hop character, a bit fruity, slight pine. Some biscuity and caramel malt in the background. Flavour is pretty balanced - quite a bit of malt sweetness coming through at first, and then it finishes with a nice bitterness.", "Robe ambrée limpide, mousse assez faible carbo normale. Nez de houblon fruité, légèrement du malt grillé. En bouche, l'attaque est légèrement corpulente, vite suivi par le fruité du houblon, amertume assez légère. Très bel équilibre, du corps mais facile à boire: de la fleur, du fruit, un léger côté torréfié, texture agréable (un peu de rondeur, sucrosité agréable et légère). Pas mal.", "Bottle. Pours clear deep golden colour, white head stays. Aroma is fruity, hoppy, grassy, melony. Taste is fruity, hoppt, malty. Medium body, average carbonation. Decent fruity APA", "355ml bottle. I was slower than most of the UK getting to Sierra Nevada but it was worth the wait. Golden colour, taste of digestive biscuits and caramel. A very nice beer for warm weather. Won't leave it so long in future.", "Bottle. Pours copper color with off-white head and some lacing. Light bread malt with some pine and grapefruit notes. Bready Malt with some caramel and pine and grapefruit hop notes. Medium-light body.", "Rather more restrained, malty and 'English' than its reputation might lead you to expect - but I enjoy that. The highlight is the way a tasteful dose of bitterness is packaged - preceded by a wee hint of sweetness and followed by a tiny dry cheerio. Can be enjoyed at a somewhat lower temperature than a typical English bitter, a trait that can be welcome in hot weather.", "Bouteille 35.5cl le 09/10/2018. Verre saveur bière. DDM : 12/02/2019.\r\n\r\nMousse : Blanche, grosses bulles, s’estompe rapidement.\r\nLiquide : Orange-ambré, quelques particules en suspensions.\r\nNez : Pin, florale, fruité, agrumes, malt.\r\nBouche : Fruité, florale, caramel, malt, amertume.\r\nPalais : Equilibré, longueur sur l’amertume.", "So dignified and respectable that you give it a fair bit of leeway, like when a respected artist does something ironically, any hints of abrupt sweetness are edgy, intriguing, and so artful\n\n---Rated via Beer Buddy for iPhone", "0,35l can. Pours pretty clear amber/dark golden with white head. Aroma of citrus, spruce, very fruity (apples, passion fruit). Taste is fruity and bitter, with the bitterness taking over in the finish.", "又到假期 🇰🇷釜山的第一天遭遇台风 在南浦洞的乐天玛特看到这款加州淡爱尔 没去过美国 但闻名已久 入口带苦 但了苦味很特别 嘴巴里余音缭绕的感觉 很不错哦", "Poured into pint glass from 16oz tallboy. \r\n\r\nPale gold color, rocky head that quickly shrinks. \r\n\r\naroma is incredibly piney, so piney that it makes you feel like your sitting under an evergreen tree. \r\n\r\nTaste starts with sharp bitterniss that gives way to pine from the cascade hops. Finishes with mild sweetness with a hang that hints of caramel.", "En aroma se aprecian tenues notas florales y a lúpulo, incluso se logra distinguir cierto carácter cítrico, sin embargo también encontramos algo de maltocidad y caramelo. En boca es redonda y balanceada, no hay una predominancia muy marcada entre el carácter maltoso y lupulado, más bien hay perfecta harmonía, dulzor marcado y de amargor leve, retro gusto prolongado y agradable.", "Bottle, 0.355l. Cloudy copper pour, one finger frothy off-white head. Low to medium retention, broken lacing on the glass. Herbal and grassy nose with notes of citrus.\r\n\r\nThin to medium body, medium to high carbonation. Prickly mouthfeel, average texture. Moderately bitter taste. Aroma of herbs, grassy hops, grains. Pilsner-like malts in the background, notes of pine and citrus fruits. Herbal grainy aftertaste. Medium lasting finish, a bit dry and mildly bitter. \r\n\r\nOverall, pretty good thirst quencher. Refreshing and nicely balanced.", "Personlig favorit det har kanske kommit godare men denna pale ale har en fin balans mellan de ljusa citrus tonerna och en god beska. Fint skum en kort tid så drick direkt inte för kall sådd får känna beskan.", "Espuma blanquecina cremosa y permanente, color dorado anaranjado bastante transparente y con bastantes burbujas brotando constantemente, aroma dulce, sabor potente y complejo fresco y cítrico de inicio con un final agradable.", "Une pale blonde bien équilibrée. Une mousse persistance, une belle couleur bonde. Une bière très rafraîchissante à la limite d'une lager. un excellent équilibre avec une amertume pas trop poussée. Une bière qui se boit facilement. Un corps léger sans sucre. Bref, à recommander, belle et bonne bière américaine qui vaut largement et dépasse certaines ales européennes.", "Nice gold colour with white head. Pleasant aroma - tropical fruits with flowers. Aroma completes the taste. Taste is nice and fruity. It' smooth. Nice, drinkable beer.", "Bottle from Co Op, at home, 8th September 18. Pours a dark amber. Aroma is citrus, slight caramel. Taste is citrus, floral, grapefruit. It's nice and easy drinking. Can't believe I hadn't review this one before.", "Bottle. Very drinkable, flavoursome with citrus  notes, crisp and not overly bitter.", "Bottle, crisp Pale Ale. Pours out a clear straw colour with a thick head that dissipates quickly. Smell of resin and citrus and hop forward taste. Thin texture and quite lively (although that may have had something to do with the walk back from the shops)", "Can from McCambridge's. Pours a deep golden amber with a nice white head that holds as a film. Gorgeous resiny nose, pine and acetate. Medium caramel sweetness, light-medium bitterness. Fairly lively carbonation, medium mouthfeel, and a lingering caramel finish. Old trusty APA. \nEarlier Rating: 12/29/2012 Total Score: 3.9\n330ml bottle, chilled. Pours amber with an appealingly frothy but thin white head. Nice bitter aroma. Citrus flavour, hints of butterscotch and herbs. Goes down very smoothly, without the sharp palate of some pale ales. Very refreshing and very drinkable.", "Botella de 355ml de Hipercor.\n\nColor ámbar intenso con burbuja media de color blanco y cierta retención de la cabeza. Sin turbidez. Pequeños restos de levadura. \n\nAroma a malta caramelo y lúpulo floral. \n\nSabor dulce a malta caramelo con un pequeño toque floral del lúpulo. Seguramente fresca tenga mucha mayor intensidad de lúpulo. Carbonatacion baja para el estilo. \n\nAmargor moderado y prolongado. \n\nLo cierto es que esperaba mucho más de este clásico pero es probable que haya sufrido mucho en el transporte. Habría que probarla más fresca.", "Tök Életes pélél olyan mintha indián lenne de mégsem az. Gyönyörű habszerkezet csodaltos színezet Finom íz", "Couleur blonde et un peu opaque. Odeur assez faiblement citronnée. Bien présente en bouche par sa rondeur. Un peu houblonnée par sa légère amertume mais peu fruitée. Se distingue par ses levures mais reste une blonde qui se démarque peu.", "An original classic. This beer helped launch the craft beer revolution. Still a very solid, very drinkable, full flavor pale ale. Nothing overbearing. A perfectly balanced example.", "More Kölsch than pale ale. Strong foam. In the nose typical ale aromas, but no fruit and differentiated. Barely bitterness. The last sip is pleasantly.", "Très belle couleur, cette bière est pas mal mais pas dingue non plus. Une apa plutot sympa.", "Awesome if you like your Pale Ales to the bitter side, could of mistaken this for an IPA if I hadn't known what I was drinking.", "Bottle, bought for me as a Xmas present. Deeper amber with a head. Strong tasting pale ale maintaining a good fruitiness to a good full-bodied dryish taste.", "Bottle at home in uk. Hazy pale ale thin white head lightly hoppy straw wheat notes", "Ocena na podstawie wspomnień z degustacji na potrzeby uzupełnienia profilu.", "It seems as if this beer was a classic. It is a very correct beer, without excesses, balanced, with the standars of the style. A good beer that is allowed to drink. For me, too simple.", "Deep golden color with white head.\r\nAroma: caramel, malt\r\nTaste: medium bitter", "Ar: Toasted caramel, orange rind, and grapefruit; black pepper and flowers. Ap: Orange and clear; large off-white head with phenomenal retention, sticking around as a cap that looks like thick marshmallow fluff. T: Crab apples, dough, and a bit of caramel; medium-low sweetness; zesty grapefruit rind; dried pineapple; bitterness is medium slightly edgy; flowers and a little pine; finish is toast and a bit of butterscotch. P: Medium body with medium-high carbonation; medium-dry finish. O: \"The\" classic American pale ale; a medium-intensity male backbone with a nice grip of floral and citrus-rind hop flavor.", "En copa, cerveza ámbar con una fina capa de espuma blanca. Aroma muy ligero y dulzón, principalmente a flores y hierba. En boca, muy ligera donde predomina principalmente la malta de cereal poco tostado. De paladar bastante dulce, poco amarga y un muy suave toque picante. Una Pale Ale apta para aquellos que busquen cervezas sencillas y fáciles de beber.", "Bière légèrement rousse avec une mousse blanche assez compacte. Au nez un peu herbeuses, légèrement sur le métal. Belle pétillance, un peu d'amertume sur le côté de la langue, bière assez claire, le goût passe assez vite tout en laissant cette petite amertume en fond de bouche. La pétillance ne reste pas exceptionnelle au fur et à mesure de la dégustation, elle est pas mauvaise, mais pas exceptionnelle non plus", "Bottle 355ml at home. BBE 2018-12-22. From Alko. Pours clear golden with off white head. Malts, caramel, fruity hops, mild grapefruit. Medium body and average carbonation. \n\nOriginal rating 7-3-7-3-14 from bottle 355ml at home 2011-05-08.", "Botella,Color Ambar,turbia,espuma fina,alta,media resistencia. Muy aromatica no es ,esta bastante suave, malta,citrico,floral.Sabor- malta,citrico,floral,ligero amargor", "Kesinlikle iyi bir American Pale Ale örneği. Koyu altın sarısı renge sahip. Güzel bisküvimsi malt tadlarıyla birlikte limon ve portakal tadı alınıyor. Hafif bir acılığa sahip. Orta gövdeli ve gazlılığı yüksek.", "Bottle at Budapest. Slightly hazy golden with white head. The aroma has notes of citrus (orange), herbal tea and some maltiness. Bitter and moderate sweet flavor with notes of citrus (orange), herbal tea, piney, grassy, malt and some caramel. Medium-bodied.", "Fles 35,5cl thuis. Wat citrus, bitters, fris. Redelijk beschaafd. (9-2016).", "a good IPA after cutting the lawn on a hot day,at 1.49 a pint it is reasonably priced,it is not a typical beer for me,as it is more like a IPA light,but not a session pale ale,it clocks in at a 5.6\r\nabv,overall a good light IPA,but not like what i call (a typical beer)which is the stronger torpedo...a good hot day beer never the less", "Sierra Nevada Pale Ale pours cloudy pale amber and sports a frothy and firm off-white head with big bubbles of medium lifespan. The wonderful bouquet is crisp and full of cascade hops with its typical citric goodness, notes of a bunch of flowers, pine needles, and some spiciness on a caramel malt base. The citrus note in the nose is accentuated by the bitterness on the palate and turns into a grapefruit note, supported by floral and pine notes, while the semi-sweet malts are thick yet contained and allow the hops to fully develop their flavors. The bitterness, which is strong on the mid-palate, decreases very slowly in the clean, dry finish, wherein the alcohol glow is well hidden. The medium-high carbonation adds nicely to the crispness. Definitely an American pale ale benchmark.", "Really nice light beer. Crisp. Slightly sweet. Citrusy, like Blue Moon.Should be great with seafood or light pasta.", "à la maison. Bière qui désaltère mais qui qui manque clairement de caractère. Plus complexe qu'une lager mais insuffisant pour rester en mémoire.", "Gold to amber bottle at Kuad Beer. Malt aroma with herbs. Medium bitter and earthy test. Low carbonated and not dry finish", "Сбалансированное, со скромным вкусом и ароматом и почему-то сильным мыльным послевкусием...", "Hvala prijatelju Goranu iz picerija Viva u Sibeniku na ovom pivu... Ok pivo ..pitko i osjeti se hmelj...", "An amazing beer in its time but now superseded by many better ones. Still very refreshing though. Not too hoppy and quite malty and packs a bit of a pinch at 5.6%. Light mandarin orange background and pretty quaffable", "Bottle from system. A decent ale and a big history behind it. Nothing remarkable (16/4/18)\n----\nBottle from Systembolaget via Martin. The taste brings back good memories of feeling bouji at the white Hart pub in Waterloo. Some macro details but an easy drinking classic American ipa. Kept at 3.6.", "Bottle at home bought from a local supermarket. Is an okay pale but is so old school now. Lacks hops and lacks flavour but is a fairly good beer", "355ml bottle. Clear amber beer with sweet taste changing to a slight bitterness. No real hop aroma or taste, but solid malt. No carbonation, but a nice head", "Pours a clear, deep gold/light amber coloration with a medium, fizzy head. Smells faintly of biscuity, bready malt, with a certain graininess coming through as well and the merest hint of citrus and pine. Taste is a good balance of biscuity malt and citrus hops, with just a hint of pine coming through and an underlaying grainy and slightly flowery note. Finishes with crisp, light/medium bitterness. Smooth mouthfeel with a light/medium body and medium carbonation. I wasn't gonna review this as first, as my bottle is a good six months old. However, reading the other reviews and knowing that SN are actually masters of brewing beers that keep well, I feel that the beer is actually supposed to have this slightly understated malt/hop presence, which is kind of typical of a classic, old school Pale Ale, I suppose. It's well balanced, crisp and easy-drinking, but lacks a certain bite and doesn't really seem that special. Maybe it really is better fresh, who knows.", "Found in bottle from ingles in Franklin, NC. Just a good solid pale ale. A little less hopped than the average but still very enjoyable. My go to mid spring beer.", "flasa z tesca. velmi prijemna svieza vona. medova mierne kalna farba. pena nedrzi. chut horkasta emne sadka vyrazna prijemna. na konci ostava.", "Schiuma panna! molto beverina , caramellata pale ale facile da bere!! Amabile e non picchia sul palato. Da gustare... una delle migliori Pale ale!!", "El borrador de SNPA en todos los otros lugares es una receta diferente y se enumera por separado.\r\nSierra Nevada Pale Ale es un delicioso ejemplo del clásico estilo pale ale. Tiene un color ámbar profundo y un carácter excepcionalmente corpulento y complejo. El aroma fragante y el sabor picante son el resultado del uso generoso de los mejores lúpulos Cascade. <P> Botella acondicionada.\r\nIBU: 37\r\nSaltos amargos: Magnum & Perle\r\nFinishing Hops: Cascade\r\nMaltas: dos filas pálido y caramelo", "Piney nose, with some flowery notes. Orange and tangerine notes as it breathes. Medium body, moderate malty sweetness. Pleasant bitterness with a nice hop flavor. Bitter finish with no harshness. Well-balanced pale ale that's not overdone in alcohol or bitterness.", "Smels like old polish beer from nineties. Lot of malts and that is all. Stron bitter taste, more like IPA then APA, bitterness and then some malts. Nothing special at all. This is one dimension beer.", "An excellent beer. Sweet and hoppy. Also widely available in pubs and shops.", "One of my favourite American Pale Ales. Some might argue there are better out there, but from the supermarket shelf? Not so many. And it's a good seller, so it's never old in the bottle. I like it more and more as time goes by, because of the wonderful fruity, apricot aroma that comes off it, which I have come to savour while drinking. Nose and mouth just combine perfectly in SNPA. It's a properly refreshing drink too, so it's a bottle of this I'll pick up when I'm hot from working. It's not weak flavoured--you can taste the citrusy hops and the honeyish malts clearly--but it doesn't challenge with too much bitterness or metallic undercurrents--there's a purity to this well-brewed classic. Mouthfeel is crisp but somehow rich and rounded too. My only complaint is this is so drinkable, the bottle's empty before you know it.", "Flaske. Klar gylden let orange, tyndt skum. Lidt humlet frugtagtig aroma. Tør humlet smag, lidt frugt, citrus, rund eftersmag.", "teminstehoudbaarteeinde;2018-05-10_aroma en smaak van limoen;zachte citrus misschien grapefruit,prikkelend bittertje als in co2,nat/droog in de nadronk;aardig", "330ml bottle from the shop, drunk at home. Pours clear with a minimal frothy head that settled fast, light lacing, no bead. Brilliant orange, almost copper colour. Faint fruit aroma with citrus and hints of flowers and cereal. Fairly flat in the mouth releasing citrus flavours led by orange and tangerine over a base of caramel malts, bitterness from the front of the palate, but never intrusive, no real sweetness, finishing crisp and dry. Overall, a lightly citrusy IPA, but refreshing.", "My benchmark for pale ales. Orange and baked pineapple (carrot cake) on the nose. Very refreshing taste, perfect carbonation, orange wafers, with hints of passion fruit, marmalade toast, bit of malt near the end.", "Golden color with nice head.\nAroma is malty with hoppy notes.\nTaste follows the aroma. Both malt and hops well balanced.", "15-03-18 // bottle at Sixites mainz. Pours an almost clear golden orange beer with a small to medium sized foamy head. Nose of sweet malts paired with fruity hops. Body is medium sweet malty followed by a mild fruity, grassy, citrus hop flavourness. Finishes with a medium bitter, medium lasting bitterness. Classic pale ale.", "Fľaška z Tesca vo výpredaji :-) pekná farba aj vôňa. Chuť celkom prebíja dosť veľa oxidu.", "Prakticky tady přidávám tento komentář, jen aby tady něco bylo, protože zpětně dopisuji 900 piv z mého seznamu a asi bych se musel u toho zbláznit.", "I love this beer so much — tastes like home. I served this beer at my wedding. The bite of the fragrant cascade hops comes through in a gorgeous and classic way. All other pale ales pale (har har) in comparison.", "355ml bottle. Pours clear golden with small white head. Aroma of malts, citrus, cereal, hops. Medium to light body with soft carbonation. Taste is light sweet, light bitter.", "Flasticka z tesca. Vona sladkasta karamelovo chmelova. Farba tmavsia zlatista. Chut jemne horkasta.", "Bottle. Golden colour, good amount of head. Slightly floral aroma. Tastes 'crisp' with just a hint of bitterness/sweetness. Overall a pretty good, inoffensive tasting pale ale.", "(miel, nez pomme/raisin, bouche amère, hop (cascade) remarquable, du fruit-floral, malté, modeste & complexe)", "A hell of a beer, floral on the nose and sweet to the taste. Bags of flavour without being overpowering. Thankfully worthy of the legend", "Draft SNPA at all other locations is a different recipe and is listed separately.\r\nSierra Nevada Pale Ale is a delightful example of the classic pale ale style. It has a deep amber color and a exceptionally full-bodied, complex character. The fragrant bouquet and spicy flavor are the results of the generous use of the best Cascade hops.<P> Bottle Conditioned.\r\nIBUs: 37", "I don't give a crap if your local microbrewery brews only a few barrels at a time. Sierra nevadas ipa is better. DEAL WITH IT!!!!!! 'Lil microbrews would give their right arm not only to sell as much but also to taste of as high quality ingredients . I live in Portland, the best beer city on the planet (look it up) and this California beer cannot be beat in domestic ipa's. \n\n---Rated via Beer Buddy for iPhone", "Pivo u flaši. \r\nPopijeno u Stella Beer2Go dućanu i kušaoni piva u Medulinu .\r\nZa ovo pivo se drži da je prva American Pale Ale piva koja se počela proizvoditi u značajnijoj količini ! \r\n\r\nZa baš prvu modernu American Pale Ale pivu Michael Jackson je postavio Anchorovu...a opet spominje se i New Albionov Ale . \r\nZnači kad pijete jedno od tih piva , ustvari pijete najznačajnija piva u 'povijesti' Craft pivarstva. \r\n\r\nDakle to moraš  probati da vidiš kako je sve počelo i gdje smo sada  !\r\nTa APA je i dalje vrlo popularna u Americi. \r\nP. S. Namjerno nisam ništa pisao o aromi i okusima ;)", "Bottled version. Managed to find it in a supermarket. Medium white head, deep amber in colour, darker than most American Pale Ale's, slightly hazy. As hoppy as you would expect, not too much so. A simpler taste, slightly bitter, an easy drink.", "Pours amber red with a one finger thick white head. Clearly bottle conditioned.\r\nVery weak malty aroma, a bit of skunkyness.\r\nQuite bitter taste, distant citrus tones and a long lasting liquorice in the back of the tongue.\r\nGets a tiny bit sweeter warming.\r\nMedium body and carbonation.\r\nA bit too old I guess, but not so bad coming from a supermaket.", "One of the best beers I could get from a convenience store. Would most likely get again.", "citrus, herbs, clear, pale, amber, brown, white foam, minimal head, medium sweetness, medium bitterness, lightly sour, light body, medium body, average carbonation, soft carbonation, bitter,", "Molto buona. Splendida luppolatura, fresca e dissetante. Voto personale 8.7/10.", "Golden colour with stable white head. Smell of citruses. In taste mostly pine and grapefruit. Lighter to medium bitterness. Nothing special to remember but it is better than average.", "355 ml, can conditioned, BB 11.10.18. Old friend revisited, pours a slightly hazy golden amber, medium off-white head, medium low carbonation, lots of sediments, a few big chunks. Aromas of bread, malt and citrusy hops. Flavours of pale malts, citrus and pine. Bitter, semi-dry mouthfeel. Very nice product.", "Pours a clear dark golden colour with a decent sized white head which is retained well. Aromas are big New World Hop driven; citrus, grapefruit and pine. Taste is medium bodied, hop forward with a nice piney hop punch which leaves a clean bitterness behind at the end but with enough malt character in there too with flavours of caramel and a slightly fruity character with the citrus elements. Fantastic beer, one of my go to beers for the American IPA style.", "355ml bottle from Beeromtr in Moscow. Pours clear gold with a medium-sized iff white head. Aroma is pine, citrus. Taste is caramel, grapefruit, medium bitterness. Really nice.", "medium white head, golden copper bronze coloured body, fruity peach strawberries sweet hops malts smell, medium to high co2 medium to high bitter malts citrus some sweet floral a bit acid taste", "Ottima birra Californiana, dal profumo fresco e dolce di fiori e miele. abbastanza leggera: 5,6% di alcol,  il gusto è inizialmente dolce e ben bilanciato, il finale vira leggermente verso l'amaro.", "Has a bitter taste to me I do not like dark beer I don’t mind Heineken it not as bitter \n\n---Rated via Beer Buddy for iPhone", "12/25/17: 12 Ounce Bottle @ The Cosmopolitan $1 Tip playing video poker. Had this beer dozens of times, never knew I haven't rated in the past. Amber pour with white head. Beautiful hops aroma, love the aroma and taste. Nice balance of hops and malt, bitter and pleasant. Very solid mouth feel, carbonation holds well, firm going down. Overall very good Pale Ale, well done Sierra Nevada!", "355ml bottle as gift. Pours clear honey colour. Nose is malt with citrus fruit. Taste is malty, quite bitter, hops, pine, citrus. Not life-changing but pretty nice. really. This was the first IPA I discovered in UK supermarkets - stopped me drinking rancid larger a few years ago!", "0,355 l bottle. Pours clear amber with big frothy off white head. Aroma is very malty with some caramel and flowery hop note, a bit of pollen. Taste is light sweet and light to medium bitter. Finish is long, pleasant spicy and grassy lingering bitterness. I expected more citrus hop character. Very drinkable and nicely rounded.", "12 oz. bottle. Pours orange-amber with an off-white head. Aroma of mild citrus, caramel, floral notes. Taste follows nose. Decent.", "Golden/orange color, medium sized white head. Aromas of citrus, bread, hops and grass. Slight bitter taste with malt, citrus and grass. Boring.", "Colore ambrato, cristallina. Schiuma bianca soffice e persistente. Profumi non particolarmente evidenti, leggermente erbacei. In bocca è davvero delicata e ben equilibrata. Fresca e dissetante.", "ABV - 5.6\n\n.Appearance: Clear Amber, white head. \n\n.Aroma: Citrus, pine, malty balance. \n\n.Taste: Sweet malt, caramel upfront. Balanced by citrusy, pine hop characteristics. Very soft bitterness. \n\n.Mouthfeel: Medium body, clean, easy drinking. \n\n.Overall: B.", "Very good taste and easy drink to bare. Rated it as a good beer and recommend this to all\n\n---Rated via Beer Buddy for iPhone", "Dark amber pour with a frothy white head.Clean and fruity aroma.  Some pine and hops; perhaps a little apricot and grapefruit. Taste follows nose. Excellent pale ale.  Pops with fruity flavor and hops without being even slightly overpowering. Great beer between an IPA and APA.", "Poured from a 355 bottle into a glass mug. Didn't appear to be bottle conditioned which it usually is. There was no sediment in the bottle. It's a pretty average American pale ale. Given the choice i would much rather have Dale's pale ale but it is very refreshing and easy to drink but the hops didn't seem to be present at all compared to when I have had it in the past and it has been bottle conditioned. I hope they haven't abandoned bottle conditioning their beers it's ruining a classic American pale ale!", "From 12 oz bottle, packed on 10/05/17. Pours amber with the nice white head. Good lacing. Nice aroma of hops. that quickly disappears after a bottle is opened. Medium body, well carbonated. Average pale ale.", "Can at Armadillo, Gatwick Airport on the way to the Xmas markets in Basel. Nice, strong, hoppy ale. Great with a Rio Rancho burger!", "Obviously IPA's are very hoppy, which in my opinion can really ruin the flavor of a beer. It's not a good tasting beer when you drown it in hops like this. You don't get any other flavors but hops. \n\n---Rated via Beer Buddy for iPhone", "Pours somewhat foggy orange/gold with a 2 finger head which lasts a little while and leaves good lacing. Smells of caramel, malt, pine, and vague citrus. Tastes all match with scent with citrus fleshing out into tangerine/mandarin orange flavor. Somewhat spicy throughout. Leaves a strangely sweet but piney aftertaste that is not very good. It is good, but did not live up to the hype promised by its name value.", "Flasche 0,355l: Bernstein, leicht rotstichig, klar, mäßig stabiler mittelporiger Schaum; frische + fruchtige Nase, kräftig Malz, etwas Malzzucker, Karamell, deutliche Hopfennoten, dunkle Früchte, leichte Hefearomen; fruchtiger + würziger Körper, angenehme Süße, Malz, Getreide, kräftige Hopfenaromen, cremig, kräftige Kohlensäure, dunkle Fruchtigkeit, leichte Zitrusnoten, angenehme fruchtig-würzige Bitterkeit; angenehmer fruchtig-würziger Nachgang mit deutlichen Hopfennoten", "Great little IPA. Pour golden with thin white head. Hoppy aroma and of course a complex hoppy taste .", "Appearance: clear golden, with one finger head. \r\nAroma: malty, and hops. caramel, pine.\r\nTaste: bitter, caramel, malt toffee", "Color is golden and clear with a medium white head. Aroma is sweet with hops. Taste is sweet and fruity, a very well balanced aftertaste and overall a pleasant beer \n\n---Rated via Beer Buddy for iPhone", "Intramontabile. Per una bevuta solida di malti. Aspetto motlo bella, bella schiuma, ma poi è malti e finale non troppo grasso. Crosta di pane.", "I can’t believe I’ve never rated this beer before. Tried it for the first time in 2007. Well balanced, it has a nice pine and lemon bite, bread body. Pretty tasty.", "Clear golden orange pour. Aroma of malts, fruity hops and honey. Taste follows the nose. Body is medium. Not overly complex but this beer never lets me down. I guess you never forget your first love.", "Another one of those that I should have rated a long time ago. Pours a clear amber with a full white head. The aroma is a good mix of hops and malt. Its grassy, with caramel, pine, grapefruit, and slight cereal. The taste is mildly bitter. The flavors are a lot of what the nose presented. Grassy hops, caramel, and pine are bigger, and bread, honey, and pineapple are undertones. Grassy, piney aftertaste. Light in body and with a slick texture. This one is your solid, middle of the road APA. You can do better, and you can do far worse.", "sorry, I should never have tried this one, way too much hops..........\r\n\r\nIt would be nice for USA crafties breweries to consider there are more ingredients to go in beer than hops and spices. they dont seem to have understood that point yet.", "From Nov 2007\r\n\r\nThis one has escaped my review radar for long enough! ;^)\r\n\r\nIt pours from 12oz bottle a slightly hazy gold with a good 2 finger head of foam from the initial pour and it stays for the entire session as a solid 1\" layer. Good lacing to be had here as well.\r\n\r\nThe smell is hop dominant to the nose but it's fairly light.\r\n\r\nThe taste is hoppy with a mild bitterness of grapefruit and a touch of grass. I can just taste some malt, especially when I swish the beer in my mouth, but it's just there to cut through the hops a bit...not really to balance it as hop is king in this very tasty APA that I've enjoyed for many many years. This was actually one of my main gateway beers bridging the past of light tasting, oh so similar tasting brews to the present, where you can pretty much sample flavours all over the spectrum. And....after all these years, it does more than hold its own. This is a *classic* and rightfully so.\r\n\r\nThe mouthfeel is medium as is the carbonation and it finishes dry and has a nice bitter aftertaste that lingers on for some time. *Still* one of my favourites of the style and one I frequent often. It is that good.", "Jasno-bursztynowe, klarowne piwo. Piana biała, drobna, jest jej mało, zostaje na powierzchni i obręczy. W zapachu słodowo i chmielowo. W smaku słodowa podstawa się wybija i w miarę upływu czasu kontrują ją chmiele. Wysycenie wysokie, goryczka niska, posmak słodowy, lekko chmielowy.", "This is a beer you can't go wrong with (assuming you like pale ales). It has just the right amoung of hoppiness to give the flavor you want without overpowering. Most bars carry this it seems, and I find myself ordering it fairly often", "Bottle. A very nice and pleasant pale ale. Bitter but not too much. Nice and smooth.", "Very nice consistent pale ale Not lots of hops but well balanced with good malt. Bisquity breads flavor with just the right bitterness to balance. \n\n---Rated via Beer Buddy for iPhone", "From Bottle. No description. Rating only. Transferred from an earlier rating.", "Great pale, one of the best! Nose isn't much but there is some malty notes. Taste is a.beld of sweet malty and hops great", "Good pale ale to try not too bitter but just right. Tried theirs with some of my buddies at a BBQ. \n\n---Rated via Beer Buddy for iPhone", "Very pleasant beer  Bread, citrus comes through , golden colour , clear , with minimal head, very well balanced with medium sweetness,bitterness and sourness, typical style body, average carbonation, and head disappears quickly reasonable long malty finish,", "Una APA no muy compleja, destacando el lupulo y estando muy quilibrada con el caramelo. Mucha bebestilidad", "Bottle on sale from Albert Heijn in Gorinchem, The Netherlands.\r\nThe beer is deep golden to amber colored and has a large and sticky white foam, with very good carbonation. \r\nThe aroma is malty with notes of caramel and very fruity with fresh hops, grass, flowers, citrus, pines and spices. \r\nThe taste is medium bodied and starts sweet with notes of honey and caramel, and goes to medium bitterness with fresh hops from the aroma. \r\nThe finish is dry and light bitter and short. \r\nLittle watery but overall a very good brew.", "Duft lime. Citrus blid duft smag lime svag frugti lidt appelsin noder af malt og græs", "Kolor miedziano bursztynowy, klarowny. Na powierzchni piwa tworzy się sporych rozmiarów biała piana. Dość trwała, pozostawia sporo zdobień.\r\nAromat bardzo delikatny, owocowy z nutami żywicznymi i trawiastymi. W tle nieznaczne akcenty karmelu.\r\nSmak bez wodotrysków. Podobnie jak w aromacie owoce, trochę żywicy i nut trawiastych. Gdyby nie fajna goryczka piwo niczym by się nie wyróżniało.\r\nNasycenie średnie, pasuje. Piwo ma sporo ciała, jest gładkie ale jednocześnie lekkie.\r\nBardzo zwykłe, niczym nie wyróżniające się Pal Ale.", "Helder koperkleurig bier met mooie pareling en grote wand klevende ecru kleurige schuimkraag. Geur: moutzoetig, karamel, vleugje fruit. smaak: licht bitter, strak, wat metaal, wat karamel, beetje pompelmoes en wat kruidig. Goede koolzuurprikkel. Afdronk: lang, licht bitter en kruidig.", "Nastawiałem się na cuda na kiju - dostałem bursztynowego Pale Ale'a, który niczym nie przewyższa przedstawicieli rodzimego Kraftu. Jest cytrusowo, mamy średnią goryczkę i trawiasto-ziołową nutę. Dobry Pale Ale, ale nic poza tym.", "Can. Amber pour. Nice pine hop aroma. Good bitterness but could be maltier. This is decent but what one would expect from a macro attempt at a micro offering. There are better out there at lower prices.", "This beer tastes like ass. Yuck! Some people may like this but I'm not one of them. Sorry...but the bottle is pretty. \n\n---Rated via Beer Buddy for iPhone", "This is my first Sierra Nevada, but hopefully there are better ones out there. I couldn't see the hype. Somewhat plain.", "Stupenda. Questa pale ale è davvero fantastica. Caramellata il giuso da trovare l'equilibro coi luppoli. gli ingrendienti si fondono in un perfetto equilibrio.", "Pours copper and clear. Aroma is malty. Taste is light malt, citrus and bitter with good carbonation.", "One of the original and best pale ales around. This is the beer I compare other beers to. It is good during hot or cold weather and seems to be my go to brewski. \n\n---Rated via Beer Buddy for iPhone", "A bottle on sale at the local supermarket. What a nice IPA is this.\nAmber colour. Nice carbonation. Only small head. A nice smell of fresh hops comes towards you. And the taste is well balanced between good bitterness and citrus. A favorite for me!\nBest drink it well chilled.\n\n---Rated via Beer Buddy for iPhone", "Traz no aroma leve caramelo, pinho e cítrico. No sabor puxa mais para o pinho do que para o cítrico. o corpo e a carbonatação são médios. Ótima pale.", "Про это пиво нечего и говорить, типичный качественный, питкий эль с солодовым вкусом и лёгкой горчинкой, без изысков", "Currently enjoying a can of this. In the past few days I've been on a Sierra Nevada kick just because they've been on sale at the liquor. I've had the pale ale, IPA, and the sidecar. This is probably my favorite of the three. The IPA is really bitter and the sidecar is very citrus heavy but this kind of lands somewhere in between and I think they did a good job with what it is. It's not extremely strong about 5.5 abv so I usually drink this at the end of a session or with stronger beer( I've got the IPA chilling in the freezer next). Good call though for about 2.50 a can you can't go wrong.", "Nice American style. Pale Ale, not much citrus flavour or aroma and seems a little light on the hoppy flavour too. But a nice bronze and cloudy colour too. Nice.", "pours light copper nice of white head aroma citrus pine and grass ,taste citrus burnt wood. a long lasting bitterness and slight toffee taste a heavish type of pale ale ,quite nice", "Off white fluffy head stayed on a a slightly effervescent, translucent, copper coloured body.\r\nBitter malt aroma.\r\nMedium to full bodied airy on the palate, soft.\r\nBitter/sweet citrus, light malt, lemon & long bitter finish", "bottiglia 355 ml, schiuma panna fine media persistenza, colore ambrato velato, al naso vago frutta tropicale e spezie, in bocca malto note agrumate uva ananas pesca, corpo medio, carbonatazione decisa, moderato amaro lungo nel finale. Non mi ha entusiasmato, forse pechè bevuta dopo la data di scadenza?! Riproverò... 25.08.17", "Bottle at home: pours a lovely, white, staying head. Smells citrusy, grassy. Fills your mouth with hops and citrus. Lovely. Classic of course...", "355ml. Pours a amber gold with a thin white head. Aroma: malt, pine, citrus, grass notes. Mild earthy aroma. Taste: biscuity malt, caramel malt, citrus, pine flavours. Medium body. Moderate carbonation. Moderate bitterness. A good solid pale ale.", "Bottle, source not recorded. Backlog entry. Entering my historic scores for US beers whilst visiting New York. No tasting notes kept, just rating.", "​Pine, bitter citrus fruits, bitter orange, orange peel, grain and bread malts,\r\nClear, dark gold, medium, creamy, white head. Light bitter. More bitter citrus fruits, orange, marmalade, pine, bread malts, soft carbonation, medium bodied. Great APA, rich and well-balanced, surprised to notice I’d never rated this before. Bottle at BA Lounge, Newark.", "Pohodová APA z pivovaru Sierra Nevada. Jemné ovocné aroma, hořká, ale přitom nasládlá chuť a hustá pěna.", "Bottle at home. Pours a golden/orange, slightly darkened hue with a white head. Oranges, grapefruit, sweet malts. Very classic, typical pale ale, well executed.", "La Sierra Nevada Pale Ale est la bière la plus populaire la brasserie américaine Sierra Nevada. Elle a une couleur orange à ambrée avec une mousse blanche et duveteuse pour un caractère complexe et corsé. De généreuses quantités de houblon Cascade donnent à la Pale Ale, son bouquet parfumé et une saveur épicée. En bouche, on y retrouve des saveurs de fruits, de pamplemousse, d'orange et de caramel. Une Ale de qualité primée de nombreuses fois lors des salons américains et britanniques !\n\n---Rated via Beer Buddy for iPhone", "Amber in color with small white head. Aroma is hops and citrus.Taste starts with a bit of sweet and sour, and comes after a bit of bitterness and lingering finish.Light to medium body. Have a good balance.", "16floz can, COD: 06.29.2017, $1.50 single, imperial glass. Past experiences goes 15ish years on draft and bottle. Looks like the ideal APA; golden-amber in color and beige head that has some big bubbles and clings to the glass. The aroma of this beer is reminiscent of when American brewers would attempt balance the hop and malt characteristics (caramel and hard sugary candy). This will always be my standard bearer for a good stylistically APA, body is medium and firm with piney-caramel palate. Very versatile ale too.", "- Svakt tåkete, \n- Aroma: frukt; pasjonsfrukt, vegetal; vanilje, harpiks, \n- Smak: klar bitter, fruktig; \nGod balanse av smak og humle. Passer ypperlig til mat og for seg selv. \r\nEn av de beste APAene jeg har smakt\r\nDrukket i Dublin\n7,6/10\r\n170806", "uma das minhas preferidas, malte em harmonia com lupulos americanos, aromas cítricos, boa acidez, final seco e excelente drinkabilitty.", "20.2.28 이마트. \"최고의 방어는 공격이라는 명제를 떠올리게 하는 환상적인 맥주\"\n에일 맥주 특유의 맥아 향이 선빵을 날리며 충격을 준 뒤 향긋한 솔잎향이 잽잽을 날려 상대를 다운시킨다. 마지막으로 홉이 상대를 묻어버려 적의 공격을 차단한다. 완벽한 공격으로 입 안을 초토화 시켜버린 최고의 에일 맥주.", "Tap @ The Beer Temple, Amsterdam VIII 2017. Eerste reactie bij het serveren werd me verteld dat dit een spannende hop was. Nou als dit een spannende hop is dan kan ik net zo goed een kratje standaard pils halen daar zit minstens net zoveel spannende hop in. Ziet en schuimt als pils maar net iets donkerder. Alhoewel dat geen naam mag hebben. Kan door zijn koolzuur zijn naam als pils waar maken. Maar het is een Pale Ale! Ruikt zwak hoppig en nog veel minder fruitig wel heel klein zoetje en een standaard bitterje op het eind. Smaakt gewoon vrij vlak waar eigenlijk veel meer hop in zou moeten zitten. Vooral waterig en valt me gewoon tegen....  snap ook echt niet waarom zoveel anderen dit biertje zo hoog waarderen.", "35.5cl bottle at home. Pours a clear orange amber colour with a small off white head which quickly recedes to a bit of foam creeping up the glass. Aroma of malt, grain, hops, honey, slight citrus, caramel, pine. Taste is medium sweet, medium dry with a nice dry finish. Notes of caramel, malt, wheat, hop, honey, herbs, caramel, toffee. Texture is watery to oily, light bodied with moderate carbonation", "Bottle. Aroma: honey malts, tropical hops. Medium body. Dry bitter taste. Soft but solid resiny and grapefruity bitterness. Good classic ale", "Well, after many years and many beers (too many to remember which is why I rate them here), I’ve finally reached the 1000 mark. It’s been a lot of fun (and sometimes a lot of work when I just wanted to drink the beer and relax). As I approached number 1000, I was trying to decide what beer I should choose for it. I thought about getting a really exotic, hard to find beer that would be a trophy for 1000, but when I really thought about it, I decided that it should be something near and dear to my (beer) heart. Once I figured that out, the choice wasn’t that hard. Sierra Nevada Pale Ale is a landmark beer to almost all American craft beer lovers. Sure there was New Albion (and its founder Jack McAuliffe) which isn’t available anymore, and Anchor Brewing (and Fritz Maytag) with its long history. But I think Sierra Nevada and its founder Ken Grossman more than any other craft brewery really broke open the doors to making and selling great beer commercially in America again, and those doors remained opened for many others who would follow in the years to come. It was the Pale Ale that did it and it remains a true icon of what craft beer is about. While the Pale Ale isn’t my favorite beer (or even my favorite Sierra Nevada beer, which would probably have to be Celebration Ale), it represents a milestone in craft beer in America and that seemed like a perfect reason to make it my 1000th rating. And here it is: 24 oz. bomber (thanks as always for the extra 2 oz., Ken!) from Albertsons in Tustin, CA. poured into a Sierra Nevada tulip pint glass, of course! Beautiful, very clear golden amber body with a billowing white head. Aroma of pine needles with some woody notes in the back. More pine and toasted wood bitterness with a bit of peppery spice in the taste along with some citrus rind and a touch of orange/lemon flavor. Nice caramel sweetness with a touch of vanilla to balance out the bitterness. And the subtle bready, yeasty flavor that gives that special touch to so many SN beers. Even though it’s only 5.6% ABV, I think the bitterness gives it just enough bite to make it noticeable. Leaves a long-lasting dry woody flavor on the tongue and lingering pine cone in the aftertaste. Everything about this beer is about balance and flavor. I’ll have to admit I enjoyed this more than I remember from my many past encounters with it. I’m looking forward to doing a comparison to the draft version when I get a fresh pint from the SN taproom in Chico next time I’m there. Cheers to a great beer, a great brewery, and to my next 1000 ratings!", "Clear orange beer, with standard carbonation and a nice foam head. At nose caramel notes and some floral notes are evident, however none of them is strong than the others, which translate in a nice balanced beer. At palate has a medium body, with a well balanced flavor as well, but more bitter than I was expecting but the overall characteristics are good.", "355ml bottle from Tesco. Appearance looks a bit watered down; 1-finger off-white head dissipates very quickly. Aroma is a nice smack of pine and citrus. Taste is a nice malt-y backbone with a lingering bitter finish. Palate is OK but it deteriorates over time, getting quite flat.", "355ml bottle. Nice gold/orange one with small white head. Aroma is citrus, hops and pine. Nice biter taste with also a sweet something I can’t pinpoint. Doesn’t stay long in the mouth tho.", "pours amber/ golden with a loooong lasting head. carbonation from the can spot on. says served chilled, but gets better as it warms to room temp. lovely sweet piney smell, short bursts of tropical then bitterness kicks in to clean the palate. good malty goodness too, almost sweet, but bitterness saves the day. this is a well balanced gem of a beer - a real classic! only drawback is pricey (in Australia)...", "Butelka kupiona w supermarkecie w UK. Piwo o barwie jasnego bursztynu, delikatnie zmetnione. Piana srednioobfita, drobno i sredniopecherzykowa, utrzymuje się do końca picia. Wzorowo wyglądający pale ale. W nosie słód, lekkie klimaty ziemiste, delikatnie cytrusowe. W smaku głównie slod pale ale, delikatna chmielowosc. Bardzo pijalne, rześkie i poprawne pale ale bez wad", "355ml bottle from Waitrose. Slightly cloudy amber colour with tiny white head. Big juicy grapefruit citrus, lemon, blood orange, tomato (?), floral hops, pine resin.", "Amber/orange with large dense white head. Malty aroma with citrusy notes. Nice balance of malt sweetness and hop bitterness with it being just perfectly leaning toward the bitter. Medium bodied with a moderately bitter finish. Classic American style pale ale.", "Cerveza color ámbar corona de espuma de baja retención de burbujas compactas. Aroma a cítricos, sutil toque a dulce. Al paladar consistencia ligera, con notas dulces de inicio que se ve opacado por un amargor ligero que perdura en el retrogusto. \n\n---Rated via Beer Buddy for iPhone", "In terms of texture - really good. Aroma scarce and not pleasant rather lager like. Fine bitter palate but too brief and not hoppy enough.", "Aroma - More malt smells with bread, cereal, caramel.\r\nAppearance - Pours a dark gold to light amber, crystal clear and a thin white head.\r\nTaste - Nice smooth malt sweetness, very clean, light to medium bitterness with a little floral hop flavour.\r\nMouthfeel - light to light medium body, medium carb with a good bitter finish that lingers around awhile. \r\nOverall - Really good balanced American pale ale that’s just easy to drink but still full of flavour.", "Bouteille 33cl. Couleur ambrée-cuivre, bulle fine. Fine couche de mousse également. Au nez, on retrouve le malt, le litchi, la passion, des notes florales également. En bouche, c’est fruité : litchi et passion également, mais aussi agrumes, épices, et quelques notes de caramel et de malt grillé. Finale amère agréable. Belle complexité pour une Pale Ale au carrefour de la bitter et de l’IPA.", "This is the beer that started it all for me. The classic, no, immortal pale ale by Sierra Nevada. Fresh and crisp. Slightly hoppy. Easy drinking and still a perfect little glass of heaven. When in the future they look back at beers evolution, this will be the one that is bookmarked as starting a movement.", "bread, cereal, citrus, herbs, pale, cloudy, white foam, medium sweetness, medium bitterness, lightly sour, medium body, slick feel, average carbonation, bitter, long finish, bitter,", "Pours dark amber with an off white head. Aroma is citrusy with a bit of pine. Taste starts a little sweet, then gets a little bitter and finishes with tangy citrus. There are notes of orange, lime, grapefruit, a little pine, and a touch of malt in the background. Medium bodied with lots of carbonation. This only recently became available in my area. I didn’t think it would live up to the hype, but it could easily be my beer of the summer.", "Optisch einwandfrei, Schaum nicht sonderlich stabil. In der Nase verhältmäßig fruchtig. Cremig im Trunk, Frucht, mittig bitter, hinten leichte Süße. Schöner Malzkörper. Großartiges Pale Ale.", "This is one of my favorites! It has a great flavor and it’s fairly easy to find.", "Bottle. It poured an amber color with a white head. The aroma was of pine, citrus and hops. The taste was similar to the aroma with more pine, malts, grass and hops. It had a medium to strong carbonation. Just plain tasty.", "Uit fles (355 ml). Prachtig van kleur. Aroma blijft wat achter bij de smaak, die is heerlijk. Niet te zwaar in alcohol. Een heel lekker bier.", "330ml from bottle at home. Hoppy, piney IPA, with strong and thick body, dark golden colour. Well rounded beer, always a good choice.", "A classic american pale ale, reddish gold, citrus, spicy. Hoppy enough. A good brew.", "Pretty standard APA, but very balanced pale ale of high quality. \"Everyday\" choice for me.", "Murky orange color with thick long lasting white head. Creamy hop aroma, citrus and herbal notes. Really awesome pale ale, not bitter as most are but really flavorful.", "Nothing really special here, sierra makes some better tasting beer, their basic pale ale is substandard to me\n\n---Rated via Beer Buddy for iPhone", "Bottle from Tesco. Pours clear copper gold with a thin white head. Plenty of bubbles looking good in the glass. Nose has lots of sweetness. Toffee and light lemon zest. Taste has the sweet malt base with a citrus top that builds to a grapefruit bitter finish. The body feels soft with a little oil and gentle to moderate sharp carbonation. Initially you have lots of toffee and citrus sweetness but this is all washed away by the bitter grapefruit finish.", "355 ml bottle @home.\r\nLight amber colour,grapefruit/floral(?)/pine/hoppy aroma.\r\nAverage carbonation. Moderate bitter (grapefruit).", "Excellent APA dominated by top quality cascade hops. Great Balance between aroma/flavor/malt and bitterness.\r\nAfter all these years quality is consistent and it is the Pale Ale we all use as a reference point!", "Aroma of citrus and herbs. Taste of grapefruit, pine and biscuits. Malty but crisp. Really well balanced and enjoyable.", "Pours a clear orange with slight head and enduring lacing. Malty aroma of bread and hay. Taste is nice combination of lightly sweet leaning towards medium sourness, finishing about the same with lingering grapefruit bitterness. Nice summer beer with fried chicken, etc. Would buy again.", "Drank with Timon 09-06-17 while working on my website. A bit like soft pils (without the harshness) with some hops. Mwah.", "Bottle bought in Rome. Hazy golden with off white head. Floral grassy and earthy. Taste the same with light bitterness. Quite decent.", "Pours rather unclear yellowblonde. Small white head. Smell is citrussy, tad ‘green’ . Taste is Bit peppery , citrussy. bit malty. Reasonably bitter.Bit resins. Very crisp and refreshing. \r\nEasy drinker. very nice. 3.7 is the rating for the beer as it was ment to be, fresh. I had 2 vintage's before, but this is not a beer to rest. Hence why I deleted the previouslhy given score (3.2 for the older beer ) . Original tekst ( for the older beer ) : \r\nSampled at a blind tasting, with Dr. Beer. Served in black glassware. smell is subtile, but prominent. Bit floral, some mild peppery notes from the yeast. Mild maltyness , bit biscuit. Some tea-like aspects, even though thats probably not in there for real. They do pop in mind, thnx to the subtile complexity of the scent. \r\nTaste is moderate bitter, rather floral. Clean yeastyness, presumably lager-type yeast, going forth on the subtile, yet recognizable lager yeast taste. Not very aromatic hops. Mouthfeel tends towards the rather creamy side, with noticable dryness (from the Sugar?) which I do think is added here. Mild sweet ending. \r\n\r\n\r\n---- note ---- I was extremely surprised this was a legendary pale ale. I really thought it was a not-so-good lager. Pretty sure our bottle was to old / not kept the best way imaginable. Should def re-rate this when I have the chance to get a new bottle.", "A nice pale ale that is pleasant to drink with good hops coming through. This beer is not anything special though!", "0,35 l Flasche. Riecht nach Melone. Schmeckt dezent bitter, fruchtig, vollmundig.", "Pours with golden to amber color and >1 thick head that sticks around and leaves nice rings around the glass. Really good carbonation. Aroma is balanced pine, citrus, maybe a little spice and then ends with malt. Medium body with great but simple taste. If your looking for something that simply tastes great and that everyone should enjoy at the gateway beer level, this would be a terrific choice. If I wanted to pick up a six to take to a party, that I know everyone should like, this would be a no-brainer.", "(355 ml bottle) This is a bottle-conditioned beer, pouring a hazy golden-amber, with vigorous carbonation, a dense white head, and specks of yeast floating in the glass. The aroma is light and hoppy, with pine sap, spice, fresh grass and a hint of lemon peel and grapefruit, followed by some caramel and biscuity malt. It’s bittersweet, and clean through to the finish, with a medium smooth mouthfeel, and a lively effervescence. \r\n\r\nClean and refreshing - a classic APA.", "Bottle 355ml, Albert Heijn supermarket. My 800th rating! Time to go international again. Pours clear dark golden / orange with a mild carbonation and a frothy off white head. Filtered? Nose of pale ale malts. Aroma is light caramel, bread. Very balanced taste, not really bitter, also not very hoppy. But not as bold as many other American brews. Palate is mild and pleasant. A quality brew!", "Bottle from Systembolaget (5,6%). Golden clear color with big, white and dense head but not lasting Aroma is sweet and fruity. Taste is hops, a bit bitter but fresh. A bitter tail but good. Great and easy to drink.", "Bottle. Pours slightly hazy light golden with average white head. Aroma is grassy hops, yeast. Taste is grassy hops, candy, slightly metallic.", "From 12oz can :) Well, this is the classic isn’t it... Pours golden orange with a thin off-white head. Aromas of fruit, yeast, juniper. Crisp, clean and delicious with ripe grapefruit flavors, a touch of sweetness balanced perfectly with refreshing hops bitterness. This has been a long-time go-to and still a favorite. I should add the Mills River Brewery is a destination in itself.", "Well put together and well balanced. Hops give it a mild pine and lime flavor. A solid PA.\n\n---Rated via Beer Buddy for iPhone", "12-ounce can pours clear, bright, sparkly orange-gold with generous off-white creamy head. Aroma: subdued floral, honey and pine. Flavor: caramelized citrus fruits, some pine resins, subdued tropical fruits, shortbread. Mouthfeel: medium-bodied, somewhat creamy. Still one of my all-time favorites.", "0,33 litre Bottle from systembolaget Charlottenberg, at home. Golden, little head. Quite Good!", "Eigentlich ein leckeres Bier, aber für mich kein Pale Ale. Von der Farbe her vielleicht schon, aber mir fehlt so einiges an Hopfen.\r\nFast gar nicht fruchtig, aber ein schön runder malziger (nicht zu malziger) Körper.\r\nLeckeres Kellerbier -- schlechtes Pale Ale :(...", "Bottle 0,355 thanks to Brain. Pours clear amber with small white head. Malts, cereal, pine. Medium body and soft carbonation.", "Pours orange with a good head. \r\nBiscuit and caramel on the nose. \r\nBiscuit, pine and malt flavours go along with a little bitterness. \r\nFine.", "Bernsteinfarben mit guter Schaumkrone. Fruchtig bitterer Antrunk, Grapefruit, Zitrone, schön hopfig trocken im Abgang.", "355ml bottle. Appearance: Clear orange body, with awhite head. Aroma: Hops, floral and berries with som cereal matls and caramel hints. Tast: Malt, cereal and camarel with some herbal hops,berries and only floral hints with a bitter finish. . Low to medium body and carbonation.\r\nMaybe not fresh enough or simpley not living up it’s hype.", "2016 catch up - Bottle at home - I drank this straight after the Lagunitas, which in hindsight was a mistake. A gentle flavour of hops, but not a huge amount going on. Very much a pale ale and no urge to drink it again.", "Bottle from M&S Hammersmith. Good standard pale ale to keep in the fridge for thirsty moments. Hoppy, fruity flavors and good looks.", "Piney aroma. Nice pour with a very long-lasting head. Now classic pine and resin flavors with hop bitterness.", "Mooi amberkleurig bier met romige witte schuimkraag die snel inzakt tot fijn laagje. Aroma en smaken van citrus, grapefruit, licht harsig. Uiteraard wel een bittertje maar zeker niet uitgesproken bitter. Redelijk droge afdronk. Prima tussendoortje, drinkt lekker weg.", "0,33l bottle. Nose: malty sweetness, grassy, piny. Taste: well balanced maltsvs hops, piny hop bitterness.", "Really pleasant taste with some biscuity malt. light pepper, citrus and grapefruit. Nose is similar with caramel and grass. Very easy to drink, session ale. Tried in a restaurant with a burger for my birthday.", "Bottle. Amber coloured with a nice head. Strong aroma of piney and fruity american hops. Taste is piney, malty, grassy and modetately bitter and fruity (lemons and a little bit of grapefruit). Medium to strong carbonation. Very balanced. Easy but flavourful drinking. Great.", "Fruity aroma. Golden liquid with almost white head, stays. Taste is hops, malt. Aftertaste is grapefruit and hops. Almost no sweetness, medium bitterness. Good beer, easily drinkable.", "The looks of the beer are quite nice. The color of the beer is a nice deep amber. The beer has some cloudiness, but I’ve seen cloudier beers. On top of the veer a crisp layer of rough white foam is formed. The majority of the foam collapses rather quickly, but a nice drape still remains on top of the beer. \r\nThe beer sure smells nice. The first things I smell are malts and hops. The maltiness is quite high. I smell some nice clear malts and some more almost biscuits touches. Besides this are the lovely American hops. I smell aroma’s of pine and some grassy aroma’s. No real citrus aroma’s are present. Hops and malts are in good balance.\r\nThe taste of the beer is also well balanced. The beer isn’t as bitter as some APA’s can be. There is a mild biter hop flavour, that pairs well with and balances the malt flavours. The hops also give a nice freshness. \r\nThe palate is good. Medium body, rather thin texture and high carbonation. The finish contains some hops and a nice alcohol touch. The finish is quite long. It ends in a rather dry sensation to the tongue. Not bad.", "LCI. Uit de fles geschonken. Wsl. wat te oud, tht 21-6-2017. Weinig smaak derhalve, geen fruit, bloemen of hop. Jammer", "the aroma is fruity and hoppy with hints of orange, pine, grapefruit, resin and spicy herbs... the taste is well-balanced, fruity and malty, with notes of swet orange, pine needles, grapefruit, key lime, resin and spicy grasses... the aftertaste is bitter and dry...", "Bottle from Alko, Helsinki. Pours cloudy golden with a medium-sized, dense and frothy head. The aroma displays solid citrusy and floral hoppiness with pale, grainy maltiness in the background. Taste is built on a combination of pale maltiness and solid citrusy hoppiness; fresh, crisp citrus fruitiness rises to the fore. Bitterness is about medium, strong enough also for hopheads but weak enough to be drinkable for everyone. The palate is light to medium bodied, smooth, average in carbonation. Benchmark for all APAs.", "25. 3. 2017, Romeo, Ljubljana. Classical PA, with medium bodied flavour, almost no aroma.\n\n---Rated via Beer Buddy for iPhone", "I’m impressed. I’ll be honest, I was expecting it to be great, but the balance between Hops and malt make it so pleasant. It’s awesome.", "12 oz bottle at Macon HGI. Hazy amber with medium carbonation, medium body. Aroma includes pine, the taste is spicy hops and finish pleasantly bitter.", "Pours a golden color with a nice head. Aroma of slight malt with hoppy overtones. A nice crisp taste with the perfect hop complement for an American pale ale. I have enjoyed this beer for many years and keep returning to it. This is the finest American pale ale I have ever had. I just wish the clone I brew tasted as good.", "Bottle at Brasshouse, Bournemouth. Hazy amber with an off white head. Aroma of caramel malt, fruity hops and citrus. Flavour is light moderate sweet and moderate bitter. Light medium bodied with light carbonation.", "Golden and slightly opaque. Foamy head. Earthy aroma. Taste has some spice and citrus. Always consistent.", "Golden and clear colour with white foam. Aroma of malt, hops and a bit of flowers. The taste is pretty hoppy.", "355ml bottle at the Barnt Green Inn, Barnt Green. Pale gold, slightly cloudy with a thin white head. Slight brine tuna aroma, with some fruitiness. Faint bread flavours with a touch of blunt citrus. Very carbonated.", "Questa APA ha un aroma molto particolare dato dai luppoli americani. Facile da bere, rinfrescante. A me è piaciuta molto.", "Birra dal colore ambrato. Schiuma fine e poco persistente. Al palato sentori di frutta maracuja, ananas e di speziato. Al palato corpo leggero, abbastanza amara con una forte presenza dei luppoli americani, sentori di ananas, maracuja, papaya, spezie, pino e nel finale asciuga letteralmente la bocca. Una birra molto particolare e molto beverina. A me piace molto.", "botella ... He bebido más fresco, pero aun así fue agradable. quizás no es el mejor conservado. ok american pale ale", "Bu au Brewmaster Pub leicester street à Londres. \nBouteille de 35,5cl.\nBelle couleur cuivré génial super brillance ! \nBelle mousse bien crémeuse et aéré. \nAu nez : un nez agréable , malts caramel ,céréales et levure , pointe fruitée type agrumes légère. \nEn bouche : belle longueur ! Note de céréales agréable bien équilibré . Petite note amertume bien type américain , fin de bouche qui tire sur le citron .\nTout est contrôlé et équilibré.", "Mild aroma - slight banana. Clear golden colour with robust head. Good taste - medium bitter but nicely balanced. Refreshing and easily drinkable. Good on the palate.\r\n\r\nFine pale ale.", "330 ml bottle.\r\nA very refreshing pale ale with a clear hop profile. This ale brings citrus, earthy and spiciness that tickles the tongue. This is a beer that goes down well every part of the year, from the hot summer days to the dark winter nights. Light mouthfeel and a flavour that doesn’t die out quickly.", "12 oz bottle poured at Teatro in Calgary. Pours orange with a white head. Smells like orange and pine. Tastes bitter with pine finish. Good beer. \n\n---Rated via Beer Buddy for iPhone", "Golden coloured ale.\r\n\r\nAroma: malty, caramel, ligt fruity\r\n\r\nTaste is the same with low bitterness.", "Bottle at home. Aroma and taste are sweet and carmel. Low bitternes. Solid pale ale.", "Bottle at home. Clear golden with a medium white soapy head. Light to medium body with moderate carbonation. Subtle bitter and sweet tones. Caramel, citrus, malts, subtle pine and fruits. OK pale ale.", "The quintessential Pale Ale. Hopiness is just right , body is strong, leaves a satisfying aftertaste.", "This is my all time favorite, I’ll try other beers and always enjoy coming back to this one Aroma is citrus and light pine. Taste follows aroma with a nice citrus and pine flavor very balanced and smooth.", "I haven’t rated this? Golden color with small off white head. Grassy hop aroma. Light body. Good balance of malt and mildly bitter hops. NIcely drinkable, a classic.", "Bottle from Albert Heijn at home, its Best before date is 6 months in the future so it’s probably a bit old. Clear golden with white head. Lots of carmel malts, light bready, a light cocoa touch as well. Some citrus peel and bitter herbs. Later some dried apricot. Under medium sweet and medium bitter. Medium bodied with slight dry malty feel. Ok but I’d like to try one closer to the source...", "Pours orange with a white head. Aroma is sweet and hoppy. Taste is sweet but the finish is bitter.", "Bottle at home, from Albert Heyn XL. Near clear amber with white head. Sweet toasted caramel malts, lot of citrus (peel), dry toast with butter, light fudge, resiny hops. Moderate sweet and bitter. Medium body, malty feel, average carbonation. Nice bittersweet fruity fudgey pale ale. Pairing nicely with these veggie springrolls.", "(12oz bottle) AROMA: biscuit, soft yeast, little bit of sweet/sour malt. APPEARANCE: medium Amber, frothy head, creamy and clingy residuals. TASTE: malt, roasted corn, grass/celery. PALATE: light medium body, smooth, fluid/watery, light spritz, moderate bitter finish. OVERALL: a very good pale ale, very drinkable, smooth, fresh, good malt and hop flavors, could be an every day ale..not as bold as some over-the-top ales.", "Bottle at Ministarstvo, Nis. Very nice APA. Though I am over limit now, I still can feel it. Probably because it’s rather strong. But nice, strong but nice.", "A classic of its style and a very drinkable beer. A slight roasty aroma with light hops, a pretty amber appearance, and a lightly sweet and hoppy taste and thin body. Not as hoppy as other comparable pale ales, which adds to its drinkability. Have purchased this beer many times and will many times again.", "Bottle. Golden in colour. Very Hoppy; piney resinous oily and spicy hops. Fruity; grapefruit citrus. Malty base; caramel. Intense resiny hoppy bitterness and citrus sourness. Lingering very dry citrusy bitter aftertaste. Lovely Beer! (2010-03)", "Excellent example of APA. Hint of pine. Good hops balance. Appearance and aroma are excellent. Available at a very good price for the standard. A classic American beer of quality. Love it.", "0,33l can. Pours an light orange body with a medium head. Well balanced pale ale. A tasty beer and easy drinking.", "Flasche 33cl. Hopfige Nase, bernsteinfarben, leicht trüb. Erfrischend leicht, blumig, keine Bitterheit. Klassiker!", "From bottle in IPA glass. Pours golden/amber with nice head and distinct piney aroma of Cascade hops. Nice bitterness against the caramel malt. This was my gateway beer into the craft beer world a quarter century ago. Always nice to come home to it", "Color ambar profundo con transparencia, muy buena espuma y retención. Malta maltoso caramelo moderado, lúpulo pináceo-resinoso moderado, ésteres a pimiento verde, diacetilo. En boca malta maltoso caramelo moderado, lúpulo pináceo-resinoso moderado, lúpulo de amargor moderado, ésteres a miel, hojarasca, arúgula, melaza, frutos secos. Final seco en balance malta-lúpulo con amargor sin astringencia.", "pours amber with white head that lingers. Medium texture, with average carbonation. Great balance of hops, not over doing it but making sure you taste it. Slight hint of pine to it. Nice and crisp finish. Not bad at all.", "Bottle 0.355L.\r\nPale amber body with a small, frothy, white head, mostly diminishing with some lacing.\r\nModerate hoppy (citrus, grass) and light-to-moderate malty (caramel) aroma with notes of fruits.\r\nModerate-to-heavy bitter and light-to-moderate sweet flavour; long-lasting bitterish finish.\r\nMedium body with oily texture; average carbonation.", "Bottle from Systembolaget. Light hoppy smell, bready and light spicy with a flowery aroma. Similar taste. Light to medium bitterness. Actually has a brittish floral touch to it.", "12fl oz bottle at home from a local supermarket Nose Maarssen. Nose is malty. Body is clear pale golden, head is medium, offwhite, creamy, average lasting, good lacing. Aroma is malt, orange peel, bread, metallic, popcorn. Light to medium sweet, medium bitter, light citric sour. Finish is long lasting hoppy and malty medium bitter. Light body, slick texture, average carbonation. Easy, refreshing, simple but tasty, nice one.", "From 33 bottle, expired. Pours golden, with limited white fine foam. Aroma is slightly herbaceous. Body is medium-light. Taste is slightly bitter, with a long finish consisting of that latter bitterish feeling, somehow herbaceous.", "Pours golden clear. Medium carbonation. White head that lingers. Floral fruity aroma, that leads into a bread biscuit malt notes. Slight caramel notes. Firm bitterness, good malt balance. Some caramel taste between bitterness. Some fruit citrus hop flavour. Overall: good pale ale, well balanced, nothing over the top in terms of hops or malt or mouthfeel. Something I would recommend to a craft noob.", "Láhev, další perfektní IPA, pivo je výborné, svěží chutné, ovocné. Skvělý říz. Těším se až ochutnám další pivka z tohoto pivovárku.", "Nose is orange. Taste is complex: mild caramel, grapefruit and floral notes. Some grass. The piney finish is surprisingly bitter, but clean. What a lovely beer.", "Sierra Nevada Pale Ale out of a bottle/can. Whenever someone posts the list of most rated beers I always realize I need this, well no more! I’m sure I’ve had this dozens of times and I bet my ratings would have been higher back in early days. Clear Amber pour. Nose is maltya nd subdued piney hops. Taste of florals, malt, pine light caramel. Welll balanced and easy drinking not overly bitter.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "A bottle from City Super in the basement of Sogo at Zhongxiao Fuxing, drunk at home. Aroma: well-hopped and zesty, a promising start. Appearance: slightly hazy amber, good froth on pouring, settling to a layer of slick white foam. Palate: medium-bodied, oily, average carbonation. Satisfyingly bitter finish. Taste: medium degree of bitterness, very refreshing. Not my favourite kind of beer, but a worthy example nevertheless.", "F: medium size, egg-white, medium retention.\r\nC: orange golden, light hazy.\r\nA: orange, tangerine, light tropical fruits, malt good balanced with aromatic hops.\r\nT: delicate creamy mouthfeel with fresh brewed tones, caramel malt, light citrus, tangerine, hint of passion fruit, medium to full body, high carbonation, very good balanced and must be simply great if it is fresh, BB: 17/08/17, 355ml bottle from AH supermarket in Antwerpen.", "Crisp and lots of citrus, not too bitter either. Good clean easy going. me enjoy", "I’ve had this beer a hundred times, and have never poured it. Its my go to beer on the golf course, and I golf year round. Frigid temperatures and temp greens never stopped me. I’ve never had a complaint about this beer, and have never considered switching to a new golf beer. Inviting citrus forward aroma. Crisp, lighter side pale, with a citrus fruit that lingers. Slightly sweet. Enjoyable every time. Quite thankful that every golf course in the world carries it.", "Bottle 0,33ltr: Slightly hazy orange colored brew with an dry bitter taste with hints of caramel and citrus.", "This beer is excellent. Beer is my drink of choice, but for some reason this beer has seemed to escape me. Taste is sweet but not too sweet. Slight slight bitterness, with great hop flavor. Malt is spot on too. I feel like i can definitely taste some caramel. Color is a nice copper..... wish i could get my homebrew this clear. Great job Sierra Nevada.", "Copper colour, crystal-clear, weak head.\nSmell is subtle. Caramel, resin, hint of hop bitterness.\nTaste is fizzy bitterness. Quite full. Refreshing. Hint of maltiness and lots of hoppy bitterness, fading into a strong astringent finish. Almost salty.", "The distinct flavor of Sierra Nevada. Goes down like any other beer but has a distinct bitter aftertaste.", "Bottle. Golden color. Aroma of bitter grassy hop, malt and yeast. Taste has grainy malt, crispy hop, mild piney citrus and some grassy note. Solid.", "Bottle. Pours a copper color with white head. Herbal, earthy, hoppy aromas with notes of maltiness in background. Earthy, herbal, grassy flavors with a malty backbone. Classic pale ale.", "(Sierra Nevada Pale Ale) Bottle 355ml at home, served into a shaker, ABV 5.6%\r\nDeep orange colour on the body, crystal clear, with a small and thin white head on top, average retention. \r\nThe aroma has light caramel malts and faint fruity notes.\r\nTaste on the other hand is more intense, still caramel malts, light citrus, tropical fruits.\r\nMedium thin body, carbonation on the high side. \r\nPretty good.", "Bue en bouteille de 355ml chez Charlie et Renaud\r\nCouleur ambrée, pointe de mousse et effervescence moyenne\r\nNez sur le fruit jaune et la résine\r\nAttaque résineuse et maltée fin de bouche avec une pointe d’alcool agréable et facile.", "aroma of pine, lemon and orange. taste follows, with a slight earthy character and some caramel. appearance is a golden orange with some yeast in suspension, without being cloudy. palate is thin with a lightly bitter aftertaste. Overall- A classic beer that holds up to modern craft. Accessible without sacrificing flavour.", "12-ounce bottles in a pint glass. Not so much a pale ale as an India Pale Ale. However, with as overly hopped as many of their beers are, I guess compared to them this one wouldn’t be quite so bitter.", "Truly don’t like this. Cascade is hideous, lager/epa like hop. I only drink beer for these new fandangled fruity new world hops, not boring English tasting floral spicey rubbish. But at least I’ve narrowed down that filthy hop at last, this is why ratebeer is such a good idea.", "Bottle. Pours orange with a white head. Aroma is sweet and hoppy. Taste is sweet but the finish is bitter.", "Dammit. I thought I’d be the first to review this... Ok, lets assume this is my 9 millionth so I best actually do this. Caramel, soft sweet orange, toasted malts, bit o pine, honey aroma. Mellow yet obvious bitterness. Bready malts with the caramel being minor, orange, pine, more citrus, the underbelly of faint spice. Finishes clear. Yumtime.", "11/20 not spectacular but a decent pub/supermarket option. Piney taste, mild bitterness, easy to drink but not enough flavour for me \n\n---Rated via Beer Buddy for iPhone", "Crisp, grasy, getreidig, citrusfrisch und rundum das Kippbier. Das Farmhouse Pale Ale. Der Hafer macht’s möglich. Klasse und ausgereift. 0,355l Flasche aus einem Supermarkt in Flensburg. Im Bett mit Andy vernascht. Unter 3€. AGAIN: TAP: CBA: KW18: Tropisch, stoney & awesome!!! I LOVE BEER💋🙂 hoppy, funny, A LEGEND👍 17...AGAIN: GEORGE SHAKEDOWN STREET BOMBER!? Fresh Maischer🤠17...passe mal an ;)", "Deep copper to burnt orange color. Supple white head of foam. Toasted grain and light lemon and grapefruit on the nose. Light caramel and toast with slight citrus bite in the finish.", "Bottle. Clear amber with white head. Aroma of citrus and tropical juicy fruits, sweet and fresh. Taste of fresh fruit, light malt, crispy juicy, bitter finish.", "Da garrafa: dourada, límpida, bem convidativa. Aroma cítrico, com notas bem marcantes de pinho, leve frutado e um toque maltado. Sabor com malte bem mais presente, frutada e amarga, com bastante equilíbrio e complexidade. Corpo e carbonatação médios, equilibrados. Bastante refrescante e com altíssima drinkabilidade"]}