{"reviews": ["08Jul2022 Sweet citrus fruits, lemon, sweet grain and cereal malts, wheat, esters. Slightly hazy gold, medium, creamy, white head. Light bitter. Sweet grain and cereal malts, wheat, esters, bread, lemon, soft carb, med bod. A malty, lemony mess. Bottle at American Airlines Flagship Lounge, Jamaica.", "Bottle from Food Dog near the lake, finished by me because my wife hated it and called it a bad Radler. Light yellow gold, good head. Lemon peel nose with wheaty goodness. Malty, a bit too sweet, hard to distinguish if the lemony flavor is hop or citrus fruit but I guess it's a blend of the two. Decent wheat notes.", "@Buffalo International. Hazy golden yellow colour, low head, thin body. Taste of malt, hops, citrus. Malty finish. \nEarlier Rating: 7/27/2013 Total Score: 2.9\nPours out of the bottle in a cloudy yellow-golden colour with low head and medium body. Nose of light wheat and hops. Taste of dull hops, wild flowers, wheat, light yeast and leaves. Easy to drink but way nothing special. Nice, but boring and little bit dull.", "A hazed blonde ale with a thin white head. In aroma, sweet fruity malt with light lime. In mouth, sweet fruity lime mix with light mineral notes, ok if a bit boring. Bottle.\nEarlier Rating: 12/6/2005 Total Score: 2.8\nHazy golden ale with a thick collapsing white head. Aroma is sweet lemony, with notes of  oranges. In mouth, light fresh wheat beer, with definite orange peels, and lactic sourness. A bit chalky. Lighter bodied summer wheat.  Bottle is about 6 months old.", "12 oz. bottle pours a slightly hazy golden yellow color with modest white head and not much lacing. Aroma has wheat, lemon, orange peel and light spices.  Body is light to medium with average carbonation.  Easy to drink, and appropriate for a hot summer day.", "12oz bottle someone left at my house, consumed from the bottle.  Nose has some lemon and coriander, sour wheat, some sweat.  Flavor is a bit fake, sour, lemon, some salt, some grist and straw.  Finishes mostly dry, medium tartness.", "Bright and hazy orange on pour with a small white head. Lots of sweet citrus aromas and full of ripe fruity flavours.", "Slightly hazy gold with a thin foamy white head. Nice delicate aroma with a touch of orange peel and maybe some lemon notes on a pale wheaty base. Smooth balanced and semidry flavor that’s pale and gently wheaty with a nice noble hop character and gentle citrusy undertones. \nEarlier Rating: 8/14/2010 Total Score: 3\nClear straw yellow color, no head.  Smelled like spice, lemongrass and wheat.  Taste was clean and crisp, albiet light bodied.  Taste was like the nose, mostly lemon, some spice, some hop, with faint wheat tastes.  Not bitter or too acidic.  Great mouthfeel, lightly carbonated and dry finishing.  A delightful surprise from a macrobrew!", "Draft at Moriartys. Hazy golden pour. Citrusy wheat beer. Orange. Vanilla. Banana. Oyster crackers. Marshmallow circus peanuts. Medium body. Easy drinking but feels a bit silly sweet and annoying.\nEarlier Rating: 4/28/2018 Total Score: 2.5\nDraft at Moriartys. Hazy good pour with white foam. Malty golden wheat.  Generic citrus. Banana. Not much there there. A good Summer Ale if you like bad beer.", "Very malt/cereal grain smell to it....but taste is very different...lighter mouthfeel, fairly low sweetness and finishes with an orangey flavor...a lot like a blue moon...flavor is very subdued and in the background with the malt carrying it through...decent and smooth with good complexity... Had at home on a lazy Sunday in the middle of July 2021 ?? x2\nEarlier Rating: 6/25/2013 Total Score: 3\nZesty blue moon look and taste...actually exactly so...did i get the right beer?! Lol maybe slightly more bold than the ’moon", "Nice citrus flavors, the lime sticks out at the end and is refreshing. I don't get a lot of the wheat flavor but it's nice overall.", "Pour from a 12oz can. Hazy gold with small head that soon vanishes. Aroma is orange, lemon, coriander. Taste is sweet up front with emerging citrus notes, musters a crisp finish with stronger citrus, slight hoppiness and mild peppery notes. The pepper at the end is good. Mouthfeel is kind of sticky and low energy, very light carbonation. \nEarlier Rating: 10/16/2008 Total Score: 3\nCloudy blond pour with a nice head. Aroma is sweet and spicy, sour wheaty with hints of lemon. Light flavor of grains with a bit of hops, a dry and indeed peppery finish. Tasted on a cool October day, I might rate this a bit higher overall on a hot summer afternoon.", "Poured from a 12oz bottle. Appearance is a medium-gold and only slightly chill-hazed. Limited head and lacing. Aroma is clean grain and tart wheat aromas with faint white pepper and vinous notes. Taste is citrus flavors are more pronounced on the palate than they were present as aromas. Still skewed sweet. Medium light and crisp is the mouthfeel. Overall light and summer perfect.", "Bottle at Robbie's: pours lightly hazy with white head. Aroma is citrusy notes and wheat. Light and zesty. Easy to drink. \nEarlier Rating: 10/29/2006 Total Score: 3.1\nThis is my favorite of all the Sam Adams beers. It goes down smooth, it isn’t bitter and is a mild enjoyable beer, that is perfect on a summer day, night, or morning. Not a hard beer and certainly not really complex, but definately well made and drinkable. Well recommended.", "12 oz bottle. Pours pale yellow with a fluffy white head. Smells of funk and wheaty yeast. Wheat flavors with some citrus tartness balancing. Above average carbonation and fizzy mouthfeel. Some spice notes but not particularly well balanced. Okay.\nEarlier Rating: 8/5/2017 Total Score: 3.2\n12 oz. bottle. Light scents of grass yeast and malt. Pours a dirty golden hazy with a short fast dissipating white head. A lot of lemon flavor but very little wheat. Slight sour finish and a refreshing crisp mouthfeel. Not too challenging very simple but nothing wrong with it.", "Lime and some wheat. Not really something I'd want to drink a lot of, though I can see the appeal for some people. Tastes like a Corona with lime. Golden pour. Light tangy end. Bottle. \nEarlier Rating: 4/6/2014 Total Score: 2.3\nHad this for free at a baseball game. Tastes light and wheaty. Cloudy pour with ok head and lacing. Free is free, so in that respect it was good. Tap.", "Orange, lemon, lime, biscuit malt, and straw aroma - very nice. Cloudy golden yellow with small white head.  Lightly sweet orange, lime, biscuit malt, and very light bitter straw flavor.  Light body.  A nice light beer. \nEarlier Rating: 7/9/2005 Total Score: 3.3\nBottle.  Orange and pepper aroma.  Cloudy orange-yellow color with little head.  Sweet orange flavor with hints of cloves and pepper.  Smooth with decent body.   A nice, easy drinking Am wheat.", "I had it on tap. It pours a hazy golden and orange. The aroma is citrus and wheat. The taste is orange, lemon, wheat, and spice. It's fairly refreshing and easy to drink. It's sweetness is subtle enough. This is always a pretty reliable choice.\nEarlier Rating: 6/21/2019 Total Score: 2.9\nI had it from the bottle. The aroma is lemon, wheat, and spice. The taste of the updated version is heavier on the lemon. You still get a little of the wheat and spice. It's a little lighter and crisper than the old version. I like this one slightly more.\nEarlier Rating: 5/10/2015 Total Score: 2.7\nThis is a re-rate.  I poured it from the bottle into a pint glass. It pours a cloudy golden color with a decent white head and lacing.  The aroma is faint with lemon and grain.  The taste is lemon, spice, and wheat. It has a pretty full mouth feel. It is overly sweet and heavy to be a great summer ale in my opinion. It could stand to be crisper and hoppier.", "Bottle from Sips of Summer 2021 variety pack. Pour was unclear golden with a white head. Aroma of citrus, wheat, lemon, spice, pepper. Taste was sweet, fruit zest, spice, orange, wheat. lemon, citrus.\nEarlier Rating: 5/7/2016 Total Score: 3\nSample at Super Saver grocery store. Bottle poured cloudy, white head. Aroma was lemon juice and lemon. Taste was slightly bitter, soapy, wheat.", "I did not know there was a recipe change for this beer. Pour is a cloudy yellow with a large white head Aroma is pretty much all lemon peel. Flavor is more lemon with a odd grain which I guess is the grains of paradise. One of those beers that has just enough to keep it interesting and not get tired of. \nEarlier Rating: 4/23/2005 Total Score: 3.2\nPour is a cloudy yellow with a white head.  Aroma is lemon zest and a bit of malts.  Flavor is lemon and spice with a creamy aftertaste.  Flavor is a bit weak as you drink more of the brew.  An ok brew on a summer day.", "12oz bottle shared with Largo Gary. Thin white-yellow. A-citrus, some wheat/grain. T-citrus/some spice-coriander. \nEarlier Rating: 6/16/2005 Total Score: 3.2\non tap-pours a white head, cloudy straw/yellow color that fits with a wheat beer.  Nice taste, a little lemon-banana.  Enjoyable.", "On Tap. Pours a hazy light golden color with a good head. Aroma of grain and light citrus. Taste of Citrus light fruit and grain. Mild bitterness and fairly clean finish. Light body and quite smooth. Nice backyard beer. \nEarlier Rating: 7/26/2010 Total Score: 3.4\nBottle- Pours a hazy golden color with good head that slowly fades. Lemon zest & clean aroma. Mild lemon and spice with light bitter touch. \r\nMedium body & dry finish. Didn’t have that crisp, refreshing feel I was expecting from a summer ale. Left me wanting, similar to the Coastal Wheat Ale.", "Pours a cloudy gold color with a small white head and very good retention. Small bits of lacing. Light citrus and light wheat aromas. The citrus and wheat flavors are also very light. A little salty. Medium-light body. Slick mouthfeel. Medium carbonation. A decent summer beer. Much better than the original, but still very forgettable.", "Frisch gezapft. Orangefarben mit minimaler Schaumkrone. Spritzig. Leicht hefig und säuerlich. Eher leichter Körper.", "not a wheat beer fan, there is nothing real special or worth drinking about this beer to me. too much wheat a flavor I don't enjoy.\nEarlier Rating: 10/12/2004 Total Score: 2.8\nEverything about this beer was just unassuming...nothing particularly abrasive, but nothing particularly great either...just an average beer, in which the lemon flavoring is tolerable but not exciting.", "Another summer beer from Sam's that smells great as you lift it to your mouth but ultimately disappoints. Having lived in Boston and toured the brewery many times, I love Sam Adams. So I want to love their summer beers..but I just don't. . They're all below average.", "I wait all summer for this one to come out. It has been a favorite for a long time now. The best of the massmarketed summer ales. This one is almost always best enjoyed after yardwork but in the shade since a touch heavier than the light beers out there or otherwise enjoyed with a bunch of buddies who want to come over this weekend and drink all your beer.￼", "Aroma is wheat and strong citrus zest. The flavor is wheat, citrus/zest and a crisp finish.\nEarlier Rating: 1/26/2011 Total Score: 3.1\nGrainy lemon flavor and not much else.  Good summer session beer when you don’t want anything challenging.", "12oz bottle from Vieux Carre Wines & Spirits, New Orleans, LA and drunk on 08/07/2008.  A decent enough wheat ale; quite refreshing and very easy drinking on an (insanely) hot day.", "12 oz. bottle.  AROMA: Sweet and lemony, like a lemon-head candy.  APPEARANCE: Pours a hazy pale gold with a whispy-thin white head that dissipates quickly.  TASTE: Lightly sour with a very mild lemon flavor and a hint of lime on the back-end.  MOUTHFEEL: Medium-bodied with a slightly course texture. Carbonation is average and the finish is mild.  OVERALL: Slightly better than the previous version of this beer (i.e pre-2019), but not by much. I would have never tried this newer version if I had not gotten it for free. That is how bad the old version was. While this version has improved, it remains the worst beer that Samuel Adams makes, and one that I still won't buy. Which is a shame, because I like all of their other beers that I've tried.\nEarlier Rating: 7/29/2017 Total Score: 1.7\n12 oz. bottle. AROMA: Mild lemon scent and nothing else. APPEARANCE: Pours a cloudy, deep gold, with a white, frothy head that dissipates slowly. TASTE: Lightly sour with flavors of dish-water (don’t ask me how I know) and lemon. PALATE: Medium bodied with a thin texture. Carbonation is average and there’s not much of a finish. OVERALL: Full disclosure: I had a nice Eisbock prior to trying this beer. So maybe that threw off my palate. But I did try a palate cleansing before trying this beer. Having said that, I find this beer severely lacking. The taste is just short of horrific and the other aspects (aroma, palate, etc.) are below par. Which is a shame, because I tend to like most of the Samuel Adams beers.", "Im American Airlines Flieger aus der Flasche. \nKlarer gelber Körper, etwas Schaum.\nAroma: Zitrone, etwas Mandarine, Hopfen, Getreide.\nSehr frisch, wie Zitronenlimonade, etwas Banane, Orange, Pfirsich. Malzsüsse.", "Tap @ Cheers. Golden coloured. Light flowery, dry, light malty, bit grassy.", "Can aboard AA101 somewhere over the North Atlantic, it pours amber-gold with a thick foam, a lightly bready and lemony nose reminiscent of Hefeweizen, then sweet and citrusy, a bit like a Russn Weizen-Radler made with lemon and lime. Touches of spice and something a little herbal, plus a distinct zesty note on the sweet finish. \n7 3 7 3 14", "Very very good beer. Probably the most refreshing beer I’ve ever had. Lots of citrus/lemon zest but very good!", "12 oz bottle served in a shaker (from summer 12 pack)- poured a non transparent orange-brown color, white ring about the vessel for a head, no lacing. Aroma of fresh wheat- and that’s about it. Hits the mouth with a light body, malt has some flavor and feel, not a lot of sugar upfront which is always nice, middle has a lemon/citrus feel to it, finish is complete and actually lingers on the tongue a little. Not too shabby.\nEarlier Rating: 10/15/2007 Total Score: 2.5\n12 oz bottle- poured a cloudy slight orange color, good head.  Aroma of sourness, no lemon whatsoever.  Hit the mouth with a thin body, kind of peppery finish.  An odd one.", "On tap at Shingobee on the Lake, Walker, MN. Sitting on a patio overlooking the lake drinking this while I eat my lunch. Nice, refreshing summer brew. I like it better than the original.\nEarlier Rating: 4/5/2015 Total Score: 3.4\nPretty hazy. Easy to drink, get the lemon and wheat mostly not much pepper but that’s probably a good thing. Easy enough to drink but for a wheat summer type of beer I’ll take a honey Weiss.", "12 ounce bottle at Kentucky Theater. Fairly basic not that great malty ale. Ok.\nEarlier Rating: 10/3/2007 Total Score: 1.6\nHuh? Summer what? Wheat? Where? Another Sam Adams fakery. How do they get away with this?", "On tap. Pours gold. Peach, apple, cereal, honey, some generic fruit stuff. Medium body. Not great.", "Didn't realize this was a new beer. Seemed lemony, middle of the road, gentle wheat I guess, quite pleasant soft and light. \nEarlier Rating: 7/9/2015 Total Score: 3.4\nVery light aroma, vaguely fruity, could not detect lemon. Appearance typical for a wheat beer. Taste biscuity, fruity, light. Mouthfeel is lightly creamy.", "On tap at Adelphi’s. Hazy light orange with medium off-white head. Aroma is fruity, medium body, medium carbonation, and little lacing. Taste is fruity (orange mostly) and wheat esters. Not bad.\nEarlier Rating: 7/4/2013 Total Score: 3\nRefrigerated 12 oz. brown bottle, best before November 2013, poured into a weizen glass. Pours hazy golden yellow with medium white head. Aroma is grains of paradise, medium body, medium carbonation, and thick small bubble lacing. Taste is grains of paradise, soft wheat, grainy, and some lemon zest. Not that good.", "Bottle. Pale orange-yellow, fizzy but doesn't bring much head. Fruity, sweet, wheaty. As advertised I guess. Meh. (#7472, 7/2019)\nEarlier Rating: 9/10/2002 Total Score: 3.9\nCloudy maize.  Hint of an orage aroma with a yeasty flavor.  Light hop after.", "Golden orangish color thick foamy head smell coriander citrus slight lemon taste of coriander lemon peel watery", "Decided to try a bottle of this at a family reunion when I heard that they had changed the recipe for this brew; amazing how distinctly different this from what I remember of the prior rendition of this summer ale! The lemon and lime flavors are indeed much more pronounced in the aroma and the taste, to the point that any subtle wheaty or malty flavors are smothered. Despite the continued hazy appearance, this is noticeably lighter and thinner on the palate, with an almost acidic aftertaste of lime juice in the finish. Some peppery notes to it, but less pronounced than before. Too much lemon and lime for my taste, although it’s not offensive I would not ever remotely consider buying this for myself. Sadly more “meh” from Samuel Adams.\nEarlier Rating: 3/13/2014 Total Score: 3\nGoing on distant memory from last summer, just realized I hadn't rated this. Well this wheat ale is a good balanced example of the style, featuring straightforward wheat and lemon on the nose and throughout the taste, with some distinct peppery notes. Poured a cloudy yellow-orange, texture is full and grainy to match. Relatively flavorful, and finishes clean enough. I'm not much of a fan of wheat beers but this was enjoyable. Well-done.", "This is a fairly decent wheat. It's got a citrus flavor and goes down easily.", "My favorite of the Sam Adams but as I see from others it's not for everyone. I prefer my beers to have a stronger bread-like taste to anything else and that's why I love this beer. If you enjoy a strong bread flavor, especially after taste you will like this beer. For reference as to where I stand with Sam Adams I tend to be a fan of the Boston Ale and Winter Lager as well.", "6/29/19 - Tallahassee, Fl - Trader Joe's - 12 oz bottle. Hazy, medium orange pour, lazy off-white head that sticks around awhile. Aroma has a fruity essence to it, some peaches, a touch of coriander. Full-bodied flavor, some date like sweetness, a touch of bubble gum, hint of cloves, touch of apricot sourness. Thickish mouthfeel.  \nEarlier Rating: 5/2/2003 Total Score: 2.9\nRerate Just not as crazy about wheat ales in general anymore - ddecent, similar flavor as before, does not look quite as nice Original 3.4 Beautiful creamy, thick white head sits on top of the cloudy golden pour.  Aroma, while fresh, is not remarkable, faint grassy notes. Flavor is a bit off, the \"grains of paradise\" which is the spice in here according to the label, leaves a slight off taste in my opinion. Overall, not a bad wheat - just expected a bit more.", "A slow start the hysterical faux beery-ness, like an employee slacking off then madly mashing the keyboard when the boss walks in.", "12 ounce bottle from Woodman's Appleton, 6/18/19. Hazy gold, thin white head, fair retention. Aroma of sweet citrus, tangerine-like, wheat, mild spice. Taste is tangerine, lime, wheat, hints of spice. Medium bodied, creamy, soft carbonation, well balanced. Haven't had the old version in many years, but this score will come in higher than that one, so this is probably an improvement. \nEarlier Rating: 9/24/2008 Total Score: 3.1\n12 oz. bottle obtained for free! Yay! Orange pour with a 2-finger head that fades quickly. Fruity aroma with notes of citrus and caramel. Taste is wheat, citrus and a very subtle hoppiness. Medium bodied.", "Pours a hazy medium yellow with a white head that last leaving litle lacing. Nose is strongly lemon in the can. In the glass, the nose was attenuated but still lemon with no detectable spice except in the aftertaste . Obviously, Boston Beer is keeping to its tradition of brewing beer to the widest demographic with this and Sam '76. They are not \"bad\" beers but they represent a chasing after market share and NOT what makes \"craft\" beer what it became and is. So, I am saddened that Boston Beer decided to lower the flavor profile based on demographics. While I do not dislike this beer but it is not what it was. Surprisingly, their advertising was honest. It is lighter.  4/14/21: Re-tasting revealed citrus dominates. Balance is not in the equation. Again, it is not what it was. As designed, it is drinkable but with an ABV that belies it is a \"summer\" beer despite its light flavor profile and low IBUs. 12 oz bottle BBY 12/21.\nEarlier Rating: 5/29/2013 Total Score: 3.5\nPours a cloudy yellow with a white head that leaves lacing. Nose is slight spice and citrus. Palate is light wheat body with a spicy light bitterness.", "Strong lemon zest aroma.  Taste is strong lemon or lime peel and zest.  Overpowers the Hefeweizen or witbier flavors.", "Benefits from the retooling, offering up more noticeable hefe notes and more pronounced citrus. That being said, still not great, too sweet with a crowd-pleasing lemon-lime heaviness overcompensating for the original’s meekness. Eh.  2021 update: gotta admit, I’m coming around on this beer. Just enough sweetness to appeal to the shandy crowd, but the cracked wheat and mild floral notes are subtle and well-done. Not a classic, but a good all-around pint for mid-summer scorchers. ORIGINAL RATING: 2.6\nEarlier Rating: 5/21/2011 Total Score: 2.2\nPours a standard if acceptable translucent gold, but the head is too quickly gone for comfort.  Smells faintly of hefe and yeast, but quite faint for all the ballyhooed ingredients.  And the flavor leaves you feeling the same way, bland and wheat-laced with a burnt undertone that gets no help from the adjuncts.  Tastes like an average, uninspired Kristallweizen that uses fancy ingredients as a selling point.  (5/2/09)", "Draft, lightly hazy golden with large head. Notes are bubblegum, wheat, spice, white pepper, and florals. Lighter bodied with forgettable finish.", "Taster. Poured clear yellow color with an average frothy white head that mostly lasted with good lacing. Moderate lemony balanced aroma. Medium body with a smooth texture and soft carbonation. Moderate sweet flavor with a moderate sweet finish of medium duration. This soft beer met my expectations.\nEarlier Rating: 12/13/2005 Total Score: 2.7\nBottle. Pours a hazy amber with a small head that diminished quickly. Medium sweet citrus aroma. Light to medium body with a thin texture. Light wheat citrus flavor with a short finish. Drinkable with little character.", "Not my favorite Sam Adams variety.\n\nNice looking beer. Fresh and bright on the palate. But, for me, the flavors don't lend to easy enjoyment. Not the balance I like. I'd rather have a good pilsner.", "Appearance: amber: inch head\nTaste: wheat w/ hint of citrus\n5/26/19 - Uncle Julio's (Naperville, IL) bottle\n4/10/22 - True Food Kitchen (Oak Brook, IL) bottle\n\n---Rated via Beer Buddy for iPhone", "Earlier Rating: 6/30/2008 Total Score: 3.4\nEn newark camino a porto me gusto\r\nFresquita y suave, de lo mejor q he probado de sam adams", "Draft at the Hard Rock pool bar in Orlando because it was something I had not tried. Pours out a hazy dark gold color with a nice white head. The aroma is strong wheat. The flavor is bolder than expected and you can definitely taste some of the grains and spice. Nice enough but wished it was a touch lighter with more citrus.\nEarlier Rating: 9/23/2007 Total Score: 2.6\nDraft.  Decent summer brew that hints of wheat and citrus like a summer weizen.  Not impressive though and I seemed to hit some sour notes in the middle and finish.", "When the summer solstice is well nigh here, you can rest assured that those sun worshipping pagans of old, The Milwaukeeans are not idolizing their Gods with this tripe.  And that's a true fact well-stated, or not.  Indeed, those wily fuckers have the gumption enough to worship the olden ones with that true pleasure elixir from the Elysian Fields: Blatz.  As a wise man once said, \"If it ain't Blatz, it ain't shit.\"  So if you want to be cast out of your pagan circle you could roll with this stuff, but when you're looking to come in for the big win, load your bloated carcass up on Blatz....that's the stuff 33 of 77 Pagans polled for this review use to summon the gods of old......\n\nTHINK ABOUT IT.", "Pours dull gold color. Head is white. Refreshing summer ale with a slight citrus taste. Quite enjoyable.", "From backlog. 0,3 litre Bottle at Hilton Grand Vacation On The strip, Las Vegas. Dark Golden with offwhite head. Malts, hops, bread and Citrus.", "Samuel Adams Summer Ale \nABV - 5.3  $2.20 12oz bottle\n\nAppearance - Golden yellow, thick off-white head. hazy with some visible carbonation. (2/3)\n\n\nAroma - Bubble gum wheat beer scent. Grainy, yeasty. Notes of orange peel, lemon zest, banana peel. Not getting much spice. (7/12)\n\nTaste - Citrus forward. Wheat beer flavor in full effect. Very subtle spice. Notes of orange peel and caramel malts. (11/20) \n\nMouthfeel - Smooth, silky feel. Nice medium body, easy drinking (Drinkability 3+). Has a good feel to it, full but not heavy. Carbonation is just right, not overpowering. (4/5)\n\nOverall - You won't be blown away, but this beer will never disappoint. Just solid and very easy to drink. (6/10)\n\n\n30/50 Good", "Pours hazy dark golden with a thin, light tan head. Aroma is breadlines and citrus. Taste is light caramel, moving to bread and citrus. Finish is smooth wheat.", "Simple. Subtle (lemon, peppery). Summer ( fruity, refreshing.) Good enough to have again.", "From tap at a bar at Louis Armstrong airport, New Orleans. Bland aroma of sweet bready grains and a hint of sweetish overripe fruit. Moderate sweet flavour with a light bitterness. Body is medium. Blandness incarnate.", "I really wanted to like it, but I can't even finish one bottle- and I bought a case of it!\r\n\r\nPours light-gold with a large white head. Smells \"pale\", and has a very strong, yeasty aftertaste. While I can't stand it on its own, I'm experimenting with using it alongside mixers and haven't been totally disgusted. It makes for a good base to use alongside sweet tea and lime.", "Smell of malt, medium head. Clear amber. Smooth taste with a little carbonation. Palate is simple, little bit of citrus that contrasts with the malt. Very drinkable.", "A good Summer all-day beer. Pours hazy, lacy retention, hint of cloves. Citrus aroma and nice mildly hoppy finish. Summer Ales and Pils are what they are; all day drinkers without putting your lights out. I've enjoyed this beer since its inception!", "Gyllengul öl med vitt skum. Doft och smak är lätt maltighet, lättare citrustoner och en lätt honungssötma. En lätt öl.", "Vom Fass @NYBC. Trübes dunkles gelb, dünner Schaum. Kaum Aroma. Etwas Hefe und Getreide. Geschmack ist schon besser..Hefe, Zitronenzeste. Süffig. Es bleibt die Zitrone. Schönes Sommerbier.", "not a bad beer, stronger and smooth, pretty spicy and a bit of lemon. doesnt seem to get very cold. got it for a steal at walmart lol", "Very smooth malt with apparent citrus fruit and banana. Great for hot summer days, but not much else. Overall it was enjoyable, yet not noteworthy.", "Got this in one of their variety packs. Was actually one of my favorites in the bunch. I'm finding their \"Brewmaster Collections\" to be a bit better. I liked the malts in this one. Reminded me a bit of a thin (not as malty) stout, if that makes any sense. See it on the shelf in 6-packs now, but I just can't bring myself to buy it. I mean, it was good, but not THAT good. With so many things to try nowadays, it's tough to buy a 6 of this, but was happy to get it in a variety pack.", "Greatest tasting beer of all time. Perfect in the warm weather. I can't imagine summer without this classic.", "Light malty aroma. Pours a copper in color with whiteish head. Has that staple Sam malt backbone with a light citrus edge and disappointing finish. \r\n\r\nNotes: bottle and tap pours.", "Light, citrusy, and very weak. Not a particularly good beer. Tried for the first time in 2007.", "very light flavor with no real presence of any taste other than the hops.\n\nI understand not all beers will taste the same, thankfully, but I do not understand the current trend to brew a beer that lacks any taste whatsoever - except for the \"HOPS\" BS.  yuck.\n\nUPDATE 06/30/2021 -  Tried this again due to a \"pick 6\" dept. of the local grocery store.  Again, taste is light without any real distinct flavor. The hops were not as pronounced, but were still obvious.  Typical \"great\" USA \"crafty\" beer.  Yuck.  If craft brewing simply means you add 150 lbs of hops to each bottle, no thanks.  I want a beer, not a hops drink.  Yes, hops is in beer, but not to the degree that USA \"craft\" brewers think is \"good\".  It isnt.  They even add too much to their Octoberfest beers - WHICH, BY DEFINITION, ARE A MALT BEER.    USA craft beers = garbage.  Thank you Germany for maintaining your beers, to some degree, as beers and not some fad idea.", "Had this one as I tried another samuel adams for their popularity on this site. The summer ale was available at the LCBO, so I tried it. Barely average, nothing outstanding about this one. Took this one at my end of season baseball team party. Great company, great food.", "Hazy straw color; Medium slightly creamy body; Aroma of wheat, citrus, & some coriander; Flavor of wheat, citrus (notably orange & lemon), light banana, and some spice; Fairly decent.", "Light and lemony. I do not like it.\nSorry, I had to upload these old ratings. They were for me, not for uploading. And also I need 75 characters, hence this sentence.\n\n---Rated via Beer Buddy for iPhone", "Bottle at Premier Cafe, 7th Avenue, New York. Pours hazy amber with a small white head. Aroma of citrus, wheat, sweet malt and grain. Medium plus sweetness, light citrus bitterness, Light body, watery texture, average carbonation. First beer on this visit to NYC, hope I will do much better.", "Ok, nothing startling, draft at the Red Lobster, near Orlando convention centre. Lightly spiced, easy drinking, expected more fruit flavour.", "Don't buy again. Was not very tasty better seasonal beer dhdhsu hehdhdhshsh hdhdhdhsushshshshdh\n\n---Rated via Beer Buddy for iPhone", "Rating #2622 - 2016.06.25 - Draught at the Marriott I was at in SLC. Hazy gold pour, Aroma has a hint of wheat, and a herbal whif, mixed with a strong cerealy note. Taste is pretty much the same, a dominance with hints of wheat character built in (wheat, citrus, etc.) Finish is dry and crisp. Nice, light, refreshing.", "Cloudy golden with white head. Citrusy and some other fruits and slightly bready texture, but actually light enough. Refreshing", "Pours a hazy golden with a medium, smooth white head. The aroma is very minor, as I’m only finding a little lemon and wheat. The taste contains mild bitterness and is dry. Here we get lemon, wheat, bread, and some slight grain. Finish is lemon. Medium bodied, chewy in texture, and average carbonation. For a summer beer, this isn’t crisp or refreshing. When I was naive, I thought summer beers were great. Since then, I’ve come to realize that they taste like furniture polish. This tastes like furniture polish.", "On tap at Bishops Arms, Östersund. Aroma has strong cider notes. The taste maintains the apple flavour and use of ’old’ hops. Decent but nothing remarkable.", "Slightly hazy, golden pour with an orange tint and white head. The aroma has wheat with mild herbal hops. It has a medium body with somewhat sticky texture and average carbonation. The taste is sweet with light spices mixed in.", "Very smooth with a full wheat body and medium carbonation. I get subtle hints of lemon and pepper in the background. Nothing overdone. Overall this is a very pleasant summer ale. Bought one six pack, will buy another.", "There’s a hint of lemon in the smell, other than that there’s not too much else to speak of. Very muted odors. Golden in color with a hazy, almost cloudy appearance. Little head, but that may have been due to a mispour on my part. There’s an initial taste of lemon that allows the malt, hops and yeast to shine too, but the additional spices creates a finish I’m not too fond of. Not a beer I’d purchase again.", "Ok Drink \nHad a lot of after taste. Did not expect. \nNot sure if I'll drink again. \n\n---Rated via Beer Buddy for iPhone", "From old tasting notes. Bright yellow gold color. Fluffy white head. Soft fruity malt nose. Clean, crisp fruity malt flavor with hints of lemon and spice. Dry hop finish. Refreshing.", "A solid, easy-drinking summer choice. A light lemon/citrus flavor and a white head", "12oz bottle on a train. Hazy golden with a decent white head. Sweet cereal aroma with hints of citrus, taste is much the same with very subtle spice warmth coming through at the end. Refreshing enough but not memorable", "BBD: 9/2017\n\n2015 BJCP Category: 30A Spice/Herb/Vegetable Beer (base style: 1D American Wheat Beer)\n\n\r\nAROMA: Bready/wheaty base malt is moderately strong along with a citrusy lemon garnish. Slight spicy scent as well. No hops or esters (none needed) 9/12\n\nAPPEARANCE: Dark golden hue over a hazy, bubbly body. Moderate white foam mostly dissipates. Decent retention and lacing. 2/3\n\nFLAVOR: A bready/dough taste accounts for a strong portion of the palette; though a strong spicy flavor is almost as prominent. Interesting balance of lightly sweet wheat taste and mild tingling spice. Lemon flavor emerges as it finishes which complements the previous characteristics quite well. Some lingering malt and spice flavors, but otherwise clean. No hop presence to speak of; no esters either. 17/20\n\nMOUTHFEEL: Medium body and carbonation; more smooth than crisp. Somewhat refreshing; though it’s a bit heavy at 5.3% ABV to work as a true session beer. A little less alcohol and body would be totally crushable. 4/5\n\nOVERALL IMPRESSION: I used to dislike this, but now I appreciate it as a classic American Wheat Beer + spice. It’s what a summer beer should be. 8/10\n\nTOTAL SCORE: 40/50", "Aroma’s wheat malt, wet grain, carbonic tang. Flavor’s similar to nose, on the sweet side - too sweet for me.", "Aroma: Malt and bananna.\r\nAppearance: Nice, clean.\r\nTaste: Good ale.\r\nPalate: Lite body with moderate carbonation.\r\nOverall: Average wheat ale. Good lawnmower beer.", "Hazy straw color. Medium fizzy palate. Aroma: mild floral and hoppy presence, with hints of malt and grass. Taste: light citrus, pine and hops. Pretty mediocre.", "Best Samuel Adams beer for me. Very good!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n---Rated via Beer Buddy for iPhone", "Not much of an aroma, not much lemon. Not that thirst quenching either. Did have a fluffy white head that lasted awhile. More of a malted wheat taste than lemon, not spicy. If you are seeking a fruit beer, there are much better ones available.", "hazy gold color; earthy malt and citrusy lemon aroma; light wheat maltwith lots of citrusy, lemon flavor", "My favourite summer time beer to drink. I wish they brewed this year-round!", "Hazy light golden-straw color with a lively head of white foam. Peppery, grassy, and lightly zesty lemon characters in the aroma and flavor. Sam Adams variation of Blue Moon.", "Draft Pint in March 2015 - Hazy Pale Gold in colour. Small white head. Malty; toasty malts, caramel. Fruity; citrus lemon. Spicy; peppery. Sweetish malty fruity throughout. Not particularly exciting, but easy drinking and quite refreshing. (2015-03)", "0.355l bottle from bierlinie in berlin, bb 08/2016. pours a murky orange with a dense white head. aroma of cinnamon, wheat, coconut. flavour of cinnamon, wheat, spices, honey, ginger, pepper. ok, it is out of date, but seriously, a summer ale? much more like a winter one. should try it fresh next time.", "Ehh. Chugged this beast in under 7 seconds. Wheaty, dry, spicy, some hop. It’s honestly only okay. Meh. Fuck you Michcam8 and Aaron.", "12fl.oz bottle. Pours almost clear deep golden colour with a mid-sized good lasting white head. Aroma of wheat, lemon peel and spices. Taste of wheat, lemon, some coconut, yeast and spices.", "De geur is redelijk futloos. Een lichtblond bier. De smaak is redelijk waterachtig. Een tegenvaller.", "Cloudy dark straw color with dense storming activity. Slightly frothy white 2 finger head that last for 5 minutes, making some average leggings. Flavors of caramel, wheat, sweet grains, corn, citrus, noble spices. Slick medium body with excessive carbonation. Light and short finish, ending with a roasted malty feel and a thick sugary syrupy feel. Overall I find this one not very well craft from the lack of intensity and balanced flavors. Overly sweet and feels adjunct.", "An american, amber, unfiltered \"summer ale\" with white head. Aroma is a bit bad. Malt, cheese, phenol. Taste is bitter. Infected?\n\n---Rated via Beer Buddy for iPhone", "Aroma: Fruity sweet with citrus and hops\r\nFlavour: Fruity sweet with notes of banana and citrus and a fruity bitterness. Finish is fairly dry. \r\nColour: Yellow woth a white head.", "Herb hefiger, hintergründig orangiger Antrunk. Im Mittelteil bleibt die leichte Fruchtigkeit erfreulicherweise erhalten, geringe Würzigkeit, hohe Süffigkeit. Spritzig, gelungen. 10/9/11/10/11/11", "Aus der Flasche getrunken (Händlerlieferung). Sieht eigentlich erste einmal gut aus im Glas. Schmeckt dafür aber sommerlich sehr wässrig. Eine gewissen anfänglich leicht angedeutete Würzigkeit schwindet flugs. Das ganze Bohau um die Besonderheit (\"Graines of Paradise\"!!) sind eher Werbemasche.", "Nose is malt and sick, with a touch of honey. I definitely get zesty fruit like lemon and lime. But above all honey is the main contributor. It is a well rounded beer with a nice lingering sweet aftertaste. Solid summer beer.", "light sweet aroma,amber, hazy, white foam, light sweetness, lightly sour, light body, oily feel, light fruit finish.", "Golden coloured and hazy. Has a white head, medium duration. Aroma is sweet, a bit oddly spiced. Sweet and mild.", "Fine persistent foam. The aroma is a little citrus with a touch of sweet honey. It is a gentle American wheat beer, which has great malt fill with the typical freshness of the freshly-cut grains. Furthermore, it has a slightly sweet taste of honey, while taste is provided by orange zest and lime / citrus. It is a tasty and fresh wheat with the perfect name Summer Ale, for a real summer beer it is indeed. Hop bitterness is almost absent and does not contribute properly to highlight something special. Mouthwatering and easy to drink.", "Une blonde un peu voilée avec un col mousseux. Arômes de citrons et de blé. Au goût, un petit feeling limonade. Avec une touche légèrement caramelisé. Bien. Mais pas mémorable.", "bottle. Golden light haze. Dry honey on nose, bit grainy malty, some floral notes. Med light bodied, honey ginger, bitters, weak lime flavour. Clean, but a bit dull and not that smooth. Feels a bit watery at times even.", "Golden coloured beer with a medium white head. Aroma of lemon and some citrus. Flavor is malty with some wheat and and lemon notes. Thin to medium palate.", "Somehow this one slipped through the cracks in terms of my rating, but, better late than never. Pours a hazy golden with a small fading white head that manages a good deal of stringy lace. Light citrus and wheat cracker nose. Pleasant balanced flavor profile with wheaty malt holding down the backbone while lemon zest and very mild spice creeps in. Finish is clean and ever so slightly tart. Easy drinking summer quencher.", "Tap at First and Main. Pours slightly hazy yellow with below average sized white head. Taste is slight lemon and spice. As it warmed, more grassiness came out.", "Copenhagen 31/7 2016. 33 cl bottle from Fakta. The usual fellow hailing with beer mug and some idyllic looking summer water (a lot of mosquitoes are possibly spawning there). Pours hazy pale yellow with high white head. Moderate lacing. Settles as dense 1 cm thick layer of foam. Aroma is fruity sweet and pleasantly lemonadelike. A little citrus and a little orange - quite tart. Strong carbonation and slightly thick palate. Flavor is a short medium sweetness followed by a more pronounced tart bitterness. Aftertaste is rather short and quite tart. Not very complicated but refreshing with a tart twist.", "Flaske 0.33L fra Kilpis Finnland. Farge strågul/brun med hvitt skum. Lukt gress, malt. Smak Malt, noe krydder, frisk i starten, noe besk i ettersmaken.", "Flaske. Nu er jeg også lidt forudindtaget efter at have set en dokumentar hvor Koch opfører sig som et mensch. Duften er hyldeblomst, smagen er frisk og sommerlig med en masse hyldeblomst. Dejlig grill øl.", "Bottle. Pours hazy golden with a small white head. Lemony and citrusy aroma. Malty and lemony flavor with creamy wheat notes. Lime leaves and light orange.", "Bottle @ Home. Pours slightly hazy golden with a white head. Aroma of wheat, little sweet fruit, light citrus, light lemon. Flavor is wheat, spice, light lemongrass, citrus, lemonpeel, sweet fruit. Medium body, average to lively carbonation. Refreshing. 240716", "Bottle, bought@Fakta, Kolding. Pours clear golden with a small white head that soon disappears. Aroma has sweet elderflower, wheat, sweet malts. Medium carbonation, fine dry and light creamy mouthfeel. Flavour has sweet malts, apples, esters, elderflower. Mild citrus bitterness. Alright, but quite onesided.", "Smell of grain, straw, starch. Pale amber colour, high white head. Aroma of grain, paper, overripe fruit, some mead. Sweet. Lively carbon, light body.", "355 ml bottle. Hazy yellow colour, thin white head. Sweetish spicy aroma with lemon and wheaty malt. The flavour is malty, with wheat and citrus, and a finish of grass and spicy notes. OK.", "Cloudy yellow color with a nice banana and clove aroma, taste is a little bit of lemon and some spice. It’s alright", "Bottle from Fakta. Frothy white fair mostly deminishing head. Yellow colour. Moderate malty and hoppy aroma. Moderate bitter flavor. Average moderate bitter finish. Oily palate. A little boring.", "355 ml bottle from a Fakta discounter. Hazy, deep golden colour with a thin, white head. Fruity aroma with citrus, sweet exotic fruits, pale malts and a subtle spiced note. Taste is light sweet. Medium body with a creamy texture and a soft carbonation. Finishes slightly dry and fruity with exotic fruits. Nice, refreshing.", "Bottle. 5.5%. Best before 04.17. Pours a hazy, pale yellow, with a white head. Slightly tart aroma with hops, fruit, citrus and grass, a bit spicy. Citrusy (orange peel, lemon), hoppy, spicy flavour. Burnt rubber overtone as it warms. Finish is citrusy (lemon) and mildly bitter, with a light milky note. Lingering spicy, grassy note. Light green apple note as it warms Overall so-so. Feels unbalanced. I can see where it wants to go, but it isn’t really working for me. 16.07.16.", "Bottle at Gaylord Nashville, 12th July 16. Pours clear amber, aroma is wheat, citrus, some spice. Taste is slight spice refreshing, simple, nothing special", "This year's batch is less sweet than in years past. Palate is smoother with a heff background.", "Bottle @ Fakta, Kerteminde. Pours clear yellow with a white head. Massive coriander, grass, lime. Very Sweet and spicy. One dimensional.", "Bottle 355ml. Pours clear golden with medium sized white head. Aroma of wheat malts and lemon. Bit watery and not a big fan of the aroma. Medium bitterness.", "120z bottle bbAUG2016. Bref: an industrially weak perversion of a thin spiked Belgian Wit just beneath Blue Moon in adjunct-laden radler-i-fication. - Ar: virtually none, spent banana peel starches and old sweet vanilla powder. Tastes like a low-fat yoghurt infused with artificial vanilla, slick and yet watery in mouthfeel. Lemon peel and the paradise grains must have evaporated, leaving an empty wheat peel of summer sadness and sad summeriness on banana-botoxed lips. Cf. Widmer Hefe for a parallel take on a German Weizen. #SadUSWheatAles", "Bottle 355ml from Alko. Pours clear light golden with a small white head. Grainy aroma, some citrus and hay in the aroma. Light straw, grainy flavor.", "Draft at Willie's Ice House. Hazy, orangish yellow, white head. Aroma is wheat and lemon. Crisp, citrus flavor. Nice summer brew.\n\n---Rated via Beer Buddy for iPhone", "Hazy golden with a lasting white head. Fruity aroma with mango and and pineapple, along with a spicy touch. Sweet fruity and spicy flavour with bready malt.", "Clear yellow, easy drinking summer beer. Wheat flavor with a hint of citrus. Bland and not worth a repurchase. \n\n---Rated via Beer Buddy for iPhone", "Very summery aroma but the taste is a bit too grapy or zesty for me. It leaves just a bitter taste and not enough fruitiness.", "Keg at The Standard. Hazy golden body with a thin white head. Good lacing. Aroma of orange pith, cigarette butt and white bread. Flavour of straw, apricot and a grassy, bitter finish. Medium body with a watery, slightly oily texture. Soft fizz. Fruity but I feel it doesn’t quite gel.", "(Bottle, 0.355 l - BBE Apr 17, from Alko, 20160625) The beer poured golden and hazy. Its head was medium sized and white. Aroma had sweetness, fruitiness and lemonade. Palate was medium bodied with medium carbonation. Flavours were sweetness, fruitiness, lemonade and mild bitterness. Aftertaste was sweet. A lemonade in a beer bottle. Not for me, thanks.", "355ml bottle from Alko. \nPoured deep golden color with a thin white head. \nMalts, orange, floral notes in aroma. Bit dull. Not much flavor actually. Quite smooth, light. Lemony finish.", "355 ml, bottled. Pours cloudy orange with a small white head. Aroma: Malt, mint. Lemon. Taste: Medium sweet, malt, zesty tones. Notes of herbs, pepper. Grains. Palate: Medium body, average carbonation. Minty flavours. Ok.", "A golden beer, a head is dense, big and blond. Aroma is mild, wheat, fruitness of lemon, and fresh grass. Taste has weird spicyness, some lemon, slightly musty end. Almost medium bodied, fluffy palate. Slightly weird beer and not so good way at this time.", "Hazy orange ochre, just remains of head, no lacing. Mildly sweet aroma, mango, ginger, bit spices, grain. Light body, soft carbonation, medium long finish, semisweet. Was not crisp, fresh and refreshing. Bit dull actually. Have to say this bit disappointing from this brewery, expected more.", "Can at a wedding in NH. Pours a slightly cloudy pale golden color with a white head. I only know this because someone else had a glass of it. I drank it from the can. Light grainy aroma with a hint of lemon. Taste is slightly sweet. Medium to high carbonation. Fits for summer.", "12 oz bottle poured in pint glass. 2 finger white head dissipates modertly quick. Beer is golden color. Somewhat hazy. No real lacing. Aroma is weak. Sorta just wheaty smelling. Taste is lightly sweet and faintly bitter. Average carbonation. Light bodied beer. Smooth. Decently crisp. Refreshing summer beer.", "Admittedly, I don’t like wheat beer, but this has sort of a garbagy smell, and the main citrus and bread tastes are followed by a garbagy aftertaste. Not very good.", "Golden yellow color, not much aroma but smell is not that important to me. Taste is easy clove and maybe faint banana. Smooth summer drinker", "a) I like wheat beers b) i like unfiltered beers c) i think citrus is sublime in summer d) ipso facto i like this beer. rec: hang a small cross sectional slice of lemon and use that as a palate cleanser at the end of your beer", "Hazy yellow body. Tiny white head. Draft. The aroma is weak but pleasant with herbal tones, the taste fruity with a full palate.", "Good taste, excellent beer for a hot summer day, just absolutely delicious!!!!!!", "Best by 08.2016. There is not much aroma or flavor here. It has a bit of lemon, wheat, with some spice on the back end. Meh.", "Ahh, one of the beers I loved before I knew what beer could be (the other was micheloeb’s amberboch). The aroma is faint cereal grain and faint lemon. Taste is cracked wheat, some orange, and some lemon. Not too much else. It’s not bad, but not great. I will give it kudos for being so bubbly in the glass and creamy on the tongue.", "12 oz bottle. Hazy dark straw color with a white head. Aromas of orange and a little citrus and spices. Taste of a little citrus zest flavor and spicy taste. Light mouth feel. Nice lacing in the glass.", "Basically no aroma on this one at all. Pours a lackluster yellow with an off-white head. Flavor is bitter but not in a good way. This beer doesn’t have much going for it.", "Tap@Jolly Scholar, Cleveland, USA. Light/medium aroma with honey, citrus and some fruits. Fresh. Light yellow color with small artificially white head and hazy liquid. Medium taste with citrus and fruits. Narrow taste spectrum and short aftertaste with fruits. Light/medium body with high/medium carbonation. Overall, bit artificial and lame, still refreshing.", "Sample @ Giant Eagle Market District. Pours a dark amber with a thin white head. Aroma of wheat and lemon zest. Strong flavor of wheat with a little spicy pepper. Little to no carbonation. Kind of flat with a warm dry finish. Not at all like a good Weizenbier. Blah.", "Draught. Oatey with a light citrus hit. Tastes more calorific than terrific.", "Tasted from draft. Pours a murky orange with nice white head. Good lacing. Aroma is lemon, orange and tropical fruits. Taste is moderately sweet with fruity notes. You do get a faint peppery taste at the end with some orange, lemon, mango flavors. Not too bad. Definitely better than blue moon. \n\n---Rated via Beer Buddy for iPhone", "12-ounce bottles poured into a pilsner glass. Not bad, but pretty average compared to other Sam Adams’ offerings. A little thin, but just right for drinking on its own in warm weather. Not the best beer to have along with a meal.", "This one takes me back. Back to summers when I was a 21 year old in New England, thinking this was as inventive as beer could get. \"Actual lemon zest in the beer?? These guys are CRAZY!\" Coming back to it now, it’s still entertaining and it actually does taste pretty good on a hot day. But there’s no denying that it’s also a bit of a bitter, muddied mess. Thanks for the memories, though, Sam!", "Originally rated on 5/19/08. A slightly above average beer all the way around, its flavor had hints of lemon and was slightly peppery. A light body but not watery. all and all its worth a try.", "Small frothy offwhite head. Fair lacing. Mostly diminishing. Cloudy beige thick body. Aroma: dried banana, wort, moderate yeasty. Initial flavor: moderate sweet. Final flavor: moderate sweet light bitter; average duration. Palate: medium body, oily texture, lively carbonation, metallic finish. Tastes like work and black tea. Not alluring at all. Estufa. Low drinkability. 6s Bitter disappointment.", "Nice fresh lemon zest with hints of grain. Easy to drink, a bit grainy, very refreshing. Sweetish malty fresh with a smooth lemon fresh aftertaste. Nice refreshing!", "What a remarkably average beer! Drink this if there’s nothing else around and you don’t want to risk drinking something you know will taste like feet. But otherwise, pass this up.", "Bottle from a friend? Poured yellow orange with white head. Aroma sweet orange musky malt. Light carb med bod. Tastes sweet grains some spices.", "Decent beer. I gave it a 6 out of 10 bottles on my show: \r\n\r\nhttps://youtu.be/Ni_I6193JBo\r\n\r\nCheck it out for my thoughts on the beer.", "Some Vienna aroma. Slightly sweet no mouthfeel crystal clear yellow some wheat notes. Very watery conflicted with some sweetness.", "Pours a cloudy honey color. Thick white head. Some lacing. Pretty well carbonated.\n\nAroma is sour. I’m not sure what it is. Also, a little lemony.\n\nTaste is a little spicy. That sourness in the aroma is finding it’s way into the back of my throat. It’s a little odd. It’s got a little lemony zest flavor, and also some something. I don’t know.\n\nMouthfeel while a little a bitter, is very refreshing. It’s more bitter than IBUs might suggest.It’s maybe a little heavier body that I would want in a \"summer ale\", I would want something a little lighter. But this is medium bodied.\n\nOverall this is good. It’s not great. There’s some tastes and stuff in here that I’m no familiar with, or are hard to taste. I guess I would have it again. It’s not amazing, but it’s ok.", "Cloudy yellow. Sweetness a little cloying with esters. Mild hopping. Some lemon. Ok.\n\n---Rated via Beer Buddy for iPhone", "Great drinking Wheat Ale. Goes down smooth with no aftertaste. Not nearly as good as Erdinger, but a hell of a showing. Will buy again.\r\n\r\nMB", "On tap at the Frog Pond, in Rochester, NY. Pours a cloudy yellow colour with a small white head. Aroma is bread, banana. Taste is same and grainy malt. So so...", "Cloudy golden yellow with a decent white head. Aroma is banana and bready malts; some yeast. Taste brings some light citrus tang with notes of banana and bubblegum. Grainy malt backbone. Very refreshing.", "Bright yellow / orange colour, with a small white head. Medium body - you get a bit of the wheat texture. There is grain in the aroma and taste - I couldn’t say whether or not it was \"gram of paradise\" - and a sweet lemon taste too. Pleasant enough.", "Draft pour pint at the dirty bird. This week on \"I can’t believe I haven’t rated this\" we have yet another Sam Adams beer. Pours an oily golden color with a thin fizz head. Soft grainy wheat aroma. Flavor is exactly what I expected. A mild wheat flavor, light body, and a decently refreshing cool finish. In a lineup of common competition, this is an obvious choice, though it’s not my favorite \"summer\" beer. I have a different definition. Not bad.", "보스턴 비어 컴퍼니 - 사무엘 아담스 서머 에일 5.3% ABV 구수한 보리맛에 가벼운 레몬향의 뒤끝. 기분 좋은 여름 시즈널 윗 에일. 아프리카산 페퍼가 들어가 스파이시 함도 있다는데 다시 마셔보고 싶다. \r\n\r\nhttps://twitter.com/MaekJuBot", "Poured a cloudy golden color with fluffy white head. Aromas of lemon, wheat, hay. Taste followed the nose. Light body and thin texture. Bubbly carbonation. Refreshing to drink in the summer. Similar to a shandy.", "Aroma is wheat citrus and what I guess is the grains of paradise. Would pass for a Wit easily. Appearance is hazy light orange with medium frothy off white head. Taste is citrus orange forward, wheat, peach tangy aroma hopping and light hop bitterness. Palate is medium light. Sweetness and a light bitterness lingers. Overall a nice beer. The citrus comes across as slightly artificial but still not bad. Could just as easily call this a Belgian Wit.", "Pours cloudy golden with low white head. Aroma of honey, citrus, wheat. Taste is sweet and wheaty. Body is light and smooth with soft carbonation.", "poured from a bottle. Light golden straw color with very thin head and minimal lacing. Bread and biscuits in the nose with a faint peppery finish.\r\nSmall amount of honey sweetness with light citrus at the end of the palate. Slightly dry finish.", "Refreshing summer wheat ale. Not fully a wheat clove taste finishes with lemon \n\n---Rated via Beer Buddy for iPhone", "12 oz bottle poured at my brother’s house in Methuen, MA. Pours a hazy golden with no head; not as cloudy as many other wheat beers i’ve had. Smells of lemon and a touch of pepper. Taste is mostly peppery. Not great but drinkable.", "A smooth and lightly creamy ale. Just a hint of fruitiness and a strong spiced flavor. Very crisp finish.", "Draft at Applebee’s (Dover, DE). Pours cloudy, yellow a small white head. Aroma of wheat, yeast and some citrus notes. Taste consistent: wheat, citrus fruit and some yeast. Crisp, refreshing, nothing out of the ordinary but not bad at all.", "First taste is lemons then the next thing that comes out is tequila. Crisp and refreshing summer ale probable wouldn’t get it again.", "Bottle from Foley’s, Sligo [300615]\r\n\nBlonde / light orange, soft haze, frothy white head, slight lacing\r\n\nAroma of soft lemon juice, lemon zest, fresh, nice lemon nose\r\n\nTaste of lemon, light sweet soft pale malts, dab of creamy wheat, lemon citrus, simple flavour but quite good\r\n\nPalate - Soft carb, light medium body, slightly creamy, easy drinking. Finish of soft sweet lemon, soft zest, refreshing.\r\n\nOverall - Simple easy soft citrus summer beer. Nice mellow lemon. Pleasant with a good drinkability.", "Poured from can golden honey with a thin white head. Aromas of citrus wheat and malt. Taste is somewhat thin and needs something to brighten it up as it has a lingering spice tone.", "smooth, soft and sexy with peach and apricot flavors. very little bitterness. greatly preferred this summer ale over yuenglings.", "It's ok for a summer ale, light fresh taste with some summer feeling to it. No real scent, color is ok, sort of like a cloudy orange. Tastes ok with a light summer taste and no aftertaste \n\n---Rated via Beer Buddy for iPhone", "Pours golden honey with a creamy ivory head. Appearance is quite pleasing. Aromas of lemon, citrus, wheat and malt. Taste is tinny metallic citrus with hints of white pepper and spices. It's ok. Probably goes down well on a hot summer day.\n\n---Rated via Beer Buddy for iPhone", "hazy gold color with a thin white had that goes away. aroma is bread and a hint of lemon. Flavor is bread, some spice, and citrus.", "Pale gold. Wet wheat, minerals, and watery citrus. Flavor is tinny wheat malt and some citrus.", "Beautiful looking, but bland tasting beer. There is not much to taste here. This needs some kind of citrus taste to it and maybe unfiltered. It has potential, but the recipe needs to be tweaked, but I feel that way with a lot of the beers Sam Adams makes.", "Fuck this noise. Fuck this noise Fuck this noise Fuck this noise Fuck this noise Fuck this noise", "From a bottle, I drank two and that was plenty. Not quite, not even close. Not much malt, not much hop, it was like a soda.", "Pours clear golden with a big puffy beige head, excellent retention. Aromas of spice, bread, lemon, grass. Light body, creamy, smooth, lively. Lightly sweet, mild tartness, light bitter and peppery finish. Very drinkable.", "5.3% ABV. Wheat Ale. \r\n\r\nNo head out of the tap.\r\n\r\nColor is a dark hazy honey, 6-8ºSRM.\r\n\r\nNose is a full-bodied malt with florid wheaty flavors. Had a beautiful fresh nose that was inviting. \r\n\r\nPronounced carbonation.\r\n\r\nPalate is full of witbier goodness, brief citrus brightness, giving way to the bold malt and then another brief hint of citrus peel in the finish and then it’s the next mouthful.\r\n\r\nJust like having a Blue Moon, Hoegaarden or a Kronenbourg Blanc. Nice.", "Somewhat watery, wheaty ale, not much going on here. I imagine it quaffs pretty well compared to the typical pale lager in the summer. Meh.", "On tap. Golden pour with small white head. Light citrus aroma. Taste is sweet, some lemon and light malts.", "APPEARANCE - cloudy like a heffe, perfectly white head that goes away fast.\r\nNOSE - very limited olerifousness.\r\nFLAVOR - medium body & crisp. \r\nNOTES - good summer drinker.", "Poured a slightly hazy gold color with a minimal head. Fair amount of carbonation. Aroma was sweet malt, buttery.. didn’t really get much else. Taste was sweet, spicy, and skunky. I’m actually wondering if I just drank from a bad bottle. I’ve had this beer before and could swear it was better quality than what I’m tasting now.. maybe I’ll re-review it someday.", "Sabor afrutado, con notas de durazno y mango, poco olor con mucha cabeza de espuma color amarillo a cobre, muy suave al paladar", "This is a light ale reminiscent of the original session IPA’s from 10 years ago. Notes of wheat, lemon, and light grain blend well for the starters of craft drinking. Experienced crafters will not be impressed.", "Dirty cloudy wheat beer with lemon aroma. Taste is soapy bitterness with the wheat ale base and lemon. All tastes bitter and soapy almost. Cheap dirty taste to this one. Not impressed. \n\n---Rated via Beer Buddy for iPhone", "Pours dark urine with a thin white head. Aroma is mostly nothing, perhaps a bit of citrus. Taste has a bit of that wheat beer kick with a smidge of citrus. Finishes heavy on yeast. Typical Sam Adams overhype.", "Banana and clove taste. Offputting hint of bitterness. Light and fresh texture, though.", "Pours a clear, classic golden with a short white head. Banana and Clive on the nose. Medium body with good carbonation. Subdued flavors of lemon, banana, and clove.", "Aroma: Citrus, especially lemon, a smidgeon of wheat, hops\r\n\r\nAppearance: Yellow, light, small white head.\r\n\r\nTaste: A lot of lemon, a little wheat\r\n\r\nPalate: refreshing, as expected.\r\n\r\nOverall: A bit too boring and a bit too much lemon, prefer other wheat beers more. Refreshing but ehh.", "Tap@tonyroma,Orlando. Hazy golden color with a white head. Aroma has citrus and spices. Taste has some malt and is quite sweet. Flavors of light wheat, citrus and spices.", "Pale golden pour with light spice on the nose and a lack of any real flavor. Finishes with a light, slightly astringent bitterness. Pretty boring beer from a great brewery.", "サマー   \nペールエール\nみかんのような香り", "From tap. Yellow gold with medium head. Aroma is sharp with citrus notes and an artificial note that I can’t place. Taste is sharp citrus and a dry after taste that is quite stale.", "Bottle. Pours clear amber with a creamy white somewhat lasting head that leaves some lacing. Weak aroma of grass and lemon. Very lightly bitter, thin body, average carbo, flavors follow nose though very subtlety and a thin brief barely bitter finish.", "Strong malted wheat notes upfront with some mild hoppiness and light berry sweetness. Not the best but certainly not the worst.", "I’m not in love. Large plastic cup pour of somewhat of a deeper honey golden with a thin white head that doesn’t hold and dissipates quickly. Aroma is wheat, grains, malty, a little fruit. I actually maybe get mango in there. Flavor follows, with malty sweetness and a little fruit notes, wheat and grain flavors again. It’s light and sorta refreshing but I don’t love it.", "Poured out of a can. Hazy dark straw color with a white head. Aromas of orange and a little citrus and spices. Taste of a little citrus zest flavor and spicy taste. Light mouth feel. Nice lacing in the glass. Overall decent beer. But nothing to wow you.", "Pours a hazy gold color with no lacing or head retention. Smells of citrus hops and lemon. Tastes lemony with a slightly sweet finish, not too hoppy. A solid summer drink. Prob a session beer.", "Good beer but little bitter, very light and smooth nice beer for BBQ and grill meat food.", "Old rating. Bottle from Old Town. Aromas like any other adjunct lager. On the palate some citrus is noticeable though. Clean, crisp and refreshing but boring.", "13 April 2015: Bottle: Poured a orangeish yellow with a fair white head. The aroma was faintly citrus but the flavor was spicy and fruity. Easy to drink with no bitterness nor aftertaste.  Rating 3.1. \n\n3 May 2020:. Can. Dark golden pour with a white head. The aroma is fruity with orange and lemon zest and spicy with notes of pepper and coriander.  Nice enjoyable ale for an afternoon on the porch. Rating 3.4", "12 pour from refrigerated bottle into wheat glass. Clear, deep yellow, small head, a bit of lacing. Nose is weak. Fruity. A little orange. Mouthfeel is weak-to-moderate. Taste is an alright wheat. Taste is wheaty, orange, maybe coriander. Alright drinking beer.", "I don’t get description. You gotta have a dogs nose to pick out any flavors described. Not a bad beer when it comes to process. But just ain’t nothing here.", "I thought it was a nice, light, refreshing, easy drinking beer. It looked great and very inviting in the pilsner glass. Not much of a nose. The taste was a little watery. a nice overall beer, but nothing memorable about it.", "4/2/15 (Draft - Finley Dunnes Chicago IL) Light brown, murky appearance, minimal carbonation and head. Minimal aroma and taste, malt and fruit present and balanced. Smooth taste. Standard beer.", "drank straight from the bottle..wheat,lemon,grassy flavor..not my kinda style..just something to have while passing time.", "On tap at Iavarone, Long Island. Hazy rusty yellow with substantial white head and nice lacing. Aroma is sort of adjunct lager, bit of wheat and citrus, nothing substantial. Flavor is light wheat, fairly floury, sort of corn flavor. Light Nitro-like mouthfeel. Not gonna be a go-to summer beer.", "A light wheat ale, that is easy to drink, only a slight yeast aroma and flavour.", "Draft at Joe’s. Pours orange gold with a white head. Flavor is wheat, orange, lemon. A bit of pepper in the finish.", "Pours a cloudy pale yellow the color of pineapples. No head to speak of, just a very tiny ring of white bubbles. Smells of apples, floral hops, some bready fruitiness I can’t place. Maybe those are the grains of paradise? In the flavor, a heavy wheat flavor, with some subtle citrus and spicy notes. Very mild sweetness. Light body, no bitterness. Summer Ale isn’t fantastic by any means, but it is the taste of the season. What is it about wheat that’s so good during summer?", "12 ounce bottle into signature pint glass, best before 11/2014. Pours hazy bright golden color with a 1-2 finger dense white head with good retention, that reduces to a small cap that lingers. Nice spotty soapy lacing clings down the glass, with a good amount of streaming carbonation retaining the head. Aromas of lemon, orange, apricot, pear, apple, coriander, pepper, wheat, cracker, bread, herbal, grass, and yeast earthiness. Nice and pleasant aromas with good balance of pale malt, spice, and yeast ester notes; with solid strength. Taste of lemon, orange, apricot, pear, apple, coriander, pepper, wheat, cracker, bread, light honey, herbal, grass, and yeast earthiness. Minimal herbal spice bitterness on the finish; with lingering notes of lemon, orange, apricot, pear, apple, coriander, pepper, wheat, cracker, bread, light honey, and herbal/yeast earthiness on the finish for a good bit. Good balance and robustness of pale malt, spice, and yeast ester flavors; with a great malt/yeast/spice balance and zero cloying flavors after the finish. Medium carbonation and body; with a very smooth, crisp, and lightly creamy/bready mouthfeel that is nice. Alcohol is well hidden with zero warming present after the finish as expected of 5.3%. Overall this is a nice spiced pale wheat ale style. All around good balance and robustness of pale malt, spice, and yeast ester flavors; and very smooth and crisp to drink. A nicely enjoyable offering.", "Interesting I thought I had it already rated. It was thin and easy to drink with that nice tickling sensation of Sam Adams’ beers.", "Pours a hazy orange with a medium white head. The aroma is wheat and extremely citrusy. The taste is similar. I do not think this beer is very well balanced.", "How: Bottle Appearance: hazy orange, white head. Aroma: floral, lemon peel, wheat, grass Palate : light body, average carbonation.", "355ml bottle purchased at the LCBO in Peterborough, Ontario. Clear golden in colour with a thin white head, light patchy lacing. Aroma is sweet, a little grainy, some apples, light wheat and citrus. Flavour is moderately sweet, some very light citrus hops, wheat, some metal. Sweet and a bit chemical mouthfeel, light body, moderate carbonation. Finishes quick, a bit watery.", "Drinkable but nothing special...perfect for out on the boat................. .....", "A dreaded American Wheat, going undercover as a ’Summer Ale’. Boring. Wheaty. A refreshing afterthought of a beer.", "Refreshing but overpowered by lemon taste.   \n\n---Rated via Beer Buddy for iPhone", "Nice beer I drank all summer. Tinge of spiciness that offsets the mild qualities of this guy. Almost doughy yeast flavor that is in the background helps me come back to this guy over and over.", "Pours a hazy orange color with a 1inch white head that leaves minimal lacing as it dissipates on a weizen glass.\r\n\r\nSmell is great. Great wheat smell with a good bit of orange. \r\n\r\nTaste is really nice. Has a sweetness up front with the maltiness kicking in during the middle of the taste then a ever so slight bit of hops at the end. \r\n\r\nMouthfeel is pretty good with a nice carbonation to it. \r\n\r\nPoured from a 12 OZ bottle into a pint glass. Purchased as part of a Sam Adams 12 pack of Summer beers at a Publix in Savannah, GA. A great appearance and flavor for me. American Pale Wheat Ale is a style that I greatly enjoy and this was a real pleasure to try. A great beer for a multiple beer event in the summer time.", "Bottle found buried in back of fridge. Pour slight hazy lemon yellow. Nose light citrus, dank hop, and hint of pepper. Taste mix of tropical fruit and spice up front. Mid palate very sweet then mild grainy malt. All in all, a surprising mix of flavors. Perhaps the age helped or the fact that I’m starving.", "Not much of an aroma just a hint of pepper. Gold colour with a short lasting white head. Not much taste, slightly peppery with mineral undertones. Watery feel with a dry mineral finish", "Pours a slightly hazy yellow with lots of head. Nicely carbonated good mouthfeel, but slightly medicinal tasting.", "Appearance: Slightly hazy body that is a medium shade of golden yellow with a fluffy white head that leaves ample lacing.\r\n\r\nAroma: It has a sickly sour aroma that is not very inviting. There is a bit of lemon zest but not very fresh smelling.\r\n\r\nTaste: There are some good qualities and some bad. I put it this way because at first I really did not like this drink, but some of it started to warm up to me. There is this flavor that tastes a bit like what I can only assume dishwater tastes like. There is this lemon twang and this muddy mess of sickly tasting flavors like old vegetables in the refrigerator. On a positive note there is a smooth wheat flavor that tries to come to the rescue at the end. If I had a 2 second memory I would probably really enjoy this beer.\r\n\r\nPalate: The palate for this beer is pretty bad. The combination of flavors makes it undrinkable to me.\r\n\r\nOverall: I find this to be a beer of poor quality that I would not recommend or drink again.", "It’s pretty good, it’s got that warm summer time flavor that every brewery tries to hit, but it’s not perfect. maybe a little bit too wheaty?", "Rated based on notes taken 23 Apr 2012 -- This is an okay summer brew, meant to be refreshing, it suffices but doesn’t excel.", "Pretty good.nice amber colt. Little to no head. Slight yeasty flavor. Citrusy acidity, banana flavor with coriander.", "11th July 2014 sees me on Balboa Island in Newport Beach, the women folk are shopping and I am thirsty, so the only option is the ’Village Pub’, the trendy, expensive and foodie place on the main drag. In here the tap selection is truly crap for a beer hunter, so I had this and a ’Rebel IPA’. Anyway this hazy, slightly sour and citrusy brew was refreshing and just what I needed at the time. Did not really test my taste buds but it did not upset them either. I am not a huge Wheat Ale sort of guy, but I have no problems with this.", "Very refreshing and aptly named beverage. Pleasant citrusy acidity and tartness with a little bit of peppery spice. Clean and light.", "Bottle from the hotel bar in Latrobe, PA. This town will forever be known as the town that doesn’t sell craft beer. It’s annoying. Light golden, slightly cloudy. Taste is cereal like with bread elements expected from a wheat. You can taste the light citrus and spice of coriander. It ends rather unpleasantly...almost flat/thin. Lots of lemon peel aftertaste. Nothing special.", "Bottle. Backlog. No label taken. Pours yellow gold white head. Nose/taste of toasted cereal, lemon, light wheat/banana and coriander. Lighter bodied.", "This is a decent wheat, but nothing to get excited about. Not bad. Not great. Sometimes it could be the best available.", "Bona cervesa, és bastant equilibrada i gustosa.\r\nBuena cerveza, es bastante equilibrada y sabrosa.", "Drinkable beer. Not bad. Not something to go out of the way for. Hazy orange with no head. Aroma is grainy. Taste is the same with a little burnt grain.", "An aroma of mild sweet cereal grains, coriander, and mild lemon zest. Appears a hazy unfiltered deep yellow, some foam and lace. Tastes of cereal, lemon, vanilla, and oregano. Palate is ordinary. Overall, enjoyable.", "Tap. Great opaque gold. Some lingering head. Not much nose. A but thin. Bright lemon followed by a bit too much yeast. Not bad.", "Draft in Las Vegas. Hazy orange pour, almost no head. Aroma of spicy citrus, some wheat and slightly fruity with a hint of banana. Flavor is a bit messy with spicy yeast, fruity and quite some wheat.", "Aroma is citrus, orange and coriander. Taste is light sweet malts, banana, lemon grass with some bitter clove. Some light yeast notes. Appearance is a hazy gold with a thin pearl head that retains fairly well.", "I vinet sanningen, sägs det. I Samuel Adams Summer Ale hittar man möjligen korn (!) av sanning. Med den ordvitsen låter jag ridån falla innan Ratebeer-adeln jagar mig tillbaka till min simpla underklassbakgrund i Mariestad eller Sofiero.", "Clear yellow color with a minimal head. No aroma. Just carbon dioxide and water. Very little flavor. This is basically club soda.", "Pours a hazy yellow orange with a one finger white head which quickly fades to very little lacing. Aroma is of citrus, wheat brad, spices, light pepper, and light spicy hops. Taste is pretty similar to the aroma with a refreshing combination of citrus, spices, wheat, and some light spicy hops. Has a medium-light body with a semi creamy mouthfeel and a semi dry, crisp, refreshing, mostly sweet, medium finish. Overall, a decently tasty wheat ale that is a above average summer thirst quencher.", "From a flight on tap. Not a bad summer time ale. Bright and clean. Decent balanced wheat style. Good for the heat. \n\n---Rated via Beer Buddy for iPhone", "One of my favorite summer seasonals. Perhaps the citrus is a little much for some but on a hot sunny summer day it is very crisp and refreshing. \n\n-via BBapp", "Cloudy golden colour. Sweet, watery, lemon, wheat, ginger, very very boring", "Bottle bought at Trader Joe’s, Foxborough, MA, in July, definitely a summer beer, clear citrus aroma but overall well balanced. Nice foam.", "On tap at the brewery. Pours a cloudy golden color with a fluffy white head. Aroma is lemon and spice, with the taste that follows with slight sweetness. Body is light which makes this an easy and refreshing beer to drink. Definitely a go-to lawn cutting beer.", "On draft at a diner in Houston airport. Pours a hazy gold with no head. Aroma is of wheat, hops and a little citrus. Taste is OK. Oily mouth feel. Floral and citrussy taste. Quite hoppy with a bitter aftertaste", "bottle. Poured hazy straw coloured with a thinning bleach white head. Nice malted wheat aroma. Light body with a creamy mouthfeel, finishes clean. Flavour of malted wheat with a breadiness that I wasn’t expecting, lemony citrus notes and a hint of pepper. A really nice session wheat.", "Bottle. Lemon gold with a thin head. Aroma is lemon ginger. Flavour is syrupy lemon ginger, a little spice on the base.", "Smell is faint wheat, malt, and dough. Pale yellow, with minimal white head. Taste is slightly sweet, malty and finishes with a slight bitterness. Light bodied, crisp, average carbonation. It’s alright but nothing really all that special.", "Pours golden yellow from tap. Little head. No aroma. Taste is citrus and spice with some hops. Refreshing. Good as a summer style beer but doesn’t really do much interesting. A little rough carbonation.", "Good summer beer...a bit on the sweet side@dhrjrj c jcnffnfjfjfjfhfhrhrjfjfjrjrjriertiuup", "Bottle. Pours a golden color with white head. Spicy, lemon peel, citrus, malty aromas. Spicy, zesty, wheat flavors. Solid, easy drinking summer beer.", "Deep gold, cloudy, tall head, little lace. \nCharming, yeasty, bready nose. \nMedium body, smooth, creamy texture, highly carbonated, bright mouthfeel, medium flavor intensity, perfectly balanced, good length. \nDry but a sweetish touch, low bitterness, refreshing acidity, almost tart, which disguises sweetness. \nYeasty, slight taste of lemon peel, discretely honeyed towards the end. \nVery enjoyable and well rounded session beer.", "12 FL OZ ($?) part of a multi pack. I took one sip of this and tossed it out. garbage fruit beer. very very not my taste.", "Bottle from radimd, many thanks.  Malt, lemon, spices in aroma. Wheat, lemon, bready malt, spices in taste. Easy drinkable beer.", "Good overall flavor. Light, not a lot of flavor, but good thirst quenching beer. Went well with my pizza.", "tasting-light taste, not much flavor-wheat and maybe lemon, no alcohol present. no thanks", "Drank out of bottle after long, hot summer day. Nose is of grain and a touch of citrus. Taste is simple - malt with a twist of lemon and maybe a drop of spice . Easy to drink . Decent summer beer.\n\n---Rated via Beer Buddy for iPhone", "One of my favorite summer beers. Esp on draft with some seafood. Pours hazy orange with quickly dissolving head. Wheats and citrusy hop notes. Almost a peppery finish. A very good summer sipper", "Bottle from a sampler. Pours a slightly hazy golden with thick cream colored head. Aroma of malts and grasses. Taste of mostly malts with s light hint of citrus.", "Hmm... A wheat ale for the summer. Whoda thunk it? The body is a slightly hazy straw color and it is capped by a modest white head. Little lacework is present. The aroma is bready with a soft spiciness, presumably the grains of paradise. The flavor begins with a white bread dough taste followed quickly by said spices. A light citrus twist rounds it all out. It finishes on a lingering spicy note. This is certainly an easily drinkable brew and, although I doubt it will ever become a \"go to\" beer for me, I would not refuse another go at it.", "Tastes like tonic water with a stale lemon. Not horrible ice cold but damn...not that good either.", "At backyard party with only a red cup to use poured a pale yellow with a white head. Aroma was light and was lemon and wheat with a hint of spice but not impressive. The taste was pretty much the same. Pretty boring.", "Pretty mediocre. See citrus on the nose. Lemon, honey flavors. Not much body; slightly tangy bitter aftertaste. Pretty typical Sam Adams offering.", "16 fl oz bottle, bought in Cambridge, MA. Unclear pale yellow in the glass, small white head. Dull wheaty with on the nose. Starts with dusty citrus, flat on the palate. Later thinner. Not really enjoyable.", "This is awful. It is fizzy and yellow, there’s no suds after about twenty seconds. This beer smells like dirty socks. It doesn’t taste much better than that, either. Take an average, mass produced American beer and filter it through your armpit, and you will have this. The label says there is lemon zest in this beer. I’ll take their word for it.", "Beerbistro Toronto na vycape.\r\nFarba hnedo zlta. Vo voni si najde kazdy nejake letne citrusove ovocie. Chut je velmi prijemno osviezujuca. Citit ananas, citronovu travu a koru citrona, ananas alebo mango. Dochut zostava ako po ovocnych cukrikoch. Keby to bol radler, pila by som ho namiesto letnej malinovky. Celkovo je to pivo velmi dobre, osviezujuce. Vhodne na letne kokteily. ---- Beerbistro Toronto on Tapping --- Beerbistro Toronto on Tapping \r\nBrown yellow color. In the aroma you can find any summer citrus fruits. The taste is very pleasant refreshing. Feel pineapple, lemon grass and rind of lemon, pineapple or mango. Aftertaste is like fruit-candy. If will be a Radler, I see I found finally the right  lemonade for me. Overall, this is a beer very well, refreshing. Suitable as a summer cocktail.", "Tapped at the Beerbistro in Toronto/Canada. Overall a very refreshing and fruity beer. Nothing awesome but no disappointment neither. Fruity aroma of pecheas, pine apple, citrus. Taste is wheaty, mango, and a mild bitter fruit finish. Overall a good summer thirst killer.", "En fût. Couleur dorée légèrement trouble, mousse blanche laissant une belle dentelle. Arôme de malt, fruité, épicé léger. Goût de céréales, malt, légère acidité, citron, herbal en arrière-goût. Carbonatation moyenne, corps moyen.", "Somewhat cloudy brass-colored beer with a medium foamy white head. Weak nose with a bit of lemon zest and spice, but really quite underwhelming. Flavor is refreshing enough, yet is still non-descript. A bit of pepperiness is there along with a hint of citrus, but the overall flavor is way too subtle. Serve it cold and drink it quickly. Not one to savor, but gets the job done.", "Draft. Fairly hazy pale orange color with large just off white head. Very light pale malt aroma with mild citrus/lemony hop aroma. Flavor is pale malts, light citrusy notes, bitterness is mild. Lacking complexity, bland, but fairly refreshing...but any beer would be at 9am, pink style.", "Bottle at a friends house. Meh. Smells slightly lemony, not very spicy. Don’t pick up any of the wheat. Reminds me of a slightly lemony lager. Meh. Crap.", "Transfer from BA review 5-6-12- \r\nPoured from bottle into pint glass\r\n\r\nAppearance – Pours a hazy golden-orange color with a big white head. The head fades over about a 5 min time frame to give a medium level of lacing.\r\n\r\nSmell – A nice wheat and lemon aroma are the base of the smell. These are mixed with a lighter orange and spicy smell as well.\r\n\r\nTaste – A wheat bread taste is nice and heavy up front. This nice wheat flavor is the base of the beer and lasts throughout the taste. At the start the taste is on the sweeter side with flavors of orange and some sugar sweetness. These flavors give way a bit to some more sour/bitter lemon flavors and a mild spice toward the middle and the end. Very full flavored overall.\r\n\r\nMouthfeel – The body is quite heavy for the abv of the beer, with a carbonation level that is a bit on the higher side. All in al, the two combined to match the characteristics of the beer well. The carbonation creates a refreshing experience while the body accentuates the nice citrus and wheat flavors.\r\n\r\nOverall –A great tasting and refreshing beer great for sitting outside.", "Look: pours a light yellow. Small white head. Clear\nSmell: malty flavor. Little to no hops.\nTaste: very sweet malt. Grass and pine. Lemon finish. \nFeel: good carbonation light mouth feel.\nOverall: not a bad every day beer.light and refreshing. \nFirst drank: 6/14/14 Jenna graduation", "Draft - Cloudy golden color. Slight tart lemon flavor and a dryness to it. Didn’t taste much in the way of spice which is good. Not a bad summer ale, thirst quenching.", "A middle of the road summer beer.\r\n\r\nI found it had almost no aroma, hard to pick anything out. Has a cloudy pale colour. A a light to medium bitter taste. A light body with thin texture and fizzy carbonation.", "On tap. Pours a golden color with a finger of head. Aroma is yeast and bread. Taste is malty with a little biting lemon flavor. Refreshing and light. Enjoyable.", "Drank from bottle. \r\nNose has bread and some yeast. Taste is malty, with a short wheaty finish. \r\nNot much lemon.\r\nMedium body, average carbonation.", "On tap at the annual Residents picnic. Beautiful sunny day for some pulled pork and ale. Light golden with fizzy white head. Aroma is light toasted grain and a hint of lemon. Flavor profile is similar. Goes down easy... \n\n---Rated via Beer Buddy for iPhone", "On tap at McNellie’s OKC. Pours a hazy gold with a billowy white head that only stays for a bit. Not much of an aroma beyond a hint of hay and bread. Tastes of lemon with a touch of malt. Light mouth that’s cool and crisp. It’s not bad, but fairly unremarkable. There are much better wheat beers to be had.", "Pours a hazy straw golden with slight white head which disappears quickly......aroma is decaying straw....taste is thin, a bit of pepper, and faint sour citrus finishing dry and yeasty.", "Ugh, I find this cloudy straw blonde ale to taste like lemony soap. Some light spicing going on maybe cloves and cardamom, citrus and bread. I always find it to have a soapy, astringent taste that I just can’t get by. Not for me. Smells better than it tastes.", "On tap at Off the Wagon in Manhattan. Only a bare hint of grain on the nose. Has a thick head that fades down to a thin lace. Taste is be bready with hints off citrus. It’s okay.", "Pour at Jack Astors -- oh man, why I am here? -- is bright orange with a thin cap. Smells like rotting rinds & squishy malts. Starts off a little weak (with a orange pop meets wheat ale flavour profile) but after a while it does all right by itself (its vaguely tasty & pretty refreshing). Sadly maybe best choice on the list.", "12 fl oz bottle. Hazy yellow with a small short lived white head. Flavour is sweet with lemon, wheat and a hint of pepper leading to a mildly dry, bitter finish.", "Golden-amber hazy colour. Big, foamy white head. Small amount of lacing.\nStrong citrus aroma followed by wheat and malt\nSemi-sweet with moderate bitterness, mildly spicy with some pepper. Honeydew melon adds sweetness to the middle with sour flavor from lemon. \nCitrus finish with quite a bit of carbonation", "Bottle. Lemon is very overpowering in this beer. You might taste a little bit of spice far off. You taste a little wheat with a medium body. It kind of taste like beer lemonade, which isn’t awful, but not what I am looking for.", "Bottle. Hazy yellow-orange. Aroma is grass, pepper, fake citrus, biscuit. Tastes like a wheat beer with added lemon peel, basil, corn syrup and coriander maybe. Zesty but not over carbonated. Overall better than most wheat beers I’ve had so far.", "Pretty lackluster. Hint of lemon flavor and slightly hoppy. Would only drink again in a pinch.", "A hoppy and lemon flavored summer ale. Easily crushable and refreshing. Smells lemony and pours light yellow. \n\n---Rated via Beer Buddy for iPhone", "Probably one of the better Sam offerings. Refreshing during summer, strong hints of lemon with a spicy finish. Very carbonated mouth feel.", "Standard summer ale. Quite drinkable and refreshing. A little thin for me, but par for the course.\n\n---Rated via Beer Buddy for iPhone", "Pours a slightly hazy golden with white head. Coriander, lemon zest, and light fruit on the nose; follows onto the palate. Pretty light and refreshing. Not bad on a hot day.", "Samuel Adams Summer Ale bottle poured into pint glass. A tasty citrus brew golden in color and a good amount of head. Beer has a really good palate or mouthfeel to it. I enjoyed it.", "Poured from a draft it's golden and cloudy. White head with moderate lacing. Smooth drinking light beer. Not a lot to say other than that.", "Bottle. Pours bright gold with a thick white head. Aroma is lemon, floral, grassy. Lemon and grassy flavor throughout. Pretty light, a slight bit of hops at the end. Just okay in the end, a wheat beer for the masses.", "06-MAY-2014, draft @CheeseCake Factory, Potomac Mills, Virginia. Very hazy orange with lasting white head. Fruity aroma with a little yeast. Taste the same but also exotic fruits - mango. Medium body, soft carbonation. Really a summer ale.", "Dry yeasty wheat aroma.thin white head and light golden body. Semi sweet flavors light spice, dry citrus, and wheat. Crisp and refreshing on the palate.", "Surprisingly good wheat ale beer. Good during the hot summer outdoors activity. Refreshing. Citrus flavour is ok.", "Think this wheat is great, had with some spicy tortilla soup... damn perfect beer with a meal", "On draft. A zesty lemon aroma. Murky orange color. A light orange flavor and slight spices. Nothing special.", "My least favorite sam. Dry pepper finish. Hazy yellow as you’d expect from a wheat. Minimal head. Sorry... just don’t like this one.", "Really, where’s the wheat? Just a very dull taste that I can’t describe, accented with something like Real Lemon juice. After brewing my own, I just can’t handle stuff like this.", "This is horrible. It has taste, unfortunately..it is horrible. Don’t drink this. Any other seasonal ale is better.", "On tap at Fenway Park in Boston. Golden color with white head. Light citrus aroma. Taste of wheat, and sweet hops with a sour finish.", "Bottle pour. Thick head that fades quickly. Nice aroma with malty lemon smell. Light going down with a clean finish.\n\n---Rated via Beer Buddy for iPhone", "Bottle poured. Golden color with a large head. Decent lacing. Light citrus aroma. Wheat, sweet taste with a sour finish.", "Very light, not a goto beer tastes like it was filtered through dirty underwear. No bueno.", "On tap poured into a Samuel Adams Boston Lager pint glass. The aroma is fresh bread with faint notes of lemon peel, toast, cardboard, and pepper. It pours a light hazy yellow-honey color with an oily appearance to it, and a soft white head on top. The head reduces to a medium thick ring with light, nearly full surface layer and leaves a very light web lacing. It?s taste is a medium sweetness, medium light bitter, and a touch of sour. It has a creamy texture and a medium body with an average amount of soft carbonation. It finishes with sour (maybe overripe?) stone fruit flavor, dinner roll, light spruce, and a touch of peppery spice. The aftertaste is bready, but mostly a clean, refreshing light lemon water character.", "Bottle from Target in Redwood City. Chalky wheat, slight citrus, cream of corn. A bit filthy and not a ton of flavor.", "It is light and cloudy in color with a medium head. The aroma is wheat and citrus. You can taste lemon, wheat, and orange. It is sweet and refreshing.", "Light color, medium head, and easy to drink on a hot day. Slight lemon notes add a bit of flavor, but this is just OK to me.", "A good balanced wheat that has a nice freshness and sourness to it. Also some good spicy notes from the yeast", "This refreshing ale is clear in appearance but is packed with flavour. An easy summer beverage with citrus notes that would pair very nicely with chicken and seafood. Hello summer!", "On tap at the Kernels stadium. Malty with a citrusy finish. It was poor to mediocre for me; MB couldn’t even drink it.", "Newer to serious beer tasting but I found a nice gold color with a decent head. The taste is very nice and refreshing, lemon with a slight pepper note. One of my favorite warm weather beers", "At Love Field Airport while waiting for flight to Austing for EY recruiting. Pours cloudy neon orange with small layer of crooked head. Aroma is quite thin, can pick up faint musky yeast kinda. Taste is mild citrus, lemon, tangerine, mild wheat, medium body, a little syrupy, on the sweet side. Not bad, not great, it is a little too sweet and sticky to session and not flavorful enough to sip.", "I didn’t know what to expect from this one but, I wasn’t disappointed! Bought a six pack and poured into my glass and it’s Golden, Hazy with a nice head and lacing. Taste was amazing, with the lemon and a hint of pepper. Nice wheat beer with some bitterness. Great beer for a hot summer day! I’ll be buying more!", "Had on tap at some dodgy sports bar in Charleston. Seems like a good beer for a nice warm day but......pours a yellowish-orange color with a decent head. Nose is a bit strange- some citrus notes but something unidentifiable in there as well. Mouthfeel is nice and light- pretty carbonated. Some overpowering spice to this- maybe the Grains of Paradise? - that made me only drink half. Also some chemical notes. Didn’t work for me.", "(bottle) clear orange colour with a small white head; aroma starts with strange chemical notes, then grain, citrus; clean, refreshing flavour", "Bue à la pression. Légère acidité, notes de citron bien présentes. Finale assez sèche pour cette bière qui est avant tout rafraîchissante.", "bottle. Golden with one finger head. Light wheat body. Very light hops. Some citrus. Tastes almost exactly like I feel a Sam Adams Summer Ale should. Bland and inoffensive.", "Tap. Cheesecake factory. Very tiny white head. Really not much smell. Hazy pour, sediment. Taste refreshing not bitter. Ordinary", "Typical wheat, lemon zest and grains of paradise very noticeable in taste and aroma, decent beer, nothing special.", "On tap at CPK. Cloudy straw colored pour with an off white head. Wheat bouquet. Wheat, citrus, and bitter hop notes. A bit on the effervescent side. Below average body and mouthfeel.", "Reviewed from notes.\r\nThe appearance was an off-colored golden body with a small white head that dissipated within seconds. The lacing was foamy and left no rings. This foamy lacing slid down the glass basically until the beer was done.\r\nThe smell was a clean sort of citrus. Not much else going on.\r\nThe taste was a sort of lemon and some slight honey, but was really barely noted.\r\nThe palate was about a medium, smooth, sessionable, low carbonation was felt.\r\nOverall, I can see a lot of people would want this sitting on a beach somewhere in the summer. Me, however, well, I’m not sure if I’d seek it out on purpose.", "Good aroma (citrus, hops, spices) and nice gold color. Tastes great, not to citrusi and not to dry. \n\n---Rated via Beer Buddy for iPhone", "Draft. Cloudy yellow gold with lots of active carbonation. Lemon and grainy wheat dominate the aroma and taste with a weird metallic aftertaste. I've had this many times over the years but, this one seems to be worse than I remember. Maybe I'd enjoy it more on a summer day. \n\n---Rated via Beer Buddy for iPhone", "355ml bottle poured into a tumbler glass.\r\nCloudy gold, with a small white head.\r\nFloral nose, with spicy hops, citrus and faint honey notes.\r\nPeppery flavors, wheat, light fruitiness, low bitterness and faint marmalade.\r\nLight-med body, quite quenching, could be crispier, but overall OK.", "Nice citrus wheat nose, and nice enough to look at with a golden haze when poured, but all in all, a pretty unremarkable beer...\n\n---Rated via Beer Buddy for iPhone", "Decent for a light ale. A more complex flavor for a light summer beer.  cloudy orange. Bananas, herb, slight citrus. A not so good light beer after taste.", "Clear deep golden, mid sized head. Aroma of bread and bubblegum Sweet with light-medium body and rounded mouthfeel.", "12fl oz bottle from El Coleccionista, Gijón. @home 18-2-2014.\n\r\nIn short: a weird ale.\n\r\nPours hazy dark gold, with some nice white head. Some head retention, poor lacing. Spicy, sweet, honey and citrusy aromas. Medium body, average carbonation, some crispy texture. Taste is spicy, some honey like flavours, dry sweetness, weird spicy flavours. Still not sure if i enjoyed or not. Quite peculiar.", "Great seasonal beer, lots of citrus notes as well as some fruits and floral flavor. Nice to have a couple on a hot summer day\n\n---Rated via Beer Buddy for iPhone", "Pours cloudy; light amber. Thin head, decent lace\r\n\r\nThe smell is almost non-existent--too mild to evaluate well. I detect some wheat, little else.\r\n\r\nA classic wheat beer taste. Some sourness and nice spice. Tight carbonation, moderate body.\r\n\r\nAny easily quaffable brew. Think front porch, watching thirsty people walking by--here’s the beer for that.", "Pours a light yellow. Aroma is typical wheat beer. Honestly tastes like any other wheat beer. Weak aroma and flavor. Not bad for fans of wheat beer but could definitely overlook.", "Bottled, 355ml from Beers of Europe, Norfolk. Cloudy yellow with short white head. Sweet bubblegum, tinned Tropicana flavours, watery but still overpowering. Forced herby notes. Not good at all.", "Birra in cui si incontrano un lato speziato e un lato fruttato, di frutta esotica che la rende estremamente fresca e piacevole. Si tratta di gusti non molto intensi, ma in definitiva questa delicatezza è apprezzabile in una birra leggera, ottima per intrattenersi nella semioscurità di qualche pub in qualche torrido pomeriggio estivo.", "Citrus and fresh wheat, with a blend of lemon zest, light fruits and hints of black pepper. Very crisp making it a good choice on a warm summer day.", "Samuel Adams has often made the mistake of being heavy-handed when it comes to adding exotic elements to wheat ales. Summer Ale does not suffer from that malady as much as some of the other beers. The spices are more reserved, here. Yet, they are fairly flavorful. The lemon zest is used nicely in this brew. While traditional wheat ales are more satisfying on a summer day, this ale would also make a decent choice.", "Draft.\r\n\r\nA- Fruity, wheat.\r\n\r\nA- Orange color, cloudy liquid, white head.\r\n\r\nT- Citrus, wheat, spices. Balanced.\r\n\r\nP- Light body, average texture, average carbonation, refreshing finish.\r\n\r\nO- A good wheat ale. Crisp, refreshing, and smooth.", "Bottle. Hazy orange colour with an off-white head. Aroma and flavour of fruit, corn, yeast and orange.", "From a 12 ounce bottle into a shaker pint glass. FROM NOTES: August 23, ’12. \r\n\r\nA: Lemons and citrus. Some hops and other grains. \r\nA: Poured a cloudy straw color with no head and minimal lacing.\r\nT: Wheat, lemon, little bit of hops in the aftertaste.\r\nP: Pretty thin mouthfeel with minimal carbonation. \r\nO: Acceptable and drinkable, but not a beer worth seeking out.", "6/2/2010. From bottle. Golden color with a white head. Malty and bready aromas with lemon and spices. Medium carbonation, fresh fruit and light on hops.", "A: Orangish Hue, Passes Lots of Light, Thin White Head Ring, Minimal Lacing\r\n\r\nS: Mild Oranges, Mildly Grainy\r\n\r\nT: Oranges, Mild Yeast, Mild Pepper\r\n\r\nM: Mediocre Carbonation, Light to Medium Bodied, Mildly Spicy\r\n\r\nOverall, mass produced beer for the faux masses.", "Cask@roscoe head, Liverpool\n\nPale burnished gold with tight white head. Fruity lemon and mango rind on nose. Medium body with perfect carbonation, lemon peel, biscuit malt, spicey yeast finish. Really good example of a golden ale.", "I had this at Olive Garden. Pours yellowish gold with a white head. Taste refreshing lemon zest, and wheat. I thought was pretty good. I would definitely drink this again.\n\n---Rated via Beer Buddy for iPhone", "Bottle. Sulphur, citrus, spice, wheat, dust, lemon, coriander, rubber, honey, black pepper, ginger. Sweet with a medicinal taste. Dry finish.", "Bottle from Rhythm & Booze, Ripon. Cloudy amber with little head. Pretty bland example of a wheat beer. Refreshing enough and a little citrus coming through, but nothing special.", "Tap: Golden-yellow with an apparent, unfiltered haze and a big, chunky white head that settles on top and leaves behind a few good morsels of lacing. Aroma is very, very mild & hard to grab at first. Earthy & musty hops, hint of wheat, faint citrus zest. Not much else... very muzzled. Taste is similarly light with some bright but faint lemon zest, orange flesh, and musky, dirty hops in the finish. Soft wheat & grain in the back-end with a mild and nearly creamy mouth feel. Not offensive at all, just slightly mediocre in the sense that there isn’t much going on at all.", "Medium golden amber color, medium white head. Aroma of light citrus and straw. Taste is similar, but little of the wheaty characteristics of a weizen.", "Bottle. Pours hazy orange with a nice white head that quickly dissipates. Aroma - malts, spices, with hints of lemon. Sweet, citric, spicy but well balanced, tart, lemon and wheat notes, dry finish. OK.", "Great summer beer wish I could get it year round... Feel bad I have to wait till next summer to crack another one open ....sigh\n\n\n---Rated via Beer Buddy for iPhone", "24.06.2013, tap @ the brewery’s tasting room:\n\r\nNice slightly fizzy longlasting head. Aroma is slightly fresh fruity, citrus, hops, light malts, grass, leafs, spices. Taste is fresh slightly sour-ish, light malts, citrus peel, grass, pepper, hay, citrus, hops. Medium bitterness, slightly dry mouthfeel. Nice one.", "(bottle, 35.5cl) Hazy, golden colour with a blond, firm and short foamy head. Yeasty, mildly grainy wheat-malty aroma with notes of banana, citrus and a zesty and delicately flowery touch. Moderately sweet flavour, medium to light bodied with a tame, if not weak carbonation. Wheaty and moderately fruity taste; mildly sweet and fruity finish with peppery spice. Not really refreshing. 25.VIII.13", "Bottle: Golden, hazy, rapidly vanishing loose white foam, dryish grainy-yeasty nose with a slight phenolic touch; almost medium bodied and a bit sticky, moderate sweet-bitter flavour; traces of turpentine in the bitter-grainy finish. No, not convincing…", "Bottle: Poured a golden color. Smell is a little citrus with a little spice in there. Taste was nothing to shout about. I could taste a little wheat in there but not much else.", "Hazy straw color with decent head. Do get a bit of lemon. There is a subtle spice taste too. Overall it is pretty uninteresting. Drinkable, but would never buy again", "Bottle. Light copper orange with medium white head. Aroma of citrus and spices. Light body, notes of citrus and coriander with a slightly bitter finish.", "Bottle at Motel 6. Puts cloudy yellow with a white head. Aroma of fruitiness, wheat, some lemon and spicy notes. Flavor is sweet wheat and some lemon. Medium body, average carbonation.", "Bottle, 12oz. It pours a nice, creamy off-white head of two-finger size and a hazy, yellow-golden body. The aroma has a fruity touch, with lemon peel and some spiced hints. Wheat too. The flavor pretty much equally uninteresting, wheat and lemon peel, and a faint spiced hint I don’t think belong there. Quite dry on the palate, medium bodied and perhaps a bit low on carbonation. Lemon peel and a little spiced and bitter touch in th end. Well, not my kind of summer beer, that’s for sure. 130819", "Cloudy straw color with minimal head. Nondescript aroma. Some slight citrus flavors, a bit of pilsener like bitterness.", "Bottle. Golden, hazy, small to average and mostly diminishing head. Moderate, malty - lightly wheaty and sweetish aroma, some caramel and some fruitiness with light citrus. Body is light to medium, malty - lightly wheaty flavor and sweetish, some caramel and some fruitiness with light spiciness. Finish is short to average, malty - lightly wheaty and lightly sweetish, some caramel and light fruitiness with light spiciness, light alcohol. Watery hefe with caramel.", "Wheat more than citrus. Lemon more than hop. Thin body, not too much body. Enjoyable at a baseball game or on the train from Penn Station to the baseball game.", "Poured from tap. Dark golden color, light frothy head. Slight hop smell. Light sweet hops taste. Not bad for a hot day.", "Pretty good tasting beer that is light and has nice lemon zest. Not much aftertaste bitterness.", "I was hoping for more. Not very balanced. A very thin sour taste. I tasted no hints of lemon.", "Bottle. Pours clear light amber with a small white head that dissipates quickly and leaves a bit of lacing. Aroma is full of lemon zest and what I assume are grains of paradise, with wheat undertones. Flavor is medium sweet, lemony, spiced, minimal bitterness other than from the zest. Medium body, prickly carbonated mouthfeel. Pretty much the definition of an average beer, IMO", "Draft. Murky yellow with white head that dissipates quickly. Mild carbonation with wheat aroma. This beer is easy drinking with a wheat after flavor that I hate. I don't typically like wheat beers and this one is no exception \n\n---Rated via Beer Buddy for iPhone", "Bottle. Hazy gold with a thin white head. Nose is maize and breadiness with a very slight lemon hop. In the mouth it’s spicy, zesty, bready and there’s a slight hint of fruit. Grape/pear maybe. It’s a bit lacklustre though, and the palate aftertaste is far too wheaty for me.", "Aroma-very light citrus toned.Appearance-light pale white head with a deep yellow colored body.Taste-tones of citrus with light hops and a distinct floral spice.Palate-not overly carbonated and pretty smooth.Overall-pleasant enough flavor, very drinkable. Certainly not bad but not exceptional either.", "Cloudy yellow pour from draft. Slightly fruity in flavor, effervescent finish on the tongue. Easy drinking, overall enjoyable even if not completely memorable.", "Bottle. Hazy Orange beer with patchy head. Aroma of wheat and citrus. Taste is wheat, citrus and some spicy pepper. Quite good, more like a hefe than a wheat ale.", "Sample from the wife’s pint at Detroit airport. Cloudy amber with a thin white head, set honey aroma. Biscuit and fruit flavours, quite refreshing, but as far as wheat beer goes, not enough head and depth of flavour. You wouldn’t need a weizen to serve this. So far, Europe has nothing to worry about...so far.", "Had huge hopes in but maybe this style does not fit me. Quite dull with some wheat, grains and malt in the aroma. Drinkable, not special. Average.", "Aroma is actually pretty good here, kind of spicy, kind of lemony. Colour is ann attractive hazy deep gold, not much head, good lace. Taste is primarily lemony at first, little boring after that though. There’s a little spice, but it’s all a little thin. Overall, easy drinking summer beer. Better than macros, good for a hot day.", "An average wheat ale. Hints of citrus, with a slight pepper taste, found in a hazy golden color and minimal head. Easy drinking for the summer season. However, there is not anything exceptional here.", "This brew has a decent aroma with a hing or lemon. The taste was okay, all not what I expected from a summer ale. It was okay.", "Draft at Champps. Pours a murky orange-gold with thin head and minimal lace. Nose of wheat, bread, mild spice and fruit. Medium body. Drinkable when it is your only option.", "Very unique combination. A wheat beer with lots of tastes well balanced for the perfect summer session beer. I taste some virus, oranges or mangos, and the grains of paradise make it slightly spicy.", "Bottle pour..light to medium orange color..creamy looking 1 finger head after aggressive pour..things go downhill as anticipated..aroma is laden with cheap pineapple juice and wheat..slight clove like action as well...hazier than expected..can’t see much of what’s going on except when held up to light..bottom line this tastes like a cross between a wanna be good wheat beer and cheap mass produced macro mess..this is far from lively as bottle stated..I would call it bland..boring..finish is weak.glad I didn’t waste any $ on this as it was a stragler from a neighbor..bleh..", "I think this is a decent summer beer.\r\n\r\nA-Cloudy yellow\r\n\r\nS- Primarily fruity with a bit of spice\r\n\r\nT-In line with the smell, a lot of citrus and some coriander/clove\r\n\r\nMF-Smooth and slightly carbonated\r\n\r\nO-As far as Sam Adams beers go I think it was decent. Fairly flavorful and refreshing summer brew.", "Nice peppery spice on the front end. Hazy yellow with no head. Very slight hop bitterness on the finish. Nice beer.", "Golden yellow appearance, appears unfiltered. Has a slight soapy smell. Has a slightly fruity taste. Smooth and refreshing.", "Yellowish cloudy appearance. Citrus taste with a little bit of spicy aftertaste. Not a bad beer for a summer day.", "Unusual taste -slightly fruity perhaps. A touch too fizzy, but the real problem for me was that I couldn’t get used to the taste.", "Good wheat not great. Good head and color. Good tasting with malt finish. Ok but not great.", "Poured a cloudy yellow gold with small white head that dissipated fast. I smell wheat, spice and some white pepper. I taste all of the same, excellent beer for a hot summer day or any day what a good drinking beer.", "For a guy that dont usually likes wheatbeer this is strangly good. Mild summer beer..", "Непогане літнє пиво. Оранжевий колір , піна невисока , але повністю не зникає. Запах цитрусових переважає. На відміну від українського пива , те що вказано на етикетці відчувається і у смаку))), прянощі і лимон добре відчутні.\n\n---Rated via Beer Buddy for iPhone", "Poured from a 12 ounce bottle. Doughy wheat malt, hint of lemon, a touch of spice in the finish. Not overly interesting.", "Part of the summer sampler, this isn’t the type of beer I would normally choose. Upon pouring this beer, I got a strong aroma of lemon zest. The beer is a medium gold and unfiltered with a quickly dissipating head. The beer does have a lemon taste, but the strong bitterness of the rind overwhelms the palette. It is pretty rough going down and the bitterness stays with you. This is neither refreshing or tasty. The most disappointing sampler beer thus far.", "Thought it wouldn’t be good but it was alright....and whats up with this character minimum", "I know it is a summer Ale, and refreshing on a hot day, but where did all the taste go?? I was disappointed in this beer. Rather boring, pretty close to bland taste.", "On tap at Red Lion in Vail. Pour is hazy yellow with a big pillowy white head and great lacing. Wheaty, bready, citrusy, lemony, somewhat grassy, and floral aroma. Taste is wheat, big citrus, orange peel, bread, lemon peel, floral, and grassy. Medium body with high carbonation. Bright and refreshing and super easy to drink.", "Wheat beer. It's a wheat beer- it's nice I enjoyed it. You can certainly taste the cereal and it has a nice, ever so slight bitterness to it which you don't generally get with a wheat beer. Wheat beer. Wheat. \n\n---Rated via Beer Buddy for iPhone", "12oz bottle from Party Source. Best before July. Mildly hazy yellow color. Fine particles, and a couple pieces evident in the body. Bigger white head, but it soon fades to a minimal ring around the edges. No lace sticks. Sharper, kind of pronounced carbonation, with a dry finish. Feels a little rough. Moderate sweet, kind of spicy taste. Not much to the aroma. Some light belgian yeast, but nothing interesting about it. Bigger spice. Maybe a faint hint of orange/nectarine peel.. Not great. Like a subpar witbier, without the orange peel notes. Didn’t realize it’s a few days expired, hell it says \"Summer\" on the label. Considering it hasn’t even been a week, though, I don’t consider that an excuse. I generally want to like Sam Adams, but this didn’t cut it.", "Wet dog smell. If I wanted wet dog, I would hose down Ol Yeller. Taste is insipid. Sam Adams has run out of ideas. Suddenly I am seised by a great melancholy over the state of the craft brew industry. Time to get back to basics, gentlemen.", "Bottle from a mix pack bought by the in-laws for 4th of July. Pours a clear golden. Aroma is lemon peal and some pepper. Taste is more citrus and lager ale with some ground pepper and wheat. Overall, drinkable.", "This beer, once inside the glass, reveals itself as a nice hazy golden color with a medium white head with a little retention. The aroma has currents of pepper, wheat, and bread malts, and the taste is mildly sour and slightly sweet, which isn’t that impressive while still being very drinkable and smooth. The mouthfeel, however, sits beautifully with its combination of a thick texture, medium body, soft carbonation, and an abrupt finish.", "To sweet. Light lemon aroma. Thin head. Not to good, drinkable but close to down the drainable. Wheat is almost non existent overpowered by lemon fuit and yeast.  believe it or not this beer ages well for a year.", "Hazy Light Orange Color, Good Head, Little Lacing. Orange Peel, yeast, malty wheat, slight sour finish. Medium Body, Slightly higher carbonation. Quite nice and refreshing on a hot day.", "pours a hazy honey/orange color with a medium white head...nice lacing. aroma has notes of wheat and mild lemon. flavor has light lemon...grainy...mild grass and very mild spice. mouthfeel is medium and the finish is grainy/spicy/grassy.", "Basis but good. Medium-light body in a refreshing beer for the summer. Goes down smmoth.", "Very light. I would live this camping our in a river. Lemon aftertaste. Low ibus. Smooth.", "335 mL bottle from the LCBO. Pours a cloudy orange, with a small head that dissipates quickly. On the nose is yeast and bread and some spice. Possibly orange. The taste is less impressive, it seems a bit unbalanced. Long, fairly pleasant, finish. Not a bad wheat beer, but there are much better examples. I would probably buy another brand in the future. Surprising for Sam Adams, their beers are usually better than this one. \n\n---Rated via Beer Buddy for iPhone", "Hate summer ale's but this is alright. Tastes like a less sweet, Arnold Palmer. Light lemon hint. Cloudy pour. Decent.", "12 oz. bottle from sampler pack.\r\n\r\nAr:  Bread dough, light spice, maybe a bit of peach.\r\nAp:  Pours a very hazy light copper-straw with little head or lacing.\r\nT:  Moderate malty sweetness up front gives way to a somewhat bitter, tart finish, which is really needed to cut through the sweetness.\r\nP:  Slightly thick and a bit more syrupy than I’d like.\r\n\r\nO:  Decent, but lacks both the refreshing flavor/body and aroma of a good wheat.", "A sooth tasty summer ale, great for a hot summer day! Smooth!! But definitely not a cool weather beer!\n\n---Rated via Beer Buddy for iPhone", "Pours a golden haze, tastes of wheat and lemon with a bit of peppery spice.  It's ok and thoroughly refreshing.....but if I wanted something light and refreshing, a radler would be better.  If I wanted a wheat beer, there are better.\n\n---Rated via Beer Buddy for iPhone", "Pours a cloudy gold in what you would expect from a wheat beer and little head. Taste is stale wheat and heavy watery taste. Certainly one of the worst wheat beers. A terrible SA showing.", "Bottled. Pours golden with a small white head. Smells caramell, vanilla, some lemonish hoppy. Tastes abit watery, some roasted malt, carmell malt with a funky canned hoppy finish.", "A lite ale. Not much in the nose. Decent taste and great palate. A very drinkable, refreshing beer.", "Not sure what this is supposed to be.  It has no flavor.  Slight wheat, slight lemmon.  Like a severly watered down summer shandy.", "Blonde in color with a sweet taste. Carbonated, but not too much. Overall, an enjoyable beer that’s easy to drink.", "Bottle.  I have had this pretty much every summer for the past decade and never know why i keep going back.", "12 oz bottle from Campus West.  Yellow gold and pretty clear with a nice white head.  Clean, crisp aroma with light citrus, malted wheat and spices.  Similar flavor with a light body, pretty bland overall.", "Light orange / golden pour.  Some head, but it disappears pretty quickly.  Malted wheat grains in the nose somehow trump the (supposed) citrus infusions and banana esters which usually constitute a beer of this style. \n\n\r\n\r\nTaste is kinda boring, but it’s easy to drink.  Not much wheat flavor overall; biggest standout is the lemon peel at the end.  Body is moderately thick, yet the relatively high carbonation spoils the show.  Overall: meh.\n\n\r\n\r\nFor a wheat beer, this is certainly off the mark.  But for a hot-summer-day beer, it’s more on point.", "Bottle at a dinner. Clearing backlog. No comments. Apologies, future ratings will have detail.", "Unlike Leinie’s Summer Shandy this Sam Adams brew is pretty flat. The lemon flavor is hardly noticeable, there is no aroma at all, and it doesn’t provide the palate kick needed on those hot Texas summer days. Leave it up North.", "Not much selection at Atlanta’s historic Fox Theatre.  As I planned on doing a touch of dancing, I went with this lighter beer.  Poured a hazy yellow with a smallish white head.  Scent was citrus and taste was mildly sweet with a hint of lemon.  Not anything special.  Right beer for the time, place and selection.  Draft - Fox Theatre - Atlanta, GA", "12oz bottle. Hazy golden orange with a small white head. Aroma of fruity wheat, lemon ant light banana. Flavor is crisp wheat malt, citrus and some spicy esters. Light body with average carbonation. Fresh, zesty and drinkable", "Light citrusy flavor- reminiscent of the summer shandy, minus the sweetness and overall not as refreshing.", "Drought. Rich yellow with whitish spongy small head, doughy aroma, sour yeeast taste, long slightly bitter finish. Not as good as I expected.", "Decent for what it is. Aroma was wheat and citrus but not at the witbier level. Clear yellow gold color with a white fizzy head. The palate was light and crisp with good carbonation. There was a slight pucker factor but not enough to distract. Flavors are light and of citrus fruits but the wheat backbone is strong enough to handle. A lighter beer but easy to drink and a good alternative to macro beers.", "Straight out of the bottle. Prominent lemon note in the nose. Little kind of something to.in the mouth it’s a light ale with a easy malt background and lemon peel verging on fake extract. Finished slightly malty.fair summer super nothing spectacular.", "Pours a hazy golden, scent of banana and wheat. Tasted similar with some spice. A pretty wheat ale.", "Not a big fan, on tap at O?Brien?s in Santa Monica, light and refreshing, hints of lemon. Copper pour, white head, nose is grassy, taste is lemon zest.", "Not one of S.A.’s better brews. I will take a Leinenkugels Summer Shandy over this anyday.", "On tap in a 20 oz Sam Adams glass... Pretty weird taste overall.  Don't taste any citrus or hoppiness at all.  Almost a sour, yeasty flavor (skunkiness).  I got through this beer, but I wouldn't have it again.\n\n---Rated via Beer Buddy for iPhone", "Smells tart and lemony.  Pours murky straw with a thin white head.  Taste is mostly bland with a hint of citrus.", "Bottle from a Summer Variety pack. Pours a hazy pale gold with a small white head. Aroma of malt,  light hop and lemon. Flavor is wheat with some floral notes from hops and a little spice and citrus. Decent.", "Apricot with foamy white head. Lagery aroma. Flavor is fairly lagery, pretty bad.", "Taste is light skunky and a mild lemon. Pours cloudy with a small head that lingers. Would not buy again.", "Fuller beer than porch rocker, but still nice and light. Not as good as other Sam Adams beers.", "Bomber from the Citgo station across the street. Pours slightly hazy gold with a nice pillow of white head that fades pretty fast. Aroma is slightly yeasty and lemony with nice floral hop notes. Taste is great. Spicy, light white bread crispness, tropical fruits, incredibly refreshing. Finishes with a nice slight dryness.", "nice aroma, nice head. nice light citrus flavor, slight spiciness. very refreshing summer beer", "Pending a better offer, this is the beer if Summer. Eager to please, easy to spend time with, and easily forgotten once the leaves change color. \n\n---Rated via Beer Buddy for iPhone", "Light and refreshing for hot summer day. Subtle, not overpowering, citrus taste with a crisp finish.", "Very average wheat beer on the smell and appearance. The texture and the taste however where a bit strange. Slick mouth feel accompanied by some buttery diacetyl notes that I couldn’t ignore. Otherwise standard wheat beer with some lemony citrus notes. Tried twice on draft this month and both times could not get over the buttery flavor and feel. Unfortunate as I usually can rely on Sam Adams for a decent pint when I end up stuck in a chain restaurant with poor tap selection. Would rather have the lager next time.", "Poured from 12 oz. bottle to Samuel Adams tulip glass. Smells sour, lots of wheat notes with hints of citrus and lemon. Taste is lemony and refreshing yet sour. Seems like they wanted to go for a fruit beer without the overwhelming fruit taste. Finishes nicely with a little carbonated bite at the end.", "Hazy gold with lasting thin foamy head; aroma of wheat and grain and lager yeast; Flava is light and slightly citrusy; feels light and fizzy; finishes dryish with some citrusy sweetness", "On tap in McFadden’s NYC. Light hazy golden colour. Slightly grainy, light slightly fruity hop flavour, typical wheat sweetish finish. Something a bit artificial about the fruity flavour.", "Pours hazy golden with minimal head. Aroma of grain , bread, slight lemony nose. Taste is very weizen without the banana and bubblegum . Finish is chalky dry and abrupt. So-so.", "Looks a lot like a Shock Top or a Blue Moon.  Much milder taste though.  Very good. No strong after taste.  Would drink again. \n\n---Rated via Beer Buddy for iPhone", "Lemon, honey-like aroma. Sweet malt flavor; also some bready/doughy malt. Lemony, with a hint of pepper.", "Tap. Hazy yellow with white head and decent lacing. Smells like dirty pennies. Tastes lightly floral and citrus. Slightly grainy.", "Light golden with a thin white head. Aroma is lemony. Flavor is light and lemony with a bit of tartness on the finish. A little dry and maybe a touch over carbonated. Vaguely reminiscent of soda, but not horrible outside on a hot day. Wouldn’t be my first choice though.", "Pours golden with a bit of head. Aroma is a combination malty hay and a hint of lemon. A light body and crisp finish make for a very refreshing summer beer", "On tap at the West Palm Beach airport in the Sam Adams brewshop. Pours orangey-yellow with a white head. Aroma has fruitiness and wheat. Taste follows; sweet fruits, grainy dry wheat. Summery is right. Light-ish and tasty enough.", "Pretty solid surprisingly.  Clean, crisp, & well balanced w/ just enough flavor to make this an enjoyable brew.", "had this on draft at Dueces.  Golden cloudy orange pour with medium white head.  decent bitter wheat taste, slight hops in here.  would drink this outside in the sun in the  summer anytime, but wouldn’t buy or order it to sit around", "On draft in beaver falls pa.  Pours a cloudy pale amber with an off white head.  Peach aroma.  Flavors of coriander and all spice with a malty backbone.", "Pours hazy gold, head disappears quick. Nose of orange, cherry, and pistachio. The aroma reminds me of my favorite Amaretto-Spumoni cheesecake! Great light fruity flavors, lemon wheat standing out. Great beer!", "I like summer beers but I am not a huge fan of this one.  Smells of lemon but unfortunately does not come out very strong on the taste buds. Pours hazyy.", "Pours a hazy golden brown with a small white head. Some citrus, wheat, pretty sweet. Just ok. \n\n---Rated via Beer Buddy for iPhone", "Very light Summery beer! I love the flavor and citrus notes. Definitely one of my favorites.", "Shared bottle, pour to shaker.  Had the perfect setting for a wheat ale: sitting on the deck on a beautiful warm spring evening.  The beer just didn’t measure up.  It was okay: some zest and crispness.  But it was thin on the palate and not particularly satisfying.", "Just didn't like this one. No depth of flavor which is atypical of SA. The Noble Pilsner is MUCH better although I realize its a different style. \n\n---Rated via Beer Buddy for iPhone", "Bottle.  Faint citrus aroma.  Medium carbonation.  Muted hoppy flavor with very faint lemon/citrus tones.  Overall, it doesn’t provide enough hoppy flavor that I’d expect from a Sam Adams beer, and doesn’t provide nearly enough lemon flavor that I’d expect from a summer ale.  Sam Adams Porch Rocker takes this beer/citrus formula to a much higher level, and is much more satisfying.", "This beer just made my top 10 best beers of all time. Outstanding taste!! Perfect warm weather beer. It has a solid body and plenty of flavor (lemon, wheat) but its not over-powering with the hops that Sam Adams tends oversell. If you dont like this beer, then you wont like any beer. \n\n---Rated via Beer Buddy for iPhone", "4 oz. from bottle at a Sam Adams dinner/beer pairing benefit at Old Line Wine's The Bistro in Beltsville, MD. \n\nLightly hazy, light straw color with an off-white head and good lacing. \n\nVery light aroma of lemon and wheat. \n\nLight taste of lemon, wheat and herbs. \n\nLight/medium body and medium/high carbonation. \n\nNot much here to especially enjoy, but nothing bad here.  I just found it to be a boring beer. \n\n---Rated via Beer Buddy for iPhone", "On tap. Definately taste the citrus but not overpowering. I think I could drink a few of these after mowing. ---Rated via Beer Buddy for iPhone", "Pours a golden color with a white head.  Grassy aroma with a hint of floral hop, lemon, and some spices.  Flavor is all grass and earthy tones with some lemon and not much else. Not really a very good summer beer.", "12 fl oz / 355mL bottle into a Samuel Adams glass. Served cold.\r\n\r\nAroma: Lemons. Sour wheat. Maybe some spice. Smells pretty refreshing.\r\n\r\nAppearance: A hazy, barely translucent dark yellow with a persistent soapy, white head.\r\n\r\nTaste: Pretty lemony! A little sweet even. Definite wheat presence. Very nice.\r\n\r\nPalate: Not heavy, but not thin or watery at all; light and refreshing, but with nice character.\r\n\r\nOverall: A good summer ale indeed. The lemon flavor doesn’t overpower and make this sickly sweet or super lemony. It’s a good, lemony beer.", "Lager glass. Hints of apricot, lemons and wheat. Cloudy gold, lots of carbonation bubbles but that’s it. Apricot taste with a bit of wheat. A little watered down.", "On draught during a brewery tour. One of the worst things I have tasted from Sam and I know it was fresh because I had it at the brewery. Bland, watery and just not good.", "Its a decent beer, but i wouldnt classify it as a good wheat beer.  Its a hazy yellow with minimal head and no lacing.  Almost no wheat taste and a little to crisp to be a wheat", "Used to think this was my favorite summer ale, how things have changed, will always make me think of summer though", "Slightly hazy yellow beer.  Tart astringent nose with a little basement yeast.  Tastes of rye-like spice, belgian yeast, brine and some basement.  Slight mouth puckering effect but not tart as it smells.  This one’s good.", "Not bad. On draft at the Outback. No rules...just right. Served in a big bloke (24oz mug) twice. Aroma was light tropical fruit. Peaches, lemon, citrus, wheat and grain, and sweet honey. Pour is golden orange with a foamy white head. Taste matches up, being a touch on the sweet side. A good dose of wheat on the finish with lemon and citrus notes throughout. Not a bad drinker.", "Draft at the brewery. Pours cloudy amber orange with a light foamy head. Has the ancient grains of paradise. Medium body. Tastes like wheat with hints of orange. Smells like citrus and herbs.", "Tap at brewery. Pours hazy gold with thick, frothy white head; good retention and some lacing. Aroma is cereal and biscuit malts, citrus fruit, lemon peel, floral hops, light spice, and light herbs. Flavor is sweet, bready malts forward with supporting light fruit esters, citrus and floral hops, and some herbs; dry finish. Light body and low carbonation.", "Bottle at noodle zoo... pours orange very cloudy.. clean fresh aroma...taste is probably one if the best summer ales ive had in a long time.. will probsbly go pick up a 6 of this... good breakfast beer", "Aromas of lemon candy, orange peel, and wild flowers.  Hazy orange with a lasting, white head.  Dry, fruity, citrusy, and biscuity.  Light body, smooth, with zippy carbonation, and a clean finish."]}