{"reviews": ["Typical amber off-red tint in the glass with a nice persistent 1cm head. Citrusy, piney nose with a hint of passion fruit. Smooth in the…", "Bière 33 cl achetée sur une petite mousse lors d'un déstockage de dates courtes, elle était preque offerte. Robe dorée, belle mousse crémeuse. Un nez typé IPA avec des notes de houblons, d'agrumes, sur un fond résineux. Bouche fraîche, et fruitée, forte amertume. Une bonne IPA bien que je els aime un peu plus exotiques que ça.", "Aspect orange limpide avec mousse résistant sur le verre. Nez sur le fruité : orange, fruits oranges, pêche. Bouche douce en entrée, épicée, fruitée. Goûts de fruits confits, de citron, d'orange, de résine. Finale sèche amère en diable mais néanmoins sucrée/caramel. Originale", "Bursztynowa barwa, delikatnie opalizujące, dość trwała piana. W aromacie trochę liczi, trochę cytrusów i wyraźna nuta karmelowa. W smaku tego karmelu jest, niestety, więcej, ale, o dziwo, piwo nie sprawia wrażenia przesadnie słodkiego. Nasycenie średnie, goryczka średnia.", "Robe ambrée, assez trouble. Mousse faible, nez fruité de houblons aromatiques, et un côté grillé léger en deuxième nez. En bouche, attaque très amère, à la fois sur le houblon et le grillé. Si ça a l'air bien mené, ce ne sont pas des arômes qui me plaisent plus que ça, et ça atteint un seuil d'amertume qui devient critique pour mes pauvres papilles.", "From a bottle. Cloudy with little head. Nice refreshing fruitiness to it initially, then decent balance between bitter and sweet", "AR: Litschi, Marmelade, kräuterig, Pflaume, leicht holzig, Rote Grütze, Zitrus, warme Milch\nAP: trübes bernstein\nTA: Marmelade, Pflaume, blumig", "Bue en bouteille au Trappist (Caen 14000)\nNez fruité qui porte fortement sur le fruit de la passion.\nJolie robe orange trouble avec des teintes de blond pâle.\nMousse fine.\nLa bouche apporte principalement le goût juteux du fruit de la passion, ainsi qu'une sensation douce de bon jus d'ananas et une fine amertume de pamplemousse.", "Pint draft at the 1965 Craft Beer. Appearance of the pour in an American pint glass is a hazy dark orange amber, topped with a finger of white froth, which recedes quickly to a thin ring and is not easy to regenerate. Aromas are muted when cold, as it warms, faint notes of citrus emerges, and on warming further, caramel malts are detected. But this is not a great one for aromas. Taste is malty, caramel, sweet, with an intense piney bitter, which is enhanced by the lack of any fruity hoppy sweetness. Medium bodied, maintains its texture well.", "Robe orangée opaque, pas de mousse, belle amertume, nez floral et gout agrume.\n\nJ'ai toujours eu peur de son nom : peur non fondée", "En IPA i den tunge ende, den smager fint af humle af den amerikanske type, er også lidt mørkere i det, med lidt karamel", "Ein Bier, das irgendwie aus einer anderen Zeit kommt. Als das Bier rauskam, war es im Vergleich zu den klassichen IPAs recht bitter. Inzwischen gibt es aber allerlei Imperial IPAs, die mehr reinhauen.\nDoch finde ich es geschmacklich voll ok. Grasige und hopfige Aromen dominieren und harmonieren gut. Nicht zu übertrieben und gut zu trinken.", "33cl fles. Helder licht amber kleur, fijne romige witte schuimkraag. De geur is citrus en tropisch fruit. Smaak is zoet, karamel, citrus en gras. Medium lichaam, weinig koolzuur.", "Robe blonde orangée, trouble à froid. Faible tenue de mousse. Arômes agrumes, fruits exotiques, résineux, caramel, un peu madérisé. Goût résineux, agrumes, réglisse. Sèche en bouche. Carbonatation très fine, moyennement abondante.\r\nBon, classique.", "Robe dorée, belle mousse crémeuse. Un nez plus typé IPA avec des notes de houblons, d'agrumes, de lime, de fruits exotiques, sur un fond épicé. La bouche est fraîche et fruitée, ronde et équilibrée, la bulle délicate et la finale raffraîchissante. Une délicieuse IPA de soif.", "On tap @Ølfred - Aarhus Streetfood.\nPours orange, with thick white head.\nScent: A bit fruity.\nTaste: High bitterness, heavy for an IPA, malts, caramel.\nTexture: Medium to low carbonation.", "0,33l bottle from Alko, Iso-Omena, Espoo. Hazy orange beer with good and quite stable head. Aroma has sweet malts, honey and pine. Taste has malts, sweet honey, pine and hints of fruits. Bitterness is there at the end. Good balance, but not so fruity one.", "Pours cider orange, good egg white head. Aroma of pale malts, orange and hop green. Taste of same with bitter bite in finish. Overall well balanced IPA. A bit of orange candy across palate.", "F: medium, tan, good retention.\r\nC: gold to amber, hazy.\r\nA: malty, fruity, bit citrus, floral, bit tropical fruits, orange.\r\nT: malty backbone, orange, tangerine, bit herbal, tropical fruits, dry on the palate, blood orange, nice hoppy finish with caramel touch, medium body and carbonation, nice one, enjoyed, 35,5 cl bottle from Cora Woluwe-Saint-Lambert in Brussels.", "Bottle, 0.355l. Cloudy copper pour, lots of visible carbonation. One finger frothy off-white head, low to medium retention. Thick lacing on the glass. Caramel malts and pine on the nose, juicy citrus notes.\r\n\r\nThin to medium body, medium to high carbonation. Prickly mouthfeel, average texture. Moderately bitter taste. Aroma is nicely balanced between herbal and fruity characters with caramel malt serving as the backbone. Hints of vanilla and pine. Nice juicy citrus aftertaste. Slightly peppery, a bit dry. Mild alcohol presence throughout the finish.\r\n\r\nOverall, nicely balanced IPA. Refreshing.", "Slightly haze orange color with big thick white head. Light malt with fruity hop aroma and some light herbal notes. Silk, light bitter and slightly dry taste.", "Bottle@ Wikas Rogue tasting w Senior. Appearance: pours muddy orange with ok off-white soapy head and lacing. aroma/taste: bread, light caramel, apricot, peach, tropical fruits, oranges and floral notes. palette: strong us hoppy aroma, average carbonation, medium body, medium sweetness, balanced by a medium to notable bitterness, average duration and a watery texture. Overall: more balanced than brutal IPA", "Fra fad.\nRavfarvet med hvidt skum.\nFrisk aroma af humle, citrus og malt.\nBlød og rund med en bitter kant. Velbalanceret og letdrikkelig!", "Pours dark orange hazy color. Citruses, caramel a light earthiness. Taste is not as sweet as expected. Medium creamy body, medium bitterness.", "Pours from the bottle murky amber with sizable cream colored head, cheesey aroma, bitter, piney taste", "Der erste Eindruck ist kräftiges Malz und fruchtig, bittere Grapefruit. Wenig Kohlensäure und auch sonst typisch India Pale Ale. Der Abgang bleibt trocken, bitter.\n\n---Rated via Beer Buddy for iPhone", "330ml can shared at За разБИРАчи, Ruse. Pours hazy with a thin froth and mousse head, heavy lacing, no visible rising carbonation. Golden colour. On the nose, citrus, driven by orange, with notes of boiled pumpkin and carrot. In the mouth, fizzy due to high carbonation, bitterness from the first sip, flavours of faded citrus with notes of honey and caramel malts, light texture and not mouth-filling due to bitterness, leading to a short bitter finish. Overall, possibly a bad bottle, but pretty ordinary for an IPA.", "Solid, west coast IPA. Not much of a citrus bomb, especially in comparison with NEIPAs, Pine,  malt, some citrus and strong bitterness will get you satisfied.", "Delicious taste.\r\nSolid aroma.\r\nDefinitely would have again.\r\nStays on palate a touch long though", "In der Nase sehr sehr grasig, zudem leicht Zitrus. Auch im Trunk sehr grün, Zitrus, alkoholisch, leicht Malz, hinten bitter.", "A beer that seems to be made by mass consumption. The beer is fine but I have found a standard beer, without any appeal that makes it different. M has left quite indifferent. The best, the tag.", "De geur valt mee voor een ipa. Donkere kleur. Weinig schuim. De smaak is echt enorm slecht.", "Original Review in 2010- I like this beer a lot. Really haven't had a Rogue's that I didn't care for yet. I haven't been buying beer from this brewer recently because I find them rather expensive and trying new things, but I must say that they are still one of my favorites. Only bought a single to sample, but even at $11-12 a six I may buy this again. Has a medium cloudy yellow-orange appearance. Smells bitter with citrus hops. I also think this resembles more of an IPA versus ESB. Can't wait to sample again so that I can compare it to my favorite IPAs.", "I love this beer one of my favorites my only complaint is in the afterbite stays on the palate a lil long", "Botella 0,355l Ambar color,espuma blanca,mediana,fina,media resistente.Aroma cereales,citrico,caramelo,galletas.Sabor- malta,cereales,citrico,caramelo,frutal,fino amargor,lupulo, muy complicado para describir todo.Buena", "Bottle from the Hop and Barley, Lincoln. Amber colour with an off white head. Aroma citrus and hard fruits and toffee. Taste light sweet to long bitter, with a big bitter finish. Medium body.", "(orange, nez fruité berga-orange jam, crystal-hop, bouche-hop, soyeuse (blé), all nickel, citric-dosé, > sapin, mandarine)", "Cerveza de color naranja nublado con una espuma blanquecina bastante buena. Aroma a lúpulo con notas de cítricos, de caramelo y de pino. En el sabor encontramos todavía bastante lúpulo, acompañado por una dulzura de cítricos, la malta, las agujas de pino y el caramelo blando. El acabado es marcado por una amargura media. Una India Pale Ale no tan brutal sino muy agradable de beber.", "herbs, citrus, pale, golden, orange, brown, sparkling, minimal head, white foam, medium bitterness, medium sweetness, lightly sour, medium body, oily feel, average carbonation, bitter,", "Flasche 0,355l: Bernstein, orange, kräftige Trübung, kräftiger stabiler mittelporiger Schaum; frische + sehr fruchtige Nase, kräftige fruchtige Süße, exotische Früchte, Mango, Maracuja, Malz, Karamell, süßliche Hefearomen, kräftige Hopfennoten; frischer + fruchtiger Körper, angenehme fruchtige Süße, Malz, Karamell, Hefearomen, cremig, kräftige Kohlensäure, Zitrusnoten, Grapefruit, Grapefruitzest; angenehmer fruchtig-würziger Nachgang mit Hopfenaromen", "0,355l bottle from Beer Republic. Pours hazy golden color with medium head. Aroma of citrus, hops, malts, caramel. Taste is a bit more sweet and grassy. Moderate bitterness with medium minus body. Aftertaste is a bit more bitter, but not in a balanced way.", "Mousse Blanche qui ne résiste pas, couleur orangé. Arôme fruité sur les agrumes. En bouche, une belle amertume sur un fruité agrumes, fruits exotiques. Un classique US pas exceptionnel mais dans une très bonne moyenne. Je conseille ce choix pour se faire les papilles sur l'IPA. ///35.5Cl chez WBS", "It’s brutality is not like a brutal dismembering, but closer to death by a thousand cuts. In a horror movie, it would be in Saw, not Texas Chainsaw Massacre \n\n---Rated via Beer Buddy for iPhone", "From a 22 oz bottle into a chalice. Pours semi cloudy amber gold with head and lace. Aroma of floral hops, pale malts, straw hops, funky fruit zest. Medium carbonation and mouthfeel. Flavors of melon rind, straw hops, grains, minerals, pale malt, caramel. Overall rich, flavorful...somewhat challenging but decent.", "(Bottle) Pours hazy amber brown with good slightly off white head. Nice aroma of stone fruit and toffee. Great palate - medium body with good carbonation. Great taste too, and not brutal. There's a very good backbone of sweet toffee malt. This is overlaid but a combination of hop flavours from tangy stone fruit to bitterness. Nicely balanced.", "From Dec 2005\r\n\r\nPoured from bottle(room temp) with a quickly diminishing head.\r\nThe beer is a cloudy medium gold.\r\n\r\nThe smell is a wonderful mix of hops and malt...you can just about taste the beer from the aroma alone and you *know* it's gonna be good.\r\n\r\nThe taste is a wonderful balance of the sweetness and bitterness with the hops taking over in the aftertaste and leaving me wanting more.. That's how drinkable this brew is. A *must* try if you see it in your local store.", "Bottle from Pivný raj. \r\nHazy amber with white head. \r\nSweet hoppy aroma. \r\nTaste is mixture of hops, bitterness, something sweet and coffee beans. Good.", "Bottle at home. Cloudy orange color, white head, looks good. A good ipa, with a good taste.", "Аромат очень насыщенный хмельной. Во вкусе хвоя, цветы, манго, очень сложный вкус с умеренной быстро проходящей горчинкой. Выглядит жиденько но во вкусе хорошее охмеление. Намного лучше всяких punk ipa", "il malto esce già al naso di prepotenza, insieme a fiori freschi. Crosta di pane subito al palato poi spazio al dry hopping. A occhi chiusi e naso chiuso pare una stout. Palato quasi pieno, alcol non spinto e quel poco coperto maluccio", "Citrus (orange) and apricot jam notes in the nose. Feels sweet. Taste is sweet, like the smell, yeasty and with caramel notes. Grassy hops, bitter herbs. Medium bodied, dry, bitter finish. Too sweet, but nice nonetheless.", "Bottle. Pours hazy brownish amber with medium white head. Aroma is malt, yogurt, grapefruit and spruce. Taste is medium sweet and medium bitter. Body is light oily with soft carbonation. Finish is long and mostly bitter with notes that follow the nose.", "Flaska bishops Örebro. Gulorange vätska. \r\nMustig doft av torkad frukt, barr och citrusskal. \r\nRelativt tung maltig smak med barr, citrus och övermogna äpplen. Fyllig munkänsla med bra beska.", "Pours golden with a medium sized white head. Aroma has citrus and hops. Taste is quite different with oak, caramel and citrus. Quite nice.", "Dark brown, cloudy colour and a frothy tan head. Aroma has light hops and some malt. Taste has strong hoppy flavour, bitter, somewhat dry finish. Medium, soft carbonation and smooth mouthfeel. Very nice overall.", "Vähän vaisu. Odotin tuolta panimolta enemmän. Sellainen \"ihan ok\". Jos joku muu ois parempi.", "Hazy golden color with creamy white head. Nice aroma of hops, malts and grapefruits. Taste is mainly hops with some grapefruits. Fairly bitter, leaves quite thin. Overall not so brutal as the title says, expected more. But very solid and easy going IPA", "Ipa de 6,3 % abv, avec 5 malts : deux rangs, carawheat, c 15 dare et risk. Houblonnage en alluvial\r\nen production propre chez Rogue. Le ebu semblerait être de 46, mais me semble un rien plus haut.\r\nMon exemplaire était à 6 mois avant date, et pourvu d’une étiquette sur fond rouge.\r\nCouleur doré aux reflets ambrés, et à la clarté nette.\r\nBulles fines, partout, nombreuses et virevoltantes.\r\nMousse blanc cassé, épaisse, plus ferme en haut, stable à 6 mm.\r\nArômes de superbe fruité, précis, avec pointe de zeste, bon malt cara.\r\n1ère bouche souple, à la très belle entame malt/fruit/résine.\r\nArrière-bouche dense, parfaitement équilibrée.\r\n2ème au remarquable ensemble, avec juste la petite pointe de zeste adéquate.\r\nArrière-bouche longue, complexe.\r\n3ème au très beau fondu des saveurs, avec une touche de tabac blond.\r\nArrière-bouche à l’harmonie très personnelle.\r\nLongueur au superbe prolongement, avec des feuilles de hêtre, zeste de pamplemousse, pointe de\r\nfoin coupé.\r\nJambes fines, denses, assez collantes.\r\nLevure douce, fruitée, très belle ligne (Pacman).\r\nAlcool parfait, il contrôle tout : saveurs, équilibre, harmonie.\r\nFinale prégnante, forte, très belle.\r\nCONCLUSION : cette bière est un superbe dosage, sur une très belle recette, avec des ingrédients\r\nhautement sélectionnés, souvent en production propre. Pas brutale du tout, mais superbe oui.", "Pullo @ Alko. Kaatuu IPA-lasiin tummankultaisena ja sameahkona, noin kahden sormen paksuisella vaahdolla. Tuoksu on reilun kukkainen, mentholmaisuutta, havuakin on sekä reilu keksinen maltaisuus pohjalla. Todella mieto tuoksu. Maku on mallasvetoinen, keksisyys on vahvaa. Humalointi tuntuu lähinnä puumaisena ja ruohoisena ollen yllättävän kevyttä. Suutuntuma on keskitäyteläinen miinus, katkerot kerääntyvät pikku hiljaa kuivattaen suuta. Olipa erikoinen olut, kaikki aromaattisuus on jäänyt johonkin Atlantille. Todella miedon makuinen ja tuoksuinen olut, oikeastaan aika harmiton, mutta aika paljon enemmän odotin. Suutuntuma on oikeastaan parasta antia.", "Bottle 33cl. Pours hazy orange with a small white foam on the top. Aroma is grapes and hops . Medium body, active carbonation.Taste is pine, orange ending with bitter grapefruits.07/17", "From elcervecero. In Teku glass. Playing Bastion. Light sweet fruityness with a strong (yet not brutal) bitterness, but more english than american, with an odd flavor, maybe mineral-like", "Partagée avec mon cher Appiantiqua dans des verres \"Straffe hendrik\".La robe a une belle couleur orangée surmontée d’une fine mousse blanc cassé peu persistante avec une faible carbonatation.Le nez nous offre rapidement des arômes d’agrumes: pamplemousse,orange......avec des notes houblonnées typiques des IPA. La bouche est à l’image du nez avec une amertume assez prononcée(\"brutale\"!) dominant l’ensemble. Une bonne IPA,agréable mais qui manque un peu de caractère!13,5/20.", "Partagée avec mon petit Kittenbieer dans un verre \"Straffe Hendrick\".\r\nTempérature de début 6° environ.\r\nBelle robe orangée translucide surmontée d’une fine mousse blanc cassé peu persistante; faible carbonatation.\r\nNez agréable sur les agrumes : pamplemousse ,mandarine, oranges.\r\nLe goût est conforme à ce que l’on attend d’une IPA avec des saveurs houblonnées et fruitées.\r\nLa finale nous laisse comme prévu sur des notes amères.\r\nUne IPA classique qui manque tout de même d’un peu de relief.\r\n13,5/20", "One of the most balanced IPAs I have tried. Orange colour. Moderate carbonation. A bit of citrus flavour. \n\n---Rated via Beer Buddy for iPhone", "Solid hoppy IPA. Citrusy, bitter. With some cone aroma, herbal. Not so brutal but delicate imo.", "Bottle. Pours clear golden. Floral, fruity, grassy, bisciut, bread crust aroma. Fairly bitter.", "Achetée à Carrefour. Bière ambrée au nez fleuri et houblonnée. Très sèche en bouche, très maltée. Bonne bière mais ne ressemble pas aux autres IPA.", "Sur un marché inondé par les IPA, dur de faire la différence. A l’ouverture la Brutal nous amène les mêmes arômes bourrins de houblons citronnés que l’on retrouve dans toutes les IPA actuelles, forts parfums de fruits tropicaux. En bouche cependant elle contrebalance cette puissance par une amertume douce et un houblonnage appuyé mais tout en légèreté, sans nous défoncer le palais. Corps moyen qui vient donner ajouter de la cohérence au profil de cette bière. Jolie couleur cuivrée. Une IPA faite pour ceux qui n’en peuvent plus des IPA.", "Pours a huge thick foamy head and has a slightly cloudy orange/coppery appearance. Nice dirty lacing. Aromas of mild floral hops and much stronger citrus hops. Light grapefruit notes it seems as well. Flavours are strong in orange and grapefruit, some light grainy and barley malts also come into the mix and much hops. Orange flavour becomes stronger after a while and more grapefruit becomes apparent in the finish, making it lightly soured. Mildly spiced. Nice and smooth creamy mouthfeel. Full bodied with quite active carbonation. Not sure why named Brutal IPA (what is on the bottle), seeing as how ibu is not extremely high and a 6.5%abv count is not super strong. But oh well, still good tasting!", "Oct 17 : Bouteilles achetées à Carrefour. Bonne ipa assez fruitée. Bonne donc, à regouter!\nJuillet 19 : en vacances à Bidart. Bonne en effet, pas commune.", "Bottle. Not perfectly fresh. Amber color with off-white head. Aroma has pine, needles, fruits. Taste is malty with long bitter aftertaste. Flavors of malt, pine, needles, citrus. Well balanced malty IPA.", "9 mois avant DLC. Ambrée sans mousse ni carbo. Arôme fruits exotiques. Très belle rondeur ! Maltée, très houblonnée. Amertume prononcée top avec hamburger maison et frites. Tres sympa mais pas belle !", "Toffi, karmel, trochę papai, potem cytrusy. Fajnie się pije. Piwo nie zadziwia i prawdopodobnie dla mieszkańca Polski nie jest warte swojej ceny.", "650ml bottle. Pours orange gold with a great head. Mango, pineapple, savoury biscuit, little drying citrus. Very sweet, nice bitter finish. Good full body. Tasty.", "Bottle. Light amber look. Foggy. Medium sized head. Aroma: nectary malts, fruity hops. Similar taste. Medium bitterness. A bit old still good.", "Es war spät, ich war das erste mal im BEER TEMPLE in Amsterdam und ich war mal wieder aufgeregt ;). Trink ich irgendwann nochmal....bis dahin: IPA...JAAAA...Great but not the Best :). TAP.", "6.2%. Hazy pale amber/honey. Medium head with high retention. Aroma intensity 3.75/5. Honey (flowers), cooked vegetables and alcohol in the nose. Unexpectedly brutal in the mouth, heavy sterile bitter. Quite pleasant. Light to medium body", "ES una Ipa muy suave, poco de brutal, si es buena pero suave..el aroma no termina de ser lupulado, o al menos no excesivo. En boca destaca lo compensada, es bastante redonda. Predominio de fruta madura", "Very nice IPA, the Americans definitely make the best ones. This one doesn’t smell flowery or thick at all, but it tastes very subtle and soft almost. Aluring beer that quickly makes you order a second, better than a lot imperial IPAs as well.", "Na zdrowie, Salud, Kampai, Prost, Skaal, Zivjeli, Fenékig, На здоровь& Na zdravi", "bottle @ home\r\nhazy orange, cream orange explosive head\r\ncream, toffee, butterscotch, sweet red orange, pink grapefruit, papaya, light hiops\r\ncream, butterscotch, good hoppy bitterness, outmeal, farmer, grapefruit, wild strawberries, meringa, peach and orange juice", "Not as brutal as expected. The body is medium for an IPA. The aftertaste is very bitter and a bit malty, as expected. Some interesting floral and citrus notes on the nose and the palate.\r\n\r\nMore balanced than the name suggests, but overall a very enjoyable IPA.", "Cloudy, light brown, touch of pepper, orangeysweet, citrus, pineapple, malty sour aftertaste.", "Botella 33cl del 3er tiempo Santander. Wow! Ipa robusta y contundente. No demasiado gruesa y con largo final. Con cautela.", "355ml bottle at home on 2 Apr 2017, from Drygate Bottle Shop, Glasgow, floral, toffee aroma, golden amber with a very short-lived lively thin head, burnt caramel, toffee, citrus hop flavour, oily, fizzy, bitter hoppy aftertaste.", "355 ml bottle. Bought in a Jumbo Supermarket in Santiago. Dense golden color with perfect thick head. Fruits and pepper smell with strong hops, tipical ipa; less smelly maybe. Good first strike, with sweetness. Miss a little more flavour in the end, but is still excelent.", "Bottle@Salling Super, Aarhus. Pours golden amber with an off-white head. Aroma and taste is malt, citrus fruits, caramel, citrus, orange. Medium body. Soft carbonation. Bitter finish.", "33cl bottle purchased @ Monoprix.Belle couleur orangée, arômes d’agrumes. Amertume légère.", "0.33l bottle. Hazy golden with medium good lasting white head. Aroma. rich aroma of tangerine, passion fruit, pine. Taste: candied fruit, caramel, biscuit, citrus, slight touch of warming alcohol. Medium body, moderate carbonation. Moderate bitterness packed with fruitiness.", "Serving: from bottle purchased at Rogue Distillery and Public House.\r\n\r\nAroma: moderate pine hop.\r\n\r\nAppearance: average-sized, frothy, off-white head. Fair lace and mostly diminishing longevity. Clear, dark-yellow body.\r\n\r\nTaste: lightly bitter initial flavor and finish with average duration.\r\n\r\nPalate: medium body, watery texture and lively carbonation.\r\n\r\nOverall: easy to drink.", "Review based on the BJCP2015 guidelines (style 21A). Bottle 35.5 cl - Batch unknown (BBF 06/2017). AROMA: oxidized aroma with notes of dried grass, cheese and stale malt. APPEARANCE: light ambar color and cristal clear. medium ivory head with medium retention. TASTE: similar to the aroma with notes of caramelized malt and dried grass. medium bitterness with an almost dry and medium bitter finish. PALATE: medium-light body with medium carbonation. OVERALL: a beer to be re-tasted.", "Pleasantly surprised by the Rogue Hazelnut Brown Nectar, I obviously chose this one with some expectations. Well, it’s a good IPA indeed, but this is not my favorite style to begin with. A fresh and hoppy taste, not way different from the best IPAs on the market but still enjoyable. Some bitterness quickly dissipated and a pretty correct aftertaste in mouth. Not my usual cup of tea but good enough to be APPROVED BY TAVERNY’S BLACK METAL CREW!", "0.33 l bottle from Boxbeers.dk . Pours orange-ish, with a small off-white head. flat. Hop aromas, fruity, light raspberry, citrus, malts. Sweet, no bitterness. Flat, medium body, soft carbonation, abrupt finish.", "Bottle, 12 FL. OZ. Pours very cloudy deep amber/orange with half a finger of soapy off-white head which doesn’t stick around long. Patchy lacing, moderate amount of visible carb; small bubbles. Nose is malty, sweet, fruity. Strong caramel, sourdough bread, candied pineapple and orange/blood orange, other tropical fruits around the edges and nicely balanced out by fresh, floral, citrus-y hops. Taste is similarly fruity and sweet, but also with a noticeably sharp grapefruit-y sourness as it hits the tongue. Turns sweeter and slightly syrupy towards the finish with some more juicy fruit (orange, mango) and sourdough malt. Some chalk/mineral bitters right at the end. Finish is long and wet a moderate lingering hoppy bitterness, with some cereal, light spice and white pepper. Body is solid medium and despite the slight syrupy character this doesn’t seem as sticky as some claim, instead going down super smoothly for me. Moderate carbonation adds a bit of extra refreshing sharpness. Great stuff with an excellent sweet/sour/bitter balance; not quite the juice monsters of your Cloudwater and \"New England style\" fare but a fine fruity IPA.", "orange beer with a small white head. Floral, fruity aroma. Limited carbonated. Taste almost smoky, a bit sticky even. Not my thing.", "Botella en 99Cervezas. \r\nColor dorado-ámbar, muy brillante y perfectamente transparente. Buena espuma ligeramente tintada, bastante cremosa con burbuja de diversos tamaños y muy adherente, aunque de persistencia media. En este caso no es un problema, porque permite ver casi enseguida un bonito encaje de Bruselas. Una preciosidad de cerveza. \r\nEn nariz intensidad media y complejidad media-alta. Lo primero que viene es el lúpulo, acompañado de notas frutales, como de ciruela blanca no demasiado madura. Notas florales suaves pero presentes. También encontramos notas ténues especiadas, como de pimienta, así como el picor de la de hierba recién cortada. Muy ligeros toques de caramelo. \r\nEl amargo y el luce compiten como sabor principal, ambos suaves pero muy expresivos y muy muy bien equilibrados. \r\nEn cuanto a la sensación en boca, es de peso medio-ligero, suavemente frizante y con gran carácter refrescante. \r\nEl fantástico equilibrio entre dulce y amargo se mantiene conforme evoluciona en boca. En el dulce, salen notas ligeramente amisteladas. El amargo por su parte, conjunta delicadeza y expresividad. El final en boca mantiene el equilibrio dulce-amargo, Sin que el primero resulte empalagoso en absoluto ni el segundo cargante. Un portento de equilibrio. \r\nUna cerveza maravillosa. De trago largo y extrema bebestibilidad. Tan sólo le cambiaría el nombre, ya que con el título de “Brutal\" quizá muchos amantes del lúpulo extremo esperarán encontrar un fuerte carácter lupulado (aún mejor si es de lúpulo viejo), y no es el caso en absoluto.", "Bottle from Boxbeer.dk\r\nShort off white head. Cloudy golden color. Plesent hoppy aroma. Fresh hoppy taste with a mild maltiness and crisp body. Lingering bitterness that is medium level.", "IPA avec un IBU de 46 et un titrage alcoolique de 6,7 % Abv. Cette Rogue Nation n’est pas si brutale que cela. Mais vous pouvez tout de même répondre favorablement à l’appel de cette bouteille qui vous interpelle avec ce \"Join Us\" fièrement inscrit sur l’étiquette. En effet sans être une grande IPA, notamment par son manque de complexité dans les arômes, elle reste d’une bonne homogénéité avec une longueur appréciable et des arômes agréables. Le peu d’effervescence déconcerte tout de même en verre, les très fines bulles permettant tout juste de napper la bière d’une mousse blanc cassée. Sa robe, blond vénitien (EBC au environs de 28) lui va à ravir cependant. Le nez quant à lui nous transporte dans une forêt de conifères. Celui-ci, intense se porte principalement sur les résineux, avec toutefois des touches de pamplemousse, d’orange et de caramel. A la dégustation, l’attaque est souple. Les arômes de caramel et d’abricot prédominent mais une arrière bouche citronnée permet de lui procurer de la fraîcheur. La seconde bouche est relativement suave et fruitée : fraise, ananas et orange sont au programme. L’amertume arrive alors, tranchante sur des arômes de pin et de pamplemousse. Le final sera long, mais n’apporte malheureusement aucune nouveauté et manque cruellement de variations... et frustre quelque peu. Dommage, car l’arrière bouche sur les fruits exotiques et le caramel accompagne convenablement l’amertume (l’arrière bouche aurait tout de même pu être un peu plus poussé) et l’équilibre est bien trouvé. Même si elle n’est pas \"brutal\", les 6,7 % Abv portent également bien l’ensemble et laissent convenablement s’exprimer les arômes. En définitive, on veut bien se joindre à Rogue Nation, mais un soir suffit tout de même.", "Bottle from Biertempel: Aroma with grapefruit zest, hints of tropical fruits. Hazy golden orange colour, low head. Flavor with candy notes, some fruitiness, herbal hops. Hints of tropical fruits, earth and chalk.", "ASPETTO: ambrata, schiuma bianca, fine, abbondante e persistente. AROMA: fruttato, un po' floreale. Comunque non intenso. GUSTO: ottima, equilibrata, dolce e fruttata (frutta tropicale e gialla) all'attacco, per poi evolvere in un floreale ed erbaceo che equilibrano il tutto. Saporita, beverino, scivola benissimo e disseta.\n\n---Rated via Beer Buddy for iPhone", "roasty, spruce, caramel, earthy, smoke, woody, golden-orange, cloudy, nice head, medium sweetness, medium bitterness, lightly sour,", "Una IPA poco brutal. Mi aspettavo una luppolatura sgraziata, esagerata e violenta. Invece è molto, troppo equilibrata. Amaro nella norma e profumi di luppolo ottimi. Una IPA molto buona ma non brutal. Rogue si conferma uno dei migliori birrifici che conosco. Le sue birre sono sempre tecnicamente perfette ed equilibrate. Anche (purtroppo) quando la birra si dichiara \"brutal\".", "2018 rating: MIsty golden-amber body, off white head. Tropical aroma, brown sugar. Light tropical hops on soft malty body. Solid, okay IPA.\n\nInitial rating, 2016 or 2017: Thanks Karlo and Ivan R. Misty golden body, small white head. Light tropical fruit from the hops and apples on dry caramelly maltiness. Taste... Cheese and citrus. Vague tropical touch. Good body, silky on medium carbonation, but the taste... Chalk it up on not traveling well and light oxidation.", "Poured from a 12 oz bottle into a pint glass. The appearance is a cloudy golden amber with a medium sized white head. The aroma is all hops and citrus. The taste matches the nose with the addition of some malts.", "Having been disappointed in other Rogue Nation offerings I had small expectations for Brutal. That was a mistake, this is easily my favorite from them so far. Bought in a mixed six pack at the local supermarket, I poured into a tall bar glass. The color is fine, a dark yellow-amber. It heads nicely and that stays throughout. Scent is minimal, grass and lemon. Taking a drink I got some moderate hoppiness, bread and perhaps a bit of malt. The finish is quite all right with a decent bitterness lingering for awhile. Very drinkable and a complementary 6.3% ABV. Maybe a bomber of this next time.", "Bottle. Pours cloudy dark gold color with off-white head and lacing. Nose of citrus (grapefruit) and resins pine. Grapefruit and other citrus followed by some resiny pine in the finish.\n\n---Rated via Beer Buddy for iPhone", "Cloudy amber beer with short cream-colored head, smell is citrus and taste also, \r\nbitter, full body, oily, finish also bitter,\r\n(I have 0.65l bottle with best-before 30.04.2017)", "0.33 l bottle from Pivoteka, Zagreb. Shared with Višnja 666 and Goran. Thanks! Very murky, almost opaque orange, small off-white head. Flat, not fresh. Hop aromas, fruity, light raspberry, citrus, malts. Sweet, no bitterness. Flat, medium body, soft carbonation, abrupt finish. Unfortunately flat, so don’t count this one.\n\n0.33 l bottle shared with Marko and Anna God. Murky golden, small off-white head. Moderately hoppy,  citrus, zest, herbs. Hops low in flavour, malts emerging, spicy hops in finish. Medium body, moderate carbonation, moderate finish. Solid.", "Gedeeld met lion in wapse. Amber crème kraag rozenbottel en mango en kruidig van de gist nais", "Bottle 0,355L. Unfortunately not the freshest example. Hazy, orange color with small, frothy, off-white head. Aroma is fruity, a bit malty, a touch of alcohol way behind. Starts as a light bitter and slowly turns to heavy bitter end with some woody notes. Medium body, oily texture, soft carbonation. Gotta find fresh one somewhere and re-rate it again.", "Aroma:\n\n\nMedium aroma of malts, caramel, orange, hops and citrus.\n\n\n\n\nAppearance:\n\n\nTurbid/opaque golden/amber beer with heavy yeast and with a slight/medium off-white head.\n\n\n\n\nTaste/Palate:\n\n\nStarts medium sweet with malts, caramel and orange; ends slightly bitter and dry with hops and citrus.\n\n\n\n\nOverall:\n\n\nThis beer is rather intense, complex and balanced. Great malt flavour with a dash of sweet hops. Could have definitely been more brutal though, with its 50ibu.", "355ml bottle. Hazy orange pour with a frothy off-white head, good retention and lacing. Aroma: orange, citrus, pine, malt. Taste: as the aroma, very citrussy especially orange, mild pine, caramel, mildly floral, bitter finish. Medium body with very little carbonation, oily texture.", "Presenta naranja turbio con media cabeza de espuma blanca y buena retención; aromas a maracuyá, mango, cáscara de naranja, hojas de pino, lúpulo y flores, en boca entrada potente con fuerte amargor, que se acentúa en el retrogusto, acabando bastante seca; cuerpo medio y justo carbónico, notas florales, a resina y miel, cerveza compleja, bien elaborada, equilibrada con fuerte carácter y estilo conseguido.", "Hazy, orange-amber colored, medium off white frothy head. Aroma is of malt, caramel, mild pine, orange hardcandy, more caramel. Taste is medium sweet malt, caramel, orange hard candy, some fruity, floral and citrus hops, medium to light aroma, medium- bitterness. Medium bodied, soft carbonation, bit oily. I’m guessing the hops didn’t make it to the shop. Disappointing, definitely need to repeat...\r\n(bottle, Pivoljub Ljubljana)", "Ambra chiaro, con schiuma abbastanza evanescente. Al naso erbacea e agrumato. Bevuta discreta con un luppolo ben spinto, agrumi e note floreali. Finisce amara. Carbonazione media. Beverina ma non eccezionale", "Brutal? I’m not a hop head and still didn’t find this at all bitter, let alone brutal. Grapefruit and pine. Tasty.", "Bottle. \r\nHazy caramel color, frothy light tan head.\r\nHoppy nose with notes of hay. Very malty taste, roasted. \r\nNot the traditional ipa. Long mildly bitter finish.\r\nFull body, soft carbonation.", "L:\r\n-pours a cloudy amber-orange with a medium,frothy,offwhite head\r\n-medium carbonation visible\r\nS:\r\n-peach,resin,grapefruit,orange,honey,caramel\r\nT:\r\n-grainy,caramel,grapefruit,astringent with a toasty finish\r\n-low to medium bitterniss for the style\r\nF:\r\n-medium carbonation\r\n-light body\r\nO:\r\nA little disappointing.", "0.33l bottle. Fresh aroma of citrus fruits, light flowers notes. Hazy amber to orange color, white head. Average bitter taste with citrus fruits notes. Medium body, watery texture, soft carbonation and dry bitter finish. Easy drinking. Good.", "Appearance- amber, a bit cloudy, a small bubbly white head. Aroma- creamy malt, caramel, marmalade, orange, hints of piney hops. Taste- bitter hops, orange peel, juicy fruit, quite a lot of sweet maltiness, fairly full mouthfeel. More depth of flavour comes out as it warms.", "$2.19 bottle from Market Street Wine Shop, Downtown. Pours murky orange-amber with a small head. Aroma of citrus, sour hay, sweat... Flavor is black tea, citrus peel, orange, sour hay. Um... I don’t hate it.", "Ljus och lätt grumlig. Hade höga förväntningar på denna. Okej, lite fruktig, men lite diesel bismak\n\n---Rated via Beer Buddy for iPhone", "Light amber pour. Aroma is resiny, orange/tangerine. Caramel/biscuit malts, pine, light orange rind, some herbal notes in mouth. Medium mouthfeel, light carbonation, lingering light finish. Low bitterness - lots of british character.\r\n\r\nRogue’s online store describes this as an imperial bitter, whatever that is. Somehow, thinking of it like that instead of an IPA makes me enjoy it more!", "Nez propre aux IPA, agrumes, houblons herbacés, épices, caramel... Rien d’exceptionnel, rien de choquant non plus. En bouche, on retrouve de très bons houblons à l’amertume moyenne sur une note douce de malts caramélisés. Les houblons et les arômes restent assez peu au palet, le final est très court. Carbonatation faible. Une simple IPA de soif, toute sauf brutale... Bouteille 35.5cl, Keep It Weird Bar, Grenoble.", "330ml bottle. Pours hazy golden with small white head. Aroma of citrus, pines, hops, fruits, resin. Medium body with soft carbonation. Light sweet, medium bitter.", "Copper with medium carbonation and good head retention. Light pine, citric, medium high fruity aroma and flavor. Medium bitterness in balance with a medium light caramel character. Medium light body. A sweet and bitter beer, nice balanced.", "- leichte Zitrusaromen verbunden mit ein wenig Malz\r\n- die Herbe ist moderat, man erwartet bei dem Namen einfach\r\n mehr\r\n- nach dem Einschenken muss man es etwas im Glas stehen\r\n lassen, da die Kohlensäure für meinen Geschmack zu stark\r\n dosiert ist\r\n- der Abgang bleibt angenehm, wobei hier der Malz- mit dem\r\n Hopfenanteil gleichzieht \r\nFazit: Hatte mir irgendwie rein namenstechnisch mehr erwartet", "Fruity hop aroma, some barnyard notes. Small head, hazy amber. Medium sweet and bitter, a hint of caramel/syrup. Medium body, long finish.", "Una IPA de color ámbar anaranjado turbio y baja carbonatación. Su aroma es a fresas, frutos rojos y lúpulo. Su sabor es a frutos rojos (fresas), maracuya, mango y naranja con un amargor suave.\n\n---Rated via Beer Buddy for iPhone", "Orangée, carbo moyenne, petit collet persistant.\r\nAromes agrumes, pointe de caramel et de sève.\r\nMoyenne en bouche, herbeuse et orangée en finale, amertume loin d’etre brutale, mais agreable.", "Bottle at home. Hazy amber body with a small white head. Caramel, stale hops. Bad.", "Bottle shared by Inoven, it has a nice citrus /hop taste. A nice palet and no head.", "Flesje thuis gedeeld met familie. Licht amber kleurig, beetje troebel bier met weinig schuim. Hoppig en fruitig aroma en smaak. Nasmaak is bitter.", "Hazy amber body, big white head. Aroma of exotic fruits, candied fruits, citrus notes. Flavors of exotic fruits, lemon, lime and grapefruit. A piney side with a medium bitter backbone. I expected a stronger flavour from the nose. Medium citrus and pine bitter finish. \n\n---Rated via Beer Buddy for iPhone", "From bomber. Lots of sediment in the bottom of the bottle. Hazy orange with a white head and plenty of lacing on the glass. Muted hops aroma. Taste is bitter, dry, hoppy, but with an odd medicinal quality. I’d be willing to try it again, but I’m not a fan of this one. Rogue usually does nice ales.", "Bottle, 33cL. Home. A sparkling amber beer with a medium off-white head ; medium retention. Fruits (tropical fruits, blackberry), resin, herb, roast, spicy note. Light sweet, medium dry bitter refreshing. Medium body, thin texture, light oily texture, average good carbonation fruity resinous dry lasting finish. Overall, very good IPA !", "belle petite couleur orangée, mousse qui tient largement la route sur la durée, assez timide au nez malgré son statut d’IPA. En bouche il y a une touche de fumé qui tabasse tout de suite, suivie par une grosse amertume de guedin. Comme pressenti au nez, ça ne fait pas vraiment dans l’aromatique, et le peu que l’on sent va dans le résineux. Donc ouaip, tout ça est bien Brutal. Pas trop fan pour ma part.", "Bottle in Las Vegas. Hazy orange pour, thin white head. Aroma of fruity hops, resin, floral and citrus. Quite spicy as well. Flavor is very bitter, spicy and a bit rough. Decent body.", "From bottle. Tastes ok, flavors of malt and a bit bitter. A very tipical US IPA.", "From bottle. Pours a hazy orange and a small off White head. Aroma has strong, earthy hops, caramel malts, orange. Taste is medium sweet, bitter, spicy hops. Average carbonation and a rather oily body.\n\n---Rated via Beer Buddy for iPhone", "Draft to pint at PDX-Portland pour hazy avg gold with orange hue and moderate white head. Nose dank citrus and pine. Taste light bitter up front, then dank hop, spicy pepper hop, then light tropical fruit. Lighter bitter finish.", "Pours a hazy orange color, topped with a medium off-white head, non-lasting. Mild fruity aroma, peachy with little resin presence. Malty backbone pretty noticeable, but still hop dominated IPA. Solid bitterness, some biscuity malty feel, sweet. Lasting aftertaste, pretty strong.", "Bottle. amber-gold with a white head. Orange juice, lychee and sawdust aroma, dry, bitter and hoppy taste with toasty undertones and some leafy green notes. Medium body, slightly alcoholic aftertaste, with leafy hops finish.", "Aroma a lupulos americanos, cítrico. Color ámbar oscuro, espuma blanca. Sabor muy lupulado, alto amargor. Toques a fruta cítrico, resina, pino. Final seco.", "Love those US IPA’s. Strong hoppy aroma, orange, off-white lacing foam. Bitter taste, lasting quite long. (Velp 201607)", "bottle to glass mug. Pours a cloudy copper color with a very sparse white head. The nose is off. I’m sure this case was brewed in 2015 and it didn’t age well. Almost no hop notes. Very malty. I will have to revisit this one again when Westy’s starts to give a crap how long beer sits on their shelves.", "Bottle, 355 ml, courtesy of and shared with Miro. Pours hazy orange with white head. Caramel malty, hops, fruit, sweetish with some bitterness in the end. Expected more hops and bitterness, freshness could be the problem. Medium bodied.", "Bottle, 355ml. Pours clear white brown, large yeast residue at the bottle bottom. Scent is gentle, corn, grain and mild hops. Mouth feel is oily, medium-soft carbonation. Tastes quite bitter, with some acidity and gentle malty sweetness. Vary savory. Flavors of yeast, grains, canned corn, pale malt, mostly bittering hops, lightly fruity, somewhat toasted, some herbal hops. Ends nice and crisp. Savory and very yeasty. OK.", "Aus der Flasche im Frenc getrunken. Trübes helles Kupfer mit stabilem Schaum im Glas. In der Nase zurückhaltend. Im Antrunk wunderschönes Bukett an Fruchtaromen. Lang angaltende subtile Bitterkeit.", "Draft sample offered by Reagin at Fishale. A little pine and a little citrus; it was fairly balanced. I agree, it was anything but brutal bitterness on the palate. Really a nice IPA but I chose the Lagunitas Waldo IPA over this.", "Bottle: Deep golden with an orangey sheen, almost clear, bigger and very stable white lacy head; exotic-fruity and some herbal piney aromas in the nose, supported by a tinge of soy-sauce and sweet malt; moderate to solid bitter-sweet flavour; medium bodied; lingering bitter-sweet finish with exotic-fruity and soy-saucy flavours. Nice...", "Le nez est assez confus, aromatique mais pas hyper équilibré ou plus tentent que cela. On y trouve un petit fond éthylique, et pèle mêle des arômes toujours discrèts, jamais tranchés de : fleurs, pêche, un peu ananas, quelques herbes.En bouche, le côté éthylique revient un peu, donne un petit côté éc?urant. On retrouve un peu le floral, le côté herbal. À cause de l?alcool, les notes fruitées font chimiques.Longueur très éc?urante.Pas convaincu.", "Fruity aroma, peach and grapefruit. Also malty caramel. Pours rich golden with a white head. Fabulous taste of sweet and bitter fruit and lots of pine. Feels slick, medium carbonation, long bitter finish. I have love for this one.", "Gloden, low head. Palate medium, low carbonation. Aroma toffee - a lots of it, candi sugar. Taste caramel, spruce resin (bucketloads of it). Furniture-like wooden aftertaste. Very bitter. Hell yeah, a strong one!", "Bottle. Very beautiful amber/orange colour with no head. Nice Orange and red fruits flavour. Very balanced bear, a good hopy bitterness but not lasting. Almost sweet and oily but not too much. A very very good IPA", "650ml bottle bought in Ucluelet liquor store, tasted on Green Point Campground. Pours hazy golden with a white head. Aroma is tropical fruits, citrusy. Taste is slightly sweet, piney and citrusy bitterness. Very good.", "12oz bb04/2017 new arrival at Bierhandlung. - Much less than brutal, deliciously balanced and even UK-balanced IPA rich with cushiony floor malts and stewed orchard fruit. - Nose: stewed rhubarb and apple (those wheats?), bitter orange and high summer forest woods. Near-chewy mouthfeel, speading the orange marmelade thick to be injected with natural angostura, pine, berry, again rhubarb. Odd how this \"cooked\" aroma profile seeps into every aspect of this beer, yet does not make it feel old or spent. Misnomer of a tasty IPA.", "The aroma of overripe fruit. Same with the taste. Dried apricot. Okay bitterness that fills the upper part of the mouth for a long time. No ipa that impressived me. Had higher expectations. Follow me @ Kung av öl @ Facebook for more pictures and ratings.", "Bottle, 0.355l. Pours hazy deep amber color with thin soapy off-white head, yeast residue and sparkling appearance. Aroma of caramel, dandelion syrup, peach, vanilla and herbs, Taste starts with light sweet biscuit malt and resin, following is mild fruity and grassy, mouthfeel is mild spicy, while finish is mild bitter. Light to medium body, creamy texture and average carbonation in palate. Brutally soft IPA...", "Bottle from Yeme. Amber hazy colour. White head. Aroma hops, pine, grapefruit, caramel. Taste is hops, pine, resiny, grapefruit, caramel, toasty. High bitter, yet pleasant aftertaste. Very good.", "Cloudy amber, offwhite froth. Peach and pine aroma. Flavour has fruity citrus and piney bitterness. Pretty drinkable.", "Sweet aroma of very matured fruits. Not what I was expecting. Hazy golden color, nice lacing. Taste is rather disappointing. Malty, a bit sweet. Not much hops, not much of bitterness. Quite a lot of caramel. Heavy, not very drinkable. Was expecting much more.", "Pours hazy amber with a frothy head. Aroma is very piney and resinous, loads of pacific hops in this one. Also rather refreshing feel to it. Flavour is dominated by bitter resin and pine, also some grapefruit. Some herbal flavours. Very bitter and extremely resinous aftertaste. Brutal for its use of pacific hops I guess. Nice.", "Bottle from LCBO. Alc 6.2%. Pours rather murky amber with creamy white head. Aroma of jammy oranges, sweetmalts, citrusy zest, resiny pine... A bit caramelly even? Rather good, albeit restrained compared with the more modern hop-bomb IPA-s. But I do appreciate the old-school restraint. Tastes fruity sweet with orangey bitter continuation and more piney finish. Mellow! Moderately prickly carbonation and medium body; nicely resinous, lingering bitter finish. I’m not a big fan but I do like an old-school US-style IPA once in a while.", "duft: svag duft en lille smule frugt appelsin\r\nsmag: citrus lime frisk lime appelsin", "Cerveza equilibrada, intensa pero no demasiado amarga. Ligero sabor a queso y frutos secos", "Bottled 33cl. Color : cloudy dark orange ale, with thin white head. Nose : citrus, floral hops, honey. Aromas : citrus and resin. Texture is medium, medium bitterness.", "Rogue Nation Brutal India Pale Ale -- what’s not to like? Hazy yellow pour with an decent white head. Intoxicating aroma of citrus fruit and pine. Taste is more to the same citrusy and just enough pine to make it interesting but no bitter bite. Brutal is a well-balanced delicious IPA!", "Blonde dorée, légèrement trouble, mousse blanche moyenne qui ne tient pas trop. Nez floral, ananas, fruits exotiques, fraise. Attaque amère, saveurs de fruits tropicaux et quelque peu de fruits rouges. Le corps est moyen, la longueur bonne et l’amertume persistante. Bonne IPA, exactement ce qu’on attend d’une american IPA !", "Okay head, carbonated fruit juice body. Good heavy fruity hops aroma with sharp hints. Good hops notes, some nutty hints. Well balanced, drinkable, amongst the pack and you’d prolly drink it if you’re local but wouldn’t sell your house to go find the thing. (Yes - I’ve found beers like that. And I miss that house).", "Bottle. Clear, orange, frothy, medium bitterness, light sweetness, medium body, oily feel, soft carbonation, & long finish.", "Bottle from Whole Foods. Been saving this for a while, £10 a bottle!\nVery nice. I was expecting more hop bitterness, overall nicely balanced and easy drinking strength. \nDon't usually rant about hop smells as I find it pretentious but... this one (to me) smells like Rhubarb & Custard sweets. Lush. \n\n---Rated via Beer Buddy for iPhone", "355 ml bottle. Semidark orange colour with stable head off. Aroma is hoppy,citrus fruits, sweet. Taste of tropica fruits like mango, peach, huge bitter aftertaste. Moderate carbonation. Nice", "C’est sans doute trop \"malté\" à mon goût ... Un côté sans doute aussi un peu trop \"compoté\" dans l’expression du houblon. C’est presque un bareley très houblonné ... C’est bien mais je suis pas fan. Ni de Rogue d’ailleurs", "12 oz bottle: Orangeish blonde color, grassy and citrussy hop aroma, toffee maltiness. Initial sweetness on the palate like berry-flavored candy, followed by pleasant alcohol and bitterness. Good standard IPA.", "On tap at John B Pub in Coquitlam. A reddish amber beer with moderate white head. This is one those amazingly balanced beers that present big hops and big malts about equally. Nice! 3.9", "Bottle. Cloudy amber pour with a small off-white head. Aroma is citrus and tropical fruit with a touch of caramel. Taste is odd - bitter up front, some light citrus zest but also medicinal and herbal, not much sweetness. A bit disappointed - perhaps it's the 3 months of age on this bottle, but it's just not great.", "Bottle. Hazy orange amber with a decent head. Aroma is resinous, grapefruit, lychee,onion and grass. Light malty sweetness, herbs, lemon peel, guyava, grapefruit and piney notes, strong bitterness. Relatively light bodied, a bit watery, but quite drinkable. Nice.", "6.3%ABV. IPA.\r\n\r\nTapped out gold amber. 8ºSRM.\r\n\r\nNose has some nice spicy pine-y aroma notes. Maybe even some table grape fruitiness and sweetness in the nose. There are also some pleasant ripe peach, plum aromas. I can’t help finding the spice which is more like basil but a little more aggressive and maybe Thai basil.\r\n\r\nMouthfeel is soapy. Palate has toasty malt flavors with graham cracker, honey comb, multigrain toast, cracked barley bread.\r\nHops are pine, resin, vegetal, spicy with cilantro, basil, mint.\r\n\r\nOverall, good, but given the IPAs that I’ve had, not \"list worthy\"", "So many aromas that makes it very smooth to drink, really nice and well rounded IPA, great.", "650ml bottle at home in Richmond as ’Rogue Nation Brutal India Pale Ale’, undated, no ABV details. Vibrant opaque dark orange, hazy, foamy off-white head. Looks the part. Aroma is potpourri, candied lemon, dried out air freshener. Body is smooth with soft carbonation. Taste is sweet caramelly sugars, flowery, card, light milky coffee dimension, grassy finish. Everything is overpowered by the caramel vibe. It’s OK. A bottle of Boon Mariage Parfait was sat alongside this at the shop, and £3 cheaper. Sometimes ticking isn’t the answer!", "0,355 bottle, Beerlovers Vienna. Intensive floral, citrus, fruity and malty aroma. Light amber color with an average white head. Bitter, sweet, fruity taste, does not disappears. Nice balanced beer, like it.", "355 ml bottle bought at The Q-Club in SoHo, Central.\r\n\r\n\n\nLooks: Translucent golden orange colour with a ring of dirt-like yeast particles; Razor-thin head and residual white foam which fades in 10 seconds; Very small sticky lacing with quite fizzy small carbonation. \r\n\r\n\n\nAroma: Very fragrant and sweet Ale malt, with strong orange, strong floral, honey, marmalade, pine, citrus and yeast. \r\n\r\n\n\nTaste: Strong sweet Ale malt, with strong citrus peels, marmalade, caramel, carbo, strong molasses, strong resins, biscuits, light yeast, strong lemon, very strong bitter hops and sharp grass.\r\n\r\n\n\nBody: Medium body. Thick and oozy palate.\r\n\r\n\n\nMouth Feel: Very good Ale maltyness in a rich and very slick background. Quite strong caramel followed by a combo of strong jammy fruit peels and almost syrupy honey sweetness, but well balanced by strong resin ooze and fair pine. Fair biscuit and strong lemon to round. Immense and very pleasant!\r\n\r\n\n\nHoppiness: Strong orange, strong floral, jam, pine and citrus in nose. Strong citrus peels, marmalade, strong resins, strong lemon and strong grass in taste; Bitterness is very strong for a lasting, very high astringent sweet-bitter finish.\r\n\r\n\n\nAfter Taste: Fairly dry. Sweet oozy and strong bitter to mouth.\r\n\r\n\n\nComments: Brutal? This one? Not really. Intense is a better word: Poor head aside, just about every aspect is strong and impressive, from bright colours, jammy aroma, sweet oozy taste, and strong lemony hoppiness. The sweet bitter combination are polar opposites but work just fine. Just love that orangey fruityness. A joy!", "Slight haze develops on the pour. The flavors of subtle citrus, rich malt and floral hop match the aromas. Very nice amount of bitterness on the finish. I’ll definitely drink this again.", "Big 2\" fluffy off white head... sits atop a only slightly hazy golden orange brew.\r\n\r\nAwesome grapefruity aroma... some fruity esters... only the slightest smell of pale malts.\r\n\r\nNice low/medium mouthfeel.... relatively low carbonation... larger than average bitterness... with mouthcoating oily citrus hops... enough malts to balance", "the aroma is fruity and, a little bit, caramel with hints of pine, orange, grapefruit, toffee and spicy herbs... the taste is malty and fruity with notes of sweet orange, grapefruit, pine needles, toffee and spicy grasses... sweet, bitter and dry aftertaste...", "Blonde dorée, légèrement trouble, mousse blanche moyenne qui ne tient pas trop. Nez floral, ananas, fruits exotiques, fraise. Attaque amère, saveurs de fruits tropicaux et quelque peu de fruits rouges. Le corps est moyen, la longueur bonne et l’amertume persistante. Bonne IPA, exactement ce qu’on attend d’une american IPA !", "Ambrée claire voilée, nez houblon floral, bouche sur une amertume prononcée, notes agrume, finale sur pointe sèche persistante. Bouteille 35cl achetée chez Monoprix Montparnasse, Paris, France, bue le 04/03/2016.", "On tap at na 7.schode, Zilina. Pours is cloudy amber with big creamy white head. Aroma of pine, resin, fruity, lemon and spicy. Taste is light to moderate sweet, moderate bitter, silid malty background, resin on tongue. Medium body, slick to sticky texture, light bitter finish.", "Une bonne bière IPA qui note des goûts fruités d’agrumes. Rien d’exceptionnel, une bière comme j’en ai déjà bu, mais je me suis régalé.", "12oz bottle from Beer Cartel, Sydney. A clear Amber with a small and fading light beige head on the pour. Aromas of peach, pineapple, lychee and hop leaf. Sweet-accented to taste with distinct pine and grapefruit characters to finish. Good malt heft. Mid-weight, soft to medium carbonation and a moderate length and intensity finish.", "12 ounce bottle from the brewery in Issaquah\r\nAppearance: light amber, hazy and cloudy medium head, lacing\r\nAroma: Hoppy and malty-strong smell of grains\r\nTaste: very good, hoppy bitterness and very good follow through\r\nPalate: Medium-full body, very nice, sticky creamy, fizzy, strong bitter finish follow through\r\nOverall: very good beer, good to repeat\r\nDrank: March 17, 2016\r\nHappy St Patrick’s Day", "Hazy orange color, minimal white head. Earthy aroma, fruit, hops and mango, same taste. Soft carbonation, medium body. Long bitter finish. Nice. //bottle, as Rogue Brutal IPA, bought at Graz craft beer festival", "Pours a hazy orange amber color with aroma of citrus and pine. Citrus flavor with caramel, biscuit, and pine. Touch of bitterness. Nice beer.", "Типичная ИПА. Есть отголоски Рога, как такового. Хорошо заходит, есть тело, есть послевкусие.", "Bottle. Golden color with medium white head. Aroma is citrusy, hoppy, floral, strong orange, zesty, caramel. Taste is strictly balanced, dominant hoppiness with caramel, floral and zesty notes, full body, medium sweet with long hoppy bitter finish. Nice one", "maltosa a sufficienza, sentori di pompelmo e decisa con l’amaro anche nel finale, ci sta", "Pours hazy orange Amber with a foamy yellow white head that fades kinda quickly to a rim, coating and lacing. Aroma is caramel malt, jammy citrus and floral hops. Taste largely follows - loaded with juicy citrus flavors. Orange, lemon, a bit of grapefruit. Some closing hoppy bitterness that blossoms with warming. Very dry on the palate. I really like this IPA - could be a go-to beer.", "Bottle at home from Beer Hawk. Mostly clear orange / amber coloured pour with a lasting loose off white head. Aroma is chewy, caramel malts, orange rind, some biscuit, hints of pine. Flavour is compose of semi-sweet, caramel biscuity grains, orange, tangy, hints of earth and maybe a little pine. Palate is medium bodies, semi sweet, highish carbonation, little chewy. DeScription says \"A non traditional ipa\" But this is now tasting decided old school.", "A beautifully balanced IPA. I was expecting something very challenging based on the name and on the brewery’s well-deserved reputation for pushing the envelope. There’s a great mix of lemon, grapefruit, lime, sherbet, musk and cherry. The grapefruit and cherry are prominent on tasting, as well as toast. A really enjoyable experience.", "Na, so brutal ist das Piwo auch nicht. Dafür recht blumig, frisch und hopfig. Daneben leicht in der Frucht und moderater Bitterkeit. Nicht schlecht.", "The beer has got a hazy golden-amber colour with a smooth body and steady head. Aroma of hops and biscuits. Taste of hops, pine, spruce, herbs, flowers, blossoms, spices and biscuits. Hoppy-mild bitter finish. Enjoyed it.", "Slightly hazy brilliant golden with a thin foamy white head. Aroma has some lemon and orange rind on the nose with a bit of a piney bitterness. Nice mellow flavor with a strong pale malt body, kinda overrides the hoppiness, with a lot of grassy and light earthy lemony hoppiness. Mostly earthy biscuity malty.", "Aroma has hint of bread and citrus. Slightly bitter hoppy taste with long finish. Beer is very cloudy and has nice golden color. Minimal head. Overall I liked this IPA a lot.", "Pours hazy amber with thin white head. Aroma of tropical fruits, citrus, caramel. Taste is sweet, malty, with light bitterness. Medium body, soft carbonation.", "Pours hazy orange-brown, with medium head with some yeast on top. Aroma is hoppy, slight citrus notes and very fresh. Taste is very full, medium carbonation with a slight sweet feel, leading to an excellent bitter finish. A very well balanced IPA, which is not too brutal in dryness.", "On tap. Orange with off white head. Aroma of malt, caramel, grapefruit, orange. Sweet caramel flavour with long bitterness", "Fruity citrus on the nose, some pine. Nice deeper orange color, with a huge off-white head. RIch sweetness up front. Huge malt backbone. Caramel, bread up front. Bitteness creeps in slowly. Not too strong....expected a bit more bite. Pine, some pepper. Balances sweetness nicely. Medium, rich mouth feel. Nice finish, bitterness echoing down the hatch. Solid IPA.", "Alaranjada turva, espuma amarelada de boa formação e persistência. No aroma notas bastante cítricas, laranja, limão, pessego, muito bem equilibrada a ponto do malte ser perceptível. \nPaladar novamente cítrico, de leve dulçor e médio amargor. Corpo médio, baixa carbonatação. Aftertaste mantém as impressões do aroma, notadamente cítrica, bem balanceada. Muito bem feita apesar de estar próxima da validade e ter perdido parte do frescor.", "Citrus rind aroma, hops are clean, not earthy or muddled at all. More lemon in the scent than anything else with some peach added in as well. Light orange color with a long lasting pure white head of foam. Taste has a citrus rind punch right away, again it is a lemon/peach combo, very unique. Not much sweetness in the background, but it also does not come off bitter. Very drinkable and refreshing. So-so palate, but it matches the light nature of this beer. I don’t know why this is called Brutal; iti s not overly hoppy at all. Good IPA, I have had better, but this is easy to drink.", "Bottle@Home.\r\nAppearance: clear orange with off-white head.\r\nAroma: c-hops, medium malt.\r\nTaste: citrus, medium sour bitter.\r\nPalate: smooth, medium body, low carbonation.\r\nOverall: very nice.", "Mesmo não sendo muito fã das IPA, essa é muito boa mesmo. Amarga e cítrica na medida certa", "Bottle. Hazy caramel with foamy dissipating head. Batting zero tonight. This one smells kind of off too. Sweet and peachy. Not getting amy good hops. Just tastes old. Boo grocers and bottle shops.", "A nice and smooth drinkable IPA, but the hoppy tones were too weak and in my opinion not outspoken enough to make it a truly great one.", "At Maakun’s. Bottle from Gall & Gall. Fruity orange sweet sugar orange tea with lots of sugar. White raisins. Dried dusty apricot. Sugary sweet with over moderate bitter. Body is medium to full, carbo is low, texture is oily, grainy. Finishes quite nice and round. Pretty nice, could be fresher I guess.", "Bottle shared thanks to sjogro. Slight hazy amber with off white head. Caramel, lychee, dried apricot, some peach, cardboard, light herbs and some curry, light grains. Almost medium sweet and bitter. Medium bodied with a bit slick feel. Seems a bit old.", "Apricot aroma. Good! orangish color. Well balanced, no brutal aftertaste. Hoping for a bigger mouth feel but didn’t get it.", "Ambar, no mucha espuma que dura poco. Potente aroma resinoso lupulado, citrico, fruta tropical. En boca es menos brutal de lo que anuncia el aroma y el nombre. Base dulce azucarada, y frutal mas que brutal, algo de pomelo amargo, pero bastante más melocotón. Equilibrada, muy sabrosa. Final bastante amarga al final.", "citrus, resin, with light color. bitter aftertaste. Big bottle great for sharing.", "Hazy gold with a thin-medium white head. Aroma of fruit, citrus hops, sweet malt. Sweet with a light bitter finish. Thin oily texture, low-medium carbonation.", "A marmalade and tropic fruit full of aroma, a supremely well balanced ipa, that manages tropical sweetness and hop bitterness.", "A non-traditional India Pale Ale with big citrusy, hop flavor and intense hop aroma. Medium-bodied with a vibrant lingering hop-bitterness that is anything but brutal. Enjoy!", "Amber with a medium white head. Aroma is oranges, pineapple, grapefruit, caramel, bread. Same in taste. Bitter aftertaste.", "Fantastic IPA. Pours a deep dark translucent orange with an off-white head that dissolves into a ring. Somewhat reserved, fresh hoppy aromas. The taste begins grapefruit-hoppy and moves into sweeter, marmalade-like notes. Solid body with a fine carbonation and a modest hoppy aftertaste. Wonderfully drinkable.", "Aroma cítrico, ótimo primeiro taste com retrogosto persistente. Ótima IPA. Bem equilibrada", "Nez: Agrumes, fruits tropicaux\r\nBouche: Caramel, pamplemousse, ananas, pin, amertume douce qui reste longuement en bouche avec une sécheresse \r\nUne très bonne bière bien fruitée mais légèrement aqueuse sur la fin", "Lys orangebrun klar med lavt hvitt skum. Fruktig lukt, røde bær og fersken. Lett søtlig smak, fruktig, medium bitterhet. Godt balansert.", "Muddy brown color with foam layer. The smell is heavy and sweetish hoppy. The taste is well carbonated, and sweetish hoppy with a thick calm mouth feeling and aftertaste.", "6-pack of bottles from Molly’s Spirits. Orange to amber in appearance. Aroma of grapefruit, zesty hops, toasted grains and yeast. Medium hop bitterness with a light malt sweetness. Medium body with a yeasty finish. A little rough and kind of hard to drink overall.", "Alla spina. IPA bionda, frizzante, erbacea e amarognola. Le note \"esotiche\" e fruttate sono più deboli di altre cugine americane ed emergono al loro posto più robusti sentori di cereali, fiori, malto e luppoli dal profilo \"europeo\". Particolare e robusta.", "650ml bottle into shaker. As ’Portland State IPA’. Smoky malt nose, hoppy background. Translucent orange colour appearance with creamy white head with good lacing. Steady and fine carbonation. Slight zing, oily texture. Gorgeous hops complemented by creamy malt background. Finish is short and subtly fruity. Really easy drinking for 6.3%! Nice.", "Smells delicious of tropical fruit papaya mango pineapple with a nice citrus hop finish. Taste starts off real multi followed up by a nice hobby tropical fruit finish does not linger on the tongue Crisp quick clean finish love this beer by rogue keep making the great bruise you do can’t wait to try more.", "It is a nice troubled copper I.P.A There is of course the side bitter. The hop is here, there is a side sweet, a perfect wedding between the cereal and the hop and dry. Drinking this beer in a train from Geneva to Delemont. I drank again this beer today at home. The thing that I could say is that the final note is watery but it is enjoyable, the carbonation is rather low for a IPA. It is easy to drink, thin and white foam.", "Not bad at all. Mild IPA with moderate hops bite upfront giving away to smooth palate. Poured from a bomber to a glass. Good all day IPA", "Drank with Rik 21-11 in Malden while playing Machiavelli. Fine beer, a bit peculiar hop taste. Not very exquisite but okay.", "Pours a hazy gold/light orange with virtually no lace and moderate carbonation. Aroma of citrus hops and malt. Taste is malty, citrusy, and not as bitter as expected.", "Pours a cloudy golden brown on tap with thin wispy white head that leaves light lace. Aroma is nice citrus hops, but kind of muted, taste follows, a bit oxidized. Think this keg may be old, but I can tell it’s former glory.", "Received from beerhawk and very happy with this IPA. Hoppy but not too much, and quite refreshing.", "12 oz brown bottle into a snifter glass. It poured a hazy orange amber colour with beige foam, short-lived but with lasting lace. Great hoppy aromas and flavours of sweet citrus, melon, pineapple, dank resin. Struck me as a blend of Columbus and Crystal, with some Southern Hemisphere tropical notes mixed-in. Intense, but not harsh. Definite bitterness, but not overwhelming. It seems I love these Rogue Alluvial hops. Hefty caramel maltbill underneath, but not so complex as to compete with this hops-forward balance. Light-medium body, moderate carbonation, lingering hoppy aftertastes. Extremely tasty.", "Pours copper with a huge foamy head. Actually the aroma is something new for me, it smells like a combination of orange juice and pineapple juice, very nice indeed. A bit thin, some fruity pineapple notes and a slight bitter finish but too watery. Certainly not brutal.", "Bottle @ the enck.... small medium white head... opage orange amber colour.... smell yeast grassy malts... taste yeast grains malts... good carbo soft body...", "Copper colour with a thin white head. Modarate intensive aroma, intensive hoppy flavour with notes of pine! Long bitter aftertaste. @craftbeerstore", "Where: Old Line Fine Wine Spirits & Bistro. \r\nHow: 12 ounce bottle, poured into IPA glass. \r\nAppearance: Cloudy golden orange with a good one inch head. \r\nAroma: Hops galore and good. \r\nTaste: Wonderful hops through and through. \r\nPalate: Thin and slight carbonization. \r\nOverall: Pretty good no complaints at all.", "Botyle tallboys beer market Leeds. Orange ok head. Aroma is sweet citrus caramel taste same good malty backbone nice sweetness good hoppy bitter finish good balance of flavours. Nice mouthfeel prickly carbonation. Good stuff.", "Geweldig aroma, licht fruit.. citrus.. nog redelijk subtiel allemaal.. fantastische smaak ook, uitgebalanceerd bitterzoet met een dikke dikke fruitige afdronk", "Pours a hazy orange-gold with a low head. Some lacing. The aroma is fruity and piney hop notes, a little flowery. Not as lush or fresh feeling as others in the style. Tastes good though, a strong citrus front, backed by decent malt and pine. Has a pretty gentle mouthfeel and a mild bitter finish. Begs you to take another sip. Solid.", "Tropical fruit and pine on the nose, along with an aroma of sweet malts. Tastes flowery and piney, with grapefruit and more tropical fruit. A nice, if unspectacular, West Coast IPA. Considering the use of English malts, it is a rather good hybrid IPA.", "Copper/orange with a one-finger off white head and modest lace. Aromas of floral hops and light fruits - mango, pear, peach. Flavor follows, with floral hops most prominent. Light body, moderate carbonation, sticky mouthfeel and a slight bitterness in the finish. Doesn’t live up to its name.", "From draft. Poured a slight hazy dark golden to more orange colour with a slight white head on top. Nose has tropical fruits, grains, crisp malts, mango, and stone fruits. Slight long lasting bitterness with a small taste of caramel. Medium bodied mouthfeel", "12 oz bottle from Total Wine and More The ale poured a cloudy light amber with a smallish head and no head. The nose detected citrus and pine. This is a nice IPA with a soft palate yet a complex blend of various hops. The medium body ale has average to soft carbonation. This is an ale that finished dry and smooth with a tinge of bitter citrus..", "From 0,355l bottle, BBD: 05/2016 Pours deep cloudy orange amber liquid, small stable frothy head, Aroma: grapefruit, pine, citrus, litchi, honey, flowers, Taste: medium, sweet, medium to heavy bitter, light to medium sour, fruity, grapefruit, citrus, pine, sweets, litchi, orange, tangerine, Palate: medium body, velvet creamy texture, soft carbonation, long citrus bitter aftertaste, Overall: extremely drinkable, and tasteful IPA, enjoyed. One of the best I ever tasted.", "Bottled 355ml. -from Pivoljub Ljubljana. Cloudy pale golden coloured, small off-white head, touch of honey and caramel in the nose. Sweet malty, caramel, hops, notes of honey and fruits with mild dry nutty finish. Pretty ordinary.", "Poured a translucent murky brown with a few millimetres of white foam that quickly diminished to a collar that laced OK. Carbonation low and medium sized. Aroma subtly of citrus plus sweet malt. Taste slightly malty with a nice moderate bitterness. Light body. Soft, light, with a lingering nice moderate bitterness on the finish. Not really \"brutal\".", "Hazy orange color with medium white head. Lots of floral and herbal hops, also citrus and a malty backbone. Taste follows the aroma, floral and grassy, with citrus fruits and caramel. Medium bitter aftertaste.", "Jolie couleur cuivrée avec une mousse blanche fine et assez tenace \nHoney on va sentir des arômes d’agrumes de poivre d’épices\nUn bouche on va commencer par sentir un début d’amertume qui devient au final très doux et passe tout seul en bouche on va toujours sentir ses notes épicées et quelques notes de confiture d’écorce d’orange amère \nBière assez sympa", "Loved this IPA, perhaps my favorite one of the Rogue Nation. Very nice fresh citrus like fruits in it’s challenging hoppy aroma.", "schenkt amber met gelige kraag. aroma van mouten, zoet, citrus, gras, floraal en mooi hoppig. Smaken zijn redelijk zoet, redelijk hopbitter, sterk, goed moutig karakter van ambermout, gras, lichte den, bloemenhoning, floraal, gist, medium body, glad van textuur, lage co2, bittere afdronk.", "Bottle at home, orange beer, small head, aroma is hoppy, malt, taste is the same, nice... easy drinkable beer", "Orange colour, with a head that fades leaveng a ring and some lace. Smell of tropical fruits, pepper, pine. Medium body, great carbonation. Taste of resin, tropical fruits, caramel, pepper, there’s some sweetness there too. Good.", "Hazy orange amber color with small lasting head. Aroma is citrus, malt, caramel. Flavor is malt, fruity, bitter, caramel. Well balanced IPA.", "355 ml bottle. Pours a hazy orange-tan with a thin but lasting white head. Aromas of pine, biscuits, caramel and grapefruit. Taste starts off with some malty sweetness before a firm pine resin and citrus bitterness washes through. Some lemon, pepper, mint and caramel at the end. Enjoyed this one.", "Горечь во вкусе не слишком заметна, она более выражена в послевкусии. Довольно мягкий солодово- хмелевой вкус", "Bottle. Clear orange color with white head. Aroma - Tropical fruit, caramel, pine. Taste - Bitter, fruity, candy, hoppy.", "Dense, irregular yellowish cream head over well-carbonated, fully hazy orange beer: shards of lace; Sweet, cake & rosewater, orangepeel. One can guess the hospe, but this is not a hoppy nose. Let alone brutal... Oranges, orangepeel, dry hops (especially retronasal). Bit grassy, too. Nice, suggested sweetness from the nose is held quite in check. Medium bodied, quite slick, well-carbonated. Nose misleads - the rest is more than decent.", "35,5 cl. bottle @ home, bought @ Gall&Gall, Tiel.\r\nHazy golden/amber with a white head. Tropical fruit aroma with some pine and some malts. Good bitterness. Solid IPA.", "A bit on the dryer side. Lots of piney hops. Medium bodied beer, very good. Try it if you are standing and the beer store getting nervous about what you should try. Just try it, you won’t be disappointed.", "Bottle at le melting pote in Nantes. Golden color with a small white head. Fruity aroma with a touch of caramel. Bitter ending. Medium to full body. Very nice", "Bottiglia @ Milano Beer Week. L’intensità olfattiva è normale e la persistenza olfattiva discreta. Il cappello di schiuma a bollicine fini produce un bel pizzo sul vetro. Anche la frizzantezza è a bollicine fini, con carbonazione insistita. La consistenza del liquido è opalescente, dal colore ambrato. L’amaro è moderato. Il corpo è rotondo. L’intensità gustativa è elevata e la persistenza gustativa è buona. Il gusto è godereccio. Le sensazioni boccali finali sono di amaro. Il finale è felpato e amarognolo. Il retrogusto è intenso.", "Pelo aroma já se percebe que é uma ótima cerveja. O nome brutal passa a impressão de que é uma cerveja forte, mas não é. Muito equilibrada. O amargor domina com uma dose de malte fazendo um fundo. Uma das melhored IPA que já provei.", "Draught at Delirium Hoppy Loft. Very thickly lacing, towering, frothy and dense, egg-white head, cloudy amberish orange blonde robe. Strong bouquet of orange peel, caramel candy, kiwi, pineapple, pink grapefruit, wet paper, toasted pine nuts, chicken broth, bitter honey - complex, perfumey and sweet, a bit unusual for the style. Soft tropical fruitiness in the onset, peach, kiwi, strawberry sweetness, orange, medium carbo with a smooth, slick caramelly maltiness, aromatically hoppy finish, spicy, blood orange ’citrusness’, bit peppery but in all soft and much more aromatic than deeply bittering, letting a lot of juicy maltiness pass. Soft, rounded, ’tropical’ IPA, very interesting.", "20-09-2015, Scheveningen.\n\nWat een lekker IPA! Zeker een aanrader. Mooie oranje kleur met een zoete geur. Perfect qua smaak en bitterheid. Prikkelt lekker op de tong!", "Bomber from Old Line. Nice copper body with big head. Nose is hoppy, with cactus and pine. Taste is hops aplenty, bitter, floral with oranges in there. Really nice. Well done.", "From the tap, the pour is auburn with a medium thin white head that lingers, the aroma is citrus, hops, but not overpowering, the taste is initially bitter, then hops and vanilla with a citrus finish, the second drink brings in malts, and the finish is hops and a little bitter. The mouthfeel is medium.", "Amber with medium white head. Dry, partly citrusy, sourness mixed with moderate bitterness.", "Heavy aroma on this. Mid range color and very cloudy. Mildly bitter start and finish. Pretty clean overall \n\n---Rated via Beer Buddy for iPhone", "resin, spruce, golden, amber, lightly bitter, bitter, medium body, average carbonation. Almost worrisomely bitter aroma, but nicely balanced sweet and sour in taste. The slightly bitter aftertaste compels you to take another drink; very drinkable.", "Das Bier hat 6,2%. Frucht, Zimt und Karamell in der Nase. Dunkelgelbe Farbe. Schaum zerfällt schnell. Malziger Antrunk. Dann kommt der Hopfen. Runder Geschmack. Bitterer Abgang.", "Grapefruit in der Nase, auch im Geschmack dominierend, schöne kräftige bitternote", "Bue en bouteille de 355ml chez le ki.\nCouleur blonde mousse et effervescence moyenne.\nNez agrumes.\nBouche agrume mandarine. Fin de bouche pamplemousse. Continuité sucrée", "A shimmering gold colour with a pale yellow head. The aroma is sharp and citrusy, giving you the expectation of a similar taste and it doesn’t disappoint. It is smooth on the tongue, sharp and slightly bitter, but citrusy and fresh, leaving a refreshing, clean feel.", "Pours haze golden amber, with unstable white creamy head.\r\nAroma: alcogol is not noticable. Crystal hop give gorgeous aroma of tropical fruits (papaya, lychee, mango).\r\nFlavor: taste is mouth feel, sweet, slightly bready, toast (reason is problably of cara wheat).\r\nBody is soft, malt sweetness medium, hop bitterness also. Finish is dry, carbonation is low.", "Dark copper beer, opaque with a nice bubbly head.\r\nSmell is bitter citrus and pine, resin. Touch of orange peel. Cheese and cherries. Apple, caramel.\r\nTaste is bitter with a hint of heavy sweetness. Warm orange with... egg? Nice full taste with a refreshing finish, subtle sourness.", "Wow, i got the different hops, turns out it was a hybrid hops! Nice one this, hoppy but overwhelmed by the smoothness very fast. Very nice.", "Taster at AEON Liquor. Mostly rich orange and caramel, herbal notes, a bit boozy, bitter finish. Fairly hoppy and drinkable, decent stuff.", "Bottle at The Roebuck, Leek (Titanic) A hazy pale amber with a fizzy white head. Aroma is quiet sweet of wheat, caramel, some straw, orange marmalade, grapefruit, maybe honey and floral hops. Taste of orange marmalade, grapefruit, caramel, some wheat, a little honey, pine and slight floral hops. Medium bodied and moderate carbonation. A bittersweet, caramelly, citrus hop bitterness in the finish. It’s not brutal but it’s pleasant and really well balanced. Isn’t different but a good IPA", "Bottle from Omihachiman Aeon. Really cloudy gold-copper, small head. Orange and caramel aroma. Tastes initially sweet from the caramel malt but the orangey hops give it a great bitter finish.", "Piney, citrus taste. Almost oily texture. A hint of bitterness. Pretty average.", "On tap at Beer Revolution. Pours a hazy amber colour with a tiny off white cap. Aroma is slightly grapefruity with a touch of B.O. Taste is slightly grapefruity with a bitterness at the end that reminds me of bile. I’ve had better IPA’s.", "Decent ipa, but nonetheless annother \"just alright \" beer from rogue. Bitter, piney and somewhat grape fruity. \r\n\r\n\r\nRe-rate: Don’t know what i was thinking about - great IPA. Amazing prickly aroma - tons of peach, sweet tea and tangerine.", "On-tap, this pours a hazy copper color with a slight head. The aroma is full of bitter hops. The taste is bitter, well-balanced with lots of great hops flavor.", "Bottle from Mitsuya’s. Pours a clear orange-amber with a modest off-white head. Big orange marmalade aromas with some grapefruit and pine notes as well. Taste is more of the same with the orange really standing out. Good caramel sweetness present as well. Awesomely balanced but pretty straight forward IPA. Nice medium to light bitter finish.", "12oz bottle. Pours a orange amber with a medium white head with some lacing. Aroma is of citrus pine hops notes caramel malt and yeast. Taste has citrus and pine hops bitterness, some mild orange notes, caramel malt and yeast, which intensifies as the beer warms up. Palate is a medium body with good carbonation. Finish is sweet caramel malt, yeast with a good amount of citrus hops bitterness, a mildly dry ending. Not too brutal as the name implies. Overall a very good, solid and tasty brew.", "Bue en bouteille de 355ml. Blinde légèrement ambrée. Nez discret sur l'agrume. Palais bien houblonné, fines bulles légères. Longueur moyenne. Pas mal.", "0.65 l bottle from P&M Getränke (6.2% abv). Hazy, reddish amber with a thin, soapy, slowly diminishing, white head. Fruity-resiny aroma of orange, honey, tangerine, pine and hints of grapefruit. Sweetish, fruity-resiny taste of orange, honey, tangerine, pine and hints of grapefruit. Short, slightly bitter finish. Medium body, slightly oily mouthfeel, average carbonation. Not as brutal as expected, rather mild for an IPA. Still quite good but too malt-accented in my opinion.", "355ml. Bottle. \n\r\nPours clear orange with white head. \n\r\nAroma citrus, pine, tropical fruits, caramel. \n\r\nTaste caramel fruity sweets, fresh piney bitter. \n\r\nMouthfeel thin, dry. \n\r\nGood IPA.", "Perfect amber pour w/ a retaining tan head that leaves a great ring of lacing. The aroma is a mild blend of hop & malt. The taste has some underlying bitterness but is nicely balanced w/ malt which makes this quite drinkable! The soft mouthfeel is rather unusual for the style but makes this one unique & overall an excellent ipa!", "Bottle\r\nAroma-fruits,herbs\r\nAppearance-orange, cloudy, white foam, \r\nTaste-medium bitterness, light sweetness, lightly sour, \r\nPalate-medium body, sticky, average carbonation, bitter finish\r\nOverall-very good", "Hazy amber apeatance with small white head. Aromatic woth hops, citrus notes. Balanced bitter and sweet taste with malts and ftuits. Medium carbonation and 6.2%. Good beer but nothing \" brutal\" about it.", "WYGLĄD: Barwa złota, zamglone. Piana drobna, średniej wysokości.\r\n\nAROMAT: Średnio intensywny. Mocno owocowy, cytrusy, akcenty żywiczne. W tle zboża.\r\n\nSMAK: Mocne cytrusowe walnięcie na dobry początek. Posmak cytrusowy. Goryczka wysoka, zalegająca.", "650 ml bottle. Pours a clear amber with moderate head. Aromas of caramel candy, dried fruit, and a bit of citrus and tea. Flavors of same with a dry bitter tea like finish.", "Aroma: caramel, grass, floral, citrus, \r\nAppearance: clear light amber, off-white head\r\nTaste: medium sweetness, medium bitterness, \r\nPalate: medium body, creamy feel, soft carbonation, long finish\r\n\r\ngood stuff", "Appearance was hazy orangish gold with creamy off white diminishing 1 finger head, spotty lacing. Aromas are bright tangerine, lemon, grapefruit with soft dill and toasty malt sweetness. Taste are tangerine, lemon, grapefruit upfront gives way to soft malt sweetness. The clean yeast profile lets the lemon hop finish. Palate was smooth soft CO2 with medium body, then lasting clean crispy bitter finish. Overall a solid clean IPA with some classic hops.", "Fairly solid ipa...more Malty than hoppy...smooth finish....(#548).....................", "Bottle from Appellation Wines. Pours golden amber. Nose is pine, sticky caramel and toffee. Taste sweet caramel, grass, pine, plenty of malts, apricot.", "Bottle. Aroma is floral and citrus. Color is a orange gold that poured with a large frothy white head that leaves heavy lacing. The taste is malty with medium bitterness with minimal aftertaste.", "12 fl oz. bottle. Orangey amber colour, foam white head leaving lacing and light aroma of fruity, slight mango, floral citrus, woody, hop. Taste is bready malt with mellow hop resins and woody spicy bitterness. Medium bodied, soft catbonation, dry earthy dusty bitter finish. Quite drinkable.", "Aroma of spices & herbs. Cloudy amber with long lasting white head. Medium sweet & light bitter taste. Full bodied, creamy texture & average carbonation.", "Slightly imbalanced IPA. Some hops, nowhere near as much as even the mildest Stone Ale. Not bad.", "Frothy white head. Stone fruit and grapefruit in the nose. Medium body with moderate hoppiness. Just a standard middle of the raid, but decent PNW ipa", "Bottle. Pours a bit hazy, nice amber, modest foam. Aroma is quite thick and malty, hops actually feel a bit faded. Which does not make the beer worse for me, but I guess it would taste a bit different when totally fresh. Taste is agressively bitter, malt body still dominating, giving the bee somewhat bready feeling. Aftertaste also having some long lingering bitterness. Good IPA, not too special or too amazing though.", "Large Format - Cloudy orange color, big thick head when poured. Typical IPA smell, not very distinctive at all. Good hop flavor but not over powering or dry at all, not much bitterness either. Just a decent middle of the road, non-offensive IPA.", "Hazy orange, with large cream head. Aroma is strong citrus and fruits. Taste is straight bitter, very hoppy, grapefruit, mango, peach. Very smooth, medium bodied and well balanced. A classic, good, IPA.", "Soft amber pour, no real head. Nose is woody hops and malt. Bitter. Middle is soft fruit and malt interplay...subtle. Finish is solid, but restrained, hop bitterness. Not brutal, just delicious.", "Bottle from Drinkmonger. Hazy amber body with a thin off-white head. Lively carbonation. Light lacing. Aroma of caramel, green apple and orange. Flavour of sweet tangerine, menthol and pine needles. Medium body with an oily texture. Soft fizz. Unlike the name suggests, this is quite a restrained IPA that’s high on drinkability.", "330ml bottle, pours hazy bronze gold, with a foamy lasting white head. Aroma is malty, caramel and toffee, lightly hoppy, fruity and floral notes. Body is medium, texture is lightly oily, finish is long, bitter and dry.", "Great reddish orange hue and dirty IPA and nice and balanced. Very nice beer indeed.", "660ml bottle & keg @ Chez Sophie, Shrewsbury. Pours a deep amber with large white head. Sweet malt aroma. Taste follows with a sticky resin presence and pine. Some orange rind and caramel. Flavoursome and easy-drinking.", "65cl bottle at cerveteca bar in Lisbon. It pours a bronze colour with a decent beige head that lasts. Aroma is green mango, hops, citrus and some bready notes. Flavour is slightly piney and citruisy, some malts and bread and an expected hoppy bitterness at the end. It has a low to medium body with light carbonation and a crispy feel. It’s a standard IPA, but I expected more flavour and richer aromas.", "Solid India Pale Ale. A little malty. Hops a good blend of bitter and floral. Looks great too.", "Tap. Pours a hazy golden with a layer of creamy head. Aroma and taste of pretty intense hops upfront mixed with some bread malts.", "Rogue Brutal IPA has a thin, white head, narrow lacing, and a murky, orange appearance, with lots of tan, powdery sediment suspended throughout. The aroma is fruity (mango?), with a white bread note. Taste is the same, with mild bitterness and slightly-turned fruit. Mouthfeel is light to medium, and this beer finishes somewhat like a lager in its crispness. A tart ale. RJT", "A cloudy orange amber color.\nThe aroma is minimal but fruity.\nThe taste is, well... Meh.\nOverall a beer I wouldn't buy again. \n\n---Rated via Beer Buddy for iPhone", "BOMBER from Bov. Barely detectable hops in th aroma, quince gem, caramel, some sugar even, and of scourse caramel malt. Some unfresh notes too. tastes fruity and caramelish, moderte but harsh hops bitterness. Somewhat sticky.", "Oranje geel bier met witte schuimkraag. Lekkere bittere IPA, niet heel uitgesproken van smaak, maar wel subtiel. Hoppig, bitter, grassig, de nasmaak blijft lekker lang hangen, bitter en grassig.", "Rogue is a great brewery and this is a fantastic beer. It is medium in color and has a nice overall palate.", "I love Rogue brewery and many of their beers. This is just ok. Nothing to really dislike, but nothing that will blow you away either. \n\n---Rated via Beer Buddy for iPhone", "This beer was very mellow for an IPA it poured light and had a very light head. The beer lacked on that final IPA hoppy notes and didn't carry well through the pallet.\n\n---Rated via Beer Buddy for iPhone", "Poured from bottle gold with a off white head. Aromas of pine and sweet citrus. Taste is crisp with overtones of citrus caramel and a nice hop finish.", "Pours a cloudy pumpkin/bronze with an off white head and good lacing. Cardboard, fruit, floral, citrus aroma. Malty, bready, caramel, hard candy sweetness, bitter finish, citrus, fresh flower. Pretty tasty. Would like to try it fresh.", "Pours a crystal clear gold with a mild white head. Moderate level of hop aroma which is vagely citrusy and floral with notes of pine. The malt charicter on the tongue is bready. The mid palate brings the hops with more pine and citrus. The finish is of sugar syrup and pine with a lingering bitterness and slightly astringent mouthfeel. This is an easy drinking, every day IPA.", "Très belle petite IPA que la Brutal! Celle-ci est bien moins brutale que son nom peut laisser croire. Est-ce un défaut? À mon sens, pas du tout! Cette bière, sans être complexe ni de classe mondiale a tout d’une petite bière agréable et sans prétention que l’on peut facilement boire tous les jours et en toutes circonstances. Le nez est floral, frais et un peu fruité. Ça sent le printemps mais sans être herbacé. Je trouve qu’elle sent presque les vêtements qu’on laisse sécher sur la corde à linge. La mousse semble généreuse mais celle-ci est éphémère, laissant les parois du verre presque sèches et sans dentelles. Dommage. En bouche, le houblon est présent. Mentionnons toutefois qu’il ne s’agit pas de l’explosion classique de houblons américains à laquelle nous sommes habitués mais de jolis houblons qui sans redéfinir le style, nous ramènent aux bases d’une IPA franche et bien faite. De longueur et de corps moyens, sans arrière-goût particulier, cette bière se boit très aisément sur la terrasse!", "Ambrée claire orangée, bonne mousse blanc cassé assez persistante.\r\nAu nez houblonnage agrumes orange. Maltage assez présent.\r\nEn bouche caramel puis amertume avec l’houblonnage agrumes orange. Assez fruitée en fin avec belle longueur d’amertume. En finalité IPA très balancée.", "Uit grote fles. Ruikt hoppig en citrus. Smaakt beetje zoetig voor een IPA, wel lekker maar iets te weinig bitter.", "Crisp and malty, thoroughly enjoyable brew. Gives a nice fruit flavour and the hop bits through. It was nowhere near as \"brutal\" as I was expecting, so from that point, I was a bit disappointed, but it was delicious.", "35.5cl bottle at Beer is Food, Singapore on 04/04/15. Cloudy orange colour, medium carbonation with a nice white head. Sweet aroma if citrus and pine. Oily mouth feel, bittersweet, citrus first followed by pine / hops. Not the best IPA I have had.", "Look: pours a light gold. Slight haze. Bright white head. \nSmell: grapefruit. Orange. \nTaste: grapefruit. Lemon. Orange. \nFeel: extremely dry. Heavy bitterness. Thin mouth feel. Leaves a thick film on the mouth.\nOverall: ok beer. Have to like bitter. \nFirst drank: home 3/31/15\nVintage:", "Murky orange pour with the healthy white head. Piney aroma. Front end taste has lots of resin and citrus flavors, with a bitter aftertaste. I would buy this until the end of time.", "hazy. Light grainy malty, bit autumny leafy pine woodsly nose. Sour oranges, real bitter, almost astringent finish. Lots of flavour. Not that smooth though. Dark caramel, bitter herby. Had better, drinkable still.", "355ml bottle at Beer Station, Xiamen. Pours hazy golden orange with a thin white head. Citrus fruit aroma with pine. Sweet finish. Very nice.", "Couleur ambrée, bonne mousse blanche. Nez fruité, agrumes douces et malt. Gout houblonné, fruité/agrumes en marmelade, malté, note caramel avec bonne amertume zeste d’agrumes en fin de bouche. Bon corps. M’attendais a plus sur l’amer et le houblon. Pas mal", "Pours orange with white lacing. Big hops aroma with citrus. The hops are so well crafted, belies the name. Nice finish", "Draught @ NYC Craft Ber Festival. Cloudy pale yellow with small off-white foamy head, doughy aroma, citrus peel taste, low carbonation, long hoppy finish. Not a great IPA.", "660 ml bottle\n\r\nMurky orange beer with little off-white head. Aroma and flavor have cream fudge, caramel, resin, peach and some catpee. Does not seem very fresh. Palate is full with moderate carbonation. Finish has quite heavy bitterness. Aftertaste is caramelly and fruity with stinging catpee like bitter taste. I’m sure this would be better when it was fresh.", "Hazy orange body, medium sized white head, and soapy lacing. Papaya, grapefruit, orange rind, mild sweet perfumey malts. Medium bodied with moderate to gentle carbonation, semi-dry throughout, moderate bitterness, clean finish.", "Bottle at home after dissapointigly having to miss a To Ol event I managed to grab a few bottles to sip in consolation. Pours hazy orange with big tropical fruit nose. Tastes of pineapple, grapefruit, passionfruit, caramel, earth, pine, and banana. Sweet yet bitter. Smooth palate. Quite nice I havet had a Rogue beer in a long time but this is lovely.", "On tap. @El Cabanón, Avilés 07/03/2015. Aroma afrutado, Color cobrizo. Sabor afrutado y maltoso.", "Tap from Stone's (hop leaf anniversary). Orange cloudy pour. Aroma is super biscuity. Taste is very very bready malty - piercing orange hops though. Bitter finish. Not bad.", "Draught at Stone's. Very cloudy (almost opaque) bright orange-brown. Smells of woodsy hop and caramel malt, toffee, bread. Tastes of earthy piney woodsiness, orange, caramel malt. Very malt forward but goos mix of maltiness and hoppiness, very orange-y, fresh tasting.", "Quite a nice IPA. Hoppier and more bitter than the 46 ibu would suggest. Aromatic piney some sweet citrus. Nice IPA. Impressed.", "Pours an opaque golden orange with a nice meringue like head. Aroma is of peaches oranges and apricots very nice. Flavor is bitter ripe Orange with an amaretto like touch a nice gentle bitter aftertaste. Médium palate full of flavor yet easy to drink", "Cloudy amber with a decent head. The aroma has pine, grass, citrus as expected. Taste is initially honey, tangerine, grapefruit, then the grassy and pine hop bitterness kicks in. Medium bodied and fairly smooth. Very solid IPA.", "Not as Brutal as the name implies. I get sweet malt on the nose, barely any hops. The taste is sweet and malty like Dead Guy, but not as flavorful. Hops are minimal in my opinion. Very good but not great.", "Hazy, amber beer with an almoust one finger high head. \r\n\r\nNose: Apricot, dried fruit, mandarine, pine, citrus and floral hops. \r\nTaste: Orange marmelade, citrus, pineapple, peach, grass, caramel malt and honey. \r\nBody: Medium body with crisp carbonation. A light bitterness at the end that stays on the tounge. \r\n\r\nThis is a great IPA!", "Aromat ogromnej ilości różowych grejpfrutów, landrynek, mango. Barwa bursztynowa, klarowne. Piana ładna, drobna, długa. W smaku zielone grejpfruty, cukierki ślazowe, pełne, ale i orzeźwiające. Dobra grejpfrutowa goryczka.", "IPA di Rogue offre forti note agrumate ed erbacee all’olfatto mentre al palato, dopo un inizio fruttato, emergono i toni di scorza di limone e arancia. Nonostante il termine \"Brutal\", questa IPA non è particolarmente aggressiva grazie al bilanciamento tra l’intenso luppolo e la mordibezza e pienezza del corpo.", "Bottle a cloudy dark golden yellow colored beer with a white head aroma malts spicy citrus fruits some yeast and hops flavor malts spicy citrus fruits yeast and a bitter hoppy aftertaste", "22 ounce bottle poured into a brandy snifter. The beer is a hazed copper color with a big white head of foam. Good retention. The aroma is pine, citrus zest, some lime juice. The taste has moderate bitterness, some citrusy sweetness, and a dry floral finish. Just a little peppery. Medium body and low to medium carbonation. Slick mouthfeel.", "650 ml bottle from the LCBO.\r\n\n\nAppearance: Pours a\r\nhazy light copper with a finger of white head. Average retention and a fair bit of lacing.\r\n\n\nAroma:\r\nApricots galore, plums, dried fruit, raisins.\r\n\n\nFlavours:\r\nOrange peel, mango, marmalade. \r\n\n\nMouthfeel:\r\nThin with moderate carbonation. \r\n\n\nOverall: Wow, the aromas on this are ones you could just sniff by the hour. Strong apricot with dried fruit. The flavours aren’t quite as spectacular but this is still a very good IPA overall.", "Subtle aroma. Slightly hazy appearance. Taste grapefruit and delightful strength. Again subtle strength and hit on the palate. One that could slip up on you very easily. Good.", "The aroma is soft & subtle. Scents of fruit salad & fresh greens. The beer is golden & opaque, not cloudy but opaque. The flavour starts with a resounding taste of grapefruit. The bitterness & sourness of the grapefruit is balanced with a nice sweetness and herbal finish. The mouthful is silky.", "Medium aroma with apricot, some citrus and hops. Golden orange color with lightly hazy liquid. Small white head. Strong but smooth taste with natural apricot, honey and hops. Medium aftertaste. Medium body with average/soft carbonation. Overall very soft and tasty IPA with some own character.", "labelled Portland state IPA. Pours golden with a big pillowy head. Citrus (lemon/orange) aromas, tart, sharply bitter and finishes quite dry.", "Pours a hazy amber/orange with a creamy head. Nice mango and citrus aromas. Aromas continue in the taste. Very juicy mouth feel, yum. Slightly bitter finish. Good IPA.", "2014 bottle. Pours a bright orange copper with an off-white head. Aroma is biscuit and grapefruit with a slight brininess. Taste is the same with more of a sweet malt flavor with a little caramel and an earthy pine bitterness that's floral at the end. A little aspirin like. A nice medium mouthfeel that is more tannic than dry.\n\n---Rated via Beer Buddy for iPhone", "Half-pint on tap in Chez Sophie, Shrewsbury on 12th Jan 15 before the monthly bottle exchange. a little murky light amber/bronze in colour. Thin white head that tried to last. The nose was semi-sweet, biscuity malts, with a fruity hop undertone. The taste was hops to the fore with the maltiness in the aroma now taking second place in the flavouring. Nothing brutal about it: nice blend and a fine beer. Good bittering finish.", "Deep hazy dark orange color with small head. Aroma of hops, but not too dominant, a bit citrus, a bit pine, also caramel. Smells like Zopf or Brioche. Taste is caramel, but not sweet, hoppy bitterness is very present, but not really fruity. Decent bitter finish. Smooth carbonation. Tasty, but not too complex. A non-sweet but still rather malty interpretation of the IPA style.", "Draught keg at the Head of Steam, Durham. ABV was 6.2%. Golden body. Medium white head. Tangerine, vegetables, dust, spice, hops, peach. Bittersweet. Dry finish.", "On tap at SOT Bar & Burger, Trodheim. Pours hazy deep golden with a small creamy white head. Aroma is fruity malts, grapefruit and piney hops. Taste is light sweet malty, dried apricot and resiny hops, with traces of herbs and liquorice at the long finish, very good one.", "Bottle. Poured cloudy, orange, with a small white head and some spotty lacing. Aroma of hops, tropical fruits, and resin combined with some caramel. Taste is hoppy, bitter with a caramel, malty background. Very nice; enjoyable and quite drinkable.", "650ml bottle at home. Pale orange with a medium white soapy head. Medium body with moderate carbonation. Well balanced sweet and bitter tones. Pine, grapefruit, citrus, spices and herbs. A nice tasteful IPA.", "Pours deep golden with thick white head. Aroma of pine and citrus. Tastes ofsame with a bit of well-hidden booze.", "Aroma: Medium-light hops, tropical fruits. Medium malt, caramel.\r\nAppearance: Hazy, golden-orange body. Small, rocky head, good retention.\r\nFlavour: Medium-light sweetness. Medium bitterness. Medium light hops, fruity. Medium malt, caramel, biscuit. Medium dry finish. \r\nMouthfeel: Medium body. Medium carbonation. \r\nOverall: Nothing brutal about this beer at all. Well balanced, enjoyable. \r\n\r\n650 ml bottle, poured. \r\n14A. English IPA", "Mahogany pour, lots of white head. Aroma is light. Wheat, hops, malt, earth. Flavor is hopped up but not too bitter and still earthy. Medium mouthfeel. Clean and refreshing for an IPA.", "650ml bottle. Hop Hideout, Sheffield. Just about clear, light bronze colour. Film of white head. Decent balance of sweet, toasty malts, and light, orangey hop, but I wouldn’t say it was brutal. Some grassiness. Slightly earthy. Taste has a light, malty sweetness, turning moderate bitter. Palate is a little oily, and quite smooth. Finishes light, long bitter. Very drinkable, but not one to get too excited about.", "Slightly hazy orange body with a beige head. Aroma is malty, hoppy, citrus, some caramel, sweet grapefruit. Taste is medium sweet with medium to light bitterness. Light to medium body, long finish. Refreshing beer.", "66cl bottle. Hazy orange colour with a very small white head. Citrus, caramel, mango, light pine and grassy notes in the aroma. Average carbonation and medium body. Taste is sweet upfront with bitterness coming after. Overall, a great beer.", "Not much hits the nose from the glass but the taste is super. Got citrus, a bit of orange, mandarin. Some caramel malt maybe dash of honey halfway through. Doesn't smash palate. 650ml, 6.2%, 3.2std drks. \n\n---Rated via Beer Buddy for iPhone", "Orange colour, white head. Aroma of hops, a bit peach, bread, citrus, herbs. Taste is light to medium bitter, slightly sweet, dry finish. Light body, slick texture, average carbonation. Good", "Bottle. Not brutal. Pours clear orange yellow with some off white head. Nose is citrus grass and caramel. Taste is some grapefruit. Fairly mild.", "750ml served in a pint glass. A: Pour an orange color forming a big and creamy light yellow head. Good retention and lots of lacings formed and left. Classic red IPA look.S: Malty and grassy, mainly, with some citric notes. Caramel and crystal malts backbone. Mango and orange. Hints of pine.T: Strong malty upfront. Strong notes of caramel and crystal malts. Notes of mango and orange. Orange zest. Hints of pine. Good bitterness, not extreme.M: Medium body and carbonation. Malty aftertaste with citrus and piny hints. O: Great drinkability. Classic IPA. Rogue quality.[BA review @ 6/25/2014]", "Cloudy orange color, average sized off white head. Some lacing. Medium to full body, soft carbonation. Aroma of pine, tropical fruits, apricot, citrus, malt. Medium sweet, medium bitter taste. Balanced, fruity, great.", "From a bottle. Pours deep cloudy amber with a big upfront hop bitterness, malty aroma and tangy citrus at the back.", "From tap at the Hoppy Pub, Thessaloniki. Hazy golden color wit white head. Malty aroma, caramel, hoppy too, grassy, fruity, light floral, pine. Sweet and light bitter taste like the aroma. Medium oily body with soft carbonation.", "Keg at Rogue, PDX airport, 12/11/14.\r\nGolden orange with a decent off white covering.\r\nNose is bitter citric rinds, orange pith, pine, juicy hops, straw.\r\nTaste comprises grapefruit, light orange pith, apricot, citric peel.\r\nMedium bodied, fine carbonation, semi drying close with a dose of hop bitterness.\r\nDecent enough IPA.", "Appearance with golden color, cloudy liquid and high head.\r\nHoppy and fruity aroma.\r\nOn the palate, it is bitter (a lot of hops) and has a nice personality!\r\nGreat IPA!", "Big bottle, served in TeKu. Pours deep orange and golden with thick head. Aroma is suprisingly malty and I dont really get why Crystal would provide massive aroma as it is described. It doesnt anyway. Of course, there are some distinct hints of pine, some citrus, but nothing especially interesting. However, it is very well balanced with malts. Id rather expected stronger hops aroma. Taste is terrific, lots of matliness combined with caramel, toasted bread, biscuits well mixed with balanced bitterness. It does however have some peculiar flavour in the finish, I dont really know what that is. It remotely tastes like anise. Anyway, its a very good beer, not in the top league of IPAs, even classic, english ones, but worth recommending and trying.", "Weak aroma of hops and citrus, cloudy amber colour, without much head. A very interesting taste of hops and fruit with undertones of apricot. Oily feel with a mildly bitter finish.", "Pours a murky burnt orange, with a thick white head that settles down rapidly.\r\nAromas of citrus hops, and caramel malts. Quite well balanced in this regard.\r\nTastes start off citrus and turn to caramel malts in the middle of the process, as it flows over the tongue, finishing with a lemon zest tingle.\r\nOverall, in a word, balanced.", "You really notice the malts in this one. Pours a hazy amber with a frothy white head. Aroma is of pine, citrus, caramel malts, basement, and biscuit. Tastes of pine, citrus, caramel, peach and biscuits. Has a medium body with average carbonation and nice amount of bitterness. A very good starter IPA to introduce people to the style without crazy bitterness.", "Una IPA estrema. Decisamente buona, con ottima schiuma, briosità giusta, al palato vengono fuori prima i malti e poi i luppoli, decisi, cattivi. Ottima persistenza ma non invadente", "caramel, citrus, leaves, orange, hazy, white foam, light sweetness, medium bitterness, bitter finish, medium body.", "Bottle from Beers of Europe. Amber colour with white head. Aroma is malty with background hops, some pineyness. Taste is unusual, malty, dark fruit, bitter, some dryness, again backgroundy hops. Medium body, moderate carbonation. Not what I was expecting. Interesting stuff.", "A fine IPA from lovely Oregon. Herbal, resin hops, biscuit and caramel malts and some earthiness waft up from this coppery quaff, ivory topped, lacing champion. Beauty! The mix of hops and malts is unlike anything I have had before, it is funny they call it Brutal (although I love the name) since it seems more on the mellow side of hop aggression. It’s very balanced but the hopping and malts are not what’d you expect from the name and style. The body is great, medium and chewy with a great aftertaste of citrus and resin hops. Lots of biscuit malt flavour in here too. Maybe the brutality comes from being sneaked up on.", "Bottle:\r\nClear, dark amber with a sudsy, off-white head.\r\nCaramel malt, wood-polish scent.\r\nTaste is earthy/nutty caramel malt....\r\nI get the brown ale feel to it, but the hopping lends to a slightly chemical note.\r\nMalty, wood and earth tones....\r\nJust didn’t enjoy this.", "Brutal Bitter: \"bigger than your average bitter, which is nice, but i’m not sure if i a) don’t like the malt combination b) don’t like the hop combo or c) got an old one. i thought i remembered this beer being better, but i was sorely disappointed last night. not thin, but bland. smelled musty. \"", "A nice beer, the goodness underneath is overwhelmed by the malty taste of the brewn. Still a very good beer!", "Not brutal at all, slightly sweet brown ale notes. Hops compliment the malts quite nicely, with some background bitterness. Easy drinker.", "Un olfactif floral et herbacé. des notes de rose et de chèvrefeuille avec un soupçon d’épices et de résine de pin. des arômes très agréables et différents des grosses IPA houblonnées à cru. \r\nLe visuel est ambré avec une mousse épaisse et dense. Très persistante. De belles traces sur le verre. \r\nLe gustatif est tout en fleurs; de la lavande, de l’eucalyptus, des fleurs sauvages. Tout en subtilité. Pas du tout la grosse amertume des IPA américaines. Les conifères sont également bien représentés par le cèdre et le pin, et leur dosage est bien balancé avec les notes florales. En bouche, l’équilibre est juste à point, et la finale, assortie d’une légère sécheresse. Une excellente IPA. Les houblons sont d’une subtilité remarquable. On s’éloigne ici de la grosse amertume ’’west coast’’ et on s’approche un peu plus des subtilités européennes.", "Poured from an enormous bottle at California Pizza Kitchen. Large frothy head well lasting. Sweet aroma, floral. Cloudy orange color. Acidic taste. Smells better than it tastes", "Tap@kampela. Darker orange, hazy. Light grainy malty, bit autumny leafy pine woodsly nose. Sour oranges, real bitter, almost astringent finish. Lots of flavour. Not that smooth though. Dark caramel (almost barley winey notes!), bitter herby. Had better, drinkable still.\n\n-- bb", "I expect a certain level once an IPA has the word \"mega\", \"uber\", \"hop\", or- I suppose- \"brutal.\" It doesn't reach that level. \n\n---Rated via Beer Buddy for iPhone", "Color cobre con espuma marfil. Aromas de maltas, frutales, mandarina. Cuerpo medio, textura maltosa, inicio dulce, malta, lupulo ligeramente picante y afrutado, final de amargor moderado y algo seco. Buena.", "Got a Portland State bottle at the airport. I am very disappointed that the annoying nerds at ratebeer are saying this is Brutal IPA. Boo! \r\n\r\nSmells like iced tea. Copper colored. Tastes like the best iced tea ever. medium body, average carbonation. Perfect finish cos it doesn’t linger too long.\r\n\r\nHere’s to PSU! This beer is much better than you!\nEarlier Rating: 10/6/2014 Total Score: 3.6\nGot a bottle at the airport. Smells like iced tea. Copper colored. Tastes like the best iced tea ever. medium body, average carbonation. Perfect finish cos it doesn’t linger too long.\r\n\r\nHere’s to PSU! This beer is much better than you!", "golden/orange, hazy, big white foam, nice lacing; intense aroma, juk,kcitrus (grapefruit, orange), floral, tropical fruits; medium(+) bitterness, medium sweetness; full body, oily thick feel, average carbonation, long bittersweet finish;\r\nOverall: great looking, nice palate, great aroma, just the taste little bit left behind", "Bottle from the Rugby Tap. Hazy dark orange, bit of carbonation there. Aroma of perfumed peach, some pine and grapefruit. Taste is a big bitter blast of grapefruit, lemon, some malt. Highly bitter finish which lives long. Quite good and enjoyable. Surprised it’s ’only’ 6%!", "Fruchtig Bitter Grapefruit Himmlisch\n---- personal review, no claim to be representative or neutral ---- repost undesired ---\n\n---Rated via Beer Buddy for iPhone", "Bottle at home. Pours a golden yellow with a medium white head. Aroma is some orange peel and grapefruit with a nice malt background. Flavor follows. Very smooth. Really nice beer. \n\n---Rated via Beer Buddy for iPhone", "Botella de 65 cl, adquirida en Slainte. Color anaranjado. Sabor a lupulo, dulce, ligeramente a malta.", "Bitter after taste. Nice aroma, bitter, not too hoppy as an ipa. Relatively high alcohol content", "Belle couleur dorée orangés avec un col mousseux respectable. Au nez caramel,notes floral,agrumes. En bouche c’est très doux, en finesse caramel,floral,herbeux, des agrumes et des fruits tropicaux viennent caresser la langue comme du jus. Ca manque de corps et de résine pour une IPA. Respectable tout de meme!", "A nice near perfect balance between malt and hops. It's a great golden color with a smooth drinkable \n\n---Rated via Beer Buddy for iPhone", "Wow I really like this IPA. Nice hoppy taste to the palate but not overwhelming. And a creamy finish to the malt. Well done rogue.", "Aroma: flowers, resin, honey, tropical fruits. Appearance: hazy, dark gold, medium, frothy white head. Taste: light bitter and sweet. Palate: sweets intensify quickly, ripe fruit, resin, heavy body, soft carbonation, dry, long finish. Overall: nice IPA, great palate, slightly weak on aroma. Pint at Hops and Glory, Islington.", "650 ml bottle from Appellation Wines. Pours clear gold, thick, pillowy white head. Aromas of orange, candied peel, caramel. Taste is light bitter, good balancing sweetness, quite refined for something calling itself brutal. Oily texture, bitter, but crisp finish. Really good.", "Butelka 66cl.\r\nOCZY : piwo jest mętne o kolorze pomarańczowym. Piwo ma spory osad na dnie butelki. Piana jest średniej wielkości o kolorze białym. \r\n\r\nNOS : piwo ma mocne aromaty tarty, pomarańczy i cynamonu. Do tego kandyzowany banan, surowe ciasto drożdżowe, delikatnie żywica, dojrzale mango. karmel i ketchup. \r\n\r\nUSTA : delikatnie gazowane o konsystencji typowej dla tego stylu przypominającej gęstość chudego mleka. \r\nPiwo jest słodkie o nutach pomarańcza, karmelu i tarty. Lekko przyprawowe o nutach cynamonu, curry i pieprzu. Umiarkowanie gorzkie o nutach owocowych przypominających pestki pomarańczy. Posmak piwa jest delikatny. Przenika słodkość i piekąca przyprawowość wraz z delikatna owocową kwaskowatością i gorzkością. \r\n\r\nODCZUCIA : piwo jest smaczne. Ma w sobie kilka oryginalnych elementów ale ogólnie jest umiarkowana i łatwa w piciu. \r\n\r\nOCENA : \r\nsmak : 7/0\r\npijalność : 7/10\r\nstyl : 0", "Bottle from mane liquor. Pours bright orange with firm white head. Nose is citrus, mainly lemon. And actually some booze. Taste shows lemon tang, light bitterness. Not too much going on but tasty enough. \n\n---Rated via Beer Buddy for iPhone\nEarlier Rating: 11/24/2012 Total Score: 4\nBottle from mane liquor. Pours a golden orange with a nice white head. Aromas of  blood orange, floral hops, citrus fruit. Taste is super clean and sessionable. Combing a good balance of malts and hops with dry finish. Great beer", "Wow. Excellent beer from rogue. A bit cloudy but excellent taste of citrus, floral hops. Really solid.", "(Rogue Brutal IPA) Bottle 650 ml at home, poured into a tulip, ABV 6.2%\r\nMostly clear body, deep orange in colour. Small and thin off-white head, with okay retention, leaving light lacing on the glass.\r\nAroma is a bit weird, there is some citrus when I swirl the glass a bit, but the main aroma has vegetable notes and some biscuit.\r\nThe weird vegetable notes are following to the taste too, but seem to fade when the beer has breathed a bit. Biscuits, some orange peel, caramel and malts on the back. Mildly bitter aftertaste, nothing extreme or even above your average IPA.\r\nMedium thin body, carbonation on the low side. Mild dryness on the palate.\r\nOverall okay, didn’t meet my expectations.", "25/VII/14 - 1Pt. 6Fl. Oz. bottle from Bierhalle Deconinck (Vichte) @ home - BB: II/2015 (2014-841)\n\n\r\nLittle cloudy dark orange beer, big irregular creamy yellowish head, pretty stable, adhesive. Aroma: very fruity, citrus, sweet, pineapple, some honey. MF: ok carbon, medium to full body. Taste: pretty bitter, hoppy, grapefruit, citrus, little sweet, some honey. Aftertaste: bitter, some citrus, bit sweet, caramel, malts, soft grassy hops, some honey.", "Gravity at GBBF 2014. Poured a hazy dark golden colour, with a thin, rocky white head. Aroma of crisp apples, hay and grassy hop. Orange flavours, with bitter pine needles and straw. Finish was spruce, citrus peal and mango.", "A quality IPA with a smooth finish. Pleasing color and mouthfeel. Entirely local and definitely enjoyable.\n\n---Rated via Beer Buddy for iPhone", "A solid IPA. Very bitter and aromatic hops with flavours of pine and citrus. A rounded, slightly sweet malt. The bitterness lasts quite long in the mouth.", "Bottle. Pours an orange/amber color with a solid layer of head that laces well down the glass. Aroma of biscuits, somewhat spicy hops. Flavor is quite sweet, has a strong malty profile, bready, some caramel notes, hops are somewhat buried by the sweetness but are still present and the end of the taste.", "Bottle. Orange-golden, hazy, nice white head with good lacing. Hoppy aroma - some green notes, I would say. Good body - the main note in taste is malty sweetness which I actually don’t really like but here it’s okay. Then comes the bitterness, it’s gentle, not brutal. There are hoppy flavours as well. I expected more offensive beer, but it’s a well-balanced, good IPA.", "Rusty Bucket, Dayton, draft. No head or lacing. Copper and clear. Smells like fermented pears. Light mouthfeel. Easy to drink. Good session IPA. \n\n---Rated via Beer Buddy for iPhone", "Murky light brown/orange, practically mo head, minimal lacing. Sweet malt, bit fruits. Slick oily feel, medium body, Semisweet, low carbonation, bread. Too malty for my taste.", "Belle couleur orangée avec mousse moyenne, blanche; arômes d’agrumes; goût houblonné;  finale amère  agréable", "BOTTLE. Cloudy gold in colour with a good finger of head. Hops hops hops & more hops on the nose. the hoppy Bitterness comes through instantly, finishing with a slight pepper/spice at the back end.\r\nSourced Cellarbrations Capel", "Bouteille. La cervoise 91. Robe orange, mousse beige clair dense. Nez caramélisé et résineux, expressive sur le houblon . Bouche amère typique où l'on retrouve le nez et une amertume sur le zeste de citron. Finale sèche. Classique et efficace.\n\n---Rated via Beer Buddy for iPhone", "Bottle. Metallic orange peel and orange malt aroma. Cloudy golden yellow with small head. Sweet floral orange-caramel malt and mildly bitter orange peel flavor. Nice.", "Bottle 65cl. Cloudy amber with a light beige head. Not a strong aroma, but hops are obviously present. Definite an IPA but not extreme. Fisrt impression was bitter but immediate faded to a somewhat average flavour. Medium length. Good beer, but I’ve tasted better ones.", "Nydelig frisk duft av citrusfrukter og honning. Dunkel gyllen farge. Hvitt skum, heng langs kant. God smak av citrus med en anelse honning i ettersmaken.", "Noe dunkel strågul farve med lyst skum. Lukt av honning og frukt. Smak av honning, malt, og grapefrukt. Tap @ Melkebaren.", "Great aromas of straw, earth, raisin, barnyard and hazelnut. Short palate and bitter up front, with orange, raisin, birch and honeycomb. Some bitter apricot and pickled fruit on the end.", "Appearance: Brownish orange, slightly hazy. Good amount of off-white creamy head.\n\r\nAroma: Hops, lemon, fruit.\n\r\nTaste: Lots of hops, floral, some fruit. Thankfully not that brutal.\n\r\nBought: Drinks of the World (Basel), 650 ml, CHF 12.20\n\r\nInfo: 31/7-2014, 56/300M, BB: 30/4-2015", "Drank at a local liquor store tasting. Pours a cloudy orange with a small white head. Aroma is hops, pine, resin, and citrus. Tastes of tropical fruit, citrus, honey, and bread. Medium bodied beer with a moderate amount of carbonation and a sticky mouth feel. Does not end with a harsh bitterness and sweet on the tip of the tongue. Nice beer", "Has everyone on RB rated this before me. Ah, that’s okay. Here’s my take on it.\r\nIPA deserves a straight up pint glass, ha ha, hmmmmmm....let’s do this. \r\nThe appearance was a slight burnt orange to brown color with a one finger white foamy head that dissipated within about a minute. There was some light lacing here and there all around and just glazing the glass in a nice adequate fashion. \r\nThe smell had a light orange to glazed over tangerine sort of light and somewhat leading apricot to mango citrus wonderful aroma.\r\nThe taste was mainly sweet but still had a light decent bitterness that ended up having a slight bitter hoppiness all around. \r\nOn the palate, this one sat about a light to medium on the body with a fairly decent sessionability about it. The carbonation was there but still had a slight harshness but was still good for the most part. \r\nOverall, pretty good beer to have again.", "Clear amber. Off-white creamy head. Spicy and hoppy nose: pepper, orange, vanilla. Lovely. Moderately bitter, moderately sweet - bit harsh on the bitterness. Lovely, well balanced, but not overwhelming.", "On tap at rogue embassy in SF. Pale, cloudy amber. Minimal white head. Smell is floral, citrus, pine. Taste is sweet, tart, finishes floral. Lots of floral flavor here, not much bitterness. Creamy and soft on palate. Good stuff.", "Tap @ Taphouse, Copenhagen. Aroma: Hoppy, fruity, citrus, grapefruit, caramel. Taste: Hoppy, fruity, citrus, grapefruit, pine needles. The finish is dry and bitter with hoppy notes.", "Poured from a 22oz into a small goblet with a light foamy head (that quickly dissipated). \n\nLight and mellow citrus aroma with sweet malty backbone. Drinks with medium carbonation and a medium body. Smoothly bittersweet with burnt sugar notes. \n\nMild bitterness lingers but not much. \n\nI'd come back for another. \n\n---Rated via Beer Buddy for iPhone", "This is a great Oregon IPA. Poured out of a 22oz bottle. Great aroma and perfect appearance. Smooth taste with just enough of a piney finish that isn't over powering, though it does last on the palate. \n\n---Rated via Beer Buddy for iPhone", "Pours a golden orange slightly unclear beer with a white carbo head. Smells fruity, honey, dried fruit. Tastes fruity, honey, malts. grapefruit. Average carbo, thin to medium body and a dry sticky texture.", "Mooie oranje kleur met een volle kraag. Ruikt honing, hop, kruiden en fruitig. Smaakt bitterzoet, honing, kruiden en iets fruitig.", "On tap at Rogue SF. It pours a nice orange gold color with a very creamy creamsicle colored head. The aroma has some touches of honey, orange, lemon and big floral and herbal hops. The flavor is crisp and floral with more orange and lemony herbs. Solid bitterness in the finish. Smooth on the palate and rather full bodied, but not sweet. Very good stuff.", "Bottle 330ml. Cloudy orange with frothy white head. Aroma of citrus, tropical fruits, a bit piney and lactic. The flavor has nice hoppy bitterness with notes of citrus (lemon, grapefruit), some tropical fruits, piney and grassy, bitter and sourish finish. Medium-bodied. Nice.\r\n\n\n\r\nBottle sample at Rogue Brewery tasting at Beer&Beyond, Tel Aviv. Hazy yellow-golden with off-white head. Skunky hoppy aroma, soap, light floral. Flavor is medium bitter, skunky, floral. Light to medium body. Sticky, bitter aftertaste. [5/3/5/3/9=2.5]", "Tap @ Taphouse, Copenhagen 15/7-14. Malty and hoppy with citrusy notes, sweet caramel and toffee, medium body with an oily texture. The finish is dry and bitter.", "Pours golden bronze with white head, big bubbles, and some head. Aroma of mild floral, citrus, and spicy hops. Taste is the same with good bitterness and lemon peel aftertaste. Very nice.", "Draught@Birofilia Festival 2014. Hazy dark orange, small foamy head. Aroma is nice, tropical fruits, pineapple, caramel, but fades kinda quickly. Medium bitterness. Medium body. Alright.", "Bottle. Pours clear amber with a decent frothy to creamy head that leaves excellent lacing. Faint aroma of caramel and floral hops. Lightly bitter, medium sweet taste in a light to medium body, lively carbonation and a light bitter and sweet finish.", "An international customer, my first experience of this beer has been terrible. Beer was cloudy, and full of visible trub & hop sediment. Creating terrible off flavour, smelt of Yeast and failure. no choice but to use as drain cleaner.", "Draught at Taphouse. Hazy amber colour with an off-white head. Aroma and flavour of hops, fruit, citrus, caramel and bitterness.\n\n---Rated via Beer Buddy for iPhone", "Draft @ City Beer Break (ALB). Nice citrusy aroma. Clear, orangish color. Smooth flavor, not piney, but citrusy. Good mouthfeel. Nice summer beer.", "Tap@Taphouse, CPH - amber coloured pour with good white head. Aroma and taste is big citrus fruity and prominent caramel malts, with some light toffee, more citrus, prominent orange rind and pine, solid bitterness. Lovely stuff.", "Bitterness is wonderful! One of my favorite rogue beers. A great IPA for those IPA lovers.", "Couleur presque brune, au moins jus de pêches, avec une mousse rare et une texture presque épaisse. Le malté l’emporte en nez, avec du sucre d’orge, du caramélisé et finalement des houblons. Fruitée, sèche mais terreuse en bouche, complexe et aux saveurs durables, elle n’est pas typique pour son style, mais délicieuse et audacieuse elle est. Après une introduction simplement passable, c’est une bombe en bouche et en gorge.", "This was on tap at the Brickhouse, Davidson, NC. The appearance is an orange with a slight bit of haze. It has floral notes with orange peel maybe some yeast as well. Citrus taste with a floral finish. Mid range bitterness. Overall a good IPA.", "Bona cervesa molt equilibrada i gustosa.\r\nBuena cerveza muy equilibrada y sabrosa.", "Bottle. After the wife went to her sister’s I got to enjoy this nice brew. Pours a very cloudy, very murky amber. Nice head, good lacing. Aroma is of faint malts and grapefruit hops. Taste is easygoing and good. Nice balance of malt and hop, good carbonation. Enjoyable.", "Aroma is floral with notes of elderberry and biscuits. Taste matches aroma mainly floral and fruity.\nMedium body with moderate carbonation.", "This is the best rogue beer I have ha. Really hoppy and bitter. Smells malty and has a nice bitter finish. Pours orange incolor. Had at home. \n\n---Rated via Beer Buddy for iPhone", "Bottle at home. Pours amber orange, light toffee pine nose, bitter, piney, dry toffee.", "355ml bottle\r\nAppearance: Hazy darker golden color with a fluffy white head of 3 fingers. Head has a nice retention and leaves quite some lacing. \r\nAroma : Pine and oranges, orange zest.  herbal tones on a backbone of caramelised malts \r\nTaste: Taste Malts and orange zest . Mild Hoppy bitterness which is a mix of herbal of orange zest on a backbone of carame. While easy drinkable it becomes a bit one dimensional. and borring halfway the bottle. And a super fresh bottle does not change that/\r\nSlightly above average body, Light oily texture, slightly below average carbonation.", "Smells of oranges and pine trees. Hazy orange appearance with an off-white head. Tastes of malts, pine, and orange. Very slight bitter aftertaste.\n\n---Rated via Beer Buddy for iPhone", "22 oz. bottle. Pours a hazy gold color with a fluffy white head. Aroma is mostly pine with some malt and citrus in the background. Taste is a nice balance of malt and hops, some citrus. Finish is a little dry with some sweetness. Pretty good!", "Sample at Hopfest 2014. Comes a cloudy golden orange with a nice white head. Aroma of citrus, pine, and malt. Taste is grapefruit, lemon, pine, malt, and caramel. Good.", "Bottle kindly donated by Miro, many thanks. Nice hoppy aroma with oranges, orange zest. taste, solid malty base with nice hoppy kick with oranges, tangerines, orange zest, light resin. Tasty.", "Bottle. Aroma is empathically hoppy, citrusy orange American hops. Hazy orange colour. Taste is nicely balanced. Strong hoppy bitterness balanced with background caramel malt. Orange flavour, orange peel. Easily drinkable, relatively full body. Full of flavour. Very good beer.", "Bottle, courtesy of Miro. Pours orange color, white head. Aroma is floral hoppy, orange, citrusy. Taste is medium bitter, lightly sweet, floral hoppy, orange, grapefruit. Nice bittersweet fruity finish.", "Flasa - Miro. Tmavo oranzova farba, biela velmi bublinkova pena. Vona cerveny pomaranc, jemne karamel. Vona citrusova, karamelova, chlebove tony, jemna horkost. Telo stredne, velmi osviezujuce.", "Aroma of lemon and lemon flower to the verge of synthetic. Also caramel, a tiny bit of pine. Tastes like lemon but a bit artificial, medium hoppy bitterness. Light mouthfeel.", "650ml bottle. Murky orange with a frothy off-white head. Flavors are bread, citrus, caramel and toffee. Light bitterness. Medium body, soft carbonation, oily texture.", "Bottle. Pours a hazy golden beer. Aroma is citrus, fruity and hoppy. Taste is citrus and a nice bitter. A good ipa", "Im sure this has been said before but this beer was brutally good. Will definitely get this again.", "Rødgylden klar skumhvid \nCitrus grape malt smør \nBitter modrate sød moderat \nCremet \n@taph\n\n---Rated via Beer Buddy for iPhone", "ivorywhite head disappears quickly. orange blond colour. aroma grapefruit, citrus, fruity, grassy. taste like aroma with a wimpy bitterness. quite thin body and medium carbonation. not that brutal really.", "Bottle from Cotteridge Wines; hazy dark amber pour with a big frothy with off white head, tangerine and citrus aroma, taste has orange light grapefruit some biscuity malts, light bitterness some floral action.", "Vibrant dark golden, light haze and decent greyed white head providing a solid lacing as it dissipated. Floral, sweaty banana and unripened orange. Spritzy Seville oranges, clean and rich bitterness throughout. Things got earthy and faint citrus and more quenchable later on. Dusting of light creamy malt and a wee drip of syrup sweetness. Very presentable fine and moderate carbonation. Finishes an exposed, thorny bitterness with lime and a resonating sharp linger. Tidy stuff all in, and smashable enough from the big bottle. \n\nBottle, The Beer hive, Edinburgh", "On tap at The Local Pub, Athens Greece. Orange color with a thick white lasting head. Aroma of lemon-flavored handsoap, slight caramel. Taste was citrus, lemon, some caramel and bread backbone. Slight aftertaste, bitter. Light to medium body, low to medium carbonation.", "Color is very murky orange yellow. Taste is orange peel, lemon and sweet, but dry, malt. Not sure I’d call it a brutal IPA, but it’s decent.", "Bottle at home. murky orange amber with medium almost white head. Aroma is malty, and hoppy, not well balanced. Hint of orange and citrus, tangerine, hint of caramel, sweet hoppy finish.", "At BBF. Copper colour with white lace. Tropical fruits, pineapple, caramel, brown sugar aroma. Resinous hops taste, some maltiness, slightly oxidized. Medium body.", "Aroma: citrus, floral; Appearance: hazy orange, foamy head; Taste: medium bitterness, slight sourness; Palate: slick texture, medium body, medium carbonation, astringent finish\n\nCool ale with intense, long-lasting taste.", "On tap at Rogue Hall in Eugene. Very disappointed. Flat, bland, lacking flavor. No hop flavor up front or finish. Another Rogue beer. That is...over priced and full of themselves and doesn’t hold a match to other NW beers.", "Pours cloudy light orange. Two finger head, decent lacing. Aroma floral, grassy, pine. Taste is sweet, lightly bitter and sort of buttery. Medium body, creamy. Finish sweet spruce, lightly bitter. I wouldn’t call this and IPA, more like an ESB.", "Nothing too crazy here good grapefruit tasting hops over a slightly caramel hops. Pretty much your standard ipa.", "from tap. Very drinkable IPa, but also very simple and far from complex. Citrus, hops, grapefruit. Not really superbitter. Balanced but nothing brutal about this beer. OK but very average.", "From tap @ BBF 2014. Pours hazy orange with a small white head. Flowery, hoppy, fruity, caramel aroma. Moderate biiterness that starts right from the first sip, hoppy, fresh mountain air. Light honey aftertaste.", "Pours a murky copper with a healthy white head. Starts off smooth followed by a bitter hoppy flavor and and a hint of malt.", "Bottle. Pale amber color. Black berries and citrus in the somewhat floral aroma. Firm floral hopbitter flavor with black berries and citrus. Slightly herbal flavor. Good beer.", "Teku, nonic glass. Appearance is orange, gold, hazy with average head and low lacing. Nose is fresh, mainly citrus, little floral notes (orange), some yeasty notes - dough, bread. Taste is very refreshing, ideal for warm/summer season. Light to medium bitterness, light to medium sweet. The alcohol, malt and hops are very balanced. Very smooth citrus taste with some floral notes. Light to medium body, thin texture, average carbonation. Bitter finish. \r\nIn overall very good, balanced, refreshing and drinkable IPA.", "From TAP at Delirium Hoppy Loft, shared with Mathieu87.\r\nAPPEARANCE: clear blond beer, small stable white head.\r\nNOSE: fruity, fresh, florar.\r\nTASTE: fruity, fresh, florar, hoppy, very nice.", "Poured from 22 oz. bottle. \n\nHazy, orangish amber with 3-finger billowing cream-colored head and very good lacing. \n\nFairly mild aroma of citrus of caramel and pine. \n\nTaste of lemon, tangerine, caramel, pineapple and touch of cloves. \n\nMedium body and medium carbonation.\n\n---Rated via Beer Buddy for iPhone", "Aroma is slight grapefruit, slight caramel. Not impressed. Taste is wow. Grapefruit bitterness, citrus, lots of caramelized malt, alcohol is hidden well. Palate is wrecked from an IPA. Well Done.", "Aroma starts when beer hits the glass from the bottle. Nice IPA that stays ahead of the curve in all aspects of the experience. \n\n---Rated via Beer Buddy for iPhone", "A very average tasting IPA. Nothing special not bad & not that tasty either. This IPA has a flat bitter finish.", "From 22oz bottle to tulip. Pour is a hazy blonde, active bubbles and thick head. Nose is hops, floral, earthy. Taste is light bodied and bitter. Nice drinkable IPA.", "Pours orange brown, creamy white head with lots of sticky lacing. Citrus and malt aroma, orange and grapefruit. Fairly bitter flavor taste with flavors of grapefruit, pine at the end.", "Pours a deep orange hue with a nice citrus aroma. Excellent all around. A top notch IPA", "Draft. Pours a hazy orange. Aroma of grapefruits. Taste is the same. Very balanced and very enjoyable."]}