{"reviews": ["Canned, served in a trappist goblet. A clear copper-hued pour with an ash-white head that leaves a ring for good. Aroma is peach, porridge, arugula. Bone dry onset. Crisp, full-bodied mouthfeel. Incredibly bitter finish (one of the bitterest beers I've had outside the undrinkable 黑 from Mikkeller -sorry if I stepped on some toes.) Very long-lasting finish with hints of conifer resin all over. Clearly over the top.", "Hazy golden. Aroma is tropic fruit pine caramel resin grassy hops. Taste is heavy resinous hop bitterness. Pretty dense with long hop finish. Rough and nice.", "Can from Super Valu Ratoath. Pours cloudy Amber with minimal white head. Aroma is citrus fruit, pine, hops. Flavour has an intense full mouth of hops but combined with lots of fruit in the mouth. Medium to high  carbonation. Pine, caramel, malt and lots of hops. Thick texture. Long bitter hoppy finish.", "355 ml dose\nFarbe orange etwas trüb\nSchaum feinporig relativ konstant\nGeruch citrus Früchte\nGeschmack malzig süß danach kommt die Grapefruit und die radiekale Bitterkeit", "Very industrial but hoppy still with nice features. Easy to drink and not too raspy in the throat after several sips.", "Colore dorato, schiuma media poco persistente, aromi erbacei, resina, fiori bianchi. Buona carbonazione, al palato, erba, corteccia, lievi sentori fruttati e di miele. Corpo medio, finale decisamente amaro. Una birra ben equilibrata, gli aromi non sono eccessivi, la componente amara caratterizza la bevuta.", "Alone at home. Hazy amber colored beer with small white head and only few carbonation. Hopped fruited aroma. Full sparkling palate. Finish is strong bitter dry, reminds of tonic taste.", "How: Can.\nWhere: Systembolaget.\nAppearance: Golden colour with a white head.\nAroma: Malt, caramel, hops, pine, grapefruit.\nBody: Medium body and carbonation.\nFlavour: Malt, caramel, grapefruit, hops.", "Can from Systembolaget. I didn't get to rate this as well as i should but I remember a class and bold West coast IPA. Need to retry if i get the chance.", "Quite happy. Pleasent after taste. Drink on a full stomach. I'd describe it as very full.", "can @ british store (budapest) golden orange colour, normal body, average carbonated, white head, bittersweet, hoppy, malty, fruity, citrus, dry in the end, easy to drink", "That's a nice piece of bitterness. The taste is a little on the low end, but all in all a very tasty IPA one should have Taster", "Honningfarvet, uklar og fint rigeligt skum. Let citrusduft. Meget bitter med smag af citrus. Slet ikke min smag.", "Slight hazy golden pour. Aroma of citrus and grapefruit with a slight hint of pineapple. Flavour of citrus and pineapple. Dry bitter finish with malt hints.", "A very tall tall-boy (19.2 US fl oz) can from Denman Liquor in Vancouver’s West End. \n\nA 6 oz pour into a snifter. Medium amber, translucent, moderate head, nose smells of beer. A good thing!\nTaste wise, this is a classic, traditional West coast IPA. Very nicely balanced, with hops and malt aplenty, oh yeah! Great stuff!", "I've had Stone IPA many, many times over the years, but apparently not at a time I could write a review.   Juicy, pineapple, orange and tropical fruit aromas from a slightly hazy medium orange/yellow body with a foamy white head.  The juiciness in the aroma gives way to a fairly dry, bracing bitterness that still has some pineapple but much more grapefruit and citrus pith.  The balance of dry bitterness to juicy fruit sweetness is what makes this such a classic IPA.  Not to heavy, not to light, and just strong enough at 6.9% ABV to make it spicy but maintain that balance.  There's also a distinctive hop spiciness that lays down on the tongue and stays there.  Lot's of that and tropical fruit sweetness at the end.  This is really an amazing IPA from a great brewery that was a founder of the West Coast IPA style.", "Puszka. Pomarańczowe, nieprzejrzyste z niewielką pianą. W aromacie wyczuwalne chmiele. W smaku pełne, słodkie, czuć sosnowe aromaty. Smaczne", "0,355l can from Kaufland store drinking 11/09/2021 Canned 05/10/20 Enjoy by 05/10/21 according to bottom. Pours a slightly hazy yellowish pale orange body with large frothy off-white foam on top, lots of lacing. Aroma of malt, citrus, grapefruit, tropical fruits, and pretty intense earthy, resinous, grassy and piney hops. Taste is even better with a good malt base and moderate sweet, juicy fruit flavours, citrus, grapefruit, orange, also a high bitter and lots of earthy, grassy and resinous hops flavours, dry bitter hoppy finish. Medium body, oily texture and moderate carbonation. Love the bitter hoppiness here, great west-coast style classic Ipa.", "color: naranja ligeramente turbia, espuma blanca 1 dedo poco duradera.\nolor: cítrico, pino, frutal.\nsabor: amargor medio-bajo, cuerpo medio, final seco, persistencia larga, llena toda la boca, muy equilibrada, carbonatacion media.", "Very long super tall metal can.  Fruit flavors that are well blended together.  Medium body. Average carbonation. Pleasant finish.", "12fl oz can\n\nThis is the most notable IPA for my life, this one is balance between malts and hops, and clean body.\n\nThe taste coming with bread from malt, light-medium sweet from malt, hops taste coming with piney, a little bit of citrus, passion fruit, a little bit of orange.\n\nYes this is the good one, worth of all pennies for this IPA beer.", "Aroma: Juicy fruity hops with grapefruit. Flavour: Dry fruity bitter with notes of grapefruit. Aftertaste is dry fruity bitter. \nColour: Golden amber with a white head. \nFrom: Can @ Nemlig webshop.", "0,33 can. Zöld gargoyle szörnyös dobozban hatalmas krémes, tömör fehér habbal egy szép világos-borostyán sör. Zöldfüves, gyantás, komlós IPA illat. Kortyra szárazan, gyantásan, és igencsak keserűen nyit. Igazi IPA. Hab végig szép, és finom is. Érdemes kóstolni, mivel \"harapható\".  A sör gyengén (közepesen) szénsavas, jó gyantás, keserű \"alap\" IPA, de ezek között nagyon \"vegytiszta\" és testes, ezért kiemelkedő az átlagból. Finom volt nagyon. Az alkoholt nem érezni, keserű sör kedvelőként úgy érzem egymás után innám őket :)", "Lattina. Il gusto al naso propende per il luppolo. L'olfatto viene stimolato in maniera elevata, permanendo in maniera ha una buona tenuta. La grandezza delle bollicine è a grana media. Il liquido è di consistenza limpida. La frizzantezza si presenta sotto forma di bollicine medio-fini, con carbonazione vivace e persistente. Il colore è giallo dorato carico. Il corpo è strutturato. L'amaro è carico. La forza gustativa è molto elevata e la permanenza è buona e persistente. Le sensazioni boccali finali risultano di amaro. Il retrogusto è intenso. Il tetto della bocca riconosce impressioni di miele, crosta di pane, luppolo, resina, agrumi, pompelmo, ananas, frutta passita e spezie.", "Pours between straw and pale gold, a tad foggy with white foam and nice retention over a calm texture. First sip is bitter, sharp and a slap of hops. Then it's a strong piney flavor with straw and weeds notes. Sometimes a echo of citrus and pineapple comes through. Body is dry and firm. Finish is clean with an overwhelming resinous hoppiness that sticks to the throat. Aftertaste is a big fat hop between your tonsils.", "Nice amber colour with lasting white head. Smell of bitter hops, fruits and citrus. Taste is really classic IPA with a fantastic bitterness. Great", "Aroma of pine, hops, flowers, mild citrus and some sweetness, like nectar\nHazy golden colour with lasting small head\nTaste is really hoppy. Pine, hops, beech leaves, mild citrus, and some floral notes\nGreat mildly fizzy carbonation with decently thick mouthfeel\nPacks a punch in the bitterness!\nTasted at home while reading 1984", "AR: Hopfen, Litschi, Marmelade, blumig, Zitrus, Karamell\nAP: opales orange/bernstein\nTA: bitter, Litschi, Zitrus, kräuterig, Karamell,", "On tap at Yard House. Clear golden. Smells of pine hops and grapefruit. Tastes of grapefruit pith, pine, immediately bitter. Light caramel sweetness. Medium body. Good without being exciting, but that's why it's a classic.", "Appearance: The wine is golden and slightly cloudy, the foam is delicate and white, and it dissipates quickly.\nBouquet: thick malt aromas with tangy citrus pomelo notes, with a hint of caramel on the edge.\nTaste: Mediumbodied wine, strong taste, sweet before bitter, malt sweet caramel sweet quickly emerged, immediately covered with a large area of hops bitter, bitter lasting strong crisp, half dry, bitter back.\nIn short, the Stone family's masterpiece, crisp, clear style, typical of the West Coast IPA, whether to drink or slowly taste, all is good!", "An amber coulored beer with a off white foam. A rich fruity smell. The fruit can also be found in the taste which lingers in the mouth. A very good beer.", "Golden, very slightly hazy, with a decent white head. Rich hoppy aroma. Taste is hops, some honey, decent bitterness.", "Enjoyed: Poured from can into tulip/snifter glass.\nAppearance: Blurry orange/ocher colour, medium head.\nAroma: Tropic fruits/passion fruit/mango, herbs, pine.\nPalate: Light to medium body, light to moderate carbonation.\nTaste: Tropic fruits/passion fruit/mango, herbs, pine, hint of caramel, bittersweet, hops, bitter aftertaste.\nOverall impression: Nice, aromatic, tasty.\nNote: My can was brewed in Berlin, Germany.", "Aroma a dank hoppiness. Crisp, clean taste. Prominent bitterness.  A good classic, old school IPA.", "Old rating from 28-04-15 - 355ml bottle, pours amber with a white foamy head. Aromas & tastes of caramel, citrus, grapefruit, earth, grass, pine, resin, hints of spice & malt. Medium body. Dry Medium to strong bitter finish. Outstanding", "IPA con molto carattere. Schiuma persistente e solo leggermente torbida colore giallo arancio. Sapore molto amaro e luppolato per una birra coi controcazz. Agrumi e retrogusto ancora amaro ma piacevole!", "Can 33cl. @home poured into a shaker. Hazy medium golden colour, good frothy off-white head, good retention and lacing. Rich aroma pale malt, grapefruit, peach, strawberry, pine resin, spicy notes. Round taste, medium bitter and light sweet, malty, grapefruit, peach, bisquit, pine resin. Medium to full body, oily texture, soft carbonation, long lasting dry bittersweet aftertaste, malty, citrus peel, piney notes, crisp, complex and well-made IPA, very good stuff.", "It's the most hoppy IPA that has broken my tongue. Still crying for it. Damn!", "golden straw color with a nice foamy white head and plenty of sediment gently floating about.", "Aromat: kwiaty, karmel, nieco miodu, nuty chlebowe i landyrnkowe. W smaku wytrawne, sporo kwiatowosci i ziolowosci, mocno slodowa podbudowa, akcenty karmelowe, wysoka, dluga, przyjemna goryczka o lodygowym/ziolowym charakterze. Nasycenie srednie do niskiego, cialo srednie.", "Justa great IPA, what can I say. That rhymes and notice, that was a statement, not a question. Will not disappoint. It is definitely one of my go-to IPA's and I only have like three of them in my repertoire. This one makes the grade so it represents a high percentage of my IPA needs. Readily available and reasonably-priced. Very consistent with your typical Stone quality control being very evident over the long period that I have relied on this IPA for its IPA deliverance.", "0,355 l can several times ago from ? . One of the best IPA-s, fruity and hoppy.", "Pours a golden straw color with a nice foamy white head and plenty of sediment gently floating about. The aroma is a bit dank with hints of pine and citrus. The initial flavor has notes of honey but that is quickly followed by a barrage of dry, bitter, pallet wrecking goodness.", "Blik 33cl thuis. Bitter, droog, flink hoppig, pine, fruitig, maltig, tropisch fruit, harsig. (13-11-2020).", "zapach bardzo intensywny, soczysty, aż mokry świeży chmiel, żywice, sosny, lupilina, niewielkie ilości cytrusów, świeżo wyjęte z suszarki pranie, trawa, i łąkowe kwiaty. kolor złoty, lekko opalizujący, piana biała, niespecjalnie obfita i niezbyt trwała. w smaku intensywne, ale nie przesadzone, dużo świeżych roślin, liście chmielu, świeże szyszki, trochę kwiatów, słodkich owoców i landrynek gdzieś daleko w tle, kandyzowany imbir, świeżo koszone łąkowe trawy, dużo białych części z cytrusów. goryczka wysoka, cytrusowa, liściasta, ściągająca, długa. w ustach mimo mocnych smaków dość wytrawne i pijalne. nasycenie wysokie", "So sollte ein IPA schmecken. Schön rund, voll, tolle Bitterkeit und feine fruchtig-harzige Noten", "9 months old, online from craftbeer-shop germany. And it’s great. Fresh, balanced above all, not too bitter, great cara malt backbone. Really quintessential classic ipa.", "Heerlijke droge ipa. Sterk bitter, droog mondgevoel, maar toch fruitig, iets van mandarijn en honing. Lekker.", "Gold and clear with a very thick, lasting head. Floral nose. Nicely-carbonated and malty with a hoppy, bittersweet finish. Unfortunately my can was expired as of last week, so it may have lacked some of the body it normally shows off. I plan to re-rate this one.", "The 6-pack was packaged on 6/3/20, so just over 9 weeks old at the time of this review (on 8/8/20).\n\nAroma is orange - almost sweet, hints of piney notes accompanying. A light toasty aroma underneath.\n\nOrange-amber color, with a chill haze, ample rising bubbles to a creamy off-white head with very good retention. Nice-looking disconnected lacing. The chill haze eventually dissipates to a clear amber color.\n\nTaste has the citrus rind (orange) biting up front, backed by some floral and orange juice flavors. The floral appears mostly as aroma that accompanies each swish in the mouth. There is sufficient malt presence, toasty bread, to provide the needed balance, but clearly the hops are the name of the game with this beer. The beer is not bitter for the first sip or two, but the bitterness builds with each successive drink to become a quite bitter beer. The aftertaste lingers for a long while and is intensely bitter.\n\nThe beer has substantial body for the style.\n\nOverall, a very good IPA, and deserving of its iconic status in the West Coast substyle. To my palate, the bitterness is most evident in the lingering aftertaste than in the flavor of each sip itself. The bitter aftertaste comes to dominate everything before you are finished.", "Really impressive IPA to drink. The nose has tropical aroma. Grapefruid, apricot, peach, orange ect. The taste is very refreshing and you get all these fruits. The mouthfeel is decent but the aftertaste is amazing. Very rare for \"IPA\" beers to have such a good finish. The beer it give one strong bitterness in the finish that it last many seconds. \nThe carboration is moderate.\nOverall one of the best IPA i have tried today.", "Puszka (z Berlina, chwilę po terminie). Jasnozłoty, klarowny, piana obfita, bardzo trwała. Aromat cytrusów i niestety lekko miodowo-landrynkowego utlenienia. W smaku wytrawne, niestety z okropną, łodygową, zalegającą goryczką. Lubię wysoką goryczkę, ale ta była paskudna. Ale ocena IPY po terminie jest niewiążąca...", "Golden color, citrusy hoppy aroma and a smooth bitter taste with a little bit of dry grassy aftertaste. Pretty good IPA.", "Aroma of Cirrus, tropical fruits, caramel, some pine. Taste of citrus, tropical fruits, pine, caramel and some perfume note. Low bitter. Low carbonation. Retro IPA.", "Plechovka od peta. Vyrazna silna chmelova vona. Zlatista farba. Chut silna chmelova velmi dlho ostava.", "hvala goblet store na dostavi ovog piva.. puno sam ocekivao od ovog piva ali me razocaralo...niti blizu pravoj IPA pivi....vise malo bolje industrijsko pivo..ni alkohol se ne osjeti bas puno ..ostane gorko u ustima..", "De l' Esclat. Súper clàssica IPA. Resinosa, amarga i contundent. Molt bona!!", "Cerveza olorosa y extra amarga, con un amargor que se come todos los matices del lúpulo", "Can. Slightly hazy gold. Medium head with high retention. Aroma intensity 3.75/5. Pine, peach and resin aroma. Heavy bitter. The dry finish gives it a chewy consistency for a medium body. A proper IPA", "Pours an almost perfectly transparent pale orange, with about one finger of a rather dense white head that shows good enough persistence. Potent but not very rich aroma has a piney/resinous base and strong citric notes of mainly grapefruit. Taste is medium sweet and high in bitterness, with a semi-dry, lingering bitter aftertaste. Light malty (crackery kind of) base, resinous bitterness, citric notes as per aroma. Bitter finish is resinous and slightly earthy. Medium bodied with average  to high carbonation in an overall lively mouthfeel that felt perhaps a little too burpy to me. Overall, a straightforward west-coast ipa. Good at that, but not really interesting or especially enjoyable to me.", "Can. Aroma of malt, candy and skunk. Medium bitter flavor, balanced out by a light sweetness. Grassy finish.", "Citrus, pine and a light touch of white bitter. Medium gentle bitterness lingers with a clean finish. Could be my everyday IPA.", "33 cl. can @ home, bought @ Una Mas, Nieuwegein. Berling brewed version.\nClear dark yellow with a big white head. Citrus aroma with some light tropical fruit. Bitter taste with a crisp bitter finish. Nice old-fashoned proper bitter IPA.", "Semi hazy yellow liquid, average head. Fruity aroma of hops. Light body, average carbonisation. Taste is bitter, a bit fruity.", "Ok, first sip of this beer seemed lik it was quite awful. But it turned out to be a nice bitter and dry ipa. Well achieved. Like the hoppy bitterness.", "Can from Jumbo supermarket in Gorinchem, The Netherlands. \nThe beer is clear orange colored with a large and stable broken white foam. Carbonation is very good. \nThe aroma is caramel malts and fresh and fruity hops, with citrus, grapefruit, grass, flowers, pines, tropical fruits and spices. \nThe taste is medium bodied and starts with caramel and goes to pretty hoppy and fruity with grapefruits, citrus, tropical notes and a spicy ending. \nThe finish is dry, very bitter and refreshing. Also long staying. \nVery good!", "Стандартное классическое индия пейль эль. Пить можно хоть каждый день. Чистое и ароматеное. Умеренная горечь.", "Stone IPA 6.9%. Golden, pine, citrus aroma, medium bodied, citrusy, grapefruit, oranges, orange peel, complex flavours, bittersweet finish. Classic IPA from Berlin, Germany 🇩🇪", "Aromas a pino, algo de pomelo y melocotón o tal vez albaricoque. En boca se repiten sabores, destacan también los cítricos, especialmente la naranja. La textura es densa y el trago largo. Amarga y resinosa, extremadamente bebible.", "Zwykła, klasyczna IPA. Na uwagę zasługuje wygląd i zapach, który zachęca do spożycia. W smaku mamy klasyczną cytrusowo-goryczkową IPĘ.", "Barwa złota, piwo przymglone, piana biała trwała.\nAromat średnio intensywny, tytoń, żywica i cytrusy.\nW smaku lekka słodową słodycz, żywiczne posmaku, goryczka wysoka,  lekko zalegająca.", "Wersja z Berlina. Klasyka, oldskul. Żywiczne, ziołowe, dopiero dalej cytrusy. Na szczęście karmelu prawie nie czuć.\nGoryczka średnio-wysoka, brak wad.\nSolidna IPA.", "Aromat średnio intensywny, pomarańcze i grejpfruty, delikatnie trawiaste i ziołowe w tle.\nW smaku słodkawe, trochę cytrusów, trochę ziół, goryczka średnia.\nNo nie zachwyciło, taka niezła IPA i tyle.", "Sometimes you fancy an old classic, from the time when IPAs tastes like this. It may feel boring to someone and sign of hardcore tradition for others. Clear golden-amber, white head with excellent retention, even in a plastic cup. Piney, dank, bitter, notes of grapefruit. I won't drink 2 in a row, but it's the IPA. Respect! We'll go back to pastry stouts later!", "Happy Valentine’s Day dinner event. This must be amoung the best coming out of Virginia￼.", "Aroma : Bready doughy malt, grapefruit citrus and some earthy/pine hop.  Taste : More of a steady resiny hop bitterness rather than an astringent citric bite, although grapefriut citrus is there. Tad different from a usual big citric bite West Coast IPA. Decent!  (Florida tour Nov 2018-bottle @The Cheesecake Factory, Miami Doral)", "330 ml can. Poured amber with a white head. Aroma is pine and malt.  The taste is fruity and hoppy with notes of orange, grapefruit, pine needles, key lime and spicy grasses. The aftertaste is bitter, sweet and dry.", "Poured amber with a big cloudy head. Lots of hops and citrus in the aroma, as well as the taste. Ok beer. Overhyped", "Grande IPA, non eccessivamente amara, pulita in bocca e definiti gli aromi, tipici dei luppoli usati.\nDa berne a secchi", "Mine has been brewed in Germany.\nGolden hazy with a one finger wide head.\nHoppy, with a funky note. Bitter taste with a citric note. Smooth body. Stronger carbonation.", "Pours clear golden, medium head and plenty of carbonation. Aroma of earthy pine and herbation. Tastes intensely bitter with a floral backbone. Great example of a West Coast hop bomb.", "Bardzo obfita średnio pęcherzykowa piana, opadająca szybko z lacingiem, zostawiając kilkumilimetrową taflę. Kolor jasny, opalizujący bursztyn. \nAromat bardzo chmielowy, żywica, cytrusy. słody. \nWysycenie średnio wysokie, wysoka goryczka, lekko ściągająca, bardzo wytrawne, pijalne, ma wszystkie potrzebne cechy IPA.", "En copa, cerveza ligeramente anaranjada con una fina capa de espuma blanca. Aroma resinoso, encontrando pino, naranja amarga, fruta madura como melocotón, especias y cereales blancos. En boca, textura ligera y acuosa, de carbonatación media y amargor intensa y persistente en garganta. Sabores a cereales caramelizados, junto con especias, pino, mucha resina y cierta nota a piel de cítricos amargos. Una IPA simplemente espectacular, potente, resinosa y amarga. Que más se puede pedir?", "Pours clear amber with a thick white head. Aroma of pine and citrus. Taste has smokey hop notes, intense bitter flavoring, earthy tones. Palate has bitter pine on the nose. Good.", "Bottle.  Pours a clear gold color with a thick off-white head and great retention.  Very good lacing.  Strong hoppy aroma.  Very strong bitter flavor. This is for serious hop heads only. Not my preferred style. Yes, I'm not worthy. Haha.", "Stone (Berlin) IPA \n33cl blikje via Jumbo Mosae Forum, Maastricht\nAlcoholpercentage van 6,9%\nUitgeschonken in Hopt glas\n\nUiterlijk: goudoranje met goede volle vaste witte schuimkraag \n\nAroma en smaak: aroma is hoppig, bloemig, smaak is fruitig, citrus, sinaasappel, tropisch, mooie straffe bitter\n\nConclusie: fijne IPA", "Tolles IPA aus dem Hause Stone.\nLeichte Hopfennoten in der Nase und im Geschmack.\nGroßartiges Bier für CraftBeer Einsteiger.", "Stone again very very very good bottle. A lot can be said but take one more of this one.", "W zapchu żywiczny chmiel, gdzieś w tle leciutkie cytrusy. W smaku żywiczny chmiel. Goryczka średnia do wysokiej z długim finiszem o zabarwieniu ziołowo - kolendrowym. W głębi nuty słodowe. Ogólnie ok.", "Kolor złoty, delikatnie opalizujący. Piana biała, wysoka, bardzo ładnie krążkuje. Charakteryzuje się długim czasem redukcji.\nAromat bardzo orzeźwiający, tropikalno cytrusowy, nieco słodkawy Jest przyjemny, świeży i zdecydowanie \"lekki\".\nSmak podobnie jak aromat, są zdecydowane nuty owocowe (tropiki, cytrusy), jest lekki akcent żywiczny, a dalej to rządzi już tylko goryczka. Ta jest mocna, grapefruitowo żywiczna, dość długa, nieco zalegająca.\nWysycenie wysokie, pasuje. Treściwość na poziomie średnim, płyn jest gładki, miękki. Posmak dlugi, generalnie owocowo goryczkowy", "Good \"old style\" IPA. Intense, high quality bitterness. Aroma a little citrusy, a little more earthy I think and grassy. Pale, golden color, clear appearance, nice white head.", "Can from Beervana. A classic and one of the best staple IPA's out there. Gold/orange colored with thick white head. Intense hoppy aromas with pine, lime peel, lemongrass and cedar. Powerful mouth puckering bitterness in the mouth with a very long herbal aftertaste. Intense, heavy stuff. Not completely sessionable, but delicious none the less.", "Half pint on tap at Dynamo (Six Degrees North), Dundee. Almost clear golden amber with a thick white head. Aroma is quite sweet - cane sugar, ripe fruits, citrus, pine. Taste is caramel, toast bread, ripe fruits, citrus, grapefruit, pine. Orange peel bitterness on the finish. Chewy mouthfeel. Hops and malts coexist in harmony in this very enjoyable IPA.\nWould I drink it again? Yes, I would.", "Złote, zamglone piwo o obfitej pianie, która zdobi szkło i pozostaje do końca w formie warstewki na powierzchni. Aromat i smak słodowy, cytrusowy, lekko ziemisty. Goryczka średnia w stronę wysokiej. Ogólnie całkiem udane AIPA w bardziej klasycznym wydaniu.", "Yes,it is citrucy and piney.soft taste.not too hoppy,but this was canned 13/06/2019,in Berlin.and this was one of the newest ipas I checked at the store.still,maybe the best value for money from Alko in the IPA range?", "An american, foggy, amber IPA with extremely high, white head. Aroma is malt, light hops, light citrus, light apple. Taste is very bitter.", "Stone IPA, abviously a bitter one for much of Chinese, very classical and fresh aroma of american hops, body is tight, I can feel very good malts being used, give the whole beer a concrete feeling.", "Mostly clear golden color.  Minimal head.  Aroma is pine and malt.  Medium body.  Strongly bitter.  Pine, resin, touch of citrus.  Classic west coast IPA.", "Can. Clear golden color, fine white head. Intense citrus, resinous and exotic fruit aroma.\nDry and high bitter taste. Astringent, exotic fruity, resinous aftertaste. Medium carbonation, full body.", "Golden Ale with slight haze. Mild hoppy aroma. Taste is highly hoppy. There is no malt to balance out the bitterness. This beer could be more clean and refreshing, especially since it’s a regular IPA not a double.", "A beautiful beer. Amber, slight bitterness which is true to the style. I like this one very cold.", "Found on tap at Smokey Bones in Nashua, NH. Came in a large frosted mug with a frothy white head.  Lovely amber color that left a perfect place throughout. Would strongly recommend", "16 oz can. Smells of pine and grapefruit, citrus. Hazy, light amber/ orange in color. Nice balance, a bit more on the bitter side. Tastes briefly of malts, followed by a citrusy hop hit, which then moves to a pleasing bitter finish. Medium bodies, not too thick nor thin. A pleasant, bitter, citrusy, hoppy taste journey with each sip.", "Keg at The Euston Tap in 2013. Mid golden. Aroma of citrus, west coast hops, peppery notes and dry grain. Big burst of citrussy hops and piney notes.", "15.08.19, puszka z datą do 17.04.20\nAromat głównie cytrusowy (grapefruit, pomelo), z lekką nutą żywiczną po ogrzaniu, w tle lekka słodowość. Ciało średnie. W smaku chmielowo-cytrusowo, ponownie lekka słodowość w tle. Sroga goryczka, szlachetna, dość długo się utrzymująca. Nasycenie średnie.\nŚwietna klasyczna interpretacja IPA.", "Uzupełnienie ocen piwnych bez opisu z uwagi na przeniesienie z papierowych zapisków.", "은은한 트로피컬 향. 피지한 탄산이 강하게느껴짐.\n쓴맛은 IPA치고는 약한편인듯...\n왜 100점인지 모르겠음;;  스컬핀이 훨 나았던느낌\n이마트 6680원", "On tap in beijing. Of course will not be as good as tap USA. Aroma is a let down because the bar didn't clean tap lines. Piny, buisuit nose, some fruit with zest.  Palate is citrus peel, warm biscuit with a lingering bitter finish. Overall a good beer", "Pours Golden like the state it’s from and with a nice white head. Nice punch of flavor starting slightly sweet and fruity, but heavy addition of hops turning this more aggressively into a pine resin and grapefruit note. Nice dry finish with some bitterness to linger there. The pinnacle of the west coast style.", "Ocena wystawiona na podstawie wspomnień z degustacji w ramach uzupełnienia profilu.", "Pite kilka miesięcy po butelkowaniu, więc nie buchało świeżością. Lekko słodowe, trochę owoców tropikalnych i cytrusów, wyraźna grejpfrutowa goryczka. Przyzwoity west coast i tyle.", "Ottima. Sapore deciso, amara 6,9%\nLascia in bocca un sapore amaro come la vita", "lattina 33 cl, bel cappello di schiuma beige fine persistente, colore giallo velato, al naso intenso frutta tropicale ananas passion fruit lemongrass resina e lievito, in bocca caramello pompelmo e uva, leggero astringente, corpo rotondo equilibrio perfetto con l’alcool, carbonatazione moderata, dolce con amaro accentuato lungo nel finale. Ottima. Stone le fa bene! c. COOP Tenero 26.07.19", "Bottle bought at Netto Helsingør, Denmark. Pours golden yellow with sweet fruity aromas and pine tree notes. Tastes dominated by sweet lemon that can be a little bit too much, but at the finish saved by nice dry hoppiness.", "Can (Berlin version). Hazy gold with white head. Aroma is hay and barnyard. Reminiscent of a Session IPA. Some sweetness with strong bitter finish. Lively carbonation. Something is off about the flavor balance, too sweet.", "Color amarillo anaranjado, con una ligera neblina. Dos dedos de espuma con buena retención. Aroma pino, pomelo y fruta madura con hueso. Gusto en la misma línea del aroma, añadiría notas herbales, amargor intenso y seca al final del trago. Cuerpo acuoso. IPA de manual, icono de Stone.", "Can 0,33L. Hazy golden color with big, creamy and long lasting white head. Aroma is fruity, but less than I expected to be. Taste is heavy bitter and hoppy as hell with long lasting aftertaste. It's so bitter, we can't talk about anything else in taste. Medium to full body, very dry, soft carbonation. Very close to imperial IPA style.", "Decent brewed IPA, especially within availibility criteria - it's possible to buy at every Tesco Express and other superstores in the UK.\nFresh aroma, the colour is pale and a little cloudy. \nStrong and heavy hoppy taste is a heaven for hopheads and it's the best advantage of this beer.\nThe hoppy taste reminds of West Coast IPA, however that and additional a high alc. percentage (6.9%) rather go towards to the Imperial IPA. \nGreat value for money though.", "Zdaje się, że to perfekcyjny West Coast IPA. Wytrawny, mocno żywiczny i cytrusowy, mocno goryczkowy, ale też wyrównany przez delikatny słód, przez co również pijalny. I to wszystko wyjątkowo intensywne. Po prostu super.", "Color dorada,opaca,espuma blanca,fina,alta,resistente.Aroma lupulada,citrico,pino,frutal,herbal.Sabor dominante amargor,citrico,pino,frutal,herbal,postgusto amargo prolongado,fresca", "Une ipa fidèle à sa réputation, plutôt excellente. Une belle amertume appuyée. Au delà des agrumes, on sent un caractère fumé, mais pas râpeux. C’est long en bouche et robuste mais ça demeure fin , pas écœurant pour un sou. Un peu forte mais ça apporte une rondeur très équilibrée. C’est top", "W barwie herbaciane, lekko tylko zamglone. Piana dosyć wysoka, biała, luźna. Aromat cytrusowy, herbaciany, może kwiatowy, niezbyt intensywny. W smaku lekki karmel, owocowość, mandarynki, icetea, przyjemna wyraźna goryczka. Bardzo dobry west coast bez udziwnień.", "pite jakiś czas temu. uzupełnienie profilu. Ocena przepisana z utpd. Miłego dnia.", "Sort of the “original flavor” type IPA and still one of the best years later. If you have skipped it thinking it would be generic you’re missing out. Extremely well balanced; a classic.", "Perfect IPA for hot summer, great aggressive and strong aroma and taste! Stone never disappoints!", "the aroma is fruity and hoppy with hints of orange, grapes, pine, tangerine, kumquat and spicy herbs... the taste is fruity and hoppy with notes of orange, grapefruit, pine needles, key lime and spicy grasses... the aftertaste is bitter, sweet and dry...", "Strong hop taste with serious bitterness. That's what an IPA should be, maybe could have been more pungent. Great example of the style nonetheless.", "Absolute classic. It's only by going through the whole New England thing that I've clocked how much I've truly love this and the West coast style. Aroma– Pine, pine, pine, big style, backed with caramel malts and some lemon rind. Appearance– Golden orange, with medium white head with loads of peerless lacing structure. Taste– The perfect balance of citrus fruit, caramel & biscuits with a cutting bitterness that makes it incredibly moorish and refreshing, but still carries a depth and complexity that few pales can muster, absolute perfection. Mouthfeel– Medium body, pretty smooth and elegant. Overall– Can't really be beaten as a west coast pale, they nailed it a long time ago, the benchmark. Always a great one to come back to, never fails to impress.", "Thuis uit een blikje. Goudgeel, helder, goed wit schuim. Een prima aroma, hop. Heerlijk bittere smaak. Betere ipa.", "Very peculiar beer!\nThe color is golden, slightly cloudy. The foam is thick.\nAroma pleasant, not especially bright, flower and citrus.\nTaste: Taste is simple and specific. Caramel, fruit. The bitterness is felt.\nAftertaste: hop bitterness", "Uitstekende Pale Ale van de onvolprezen stone Brewery in Berlijn. 6,9%, hoppig, grassig, veel koolzuur voor een prikkelende smaaksensatie 👍", "Riecht fruchtig nach Mango, Zitrus und Gras. Trübes hellgelbes Bier, sehr ergiebige große Schaumkrone. Der Antrunk ist sehr vollmundig fruchtig. Perfekt carbonisiert und eine sehr angenehme Herbe. Aromen von Harz, Mango und Honig. Sehr intensiv im Geschmack. Sehr gutes IPA", "ホップと柑橘系の爽やかさ、甘ったるくないキレッキレの突き抜ける爽快感。ガツンと来る苦味が口の中で暴れています。パンチの効いたビールが飲みたい時はこのガーゴイルにひっぱだかれたくなります。", "Pours a lovely clear orange amber with a foamy white head that laces the glass. Nose is stone fruit, marmalade, caramel malt and pine. Grapefruit and stone fruit initially dominates to be replaced by a firm spicy hop bitterness. Very nice balance between bitterness and sweeter malt notes. Definitely one to try.", "22 oz bomber poured into a pint glass. Gift from a house guest. Thanks house guest. From the first sip, knew this one was a winner! Try it ASAP, your poor ass will not be disappointed!", "From can (brewed in Berlin). Pours clear golden with a medium white head. Aroma of citrus, grapefruit, pines, caramel. Medium body with average carbonation. Taste is light sweet, over medium bitter. Very nice.", "Pours a clears gold. Not getting to much on the nose, peachy caramel notes. Packs more on the flavour, solid resiny bitterness, to balance a decent whack of malt which drives a sweetness.", "Ich bin kein großer Fan von Stone, da mir das Firmengeflecht zu undurchsichtig ist und man nie recht weiß, aus welchen Brewpub auf der Welt das Bier kommt.\nZu dem IPA kann man aber nichts negatives sagen. Ein tolles Bier mit schönen fruchtig-hopfigen Noten, ohne widerlich bitter zu sein.", "Bitter and fresh. Very decent beer, be sure to taste. Grapefruit bitterness in a taste and aroma.", "Ladna piana, złociste w kolorze, lekko mętne. Zapach i smak amerykańskich chmieli. Bardzo porządne IPA bez przesadnej goryczy", "Tap & Gollem, Amsterdam III 2019. Redelijk fruitig licht zoetige stevige IPA in precies de juiste verhouding. Combinatie van ananas en limoen met een stevige bitter en achterin citrus gras en lichte hoppige smaak die de doordrinkbaarheid niet in de weg staat. Mondgevoel is met zijn verschillende aspecten van fris zurig naar hop dan ook perfect in balans. Donker geel diffuus bier met witte schuimkraag. Ik begrijp dat het een klassieker is en heb meer klassiekers geproefd maar deze kan het echt waar maken.... Alleen gebrouwen in Berlijn maar bedacht  in Californië. Klinkt als Apple ontworpen design from Californië maar de in China. 😂 Ook de craftbier industrie wordt steeds meer geglobaliseerd. Maar waar ie ook bedacht is het blijft een Toppertje! Proefglas & Origineel glas", "28-03-2019; can; Bed 'n Beer Hostel, Belgrade, Serbia (bought at Jumbo supermarket, The Netherlands).\nDrank from the can, so looks are hard to rate. I poured a little sample. Looks like a nice golden amber, with a rough white head. Thats about all I can say about it. Looks like an IPA should look like. Not bad.\nThe aroma of the beer is nice. It is exactly as labeled: citrusy hop with a subtle malt aroma. The hops are citrusy, zesty and fresh. Tangerine, lemon and orange, together with tiny touch of pine needles. Very crisp and fresh and quite powerful. The malts brings just a plain malty base layer. It is quite nice. The beer is clearly a powerful IPA, but remains quite accessible. This is done pretty nicely. I like how they've done it. \nThe taste of the beer is good. It is a robust bitter beer. But, the bitterness is very well balanced by nice zesty citrus sours and some nice sweet malts. The bitterness is not overwhelming. I like this balance. \nThe palate of the beer is fine. Medium body, slightly sticky texture and medium-high carbonation. The finish of the beer is nice. It is filled with citrus, zest and just all of these lovely hop aromas. I really like it. All in all, it is the perfect beer for after a long drive. Or for any other occasion really.", "Poured from a bottle into a tulip.  Striking golden orange color with a moderate off-white head.  Beautiful lacing as I drink this.  Aroma is pine and grapefruit.  Moderate bitter, medium body.  Long bitter finish.  Very easy and refreshing to drink.", "Dufter ikke af meget, svagt citrus. Flot, blivende skum, en ofte overset detalje. Lækkert bitter uden alt for meget citrus i smagen. Men det er jo en AIPA.", "Big, bold and badass IPA. Copper, frothy head, citrus, pine, resiny, thick, dank, bitter, and hoppy as hell, delicious, straight down the line IPA. Quality.", "Barwa złocista, klarowne, piana obfita, ładnie oblepia szkło. Aromat chmielowy, nuta cytrusowa i ziołowa. Wyraźna goryczka, nieco zalegająca ale w przyjemny sposób, wysycenie średnie. Piwo dobrze pijalne, wytrawne, o chmielowym charakterze ale z nutą słodową w tle.", "0,33er Dose der Berliner Version aus dem Globus.\nHonigfarben mit leichter Trübung. Schöner, weißer Schaum. Wahnsinns Geruch nach Orangen, Kräutern, gemähter Wiese und Hopfen. Viel Hopfen. Kräftiger, hopfiger Antrunk, nach dem Hopfen etwas Restsüsse.  Schön ausgewogen. Frisch rezent. Im Ausklang schlägt die Hopfenbittere zu und klingt lange nach. Eine Referenz des Stils.", "Янтарное, непрозрачное, с довольно высокой карбонатизацией. Аромат типовой - тропики, фрукты, цветы. Довольно горько на вкус.", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "Pours a cloudy orange color with a thick white head. The aroma was of citrus and pine. Taste was grapefruit and hoppy. Bitter finish, but refreshing.", "Buena IPA, y viniendo de una persona a la que no le gustan especialmente, es mucho. Buen toque a caramelo, amargor Justo. Buena espuma. Muy rica.", "Beautiful almost clear yellow/orange pour with a huge white head. Grapefruit, tangerine on the nose, along with peachy tropical fruits. Taste is medium sweet, over medium bitter. Medium body with average carbonation. Nice bittersweet lingering finish. Good!!", "Aroma: lots of citrus, pine, and grapefruit. very hoppy.\nAppearance: clear amber color with a two-finger slightly off-white head.\nTaste: toasty malt, citrus, pine, grapefruit, medium-low sweetness, very high bitterness\nPalate: medium body, medium-high carbonation, very dry in the finish\nOverall: It's a typical west coast IPA featuring citrus and piney hop flavor. Nothing special, just another hop bomb.", "Klarownomętne złoto. Piękna biała czapa. W aromatach te ipowe cytrusy. Ogrom chmielu, daje o sobie znać chinook. Kwaskowość i moc, długa zdecydowana goryczka.", "19.2oz can pours a very light amber color transparent thick foamy head slow carbonation nice lacing smell of caramel piney hops fruits taste hops fruit grapefruit  caramel bitter taste lingers at the end no one flavor overpowers another delicious beer", "Pours a clear-ish amber, lots of carbonation and thin head that dissipates quickly. Light hops aroma with floral hops taste. Fizzy mouthfeel. Light plum fruit aftertaste.", "En god IPA. Har en masse smag af citrus, så jeg tænker amerikanske humler i den.", "Not much to add about this beer. Just a great example of a West Coast IPA . Great balance and drinkability.", "Nice on the plate, lots citrus notes. For an IPA it’s quite light also. Overall great beer, highly recommend", "Nose: smells like soiled concrete, with hints of moist pistachios and burnt pecknerwood... \n\nMouth: tastes like the food found in an unopened tomb, and has a very pleasant public pool-water aftertaste. \n\nBottle made out of glass: hard enough to break and threaten bartender for less hoppy drink.", "Stone Berlin, piana biała obfita, redukowała się spory czas, drobnoziarnista, uszyła firankę na szkle, duży plus. Barwa złocista, herbaty z cytryną, trunek jest przejrzysty. Zapach: rządzą tu przede wszystkim cytrusy - pomarańcz, pomelo, cytryna; do tego mamy jeszcze przyprawy (choćby pieprz), trochę lasu i słodkości. W smaku mamy ładny balans atakującej na początek goryczki, wraz z kontrującą słodyczą. Bez żadnego nadmiernego pozostawania na podniebieniu, tak jak być powinno. Piję się to wszystko z chęcią i przyjemnością.", "Classic. A beer with great ballance of hoppiness. Piny, some grass and herbs, great bitterness at the end", "Taken yesterday at Jay Peak at their general Store on their ski center, great tasty IPA after a great ski day.", "This is a good standard IPA. Pretty smooth flavor going down but leaves you with that stank ipa breath.", "Aroma: Medium citrus, pine, toffee. \nAppearance: Hazy, golden body. Large, white head, small bubbles, Fair retention. \nFlavour: Medium-high bitterness, Medium citrus, grapefruit, candied peel. Medium-light malty, bread. Dry finish with candied orange peel, \nMouthfeel: Medium body. Medium carbonation. \nOverall: A good IPA, with good hops and bitterness. \n\n330 ml can, poured. \n21A. American IPA.", "Can. Color: Golden, white head. Aroma: Malt, hop. Taste: Moderate to medium sweet malty nicely combined with a good amount of grassy and floral hopbitterness. Medium to over medium bitter. Long lasting finish. Subtle resinous notes and citrus hints. Crisp. Great Westcoast style IPA.", "Light beer with peach notes. Good bitterness,\nBirra chiara con note di pesca. Buona amarezza,", "Pours very hazy golden, topped with sizeable and lasting white head. Mild fruity nose with pine and lots of resin. Moderaze bitterness, herbal with hints of fruity sweetness. Nice, proper IPA. Not spectacular, but pretty nice.", "•Color: Entre rubia y dorada, levemente opaca, espuma blanca, con media retención. \n•Aroma: Medio bajo aroma a malta con carácter a grano dulce, aroma a lúpulos con notas cítricas y frutales, sin esteres ni fenoles.\n•Sabor: A Malta con intensidad media baja a media con carácter a grano dulce y leves notas a caramelo, sabor a lúpulos con intensidad media a media alta con carácter cítrico, afrutado ; amargor medio alto sin dejar aspereza, balanceada al sabor y amargor del lúpulo, con un final seco.\n•Sensación en boca: Carbonatación y cuerpo medio pleno.\n•Impresión General: Cerveza color dorada balanceada al aroma a frutos cítricos/tropicales y al sabor/amargor del lúpulo,la malta le da un buen soporte por su ligereza ,medio cuerpo y un final seco con alta tomabilidad.", "Wonderfully piney with peach notes and a hint of yeastiness. Assertive bitterness, perfectly dosed and with a tiny sweet edge. This beer is a little syrupy and yet juicey at the same time, almost perfectly balanced overall. Maybe carbonation is minutely too heavy, but that's my only complaint.", "Siempre es un acierto esta ipa de aspecto dorado sin turbidez.  Con buena espuma . De sabor ligeramentw amargo citricos . Un poco dulce en boca pero mantiene el sabor en garganta.", "As an iconic IPA, this is pretty good already. Only weak point is the slightly bland after taste. The citrus and pine flavor of the hops are beautiful and strong. However, I wish the after taste is matching it’s overwhelming first impression.", "Another one of those brews always thought I had prior.  Clear copper orange beer with foamy white head.  Nose is caramel and pine and citrus.  Trees of grapefruit, orange, malty, caramel, pine.  Classic west coast ipa.  Not all that bitter slightly sweet and dry.", "Ikonická IPA. Krása. Lehká, dobře pitelná, vyvážená. Není až tak moc nepříjemně chmelená, kořeněná, citrusová... zkrátka tak akorát.", "Favorite Beer at summer. very nice taste, and soft, but aftertaste is intensive", "Der absolute Klassiker. Fruchtig hopfig mit leichten Malznoten. Etwas Zitrusfrüchte mit ausgewogener Bitterkeit, während zum Schluss hin das leicht malzige durchdringt.", "Dank  aroma with subtle pine.  Copper color and thick white head.  Resinous hop bitter flavor with minimal sweet malt and  some grapefruit taste.  Dank, bitter, weed aftertaste", "Nice clear classic ipa. Had at brewery but never rated until now. Not too strong of a finish", "Pours a clear dark gold, with ample white head. Aroma of complex hops. Taste is rich, notes of hops and more. This is an excellent IPA. Thumbs up.", "Rating #666 on RateBeer and it looks like this brewery has some sympathy for the devil as well. Very decent ipa, lots of hops with some subtle sweetness. The devil is in the details...", "20oz on tap at the Gordon Ramsey's, Las Vegas. Aroma is light pineapple, light pear. Appearance is clear golden with a white foam. Taste is beer and light sweet. Full body. Great.", "Lukt: malt: , humle:skog, sevje, furu, mango, \r\nSmak: veldig humlete: skog, sitrus, mango. malt. karamel?, \r\nStram og lang bitterhet. Fløyelsmyk karbonering, \r\nEn sterk og tydelig IPA; Typisk west coast. Mye \"skog\"-smaker fra humla og en typisk caramel malt som grunnsteinen til alle smakene. Veldig god.\r\n7,9/10\r\nTappet på boks 180802 (fersk nok?)\r\n181124", "33cl fles. Helder goudgeel kleur, fijne romige witte schuimkraag. De geur is citrus en gras. Smaak is zoet, citrus, gras en dennen. Medium lichaam, veel koolzuur.", "330ml Can. Classic West Coast IPA.  A genre redefining beer. Caramel, amber coloured pour with a pure light white carbonation.  Bitter, clean. Incredibly complex layered citrusy hop flavour. Lightcl and very drinkable.", "I really like IPA's so this one is really good. It's 77IBU's is a little misleading, it definitely tastes like it or maybe a little more, but not overly bitter. The roasty malt backbone holds this beer together.", "Notas de pomelo, piña y resinosas. Bastante turbia. Cuerpo medio y textura aterciopelada. Bebestibilidad media. Buena IPA, aunque no deslumbrante.", "330 can at the Craft-Beer Mile, Ruse on 3 November. Pours almost clear with a thick fluffy head, plenty of lacing and slight, coarse, fast-rising carbonation. Gold in colour. On the nose, complex citrus, cumquat marmalade, rye bread. In the mouth, quite bitter with some astringency from the start but which eases though the palate, flavours similar to the aromas but less intense, some sweetness and alcohol presence, smooth - thick texture with a fairly long finish. Overall, the richness and intensity of a DIPA without the alcohol - what's not to like about that?", "It's got fruity bitterness and a long, dry finish. Let down by it's obnoxious hop taste which makes it difficult to drink. I love ipas but this seems to overdo hops. Which I didn't even think was possible", "Definition of the modern IPA. Hazy gold, aroma of peach and grapefruit. Taste has hops to the fore, and then some balancing malt sweetness. Medium carbonation. A very fine thing.", "W zapachu slodko, cos jakby pomelo, mango, marakuja. Biała jak śnieg piana, drobnopęcherzykowa, nawet sie nieźle trzyma. Barwa piwa slomkowa. Klarowne, aż za klarowne. W smaku dużo słodyczy od chmielu. Od slodu słodyczy brak. Goryczka wyczuwalna juz w pierwszym lyku.", "Hops smack you in the face straight away, before the slight malt sweetness soothes just enough to allow you to take another swig. I like hops but this is a difficult one to drink. Proper happy to see it in the supermarket though, a cracking example of a hops forward IPA.", "W aromacie swieze i przyjemne cytrusy, calkiem intensywnie; grejpfrut.\nZe szkla ponadto slodycz, wrecz lekka mlecznosc, kwiatowosc i owocowosc.\nLadna piana, barwa niemalze slomkowa.\nKlasyczne cytrusy, mango, calkiem pokazna mandarynka, leciutki karmel, biale winogrona, slodycz. Goryczka od pierwszego lyka wyczuwalna. Wytrawne.", "W zapachu trawa cytrynowa, grapefruitowa goryczka, lekka mleczność, kwiatowa mdłość.\nPiana biała, szybko znika. Piwo złoto-miodowe. \nWinogrono, mandarynka, sroga goryczka łączy się z owocową słodyczą. Wytrawne. Dobre wysycenie.", "Can, 330 ml  Stone goes big. I've tasted the big boys of the brewery, so it was the time to taste the basic. Looks a bit hazy golden, good head and devent carbo. Typical IPA aromas, peach skin and grapefruit. Moderate IBU, it comes mainly in the long aftertaste. Great one, i can't say even one bad word about it...", "Very aromatic IPA. West coast at it's best. Great body and excellent aftertaste of flowers", "0,33l can. Pours near clear golden with white head. Aroma of citrus, spruce, tropical fruit, your typical west coast IPA. Taste is fresh, fruity, tropical fruits, citrus, slightly resinous, crisp bitterness from the hops, slight malt sweetness. Great stuff.", "Dåse øl købt i fakta 10 kr på bud. Fantastisk IPA til pengene også når det gælder fuld pris. God bitterhed og eftersmag en af mine yndlings IPAer.", "Appearance Hazy yellow, small white head, some lacing \n\r\nAroma Grapefruit, orange, citrus fruits, not offensive but very one-dimensional. Some hints of fart \n\r\nTaste Mildly sweet, bitter, unbalanced \n\r\nPalate Medium body, medium carbonation", "Gylden farge med medium høyt hvitt skum. Aroma av ulik frukt. Nydelig smak, sitrus og andre tropiske innslag. Deilig bitter.", "Amber with white head. Aroma sweet exotic fruits. Taste dry and bitter, too hoppy for me.", "Desde una lata, en cuanto al aroma se lograron apreciar notas a frutos tropicales, notas a pino y resinosas de lúpulo, destacando un carácter cítrico y a piña. Esta es una cerveza con un balance excepcional, el soporte maltoso es complejo, incluso dulce, y armoniza perfectamente con el carácter lupulado que predomina otorgando un amargor agradable en boca (a pesar de sus 77 IBU) y con un retro gusto complejo, duradero y por sobre todo agradable. Referente de West Coast IPA.", "J'en ai acheté 4 canettes, bien m'en a pris. Cette ipa \"gebraut in Berlin\" est excellente. L'odeur est forte en fruit, du corps, de la résine et du fruité, de l'exotique, belle amertume. Je ne sais pas dans quelle mesure sa notation dans le top 50 m'influence. Toujours est-il qu'elle est très bonne. L'amertume est agressive.", "Robe orangée, limpide, avec un peu levure en floculation (gros flocons). Nez très houblonné, principalement sur les agrumes (mandarine, pamplemousse), légèrement herbacé. En bouche, l'attaque est amère, aux notes d'agrumes, avec cependant un léger corps, même si l'amertume prend le pas. Une IPA très typée, et réussie.", "IPA de estilo californiano, muy lupulada, cítrica y frutal. Bien balanceada con un toque leve a carameloz", "Dorada, ligeramente nebulosa, generosa espuma efervescente. Intenso aroma a lúpulo, olor a campo. En boca es punzante, buen punto de gas. Intenso amargor de principio a fin. Rico sabor con notas herbales y sobre todo frutales, uva, pomelo. Bastante potente.", "Dåse. Let mørk gylden, kraftig skummende, som dog svinder til tynd ring. Aroma er humlet. Smagen er lidt grape bitter humlet, sim aftager lidt, lidt ensformigt, men ok.", "Canned 0,355L. Clear and bright orange crisp and lively color, bubbly and fraught aspect with creamy white head of medium duration. Intence citrusy and cortex aroma, notes of pine, grapefruit, orange, tangerine. Crisp and lively mouth, equilibrate alcoholic and sweet malty taste, notes of aged and riped grapes, orange, pine and resin.", "Pours a clear, clean pale golden color. Fluffy white head with tiny compact bubbles with a moderate head retention.\r\nAroma of oranges dominates with a hint of pine.  Slight grainy malt smell.\r\nFlavors of citrus (oranges) with very low malt sweetness.  \r\nAggressive bitter hops.\r\nLow carbonation on the palate, long bitter and very dry finish. \r\nThis is a beer with a narrow audience - those who love very hoppy, bitter beers.  It is on the high side of the bitterness scale and taste for an IPA. So if you love highly bitter IPA's, go for it, this ones for you.  If you prefer a more standard IPA or one on the lower side of the IBU scale, don't try Stone IPA.  Nothing against Stone Brewery, they are a great brewery.", "Solid Pale Ale. Very hoppy. Flavoures are hoppy, malty with citrus aroma, ant they are making real mess in you mouth with so much alchohol. Golden color with medium head. Refreshing beer.", "Bardzo pozytywna IPA, klasyka gatunku. W smaku czuć po troszkę najważniejszego. Chmielewska, lekkie cytrusy, goryczka. Wszystko perfekcyjnie wyważone", "Aromat trochę za mało intensywny, ale przyjemny, ziołowa goryczka w punkt. W smaku bardzo stylowo, bez fajerwerek, ale klasycznie. Karmelowe, chmielowe, ale goryczka mogła by być mocniejsza. Tak jak napisali - definicja stylu, ale nie wyróżnia się :)\n\nJak trochę potrzymać (3 miesiące po rozlewie) to w aromacie wychodzi lekki skunks. Reszta dalej na poziomie. Przyjemne ciało.", "Tingly grapefruit pith with floral, piney notes over a medium but not overpowering caramel malt base. Herbal, floral bitterness that lingers. Deliciously soft thick mouthfeel. Golden and retains a frothy head and lacing throughout. Absolutely nails the style. Only wish I could try one that hasn't travelled.", "Canned. Clear golden color with small white head. Smooth bitter hops and citrus aroma with strong floral notes. Medium and light dry body with lasting bitter hop aftertaste.", "Puszka (Berlin). Piwo miało lekki aromat owoców tropikalnych i cytrusów. W smaku bardziej mango, trochę cytrusów i goryczka grejfrutowa mocna ale niezalegająca. W smaku pojawia się przyjemna słodowa ciasteczkowość. Bardzo smaczne piwo.", "Draft beer from hotel bar in Denver, but I’ve had it from cans before. Strong hoppy flavour, but easy drinking.", "Can, 0.33l. Brewed in Berlin. Hazy copper pour, one finger frothy white head. Nose is caramel malt and citrus fruits, vague honey.\r\n\r\nMedium body, soft carbonation. Very soft mouthfeel, texture has really pleasant thickness to it. Herbal bitter peppery taste. Caramel malts in the background, grassy hops, citrus fruits. Strong herbal notes, spicy. Slight alcohol burn. Long finish, dry with lasting strong bitterness. \r\n\r\nOverall, pretty good IPA. Bitter and tasty.", "Découverte en pression à Vienne avec mon cher appiantiqua .\r\nSuperbe robe orangée surmontée d'une mousse vanille bien veloutée.\r\nLe nez est sur les agrumes(citron) et fruits tropicaux(mangue)\r\nLe goût est corsé avec des notes épicées et poivrées,des saveurs fruitées et houblonnées.\r\nLe palais est long et frais.\r\nUne bonne PA de caractère!17/20", "Color anaranjado, poca espuma y poco para ser una IPA. En boca es algo oleosa, con un sabor a lúpulo muy particular que deja paso a un amargor muy pronunciado. La burbuja es muy fina y agradable. Muy buena.", "Can 33cl. Small white layer. Cloudy light orange color. Aroma is hay, nettles, flowers, hint of cabbage. Taste is bitter", "Dégustée en pression à Vienne en compagnie de mon petit Kittenbieer.\r\nTempérature de début 6 à 7°.\r\nSuperbe robe orangée translucide, mousse vanille, bonne carbonatation.\r\nNez : agrumes, orange, mangue.\r\nGoût ultra houblonné, poivré, épicé, fruité.\r\nFinale longue et fraîche.\r\nSuper IPA!!!\r\n17/20", "Ar: tropical fruit, grass, hops Ap: orange, creamy rocky head, clear T: med/high bitterness, med malty sweetness P: med body, long finish", "W aromacie las sosnowy tak intensywny, że na pograniczu syntetycznych aromatów. Bardzo przyjemnie jasne, z piękną czapą piany. W smaku mocno wytrawne, ale z podbudową słodową. Goryczka pojawia się już w pierwszym łyku, mocno żywiczna. Cytrusów brak, ale ma to wszystko swój urok. Bardzo przyjemne", "Aroma is Pitney with a little citrus \r\nMalty like bread crusts. A little water cracker on the finish.", "7/31/18\r\nWith A on Taco Tuesday!!\r\n\r\nPoured from can. Deep slightly hazy yellow with a moderate sticky head. Label is killer as always for Stone beers!\r\n\r\n Nose is a citrusy hop assault. Tons of grapefruit pith with some nice dank notes as well.\r\n\r\nTaste is a bitter hop bomb.Bright and very flavorful. Grapefruit pith dominates, shining brightly over lots of other floral notes and a touch of cracker-malt that rounds out the flavor nicely. Strikingly bitter in the best way with just a touch of sweetness.\r\n\r\nPalate is lively and crisp. Medium light. Wonderful pithy bitterness lingers.\r\n\r\nOverall, I can't believe I haven't tried this before now, but it definitely blew me away. Haven't been huge on some other Stone produces I've tried but this one is just about a perfect IPA. All of the bitterness without the funky/off flavor I taste in something like Arrogant Bastard. Phenomenal beer!!", "amber, hazy, sparkling, frothy, medium sweetness, lightly bitter, full body, oily feel, average carbonation, bitter, long finish, hay, nuts, grass, citrus, herbs, woody,", "Piney aroma. Some malty sweetness balanced by  medium bitter running through. Lasting bitter finish. Clean quality beer.", "From can to snifter. Pour is a transparent orange/yellow, thick white head. Nose is huge hops, citrus, light floral note as well. Taste is medium bodied, bitter with a rounded out sweetness. Finishes crisp on the mouth, juicy ending. Staple IPA.", "Can - Golden orange with large white frothy head. Good pleasant citrus aroma. Good mouthfeel. Ok tasting - citrus with a good tang. Ok beer.", "Ocena na podstawie wspomnień z degustacji na potrzeby uzupełnienia profilu.", "Piana obfita, opadła szybko do 0,5 cm. Jasne złoto,opalizujące. Piękny aromat cytrusów i żywicy. Żywiczna goryczka, sroga już w pierwszym łyku. Cudnie. Nie ma co się rozwodzić, wzorowa klasyczna west coast ipa. Brawo", "On offer at a local Netto.  Slightly hazy, dark golden in colour. Aroma of overpowering hops (in a good way) quite bitter (as a good IPA should be) smell of citrus and pine. (Pine is an absolute favourite of mine) all in all, 9.9/10. On the slightly too bitter side for me.", "Birra color oro acceso con schiuma fine e persistente. L'amaro compre quasi tutto ed è difficile sentire altro. Inoltre in bocca l'amaro si presenta subito ed aumenta nel retrogusto. L'amaro rimane in bocco per molto tempo. Retrogusto erbaceo e un po agrumato. Una birra ottima, la consiglio.", "Can’t remember too much about it honestly other than it was one of my favorite IPAs, I’ll have to pick it up again soon.", "Dark gold colour with white head. Citric and resines in aroma and flavour. Tastee in Olut Club de Cata", "Smells of citrus hops. Light in color, and a little hazy. Decent white head. Citrus, dry, pine, and good hop bite. Some lemon flavor on the back end.", "Appearance is golden yellow, no foam, little carbo. Aroma was hoppy and malty. Taste is medium-high hops! Nice beer!", "Clear golden with long lasting low white head. Sweet aroma of herbs .  soft carbonation & a bitter finish.", "Can brewed in Berlin, bought at Biervana in Munich. Nice head at first that doesn't stick around. Slightly hazy orange color. Funky dank pine resin nose with some fruits and citrus. I know it's a classic - but it's just too bitter with too little remaining sugar to balance it. The aftertaste is like you've just sucked on an underripe grapefruit, and it just doesn't go away. This beer and others like it are why I didn't touch IPA for years. Nevertheless it's a nice blend of hop flavors, if you like that overpowering bitterness along with it.", "0.33l can from Stockmann Tallinn, brewed in Berlin. Pours deep orange, super foamy head. Canned in January (drinking in June), still time until BBD but foam and nose already hint that it could be fresher. Lightly malty nose, fruity hops, some plastic. Tastes medium-bodied, good level of bitterness, not too much, not too little. Some softer fruits and finishes with longer bitter linger. Relatively simple IPA, solid but not overly exciting.", "Poured from bottle into glass. Hoppy aroma, bordering on skunky. Not as complex in flavor as I prefer my IPAs but nothing to complain about, quite bready and yeasty with subtle notes of grapefruit and citrus, pine, and pleasant malty background. Has a nice light, crisp mouthfeel and easily drinkable even after it warmed up a bit. Slightly dry, metallic finish. I think I'll try it again, but I'll look for a fresher batch.", "Mousse épaisse sur une robe jaune soutenu. Ronde et équilibrée, elle laisse derrière un arrière goût très houblonneux qui se termine par un peu d'acidité.", "Goldgelbe Farbe, im Geruch Mango und Harz, im geschmack hauptsächlich floral, Harz, Fruchtigkeit steht nicht im Vordergrund, fast schon ruppiger Abgang mit anhaltender Bitterkeit", "Light hazy orange golden with a white head. Mango, maracuja, light ananas, lime, resin, grapefruit, burnt coffee, wood laquer. Penetrating medium to heavy bitterness, medium sweetness, light sourness. Medium carbonation, long dry bittersweet finish. Not a special IPA apart from being a little too bitter.", "Helle, ganz leicht trübe Farbe, viel fester Schaum. Sieht schon super aus, so riecht und schmeckt es auch! Dicke Portion Hopfen schon in der Nase, sehr fruchtig (zitrus, Mango,  allgemein Tropenfrüchte), etwas florale Noten mit dabei. Geschmacklich ebenfalls wieder richtig starker und auch fruchtiger Hopfen, 'grasig' florale Note und leicht malziger Geschmack. Außerdem sehr bitter (71 IBU) und trocken auch im Abgang, was mir sehr zusagt. Für mich ein richtig gelungenes IPA, was für teilweise unter 2€ die 0,33 Dose fast schon unschlagbar ist. Auf der Dose heißt es 'Iconic west coast style IPA' - das trifft es für mich gut.", "Canette de 33 cl \"gebraut in Berlin\". Couleur : dorée, mousse blanche éphémère. Odeurs : agrumes, litchee, pin, houblons. Saveurs sur le fruit/agrume (orange amère), fruit exotique (ananas ...), un peu de caramel et de résineux. La carbonatation est vive, bonne longueur, finale sèche et grosse amertume. Bonne IPA", "Can. Hazy golden with an off white head. Aroma of tangerines and dough. Flavour is packed with citrussy sweetness and a strong bitter finish.", "Original rating: somewhere in 2017\nHow: can\nColour: golden\nHead: frothy, white\nAroma: citrus& tropical fruits, parfym, pine, some very slight notes of grass\nTaste: medium body, medium/ heavy carbonation, rich& complex hop aromas: citrus& tropical fruits, pine, long bitter finish.\n\nRe-rate:\nHow: can @ Himos cabin. BB: 10.03.21, canned one year earlier. Tnx monopoly store. US version.\nHead: with careless pour, four fingers. White.\nColour: hazy dark golden.\nAroma: really ripe citrus fruits, slight tropical fruits, caramel, bread, resinous, pine. Quite dank.\nTaste: thin to medium body, average carbonation, taste follows aroma. Not as bitter as aroma suggested. Resinous bitterness.\nCitrus fruits& resinous bitterness in long aftertaste.\nReasonably well aged.\n6-5-6-4-14", "2/18/18: Purchased 16 oz draft pour with the Cheeseburger, Onion Rings and Beer $19.95 Special at Burger Brasserie in the Bally's / Paris Walkway. Murky orange pour, white puffy cloud head. Firm hops aroma, citrus offsets the hops. Firm hops taste, pleasant bitterness, citrus slightly offsets the hops. Thin mouth feel, easy drinking. Overall very good IPA.", "330ml can. Pours a mild gold with fluffy white head. Large biscuity nose with subtle hops. Medium body with a distinct malt front which is eaten away by American hops. Has an acidic after taste, may not be in the best condition.", "Golden with a dense and huge head. Citric aroma with strong notes of pine and lemon. Bitter and dry hoppy taste that lingers for minutes, with a fine malty base in the background. Highly drinkable. A beer that never ceases to amaze me.", "330ml can (6.9%) at home on 29 Apr 2018, present from Andrew C (bb 3 Nov 2018): resiny, orange, eggy aroma, golden amber, lively white head with micro bubbles, orange, boiled sweets, some caramel, some citrus, viscous, bitter citrus hop finish.", "From a 330ml can, truly an awesome drink. Nice balanced fruity notes, that turn to a full on hoppy taste. This is one of the best IPA's I have had.", "Refrescante, amarga límite sin saturar, espuma justa, aroma suave y agradable, se siente espesa al tomarla, exquisita !!!!", "Аромат довольно слабый, сухой, хвойный, цветочный. Пена обильная, довольно стойкая. Во вкусе умеренная горечь, хвоя, цветы. Послевкусие очень горькое, однако не такое сухое что плюс.", "resin, floral, grass, spruce, citrus, herbs, cereal, hay, caramel, light sweetness, medium sweetness, heavy cloying sweetness, lightly bitter, medium bitterness, very bitter, lightly sour, medium sourness, heavily sour,", "It's a toss up between Bell's Two Hearted and this as my top standard IPA. This is a bit lighter on the malt, and maybe a tad more bitter and hoppy. Nice citrus flavor too, but not overwhelming. Very smooth mouthfeel. Light orange semi-clear appearance. Haven't had a Stone yet that I didn't like (a lot). Probably not as good as the Ruination, but lighter and a better price.", "330ml can. The first time I had this, it was one of my first IPA's. It almost blew me away, being so unexpected that I actually wasn't sure whether I liked it or not. Having it again now, for the third time almost a year later and having sampled quite a few other IPA's in the meanwhile, I can appreciate that this is quality strong beer. It's lively, with herbal flavours, sweet citrus and hops, followed by a lingering dry bitterness. It's slick in the mouth. Maybe one day this will be the minimum standard for my IPA's and I'll then think it boring, but not today, not for me. This is great.", "On draft @ Tap craft beer bar Robertson Quay \n\nLight, yeastie, Bread and slight grapefruit aromas. On the palate very distinct malt, dry hops, and slight hints of lemon. Medium light bodied and pretty easy drinking despite ABV.", "Tap ADT.  Clear golden orange with a frothy, lasting white head and good lacing. Citrus, light grapefruit, gooseberries with bread and caramel.  Medium body, medium carb.  Lingering crisp, bitter finish.  Excellent.", "Cloudy golden color with medium, white head and low retention. Aromas of pineapple and ripe mango with herbs notes. Malty taste and hops on the earthy side, with a corrosive and persistent bitterness, pine notes. A perfect IPA for every day and an instant classic.", "Caramelo bien marcado. Aroma poco intenso, amargor marcado y tapado con el toque final de caramelo\n\n---Rated via Beer Buddy for iPhone", "Can. Hazy golden copper color. Thick creamy head. More Bitter than usual IPA. Lower fruit tones. Bit Harsh Beer.", "W aromacie chmiele, cytrusy, iglaki; w smaku owoco, żywicznie, mocno chmielowo, średnia goryczka; bardzo przyjemne piwo.", "330ml can. Deep golden in colour. Pours a 2-3 finger white head, that dissipates quickly, big spacious bubbles. Fresh lemon is dominant on the aroma, slight pineapple, little bit of fresh orange. Toasty caramel, sweet-ish notes coming through. Lovely pleasant bitterness. Balanced Brilliance! By no means is this mind-blowing, just wonderfully drinkable. For the 6.9 abv, I think a lower abv could reach this level of perfect balance. So, in that respect, the balance lets it down, I needed the flavour or the bitterness to be a bit more raging to justify a better score. Cannot reach the top with 'nice'!", "Puszka 330 ml. Iconic West Coast (strong) IPA. Doskonała IPA, wszystko tu jest takie jak powinno. Duża goryczka, mocna moc; fajny wygląd i ogólnie wizualna część produktu. Mętne, wysycenie w normie, duuuża pełnia. Sztos.", "12-ounce bottle from a 12-pack sampler pours slightly hazy yellow-gold with small creamy off-white head and lacing, along with lots of visible carbonation rising in glass. Aroma: not much, yet some faint bittersweetness. Flavor: malt forward (honey, light brown sugar, toffee) along with a medley of citrus fruits in sweet syrup, nuts, pine. Mouthfeel: medium-bodied.", "Berlin version, tap at Fakin. Amber body, white head. Lovely lemon-lime notes in the aroma, backed by light candyish maltiness, but quite clean and well balanced. Perfumey, lemony-herbal taste, again backed by the slightly candyish maltiness, ending bitterish and a bit dry. Very well executed, very good beer, but I've honestly expected far more.", "Espuma de buena calidad,color oro, espuma de calidad se conserva bien su aroma mango y olor lúpulo particular. Sabor amargo característico de la típica IPA y sus 6,9 % bien equilibrados.\r\nEn definitiva, una Indian Pale Ale recomendable", "Una IPA de les de sempre... però que no aporta gaire novetats. No és de les millors de Stone", "Can brewed in Germany. Clear dark yellow beer with white head. Aroma is kind of light, mostly hops. Taste is again mostly hops. Very dry and bitter, also bitter aftertaste. Drinkable but kind of boring.", "Una IPA bastante suave, lo que hace que se pueda tomar fácilmente. Espuma gruesa y un agradable sabor. Esteticamente la botella esta muy bien.", "Pale golden color...\nAroma with noticeable hops...\nTaste with caramel and bitter hoppy finish.\nNice IPA from Berlin", "This is the standard for IPAs. There are some better ones out there, but when you are the benchmark for all IPAs, folks get up early to challenge the thrown.", "Aromat jest średniointensywny, nic nadzwyczajnego - głównie las, żywica, iglaki. Za to goryczka zabija! Jest bezkompromisowa, ale nie przesadnie zalegająca, pestkowo-łodygowo-ziołowa. West coast nigdy mnie nie powalał, ale tutaj smak naprawdę wymiata.", "Wygląd: Barwa jasnozłota, średnio opalizująca. Piana biała, średniej wysokości, zbudowana z różnych oczek z przewagą średnich pęcherzyków, opada do ostatniej warstwy pozostawiając lacing.\nAromat: Średnio lotny. Na średnim poziomie cytrusy, cytryna, limonka, pomelo, pomarańcza wraz z owocami egzotycznymi w postaci melona, kaki, nuty ananasa oraz żywiczności. Całość uzupełniona słodowością chlebową z akcentem tostowym na średnioniskim poziomie. \nSmak: Również średnio intensywny, zdecydowanie na pierwszy plan wysuwa się żywiczność, sosna na średniowysokim poziomie, kosztem cytrusów, owoców egzotycznych i słodowości ze składowymi z aromatu, które występują na średnioniskim poziomie. W ustach półsłodkie, treściwość średnia, gładka z odrobiną lepkości, wysycenie średnie. Goryczka średniowysoka, żywiczno-grejpfrutowa, średniej długości, zdecydowana, ale przyjemna. Finisz półsłodki z przyjemnie zalegającą żywiczną goryczką średniej długości.\nOgólnie średnio intensywne, choć nie można porównywać z dzisiejszym trendem DDH, bo to inna bajka. W aromacie za dużo słodowości, smak zdominowany przez sporą, ale przyjemną żywice.", "Bottle.\r\n\r\nBeautiful lacing contributes to the impressive mien. Citrus. Pine. Fruit hints. Subtle hop hit.", "Stone IPA is another classic west coast ipa in this day and time filled with NE and juicey IPAs. Love these throwback styles . Very similar to the Dry County IPA I tried a week or so ago. Stone is always putting out 1st rate products.", "Złote, opalizujace, piana drobna, powoli redukuje do trwałej cienkiej tafli. Wyraźna chmielowość, białe owoce cytrusowe i iglastość. W smaku początkowo jest zarysowana baza słodowa, potem daje znać wytrawność i chmielowy smak, goryczka jest wyraźna i wysoka, żywiczna, nieco długa. Nasycenie średnie.", "Aroma of fruits, citrus and hints of grass and grains. Golden with a white head. Medium sweet and medium + bitter. Medium body with a average carbonation. Dry and bitter finish. Overall an OK IPA, but a bit on the boring side.", "0.33 can\nC: light amber gold\nN: honey, floral, malt, caramel\nP: strong honey presence, heather, light orange bitters", "Can. Pours orangey with white head. Malty, spicy and bitter at the end with a slight alcohol kick. Really good, no hint of unpleasant tastes here.", "4 month old can > wine glass, 1 week until Enjoy By.\r\nA: Cloudy light orange gold pour with 1/4\" of beige foam that quickly fell to a film, leaving tracks of lace.\r\nS: Light scent of mainly pine, tangerine and toffee. A little alcohol and wood.\r\nT: Bitter grapefruit pith and orange pulp with caramel and wood malt notes.\r\nM: Medium body with crisp carbonation and wet resinous finish.\r\nO: Pretty good all around IPA.", "Lekko zmetnione, trwała piana. Aromat słaby, trochę żywicy i owoców, zboże. W smaku fajniej, dość sporo owoców i iglaków, półwytrawne. Goryczka średnio niska jak na IPA, dość krótka, owocowo pestkowa. Nie czuć tego 7% alko. Trochę przereklamowane", "12 oz bottle at Il Birrificio Camberwell Vic. Pours hazy apricot with small white head. Aroma is big, tropical fruits with a little citrus. Flavour is dominated by bitter hop hit. The solid malt backbone provides plenty of support for the hops. Taste is strongly bitter with reasonable sweetness underneath. Palate is thick with a slightly creamy or oily mouthfeel. Lasting residual bitterness on the front and mid palate. Overall a very good big IPA. Not easy to find in Australia but worth the hunt.", "Orange brass in color, medium carbonation. Too much pine and lingering bitterness for me, the bitter aftertaste will stay with you a while. Decent carbonation and retention with the lacing. Not enough smoothness and fruitiness, straight pine and bitter. While I will call it a very good IPA it's just not one I come back to very often. I did today and so the review. Still very good if you're a fan.", "Aussehen : Gold Gelb, leichte Trübung / Schaum : Feinporig, weiß, langer Stand / Geruch : kräftige Mango, Zitrusnoten, leicht süßlich / Geschmack : hopfig, Zitrusnoten, alles recht mild, Abgang recht bitter", "Sweet aroma of herbs & clementine. Clear golden with long lasting low white head. Light sweet & medium bitter taste. Full bodied, oily texture, soft carbonation & a bitter finish.", "Color dorado, buena retención de espuma. Amargo sabroso y sabor a hierbas y pino. Muy buena!", "De Stone Brewing Co.(E. U. A.)esta iconica IPA sandieguina, bautizada simplemente como “Stone IPA” tiene 6.9% ABV y 71 IBU's, contiene una variedad de lúpulos tales como Magnum, Chinook, Centenial, Azacca, Calypso, Motueka, Ella y Vic Secret, una de las primeras IPA's con ese punch de amargor que desataron la fiebre por los lúpulos, este año está popular receta cumple 20 años en el mercado, probemos esta IPA de la vieja escuela para juzgar como a evolucionado el estilo y como a envejecido la misma receta. \r\nEn apariencia mantiene una corona de espuma delgada con mediana retención formada por perlas medianas, actividad de carbonatación mediana, color dorado claro de aspecto filtrado, cuerpo ligero al ondearlo en el vaso. \r\nEn nariz presenta una intensidad bastante clara y enfocada a los cítricos, principalmente aromas a toronja, naranja, piña, resinosa, quizás no tan compleja pero si muy marcadas todas las nota, lo suficiente para dejar claro que por lo menos en este aspecto es una IPA cumplidora. \r\nYa en paladar presenta un  amargor potente hasta algo desbalanceado creería yo acompañado de astringencia que si puede llegar a molestar, ligero dulzor, los sabores encontrados son a cáscara de toronja, naranja verde, piña, resinosa, satura el paladar de inmediato, presencia de cuerpo ligeramente mediano, retrogusto de permanencia basta en donde predomina la toronja, como dije algo desbalanceada permanece en el mercado como un clásico y es buen ejemplo del enfoque o balance que se buscaba en una IPA hace 20 años, hoy en día el mercado pude IPA's con amargor marcado pero una buena base de malta que las haga más balanceadas y se pueda apreciar más claramente todos los componentes en el paladar.", "Vycap B33R. Zlata farba, husta biela pena. Vona sladova, citrusova, jemne mango. Chut sladova, hutna, citrusove tony, mango, mandarinka. Horka dochut. Prijemne", "A bottle from Jasons, near NCCU. Aroma: rather indistinct yeasty, surprisingly uncitrusy. Appearance: clear amber, 1mm. off-white head. Palate: Medium-bodied, rather thin, average carbonation,pretty astringent at the finish, but less so than the 'go to...'. Taste: heavily bitter, much less grapefruit than the 'go to...'., higher ABV unnoticable, not my cup of tea.", "Pivo u limenci. Ovi iz \"Pivovare Kamen\" se hvale da je to jako popularna IPA u njihovoj zemlji. To mi je prva IPA \" koju sam uspio probati a koja dolazi iz U. S. A  , zemlje u kojoj je nastao taj (dorađeni) pivski stil koji dominira u Craft pivarstvu , i još je na Top 50. Ukratko , pivo ima klasičnu citrus&hop aromu. Pivo nije pregorko. Gaziranost je srednja. Ali sve u svemu, očekivao sam više od tijela i balansa. Vrlo dobro pivo , ali ne i odlično.", "Served in can on Amtrak travel, mostly fresh and consistent with current canned options in stores and bars. Strong bite IPA higher bitterness index but a fave for those who are ok with that.", "Keg @ Trades Club, Hebden Bridge. Golden with a thin head. It's a hoppy ale, flavoursome, with a strength including caramel in its nose and lingering finish.", "Puszka 0,33 l. Wypita 15.01.2018. Piwo uwarzone w Berlinie. Barwa złota, delikatnie zmętniona. Piana biała, gęsta i trwała, ładnie osadza się na szkle. Mocny cytrusowy aromat. Poza tym bliżej nie określona, nie zbyt fajna nuta, trochę jakby stodoła. W smaku potężna goryczka, ale też sporo słodkości, takiej klejącej. Konkretna ilość cytrusów, przede wszystkim gorzkiego grejpfruta. Wysycenie średnie. To piwo jest naprawdę dobre, choć nie jest idealne.", "Berlin brewed can. Medium white head with good retention. Hazy gold body. Grapefruit, pine resin, alcohol, biscuity malt, herbs, green grass, honey, citrus, raw cookie dough, fruit, B vitamins, iron. Taste is bitter, tangy, tannic and some slight umami. Dusty dry finish. Good.", "Piwo w puszcze 0,33ml. Piwo w aromacie trochę słabe, czuć coś niepokojącego. Ogółem piwo nie jest złe.", "Can 330ml at home. BBE 2018-09-07, canned 2017-12-11, Berlin brew. Clear  golden, off white head. Classic WC IPA. Malts, fruity hops, grapefruit, caramel, pine. Medium bodied, average carbonation, bitter finnish. Original rating 2008-10-15 from bottle at The Belamar Hotel Manhattan Beach CA 8-3-8-3-14.", "From a can from the Berlin brewery. Floral, herbs, mild lemongrass, pale, hazy, minimal head. Light sweetness, medium bitterness. medium body, oily feel, soft carbonation, bitter finish.", "golden shower,bitter, some fruits,a bit sweet, bitter aftertaste, oke, but not at their\r\nbest", "On tap, clear amber-copper. This one is quite bitter. Not very floral, but the citrus taste is there. The crispness really carries it.", "Pours a golden amber with a white head from the tap. Citrus and pine aroma. Crisp and very hoppy with a lingering bitter aftertaste.", "Berlin can. Aromas of malt, hay and subtle grapefruit. Taste is quite bitter with some malty sweet and metallic notes. High carbonation and medium-full body. Long lasting bitter aftertaste. I believe one of the reasons Stone Brewing went to brew in Berlin was to prove a point that Americans can make good or even better beer than the Germans. They failed to do so with this one.", "Flagship of Stone brewery. All beer I tasted in Berlin, and they are actually brewed in Berlin. This one is very good,  fruit aromas, grapefruit, balanced beer.", "I am quite surprised I haven't tasted this one before. Especially when I see this towering high grade it has on this site! And I quite disagree. Usually I can follow voting here really well. But this is an unremarkable IPA, heavy on the bitter side and not very flowery or even hoppy. Maybe it is because it is now also brewed in Germany and it doesn't taste as its US counterpart, but that would be a disgrace really. Don't fancy this one much.", "Can. Great aroma but otherwise lacks balance. Astringent bitterness dominates the taste, overcarbonation makes it even worse. Decent but disappointing.", "Puszka 0,33l kupiona w Carefour. Ocena na podstawie wspomnień z degustacji. Na pewno świeższe byłoby lepsze, jednakże piwo miało 2 miesiące do terminu.", "citrus, spruce, floral, pale, hazy, frothy, white foam, very bitter, medium body, oily feel, lively, nice bitter finish,", "Uzupełnienie profilu notatki.\r\nPiana obfita trwała, zdobi szkło. Kolor jasno złoty lekko zmętniony. Aromat cytrusy, cytrynowy od chmieli, lekko słód, niezbyt intensywny, przyjemny. Smak również cytrusy, trochę las, lekko słody i wysoka ale pasująca goryczka. Piwo mocno pijalne ze średnim ciałem, ukrytym alkoholem. Bardzo dobre, nie rzuca na kolana. Kolejne przereklamowane top50.", "Pours a deep golden amber coloration with a large frothy head. Smells mainly of hoppy grapefruit and orange notes, with a hint of pine as well. Taste follows the nose, being dominated by hoppy grapefruit and orange rind notes, but with quite a resinous character, light caramel malt and strong pine as well. Finishes with a medium/strong bitterness and quite a bit of pine lingering in the aftertaste. Smooth mouthfeel with a medium body and carbonation. This is the quintessential West Coast IPA with its resinous character and notes of grapefruit, pine and caramel malt. Probably the best value-for-money IPA in Germany, if you can find it fresh.", "330ml can from Marks & Spencer, Reading. Amber colour with white head. Watery hops, watery mixed citrus, light pine resin, watery grapefruit juice, tastes almost like a session IPA despite the abv. Chalky, slightly sticky body. Enjoyable IPA but definitely doesn't deserve 3.94 av.", "Bitter but refreshing at the time . hints of citrus . Full of hops typical of a strong IPA .", "Hazy golden colour. Aroma strong flowery and caramel. Complex flavour. Long lasting bitter finish. A crispy and very refreshing IPA.", "Appearance: clear golden color, with thin head. \r\nAroma: floral hops, citrus, malta \r\nTaste: pine, hoppy and ends a bit bitter.", "bevuta alla spina, onestissima ipa colore non troppo torbido tendente all'ambrato schiuma generosa persistente, beverina secca e ben equilibrata", "Nice amber/gold color; Medium creamy body; Aroma of rich floral hops, citrus, & some malt; Flavor of malt, pine hops, citrus (notably grapefruit), and some caramel; Finish is bitter & lingers a bit; Nicely balanced; Really nice IPA.", "Can from kvickly, Odder. Pours golden color with medium white head. Aroma: Citrus, grapefruit, light apple and some hay. Taste: light citrus, pine, grapefruit, long lasting highly bitter aftertaste.", "W aromacie cytrusy, najbardziej czuć pomarańcze. W smaku fajne wytrawne ale orzeźwiające. Piwo nieziemsko pijalne. Lekko za duże wysycenie.Finisz pusty. Bardzo dobre", "Aromat chmielowy, cytrusowy, grejprfutowy, ale nie jakoś wybitnie intensywny. Drobna piana, ale utrzymująca się do ostatniego łyka. Bardzo wytrawne, fajnie zaznaczona grejprfutowa goryczka, dobrze pijalne. Klasyka.", "Can at Dusseldorf airport. Clear yellowish with white head. The aroma is piney with notes of tropical fruits and citrus. Bitter flavor with notes of citrusy hops, piney, some tropical fruits, \"green\". Slightly dry, medium-bodied.", "On tap from Ryan's in St. Julians. Aroma is citrus, pine, and initial taste is fruity followed immediately with a bold bitterness which resonates. Very well balanced and excellent tasting. One of my favourite IPAs ever.", "Appearance: clear golden colour with white small head. Crystal.\r\nAroma: grass, hops, fruits. Good.\r\nTaste: light body, good bitterness. Too watery.", "klasyczna ipa z chmielowa, niezalegajaca goryczka, wytrawna i pijalna z tropikalnymi owocami w smaku i aromacie.", "This IPA has a stunningly beautiful foaming. Aroma is citrus and spices. The taste is dominated by grapes, pine needles and spices like grass, coriander and basil. It's an extremely delicate IPA, where the hop bitterness is significant, but is not bitter than a level where I think everyone will be able to find positive things", "Bardzo klasyczne IPA, dobra, intensywna, ale nie lodygowa i nie zalegająca goryczka, wytrawne, dobre.", "12oz bottle. Pretty awesome that an IPA brewed in 1997 can still hold up in 2017. The hop bill is a little NW antiquated, but bitter and bold at the same time, more so than most IPAs these days. Filtered, which keeps it clean, because the hops and overall mouthfeel are pretty solid and intense. Pretty much a great IPA that has stood the test of time.", "330ml can. Pours slightly hazy amber, foamy white head, sticky lacing. Aroma is fruity, hoppy, bit resinous, malty and very well balanced. Very nice nose! Taste is bitter, juicy, tropical, resinous, lots of grapefruit, orange peel. Some herbal and grassy notes in aftertaste. Taste is bit more harsh than aroma, but still lovely. Medium + bodied, bit over average carbo. Really good example of pure breed IPA.", "This is one of my go to IPA's. It is nice and hoppy without being too high in ABV. Very drinkable.", "On tap at Vista Village Pub. Hazy Golden with medium head! Malty and hoppy aroma ned taste!", "Aroma is huge mango, orange and some pine. Looks awesome in the glass - dark gold huge white head. Taste is similar to the aroma but a little bitter with some malt and grassiness. Overall a solid ipa but kinda expected a little more given the hype.", "Blik gedeeld door Benzai. Goudgeel bier. Ietsje troebel. Aroma is hoppig en hooiachtig. Smaak is zoet, fruitig en hoppig. Weinig nasmaak.", "Blik gedeeld door Benzai, geprobeerd met Inoven. Het is een troebel geel bier met een dunne witte schuimkraag. Het heeft een fruitige grassige geur. De smaak is hoppig en citrus achtig.", "Złoty kolor, bardzo obfita czapa białej piany. W aromacie cytrusy i żywica. W smaku mocno chmielowo, dominują cytrusy i żywica, piwo dosyć wytrawne.", "From Aug 2007\r\n\r\nBought as part of a mixed 6Pack at Wilbur's Liquors in Ft Collins.\r\n\r\nIt pours from 12oz bottle a clear gold with a large head of foam that shrinks to a fine broken layer with lacing.\r\n\r\nThe smell is an abundance of citrus hops and spice. When I take deep wiffs, I can also smell some sweet malt. It's a very good nose.\r\n\r\nThe taste is, well. yummy. Plenty of citrus(grapefruit) there, which is typical for a Stone brew but probably never boring, and about midway through, there's a more than ample maltiness that balances out this IPA beautifully. Man, this baby is packed with flavour and is so easy to drink....a world class American IPA if I ever tasted one. And that's with it coming straight out of the fridge. The flavours get even better as the beer warms up. The mouthfeel is great and it finishes with just the right amount of bitterness to leave me yearning for more. Superb!\r\n\r\nWell, I've had this IPA many times before and I always \"assumed\" that I had already reviewed it. My bad.", "Can form Berlin Stone, canned on 18.05.2017 \r\nAppearance: nice white head, golden and a bit hazy \r\nAroma: tropical fruits, mainly passion fruit and mango. \r\nTaste: high bitterness and not very strong notes of hops - tropical fruits and low fruit like sweetness, but the beer is rather dry. \r\nVery decent IPA", "Forventninger var nok lidt for store. Efter at have smagt to enkle og gode session ipa inden, virkede denne lidt sød og bitterheden ikke i balance. Den føltes mere som en American Pale Ale. God, men jeg var ikke væltet om kuld.", "Aroma deutliche Hopfennote mit tropischen Früchten und grasigen Noten. Antrunk erst fruchtig, leicht bitter. Dann deutlicher Hopfen mit Bitternoten, grasig floraler Noten und einer spürbaren Alkoholnote. Im Abgang trocken und bitter.", "Canette achetée chez Amstein - De couleur dorée translucide ave. une belle mousse blanche qui colle bien au verre - Au nez on part directement sur de la resine, des fruits, agrumes et fruits tropicaux, une bonne présence de malt, et une touche herbacée - En bouche on reste sur la même chose pas mal de résine, herbacé et malt les fruits se mettent plus en retrait - Corp moyen, amertume forte, carbonation correcte, soyeuse, final amère herbacé long - Typique american ipa, sans extravagance", "Citrus, pine, resin, malt giving the idea of honey. Pours golden-amber with large head. In taste dry, intensely hoppy: citrusy, resiny, a bit of tropical fruit, with moderate grapefruity bitterness and crisp malty background. Medium body and carbonation, despite relatively high bitterness it's very drinkable. Tasty, looks like the reputation is well-earned.", "Owoce tropikalne, cytrusy, słodowość. Średnie ciało, półwytrawne. Średnie wysycenie, średnia do wysokiej goryczka, na szczęście dość krótka i niezalegająca.", "Bottled. Amber colour with a slight haze and a very small, off-white head. Honey, yellow fruit, and a faint hint of pine. Very dry throughout. Very hoppy with pine-resin bitterness that's very strong on the finish. Clean with a good balance of bitterness, acidity, and alcohol.", "Can from Marks and Spencer. Drunk at home. Light gold, a bit hazy with a large but quickly dissipating white head. Lots of lacing left. Pine needles, mango lassi, ample resin and lemon balm in the sumptuous aroma. Initially sweet taste turns bitter quickly, although it tempers with repeated sips. Long finish with key lime and lots more pine in the aftertaste. Pretty good stuff.", "330ml can. Pours a large head, liquid a cloudy amber colour. Aroma is strong citrus and taste is slightly sweet with a good bitterness and is well balanced. Good, long finish with a lingering bitterness.", "Tolle Perligkeit, frisch aus der grünen Dose. Ordentlicher Schaum, da bricht nix weg. In der Nase cremig feine Mango. Ebenso im Trunk, mittig kommt etwas der Alkohol, dann holzig, bitter, süffig. Geiles Ding.", "Dobra IPA w stylu West coast. Niezła piana drobnopecherzykowa. W smaku dużo chmielu, żywicy. Klasyk stylu.", "Ipa de poco cuerpo, ligera,muy gasificada,con sabores herbales,pino...cerveza comercial.", "Has a light aroma of citrus, floral and fresh brewed tea. Very hop forward blend, hard to pick out individual flavors on this one but its a nice balance and mix of citrus, pine and dark fruit, none stand out more than the other. Finishes off with a long dry, bitter finish that lingers for quite a while. Very tasty and one I've been wanting to try for a while now, glad I did.", "33cl can brewed in Berlin. Great fresh fruity nose. Lots of floral hops. The beer starts fresh and fruity. Intense and mild in one. Sticky with herbal parts, great depth with lots of hops. Long fruity bitter herbal aftertaste. Great.", "Puszka do 27.01.2018\r\nAromat: żywiczny, w tle trochę cytrusów. Trochę jak leśna kostka toaletowa. Nic specjalnego.\r\nWygląd: obfita, średniopęchrzykowa piana, dość szybko znika. Barwa złocista. Klarowne.\r\nSmak: Jak w aromacie - głównie żywica, trochę cytrusów. Goryczka średnia do średnio wysokiej, lekko skontrowana słodyczą. Trochę zalegająca.\r\nOgólnie: Poprawne, ale nic specjalnego.", "Tap at Mel's Craft Beer & Diner, Vienna. Pours clear golden colour with a small white head. Aroma of sweet fruit, malt, hop and caramel. Moderate sweetness, medium plus bitterness.. Medium body, slight oily texture, average to soft carbonation", "12floz bottle, stamped BOD: 07.17.2017 and BBD: 10.30.2017, $1.75 unit cost, tulip glass. Appears a glowing golden yellow color with foam, blah, blah, blah...Smells like cut up citrus fruit sprinkled with garden herbs. The palate is hop centric, thin on the malts. Plant stems and green leaf flavors linger on the palate. At one time, I thought this beer was well composed. Now it it just seems like a run of the mill moderately bitter AIPA and nothing else. This is to say it is okay, but I used to remember a touch more juicy sweetness as a counterbalance. As is in this review, it lacks a malt backbone. Not that great, I suspect the high rating here is  based largely on legacy and before the flood of one-dimensional IPAs. Unfortunately, Stone Pale Ale has somehow become scarce in my area,. I'd like seek it out to see it if has held up to past memory (for better or worse). Stone brewery has really lost it's luster in the last ten years. They are no longer a highly regarded beer maker in my book. Just one of the crowd.", "About as good  and reliable as beer gets. West Coast style, fruity and piney. Love it.", "0.33L can. Cloudy amber color with huge white hat, stays few minutes. Egg white, rotten orange nose. Disturbing alcohol taste is coming first, single hop, and strong grapfruit seed taste. Pleasant, messi, strong bitter finish. Grapfruit mouthfeel stays some time.", "330ml can from Kaufland Merzig, Saarland, Germany!\r\n\n\r\nPours clear golden with a high white head. Aroma has lots of hops, grapefruit, orange peel and pine. Taste has tons of grapefruit, orange, exotic fruits, pine and spruce. Finish is dry bitter, fruity, again massive grapefruity!", "From can (brewed Jan.'17) in IPA glass. Lively pour: cloudy amber with big head that muted hop aroma. Beautiful, tasty malt base with piney hop bitterness coming through in the finish. Had this many years ago in LAX and will need to revisit closer to the source to taste at its prime.", "Honestly, after listening to folks hype Stone IPA for such a long period of time, I was expecting fireworks and a marching band. No doubt -- it is a very good IPA -- but, it did not knock my socks off. Poured with a medium head; clear and golden to maybe copper in appearance; hoppy aroma; both citrus, some pine, and just a little malt in the taste. The finish was a little too crisp for me.", "My current go to IPA in a can. Excellent IPA colour and taste. Cannot fault this.", "Cytrusy, grejpfrut, mango. Niestety zapach dość ubogi. Mocna goryczka jak na west coasta przystało.", "very bitter, fantastic colour and an easily drinkable IPA, for it's strength. this one will creep up on you! a staple of the IPA world and now (thankfully) quite common in UK supermarkets canned.", "appearance: slightly hazy golden colour. Good fluffy head. aroma: big fresh nose, citrus, pine, grapefruit. Palate: smooth medium full, medium carbonation.  taste: full of hop flavours to match nose. Decent bitterness with grassy aftertaste,", "Can from local Tesco. Huge, white head, golden colour, clear. Aroma: hops, lots of hops, grapefruit peel, spruce, pine, lemon. Very bitter taste, bitter finish, lively, full body. Proper IPA, nicely bitter, but flat palate, lacks of something.", "F: huge, light tan, good retention.\r\nC: deep gold, light hazy.\r\nA: tangerine, orange, bit tropical fruits, biscuits, honey, strawberry.\r\nT: malty backbone, grapefruits, tangerine, tropical fruits, bit herbal, pine resin, long lasting bitterness, medium to full body, medium carbonation, very good, enjoyed, 33cl can as “Stone (Berlin) IPA” from Bierwinkel De Hopduvel in Gent.", "Aroma: pleasant nose of citrus, herbs and pine. \r\nModerately intensive taste of herbs mix, citrus and flowers. Some notes of honey and pine. Interesting mix", "Bottle. Pours clear golden with huge white head. Aroma is spruce, resin, grapefruit and passion fruit. Taste is medium sweet and medium to very bitter. Body is oily with medium carbonation. Finish is long and intense fruity with notes that follow the nose plus notes of yoghurt and strawberry. Nicely balanced.", "330 ml can. Pours with a clear, Golden Color and a nice white head. Fruity nose of grapefruit peel, hoppy with some piney Notes. Taste is not as hoppy as I remember. Nice fruity flavors with a resinous and bitter dry finish.", "Can 33 cl. Pours a clear golden to copper with a medium white head and an aroma of mainly hops, citrus and pine, mango and sweet malts. The taste medium sweet with an intense long lasting hoppy finish. Very good IPA!", "Goudblond bier met stevige witte schuimkraag. Geur: veel hop, exotisch fruit, citrus en wat dennen. Smaak: strak en scherp hopbitter, citrus en hars, maar in balans met wat zoetigheid. Afdronk: bitter, droog. Een mooie hopbeet, lekker!", "Lata from Stone Berlin. Unclear like nice deep golden colour, big white head, well lasting, good lacing. Pleasant aroma of fruity hops, a pleasant sweetness, pine,wet dry grass and some alcohol. Flavour is sweet fruity piney hoppy peachy with a good well lasting and well present bitterness indeed, not ripping though. Nice but not really up by them 4.0.....", "12oz bottle. Pours gold with a moderate white head. Aroma is caramel, grapefruit, pine, and floral hops. Taste is similar; strong hops balanced out by malt. A good amount of resin. Bitter. Dry. Not-quite-medium body. Medium carbonation. Crisp mouthfeel.", "Berlin-brewed version, on tap at Stone Berlin about a year ago. From notes. Very fruity but with a faint bit of onion-garlic roughness in the nose. Firmly bitter with that familiar sticky resin. Juicy and as balanced as this beer ever gets, which is not quite.", "Aroma is hoppy citrus, grainy, grapefruit, some malts. Good solid body, smooth medium bitter finish. Very comfortable drinking IPA.", "Aroma humle, sitrus, aprikos, krydder, malt, humle. Utseende uklar gylden med hvitt skum som daler fort. Smak sitrus, aprikos, karamell, krydder, humle, malt. Boks på The Bishops Arms 33cl 6,9% BF 021017", "Bottle from Beers of the World. Lots of citrusy hops balanced with some malt.", "Clear pale coloured IPA. Very hoppy and fruity, a good beer but nothing special!", "Can. Clear dark amber pour with white head. Aroma has sweet lime. Taste is balanced with a bitter kick. Malty backbone. Heavy body. Medium carbonation. Old school. Not bad", "Medium body, Clean aftertaste, Good balance, Grain incense, Not strong aroma", "Golden, slightly amber. Clear. Hoppy, fruity aroma at the medium level for a west coast ipa (as for style). Very well balanced taste, fruity and bitter. Excellent IPA!", "Review based on the BJCP2015 guidelines (style 21A). Can 33 cl - Batch 170407DE0102 (JAN.2018). AROMA: predominant oxidized hops (cheese) with low malt background (slightly sweet). APPEARANCE: dark gold and clear. m?dium ivory head with good retention. TASTE: m?dium-low oxidized hops (dried grass), followed by almost neutral and slightly sweet malt background. high bitterness with a bitter and almost harsh finish. PALATE: m?dium-low body with m?dium carbonation. slight astringency. OVERALL: unfortunately another oxidized IPA from the Berlin Stone operation.", "Canned 330ml. -Berlin version. Clear pale golden coloured, medium sized white head, mild hoppy nose. Sweet malty, grapefruity hoppy, notes of caramel and alcohol with moderate bitterness in the finish. Quite nice.", "12 oz. bottle, consumed on 7-17-17. \"RVA 05/22/17. EJBY 09/04/17.\" Strong, heavily herbal, ?dank,? mineral aroma. Scent of grapefruit. Pours a highly effervescent bronze with a moderate amount of beige head. Produces good lacing. Excellent, dry, highly likable flavor. Pine and a touch of sweet peach (but definitely not too sweet). Good underlying malt flavor comes to the fore as initial hops shock dissipates. Nice, bitter finish and aftertaste. Medium to full body. Lively in the palate. Highly drinkable and likable. A superb, aromatic, and delicious classic. What brewers should strive for their IPAs to be. Quintessential. 8.4.8.4.17=>4.1", "Bottle from Vons, Las Vegas. Pours clear golden with a diminishing, small, white head. The aroma contains hops, spices, fruits (grapefruit), some citrus and yeast. It tastes medium to heavy bitter and light sweet, with a rather astringent, dry finish. Medium body, oily/slick texture, fizzy carbonation. Not very satisfying to me.", "Bursztynowa nieprzejrzysta farba. W zapachu slodowe z nutami gruszek, zóltych jablek. W smaku srednio pelne, lekko cytrusowa goryczka niezbyt dlugo pozostajaca na podniebieniu. Bardzo ladnie utrzymujacy sie lacing. Piwo srednio wysycone.", "Can. Honey gold, off white heavily laced head. Aromas of grapefruit, passionfruit, pepper, pine needles and a big caramel backing. Big, bitter front palate full of dominating grapefruit and some pine cones. Balancing caramel malt middle that is understated but does it's job perfectly. Long, dry finish with a lick of pine. Undetectable alcohol, never cloying and drinkable. Magnificent beer and a West Coast IPA to judge all others.", "Oranjekleurig, licht troebel. Volle witte schuimkraag. Mango, perzik, abrikoos, steenfruit, gist. Hoppig, mild bittere afdronk. Redelijk vol, beetje creamy mondgevoel. Zéér goeie ipa.", "Thick white head, golden in color with the trademark haze of a good IPA. It smells of herbs and earthy notes. Quite pleasant really. Butt that doesn’t really translate into flavor. The hops are subtle but allow the flavors of the malts shine through. It’s not really bitter at all and there are some after tastes that make me wish for citrus hops but c’est la vie.", "330 ml can (Berlin) @home,canned 24/04/2017,bb 19/01/2018.\r\nOrange,slightly hazy,quickly diminishing head.\r\nAroma of citrus and hoppy bitterness.\r\nTaste is bitter,not overpowering with some citrus in background.", "Can from ASDA. Clear, golden with a good white head. Malt, citrus and pine aroma, pine dominates the flavour with a little citrus I’m there too. Dry finish", "Aroma: Grapefruit and hay.\r\nAppearance: Dark gold color with lightly hazy liquid and frothy white head.\r\nTaste: Medium bitterness and medium sourness.\r\nPalate: Medium body with thin texture and soft carbonation. Sour and bitter grapefruit finish.\r\nOverall: Very sour and bitter feeling. Goes great with appetizers or even by itself.", "Can from Westhill Service Station. It’s a clear fiery gold with a decent fluffy white head. Some nice bubbles trails in the glass look refreshing. Taking a sniff and you can smell that bittering pine straight off the bat. There sharp citrus, like lime and grapefruit and a sweetening hint of candy floss. I take a sip expecting full on pine but am surprised when I get lovely caramel notes kicking things off. You don’t have to wait long though before that pine and grapefruit take centre stage. There’s a very gentle warm spice taking the edge from the sting. The beer feels soft, slightly oily with a great sharp, dry sparkle to help lighten the hop load. I was almost hesitant about Stone IPA such is its reputation expecting an overpowering resinous hop overload. Yes the hops slowly dominate the profile but it’s much more balanced than I expected and very drinkable as a result. It’s hefty, there’s no getting round that, but it is a very fine example of the West Coast style IPA.", "Clear, amber.\r\n\r\nGrapefruit, gooseberry, malt.\r\nBalanced malty sweetness and moderate hoppy bitterness.\r\nLong bitter finish.\r\n\r\nGood.", "33 cL Can at home. Pours hazy golden with a medium white head. Aroma is a bit sweet with caramel, pine, some fruity hops, citrus and hops. Taste is slightly sweet with malts, pine, some tropical fruits, biscuit and an over medium bitter finish. Medium body and carbo.", "Puszka, 330 ml. W nosie trochę słodkich, przejrzałych owoców, marakuja, grejpfrut, może pomelo, delikatna podbudowa słodowa wpadająca w jasne pieczywo. W smaku odpowiednio wytrawne, jak na west coast przystało, mimo że zasyp dość obfity (obstawiam 16-stkę), słód lekko odczuwalny, ale w tle, zdecydowanie chmiel z przodu.", "0,33 l Dose. Oranges, trübes Bier, cremeweißer, stabiler Schaum, schöne Gardine. Riecht nach Ananas und Karamell. Schmeckt süßlich, fruchtig, angenehm bitter.", "From 330ml can. Pours amber with some head. Quite a hoppy IPA with bitterness about it. Not bad, but nothing to get tremendously excited about", "(12oz bottle - part of a mixed Pale Ale 12-pack)\r\nAROMA: very nice hop nose, grapefruit, green, fresh, good maltiness, lovely nose \r\nAPPEARANCE: medium Amber, robust Looking, full head that lingers. \r\nTASTE: yummy, bold hops on front and back, smokey grain, tobacco, toast, some citrus peal ... very layered\r\nPALATE: medium to medium heavy body, well balanced, some crispness, bitter dry followthru. \r\nOVERALL: a very good IPA, enjoyable, robust, I liked the perfect balance between roasted maltiness and hops. I would almost consider this a craft IPA ... a standard for judging IPAs.", "Golden coloured beer with an huge frothy white head. Aroma is grapefruit, pine, and a some floral notes. Flavor is citrus, biting pine and lots of grape fruit.. Medium to heavy palate. Smooth finish.", "Can. Clear amber color with tiny white head. Aroma - Citrus, flowers, malt, hops, biscuit. Taste - Bitter, grapefruit, light pine, mango, tangerine.", ".33 can. Clear pale gold,thick,stable,ugly head,a lot of lacing. Aroma grassy,citrusy,lemon,flowers. Taste thick,smooth,sweetish but but generally rarer dry. Carbonation medium to low. Bitterness medium,short,very nice. Aftertaste grassy,lemon,citrusy,intense watermelon. Really nice.", "330ml can from Dekabrist in Engels. Brewed in Germany. Pours hazy yellow with a large white head. Aroma is grapefruit, pine, pale malts. Taste is citrus, grapefruit, orange, heavy bitterness.", "Can. Pours clear golden with thick stable white head. Aroma is fruity, resiny, lot of pine and touch of herbs. Moderate bitter, resin and herbs on tongue. Medium body, soft carbonation, creamy texture, long bitter finish.", "Can. Creamy white good mostly lasting head. Yellow colour. Moderate malty and heavy hoppy aroma. Heavy bitter flavor. Long heavy bitter finish. Creamy palate.", "Dose 0,33l: Golden, leichte Trübung, sehr kräftiger stabiler mittelporiger Schaum; sehr fruchtige und frische Nase, Zitrusaromen, helle Früchte, Maracuja, Grapefruit, Malz, kräftige frische Hopfenaromen; frischer Körper, kräftige Hopfenaromen, Malz, Getreide, kräftige fruchtige Bitterkeit, dunkle/getrocknete Früchte, cremig, kräftige Kohlensäure, recht trocken, würzig, leichte Röstaromen; angenehmer würzig-trockener Nachgang mit kräftiger Hopfennoten", "This is the first IPA I believe I've ever tasted and it hasnt changed since in the god knows how many years since the first time. It's just delicious plain and simple, the standard I set for all IPAs I drink \n\n---Rated via Beer Buddy for iPhone", "Can. 6.9%. Best before 31.12.17. Brewed in Berlin. Pours a slightly hazy straw yellow/golden, with a diminishing off-white head. Spotty lacing. Somewhat unbalanced aroma; hops, a bit cheesy; fruit, both overripe and regular; and slightly citrusy. Has a sort of cooked vegetables note to it as well. Flavour is fruity, citrusy. Light cheesy hops note. Spicy and cough drop hints as it warms. Bitter finish, lingering, along with a hop note, a mild alcohol burn and fledgling hints of rubber. Overall so-so; not bad, but the aroma does leave something to be desired, while the flavour is okay, if nothing special. 20.06.17.", "Dose bei Rewe in der Ackerstrasse gekauft, gebraut in Berlin.\r\nBlasses aber klares Bernstein, voller und großporiger Schaum\r\nAroma: sehr schönes Mango, Aprikose, Hopfen, Grapefruit, Zitrone\r\nGeschmack: bitter, Heu, etwas Grapefruit, blumig\r\nEher saftartig, wenig Kohlensäure", "Complex nose, piney, resiny with some bready notes. Rich bitter flavor, backed up by a malty sweetness. Slick, slightly oily body. Finish bitter, slightly harsh, but by no means overbittered. Excellent IPA", "33 cl. can @ Home. Brewed in Berlin.\r\nAroma: not very intense aromas of grapefruit, grapes, passion fruit, citrus, tropical fruits. Subtle hints of pine, resin. Some malt background appeared as the beer was warming.\r\nAppearance: light amber to golden color, light hazyness, high head thickness. Super creamy slightly off-white head made of mid sized to big sized bubbles. High retention. Very low Brussels’ lacing, almost non-existent.\r\nTaste: low sweetness, medium to high bitterness, no sourness. Flavors of grapefruit, citrus, passion fruit. Tastes slightly sweet at first, but increasingly bitter towards the end.\r\nPalate: light to medium body, oily texture, low to medium carbonation, very long and very dry bitter finish of grapefruit, resin, pine, citrus, tropical fruits, passion fruit.\r\nOverall: very good appearance. Not very intense but good aromas and flavors of grapefruit, resin, pine, citrus. Quite refreshing and thirst quenching. Good IPA but not as good as i’d heard, maybe this one brewed in Berlin is not as good as the American one.", "Can at home from Fakta. Clear yellow with a white head, nice lacings. Aroma medium malty (caramel), medium+ hoppy (piney, citrusy). Flavor medium sweet, medium+ bitter, spicy, long lasting bitterness. Medium body.", "330 ml can from Marks & Spencers, brewed in Berlin, Germany. Aromas of tropical fruits, malts, subtle pine. Big white head and more or less clear golden body. Taste is sharp malts with hoppy bitterness. Floral, fruity notes and citrus finish. Very nice beer.", "Amber. Powerful spicy hop aroma and flavour, and light caramel sweetness. Very bitter finish. Medium body, and a smooth mouthfeel Overall, a great IPA. Very tasty.", "Rocky white head left a cover on an unclear, finely carbonated straw coloured body.\nCitrus, hops, pine & pineapple.aroma.\nMedium bodied, tingly on the palate with an light feel followed by a soft clean back.\nBitter pithy tastes of grapefruit, zest, pine, caramel & orange.", "330ml can @ 6.9 % . Pine aromas, grapefruits and floral, taste is similar. Didn’t massively enjoy this one, remember the bottle tasting much nicer. Possibly a bad batch.", "33cl can. Light amber colour with average whitehead. aroma of hops lemons, oranges and grapefruit. well-balanced and full bodied, exemplary IPA", "Nos super, świeże chmiele, owoce egzotyczne, ale za to trochę masła żeby nie było tak różowo. Dość ciekawe, ale kurde z drugiej strony trochę pustki... To nie zasługuje na takie oceny. Mogliby dosypać nieco więcej na goryczkę....", "W aromacie chmiel z paczki, ale nie takie najlepszy. Barwa zlota, piana ladna, utrzymujaca sie. W smaku pelne owocowe. Goryczka intensywna, cytrusowa, zalegajaca. Wytrawne, fajne. Brakuje aromatu, ale to chyba kwestia swiezosci.", "Golden amber pour with minimal head. Strong aromas of fresh pine, citrus fruits lemon, grapefruit and earthy herbs. Taste is clean; pale malt body dominated by big hop flavors; bold but balanced bitterness. Slick mouthfeel medium body, with moderate carbonation. Very good west coast IPA.", "Good floral smell, just like an ipa should smell. \r\nBig white foam the disappear quickly, dark yellow color. \r\nTaste ok, but a little thin", "Classic IPA. Full bodied, full of citrus, lemons, oranges and grapefruit. Plenty of piney hops. One to compare others to. A good IPA benchmark", "Can. Pours pale amber with a perfect white foam residing. Scent is medium notes of middle hopped sweetness. Taste is consistent with notes of citrus. Some properties of dark fruit. Lovely.", "Can (Berlin) and draft (US). Golden orange with an off-white head. Aroma has lots of hops, sweet caramelt malt, hay. Moderate sweet with hops, caramel, hay, pine. Grapefruit bitter aftertaste that is moderate bitter. I think I prefer the draft version.", "Puszka z Berlina. Niegdyś rewelacja, dziś mocno przykurzony klasyk. Klarowne, poważnie goryczkowe, co się niefajnie odkłada w posmaku.", "Wow. Ny farvoritøl. Fantastisk god smag. Dejlig med humle. Super frisk smag. Købt på tilbud i Fakta", "Extremely good IPA. This is another benchmark for IPA’s. The amount of citrus flavor packed into this IPA is incredible and the hop finish leaves enough like an IPA to be thoroughly enjoyable. This is going to be a go-to IPA.", "Pours clear golden witth a one finger high white head. Aroma; Citrus, pine, tropical fruits and floral. Taste; Hoppy, grapefruit, citrus, mango, tangarine and pine.", "Classic for being what it is: a solid IPA that has all the earmarks and no detractors: big citrus and pine aroma from a beautiful pour; full body with chunks of pine bark resin swimming around your tongue; and a bitter and sweet taste that eventually allows the hops to win out to a dry, but not too dry, finish. Excellent.", "Can, 33cL. Gift from the staff of La Cervoiserie, Les Herbiers. Thank you !! Home. A golden orange-yellow beer with a small white head ; average retention. Fruits (red berries, tropical fruits, citrus), resin, light herb. Medium bitter refreshing, very dry, light sweet, light warming background, light spicy. Medium body, light to medium oily texture, average carbonation, dry fruity spicy refreshing finish. Overall, delicious !", "Delicious world class IPA.\nBeautiful clear honey colored with a medium frothy head.\nFruity hops flavor smooth and good\n\n---Rated via Beer Buddy for iPhone", "Aroma: sewage, onion, maybe a bit pine notes. Meh.\r\nTaste: bitter, little pine and some unpleasant (sewage?) notes. Bitterness in aftertaste.\r\nHead is just OK.\r\nOverall: bad beer imo. Yuck.", "amber, clear, white foam, citrus, herbs, floral, resin, medium body, thick feel, sticky, average carbonation, bitter,", "Can. A sharp taste of hops but it quickly fades. Aroma is a little faint. An ok IPA but I have had better.", "Pours clear amber with a good head. Pine, malt and citrus on the nose. Lots of hop character with biscuit and citrus flavours. Finishes long and bitter. A classic.\n\n---Rated via Beer Buddy for iPhone", "This is an excellent IPA it's not too hoppy and doesn't leave an harsh aftertaste.\n\n---Rated via Beer Buddy for iPhone", "LCI. Uit blik geschonken. Mooie IPA, lekker bitter, hoppig, fruitig en een prettige bitter-grassige nasmaak. Prima!", "Clear golden appeareance with a decent white head. Pine, malt, citrus, grass and grape aroma. Taste og pine, grapefruit, hoppy freshness and citrus.", "Pours clear amber with a good head. \r\nPine, malt and citrus on the nose. \r\nLots of hop character with biscuit and citrus flavours. \r\nFinishes long and bitter. \r\nA classic.", "Can, brewed in Berlin, Germany. Pours clodu yellow with average white head. Aroma is lemon, lemongrass, malt, a hint of pine and candy malt. Taste is bitter with pine, lemon, candy malt. Very well balanced.", "From the tap at FOB, Rimini, Italy. Pours crisp golden with white foam. Aroma is resinous and piney. Body is medium-dense. Taste is bitter. Finish is long and bitter.", "Puszka 330ml. Zloty kolor. Piana biala ,srednia o duzych pecherzach. W zapachu cytrusy i szyszki. W smaku dosc cierpkie o cytrusowym zacieciu, dojrzale owoce w tle z chmielowym akcentem. Urodzinowo", "Can from Tesco Extra, Longton. Pours golden. Good chewy slightly resinous well hopped ipa. A bargain too!", "Pivo v plechovce: Deep golden with an orangey sheen, hazy to cloudy, lacy white foam; moderate to solid sweet-bitter flowery to piney nose, sweet pale mal and some cookies detectable in the background; solid - but not too dry - bitter-sweet flavour, medium to full bodied, very soft; lingering dry bitter piney finish with - as expected - hops stickin’ to the palate and still a good dash of sweet malt. Even though I’m already fed up with all the \"craft-beer hop bombs\", I’ve to admit that this is a well made , well balanced example of astonishing drinkability...", "Poors amber, light white head. A bit of caramel. Heavy hopy, strong grapefruit, pinewood, a little of apricot. Light sweet, strong bitterness. Good balance between hope taste and bitterness.", "Just an all-around very good IPA. This is one I would give to someone who has never tried an IPA before. The pine and citrus and bitter are just not that strong for someone who is not ready for it. Readily available too.", "Trübes dunkles gelb schöner schaum, fruchtig citrusgrasig herber Duft, im Geschmack kräftig hopfig trockenfrüchte citrus pinie kräftig harzig herb, ein klassisches ipa das einfach schmeckt", "The aroma has a nice balance between dank resin and juicy citrus. Also lots of orange peel. Two finger white head, maybe a very light off-white. Lovely colour, slightly cloudy. Initial taste is very juicy, then orange peel bitterness comes through, lingering for a very long time. It takes a good length of time for all the flavours present to make themselves apparent. The initial juicy burst makes it very drinkable, to boot. This beer has a stellar reputation; well-deserved in my book.", "Aroma: lightly sweet and floral; Appearance: hazy orange pour with thin white head that lingers; Taste: clean, hoppy, pleasant; Palate: medium body with medium finish; Overall: nice IPA example; would definitely get again.", "12 oz. bottle. Clear pale gold, creamy white head. Aroma of citrus and tropical fruit. Taste is citrus, tropical fruit, grapefruit notes, pine. Nice.", "Drank this beer quite a lot seven years ago, I've just started again it's a classic for sure. \n\n---Rated via Beer Buddy for iPhone", "Hellgelb, leicht trüb mit guter Krone. Erfrischend hopfiger Antrunk, Zitrusnoten, leicht malzig, trockener Abgang!", "Berlin version, just a pale replica of the original. Very bitter, not as \"tasteful\" as the other beers from Stone in the U.S.A.", "Can, Tesco online. Just splendid hoppiness, solid malt background, not too sweet or caramelly but definitely there, long pine, grapefruit bitterness, some resin. Dry. Long finish. Great, a classic for a reason.", "Aroma: fruchtig, Beeren. Bereits im Antrunk ist der gute körper zu erkennen, der durchgängig alles im griff hat. Tolö hopfiger abgang, das gefällt. Gute Säure im Nachgeschmack.", "(330 ml can) Clear amber-golden beer, with a thick, fluffy white head. Gently carbonated, and can-conditioned, with a few speckles of yeast floating in the glass.\r\n\r\nA hoppy aroma, with grapefruit, pineapple, and cantaloupe at the forefront, and a slight singe of alcohol. Spicy on the palate, but surprisingly sweet and floral, and well-balanced with a strong caramel malt. The finish is slightly more bitter, with hints of pine and mineral water.\r\n\r\nThe mouthfeel of this beer is tremendously smooth and silky - a classic West Coast IPA.", "Piwo zakupione w markecie w PL , w puszce. Canned on 07MAR2017 Enjoy by 02DEC2017\r\nAromat: Nuty od chmielu raczej ziemiste, ziołowe, trochę przyprawowe i leciutko cytrusowe, owocowe, rozczarowujące jakością jak i intensywnością, poza tym chyba niestety lekki DMS oraz Diacetyl.\r\nWygląd: klarowne złote, piana średniopęcherzykowa, ale redukuje się do cienkiej warstwy.\r\nSmak: Wytrawne, goryczka wysoka, ale nieprzyjemna ziołowo - łodygowa, zalegająca.\r\nOdczucie w ustach: Raczej lekkie, wysycenie średnie do wysokiego.\r\nOgólnie: Wielkie rozczarowanie, bardzo słaba IPA.", "Stone Berlin, Germany. Pours hazy golden, lot’s of yeasts in the can, big head. What surprised me a lot, that there was no smell at all. Aroma was really watery, and there was only a hint of iron. Checked with my girlfriend, she didn’t notice any aroma also, from the can and from the glass. Taste is bitter, grapefruit, a little artificial like (like some hops aroma, not like whole hops cones or granulate), also there is strong metallic flavor. Unfortunately I think that opening German brewery was not a good idea, now it’s harder to spot a real Stone beer in Europe, and this Berlin imitation of Stone IPA is just like mass production and tasteless.", "The beer has got a clear deep golden-amber colour with a steady head and mediu body. Aroma of hops and pine. taste of hops, pine, citrus fruits, spruce, herbs and biscuits. Hoppy finish.", "Typical West coast ipa big pine resin some peach and melon to balance. An original trailblazer.", "33cl can,berlin version.Classic west coast ipa.\r\nAroma: pale malts, and shy hops with notes of zest and pine. Taste: moderate malty sweetness, just a touch of citrus and a big piney bitterness. Very good.", "Pours a clear amber color with a medium sized, stable head.\r\n\r\nThe nose is defined by fruity hops, oranges, lemon peel and cakey malts to highlight the hops. Classical nose for an ipa, a very enjoyable though. \r\n\r\nPerfectly balanced, well carbonated bright and thirst quenching with a nice taste evolution regarding the evolving hop profile.\r\n\r\nBitter from the first glance, without pushing too far, due to balancing, sweeter malts. The hops are pretty fruity but foremost dry, bitter and in your face. Finishes soft, still dry but with a caramel malt sweetness cutting through.\r\n\r\nPretty wow, one the most well build west coast ipas I ve ever had. It is uncompromisingly bitter, while still caring for remaining drinkable, which is acoomplished by the noteable malts.", "Clear golden with one finger white head. Dank hoppy aroma with citrus, grapefruit and tropical fruit. Taste is also dominated by dank hops accompanied by citrus, grapefruit, light pine, some tropical fruitiness and only a light and crisp malt base. Medium mouthfeel, medium carbonation and dank hoppy aftertaste.", "A very good beer and I’m surprised this is the first time I’ve rated it. Well balanced, golden with an aggressive bitterness and a nice citrus flavor.", "Fresh fruity aroma. Really dry with masive biterness. Very good west coast ipa!", "Hazy golden. Moderate white head. Aroma: passion fruit, mango, tangerine. Medium body. Heavy bitter taste. Very fruity. Good.\n\n-- rated with beerbasher/winphone", "3 finger white head.\r\nSemi-hazy, deep golden coloured beer.\r\nAroma is orange marmalade, honey, apricots and pungent mango. \r\nTaste is grapefruit and pine with a sweet and slightly ’dishcloth’-y marmalade ending. It’s that Centennial going to work. \r\nMedium oily mouthfeel but very crisp and refreshing. with a good bitterness bite but it could’ve used more for a full 5/5. \r\nOverall: Still as good as the first time I drank it and a true classic IPA. Grab a few of these, grab a few friends and barbeque the shit out of a day.", "Can from Stone Brewing GmbH, Berlin. Pours hazy golden with white head. Aroma of sulphur, citrus, grass, tropical fruits, lemonade, pine needles. Taste sweet with a lot of bitterness and very bitter finish.", "Nice light amber pour with a thick white head that lasts. Aroma of citrus and pine. Taste is all bitterness...Unfortunately too much so, though. I get hints that there’s some nice flavor in there, but the bitterness covers it all up. It’s too bad, I had high hopes.", "Tirador al BBF17. Cervesa daurada amb escuma blanca. Aromes herbacis amb una mica de cereal. Una mica plana però bona.", "Poured a medium amber color with smooth thick head. Very nice aroma of orange/lemon zest with hints of pine. Well balance of hops and malt.", "330ml can, Tesco. Pours clear amber colour. Nose is pinewood and citrus. Definite pine & grapefruit taste with the bitterness you?d expect, although not huge amounts. Some orange zest as well.", "Stone Brewing knows their IPA’S. A good and juicey beer with plenty of citrus flavor and hops. Would recommend.", "Kompletne india pale ale. Godne polecenia ;) Wpis w celu uzupełnienia profilu", "With my local Tesco recently expanding their beer range with a bunch of american craft cans including this and the Go To IPA, I thought I’d make this classic the first entry a \"why have I never reviewed this before?\" series of sorts. Can - 330 ml. Pours clear amber/gold with a finger of dense white head with good retention and thick lacing. Occasional small carbonation bubble visible. Bright and fresh on the nose with Intense sweet citrus and pine resin, underneath which is a bit of cut grass, light straw and acacia honey malt. Classic west coast hop profile as expected. Taste is both subtly sweet and strongly bitter (though obviously less so than Ruination) with a lot of solid honey malt joining the grassy, resinous hop profile. Grapefruit, gooseberry, hint of mango, long, slightly dry, chalky bitter finish. Medium body, thick, silky texture, light carb; lovely mouthfeel. Exceptionally well balanced and definitely lives up to its reputation, really glad I’ve now got a ready supply of this!", "Can. Poors amber, light white head. A bit of caramel. Heavy hopy, strong grapefruit, pinewood, a little of apricot. Light sweet, strong bitterness. Good balance between hope taste and bitterness. There is many IPA on market but this one is one of the best I drank during last weeks", "Can 330ml (BB 12.06.2017). Clear, golden colour. White-grey, large, long lasting with good lacing head. Aroma is fresh with intense resin notes. I can say there is only a lot of pine in the aroma and that’s great. Medium to high, resin biterness but short lasting with a bit astringent finish. Light body, full hoppy, refreshing, really drinkable. I’m hoppy drinking this IPA.", "1100th beer. 330ml can from Gateshead Tesco, served cold in a 1/2 pint chalice. Slightly hazy amber with a white head. I deliberately chose a \"verging on iconic\" beer. I don’t know if I’m right, but this feels like the original poster boy (or girl) for modern American IPA. Ripped the can lid, and smelled the Citrus, resin and tomato vine: and that’s what you taste, along with a kick of alcohol and some cereal. Also a nice toffee malt undertone. So, my favourite style scores a solid 4, it does exactly what it says on the tin and sums up the 1-1100 quite nicely. By the way, did I say I bought it at Tesco?", "Ipa bastante herbal(pino), con final amargo muy seco y de durabilidad media, no esta entre mis preferencias, de complejidad media.", "Can from Beer52. Golden amber with an off-white head. Tropical fruit and pine aroma. Taste of lemon, grapefruit and pine. It’s fresh and crisp and it’s a pretty decent IPA. But there’s no wow factor, and for me it doesn’t live up to its formidable reputation.", "Can from Tesco. Rich golden colour with a thin white head. Aroma citrus orange and light grapefruit. Taste light fruity.", "330 ml can from Tesco, London (UK). Colour is clear golden,with medium white head. Aroma is tropical fruit, citrus, pine. Taste is piney hop, orange zest, citrus, mango, other tropical fruit. Hoppy! At finishing light bitterness.", "Nice can, typical Stone. A lot of information is on the webpage.\r\nClear golden beer with short white head, smell is very tropical fruitful and also citrus, taste is citrus, heavy bitter, medium body, short finish with bitterness, \r\n(I have 0.33l can with best-before 02 Oct 2017 and batch 170105060103)", "Clear golden pour with a small white head. Aroma and flavour is mainly grapefruit and pine, light body, lingering bitterness. Solid.", "From meny; pours bright golden with a giant white head; aroma is fruity hoppy, slightly hoppy spicy, berries, orange zest; taste is fruity hoppy, citric with some pine, fading into a solid smooth grapefruit and pine bitterness; light texture with high carbonation", "33cl can at home. Appearance: slightly hazy pale straw with medium white head. Aroma: grapefruit, orange zest, hop resin, mango, pine, citrus. Taste: medium sweetness and high bitterness. Notes of hops, grapefruit, lemon, orange and tropical fruits. Finish is bitter-dry with notes of citrus. Palate: medium bodied, watery to oily texture and lively carbonation.", "Klares Orangegold mit reichlich Schaum. Malzig, sehr fruchtig, Zitrusfrüchte, Orangen, Grapefruit, leicht bitter, sehr süffig.", "Puszka. W aromacie kiszonka. Na drugim planie tropiki.w smaku lepiej. Fajna goryczka.", "Can 0,33 l / Amstein - St-Légier (CH). Golden with an average white head for a short time, low sparkling but laces on the glass. Fruity aromas of apricot, mango, passion, lemon, citrus, malt and caramel, the whole in symbiosis. The taste is like, fruity but bitter, crispy on a nice malted backbone and caramel. The fruity nuances are complex and the bitterness of citrus, pèine and grass. Very nice, except the can.", "Tasting @ fillepolo 20170310. Can from Systembolaget. Fruity, hoppy and caramely, pine needles and grapefruits, medium body with an oily texture. The finish is dry, fruity and hoppy.", "Beer tasting @ 10/3-17. Can from Systembolaget. Fruity and hoppy with grapefruit, caramel and pine needles. Body is medium, the finish is dry, hoppy and caramely with pine needles.", "Overhopped and over-resinous with an unpleasant aftertaste. Really not one for me though I’m clearly in the minority!", "0.33l can. Hazy yellow to golden with medium creamy white head. Aroma: caramel, mango, tangerine, yeast, malt. Taste: tangerine, juicy, resins, malty background. Medium body, moderate carbonation. High bitterness with long fruity aftertaste. Oily texture. Clean and fruity brew.", "Barwa jasnego złota, piana średnia. Aromat cytrusowy, tropikalny trochę żywiczny. W smaku słodkie białe owoce, żywiczność a potem genialna grapefruitowa goryczka. Goryczka która fajnie zalega. Brak alko w smaku i fajnie grzeje w przełyk. Świetne pifko.", "Can. Aroma- pleasant, but quite weak combination of resin and sweet tropical fruits. Great colour- pale and sunny. Clear, with a nice-looking, white head, which quickly falls down. Some tiny lacing. Taste- quite similar to the aroma. Again, there’re tropical fruits and forest notes, but not so clear. Medium-dry, with a subtle maltyness in the aftertaste. The bitterness is medium-high, but quite harsh and stalk-like. Medium-low-bodied, with a medium-low carbonation, which makes it very drinkable. All in all, it’s a good IPA, but for me too weak to be in the Top 50.", "Aroma: Citrus and light piney aroma. But not very lasting due to the smell of alcohol cover the aroma of hops.\r\nAppearance: clean orange with whitehead.\r\nTaste:medium malty, sweet and bitterness, quite balanced. \r\n\r\nA balance of freshing and relatively high alcohol IPA.", "Złocista barwa, piana niezbyt obfita. W aromacie mocno cytrusowo z owocami tropikalnymi. W smaku trochę zawód, bo w zasadzie czuć wręcz ordynarną łodygę i nic prócz tego choć da się to wypić.", "This one is a hop monster. Big on the grapefruit, pine and citrus on the nose. Taste is similar, but introduces some peach, lemon, lime and mango. A good quality beer, but nothing to separate it from the crowded market of IPAs. Tried as Stone Berlin.", "Duft frisk citrus lime humle smag frisk citrus lodt gran lidt bitter kant maltet", "33cl can from local Alko, Viikki. Excellent IPA which sets the standard to IPA in my books. Nice hops and length with delicious tropical fruits. Brilliant!", "330 ml can as Stone Berlin, served in tulip. Medium pale orange colour, slight mango smell. White head not long lasting. Blue cheese (Roquefort, Gorgonzola) and grapefruit aroma. Very bitter and salty, full-flavoured and spicy. Flat carbonated, medium body. Very bitter finish and long lasting aftertaste. Sophisticated IPA and quite interesting.", "Can. Light yellow, almost clear, with big white and very solid head, good lacing. Strong citrus hoppy aroma with some grassy and herbal notes, very pleasant. Light body, dry but not watery, little bit sweet start with strong herbal bitterness. Excellent and very drinkable ipa.", "citrus and light piney hop aromas. hop forward, strong citrus and piney flavors, underlying light caramel malt notes", "Klasyczne IPA ze Stone’a wygląda bardzo ładnie. Jest jasne, barwa to takie bardzo jasne złoto. Klarowne. Piana jest biała, bardzo obfita, nawet dość puszysta zbudowana z małych i średnich oczek, które po kilku chwilach pękają, piana opada i pozostaje po niej gruby pierścień przy brzegach, jest też trochę śladów na ściankach. Aromat typowe dla AIPA cytrusy i trochę owoców tropikalnych. Byloby bardzo przyjemnie, gdyby nie to, że jest też wyraźny DMS, który mocno przeszkadza i psuje wrażenie. W smaku przede wszystkim wyraźna, bardzo fajna, charakterna, wysoka grejpfrutowa goryczka, nie zalegająca. Owoce cytrusowe, grejpfrut, pomarańcza, mandarynka - początek owocowy i słodki, ale natychmiast skontrowany wspomnianą goryczką, przez co generalnie piwo jest wytrawne. Ciała jest sporo, nie jest gęste, ale jest treściwe, wysycenie jest niskie. Bardzo dobry przedstawiciel stylu West Coast IPA. Wierzę, że wada w aromacie to mój niefart, że trafiłem może na gorszą warkę. Bez tego, byłoby bardzo dobrze."]}