{"reviews": ["Ambrata con ampia schiuma persistente. Aromi fruttati, ananas, agrume; si sente un accenno di caramello. In bocca sensazione dolciastra spenta in fretta da un amaro intenso e un po' di astringenza finale.\nC'è di meglio.", "Rich taste but I was expecting something more, above the average anyway. Aroma and mouthfeel above the average as well.", "Pours amber with a small quickly fading head white head.\nNose shows herbal and spicy hops along with some grapefruit and restrained clean malt.\nFlavours include more spicy, piny hops and some grapefruit along with gentle malt with slight grainy notes.\nBody feels a little watery.", "Butelka. Wygląd - jasnobursztynowa barwa, lekko zamglone, z kożuszkiem drobnej piany. Aromat - trawiatość, kwiatowość, lekka słodowość, nuty karmelowe. Smak - półsłodkie, trochę ziołowe, trochę słodowe, ciało stajnie, faktura dość gładka, nasycenie w stronę wysokiego, goryczka średnia, dość długim finiszem i fajnym ziołowym aftertaste'em.", "C: amber\nN: sweet grapefruit, light tangerine, light resin\nP: med carbonation, hoppy, dry, quite bitter, light tangerine, citrus rind.", "IPA start level per chi vuole iniziare a conoscere il mondo di questo stile. Invitante l'aspetto, con un livello di carbonazione buono e schiuma abbastanza persistente che preserva l'aroma per un lungo tempo. Al primo assaggio l'amaro risalta al palato, ma senza infastidire. In seguito il gusto si ammorbidisce rendendo la birra beverina e fresca, ideale per un clima caldo e umido siciliano. Il retrogusto lascia al palato sensazioni astringenti di mela verde. Se si abbina in un aperitivo a sapori forti come possono essere BBQ bulls (snacks di mais) con sapori agrodolci, rende al massimo delle potenzialità. Menzione speciale per l'etichetta molto bella, con il cane Doggone.", "Slightly hoppy taste with hints of citrus that are not overpowering. The beer is smooth and accessible.", "Dark yellow/honey colour with white head. Smell of hops, citrus and pine. Taste of hops, citrus, sweetened with honey . Very refreshing and tasted on a cafe near Musee D'Orsay with S.", "Helder goudblond bier. Bitter en zoet. Zacht. Hoppig, verder karamel en brood.", "Orange Farbe, wenig Schaum, Bitterkeit deutlich schmeckbar, Geruch unauffällig.", "Nice hoppy aroma. Lovely hop taste of malt , lingering hops , malt and honey. Quite light for the 6.2% alcohol. Nice.", "Colore dorato, schiuma abbondante poco persistente. Al naso sentori erbacei e resinosi. Al palato erba, leggeri sentori fruttati. Il gusto a una componente leggermente dolce, per poi scomparire in un finale secco e amaro. Una birra abbastanza equilibrata, molto etbacea il corpo è leggero,", "Liquide doré transparent avec mousse courte et persistante. Nez légèrement malté et résineux. En bouche, c'est une attaque assez douce et à peine agrumes débouchant sur une amertume assez résineuse, correct !", "Clara dourada,espuma cremosa bem formada e duradoura ;aroma cítrico,herbáceo,terroso;sabor delicioso,limpo,cítrico,resinoso,refrescante,alta drinkability;corpo médio,boa carbonatação,final seco pedindo outro gole.\nÓtima IPA,uma referência.", "Una cerveza con un color ámbar cobrizo, con una espuma generosa y medianamente persistente. Notas a caramelo, fruta y un toque de plátano. Con un amargor y muy bueno, refrescante, y con buen retrogusto.", "W aromacie karmel, cytrusy.\nBarwa miedziana, piana ładna, klarowne.\nW smaku wytrawne, cytrusowe, nutka karmelu.\nGoryczka średnia, przyjemna. Wysycenie niskie. Klasyczna ipa, taki east coast, solidne.", "Schiuma abbondante, colore ambra/miele tendente leggermente al bruno torbido, intenso profumo floreale che ti trascina. Palato leggermente frizzantino con uno strato dominante di luppolo, cioé erbaceo amarognolo, che purtuttavia non é tanto marcato da infastidire. Ottima per le serate in cui vi mollate con la vostra ragazza: vi darà l'impressione di avere qualcosa di davvero interessante e nuovo, distraendovi così dal mal d'amore. Oppure, consigliata anche nelle serate in cui ne incontrate una nuova: la terza birra ve la farà apparire più bella di quel che é.", "Buona birra nel complesso, ipa bella amara, buon naso da luppolo e anche un bel palato con sentori erbacei del luppolo da amaro, mentre il luppolo da aroma è in stile inglese molto terroso, nel complesso una birra piacevole e ricca. La schiuma non è persistente", "One of the first US craft beers I ever had (many many years ago), and a great introduction to US IPAs - pours a lovely clear pale gold with a frothy white head and a piney, citrus, floral aroma. Softly carbonated and smooth, with grapefruit bitterness, some caramel sweetness and floral hops all combining very nicely", "Аромат хмелевой, много горячи от шишек, это выражается в травянистости, ну может немного цитрусовых и все. Цвет обычный, полу мутный, желтый, пенка кстати плотная и долго не падает. Вкус очень горький, прямо вяжет на языке от горячи. Много трав и леса. При глотке все усиливается. В целом классика, но после Нью Ингланда, идет тяжело.", "Ein ganz hervorragendes IPA, das mir aus Italien mitgebracht wurde. Hervorstechender Geruch nach Pfirsich, Grapefruit und Zitrus. Vollmundig im Geschmack und leicht herb im Abgang 👌", "Bottle. Clear dark gold with a really nice white head. Aroma of grapefruits, lemons, oranges, pine and some biscuits. Taste of citrus fruits, malts, caramel, pine and resin. Strong and lasting bitterness. Medium carbonation. Balanced. Nice one.", "0,355l bottle. A clear amber beer with a rich creamy white head. Strong aroma with notes of pine, flowers, hops, sweet citrus, lime, caramel, peach and fruits. Slightly bitter flavour with notes of fruity hops. Stunning bitter, dry aftertaste.", "0,33 bottle. Az üveg és címke klasszikus, a ser színe közepes arany, szűrt,  habja fehér, átlagos. Illata gyümölcs, főleg narancs, barack, nem túl intenzív. Az íz: IPA . Keserű, komlós, gyantás, sokáig érezhető. Ezt szeretem bennük. Inkább gyümölcsös apa beütés, de nem rossz, egy nagyon selymes jó kis IPA. Szénsav kevés így több az íz.  Kifejezetten jó. *** Újabb kóstolás - ezt Olaszországból kaptam : minden ugyanolyan. Jó, megbízható IPA. \n***\nThe glass and label are classic, the color of the ser is medium gold, filtered, the foam is white and medium. The aroma of fruit, especially orange, peach, not very intense. The taste: IPA. Bitter, hopy, resinous, long lasting. That's what I love about them. I prefer fruity dad punch, but not bad, a very silky good little IPA. Carbonic acid is low so it tastes more. Good", "Amber, minimum foam, almost none\n\nSweet malt, barf, wet floor, pine, no hops at all.\n\nMaybe the one I have gone bad.  Only thing left is sweet malt on the palate with medium hoppy sweet malt finish.", "The aroma is very pleasand and give you many tropical fruits. The taste is ultra smooth and has bitter/ sour direction. Many fruits there. Grapefruits, Mango, Orange ect. The mouthfeel is great and the carbonation soft.\nAll in all, one of the most pleasable \"IPA\" I have drink. Really, very serious beer.", "Pours a clear golden yellow with a medium white head. Some floral notes. The flavor was a citrus, hoppy flavor with a mildly bitter finish. I could drink this beer again.", "Amberkleurig bier  met een gebroken witte schuimkraag. Tropische fruit Geuren en smaken. Ananas, grapefruit,  limoen en een vleugje caramel. Aangenaam bitter.", "@ Röhälla 20210720. Can (330 ml) from Systembolaget.\nHoppy, fruity and caramely with grapefruit and pine, medium body with an oily texture.\nThe finish is bitter and fruity.", "Elle fait partie des classiques concernant les IPA, et c'est mérité !\nRobe blonde dorée, avec une très légère mousse. Bien sûr, on a le droit à des notes très fuitées, et surtout des agrumes qui apportent une belle amertume. Dans le style, c'est hyper efficace donc si vous aimez les IPA, vous pouvez y aller les yeux fermés !", "Goudkleurig bier met een stevige witte schuimkraag met fijne structuur. Geuren van citrus en een fruitige smaak met bittere afdronk. Redelijk 'cleane' IPA.", "Clear golden with a white head, moderate but with a good lacing and retention.\nAroma: Hops: Grapefruit, citrus, grass, passion fruit, orange. Malt: Hay, grains.\nMouth: Mostly bitter of course, Some fruity sweetness, but overall impression is dry. Watery. Medium body.", "Robe orange dorée, limpide, moyennement effervescente\nSenteurs mangue, melon, agrumes et pins.\nPremière gorgée rafraichissante très portée sur le pin et le houblon, la suite porte sur les agrumes, le miel, le citra et l'ananas.\nFinale sèche sur des notes herbacées et de sève de pin.\nUne IPA intéressante à un prix raisonnable, une bonne compagnie pour une classique de l'apéro sans se ruiner !\nPar contre, rien à envier aux ténors du genre, elle ne concourra pas dans la cour des grandes ;)", "0.33 flaske på El Paso i Kragerø. Mørk gul/gyllen. Masse kullsyre. Deilig Og veldig typisk India Pale Ale med god ettersmak og middels bitter..", "355ml bottle from store, drinking it at home after a pizza on 10/06/2021 BB 03-03-2022 Pours a very nice crystal clear amber with some not too long lasting frothy off-white head on top, nice lacing. Good aroma of malt, quite resinous, pine, very hoppy, orange, grapefruit, tropical fruits.. Taste is sweet and malty at first, with nice caramel, pine, orange and grapefruit notes and a pretty strong and dry, bitter finish. Quite a resinous and bitter aftertaste that keeps on going with each sip but is kind of balanced by the starting malt and caramel sweetness. A bit lightly flavored at start though, before the hoppy bitterness kicks in and stays. Moderate body and a bit oily texture, medium carbonation. 6.2% abv and very drinkable, good and very hoppy west coast ipa if a bit aggressive in the finish. Quite a nice one!", "Clear amber, big frothy head.\nBig aroma of hops, pine, tropical fruit. Very good.\nTaste is a little sweet, lots of pine. Some tropical fruits. Nice bitterness at the end.\nGood", "Pours a structured  foam head on a crystal clear amber. Good carbonation. Aroma is light and malty. Balanced malt and hops taste with a very thick mouthfeel. Light citrus and coriander, and quite bitter aftertaste.", "Alone at home. Goldblond colored beer with small white head and no carbonation visible. Hopped floral aroma. Full sparkling palate. Finish is bitter spiced dry", "355ml bottle brewed in Holland(!) at 6.2%. Clear golden-amber with a good-sized, fair-duration head. Brown bread malt and orange peel and floral zest on top of melon rind aroma. Moderate carbonation, decent body. Lightly floral finish, reminiscent of lilac and tangerine. Brown bread malt in the aftertaste alongside orange citrus twang. Real fleshy orange vibes here, with good grapefruit dryness. Very solid premium supermarket offering; even brewed under license this does give you a good idea of what cutting-edge USA craft IPA is like, albeit more of an idea than an outright example.", "Easing out of lockdown, April 2021. Keg at Winston Hotel, Southampton. Quite drinkable, but tastes like a standard 5%  hoppy lager (which always tend to taste like a dry, thin hoppy 4% ale) rather than a 6.2% ale, let alone an American style IPA. Hmm. Anyway, refreshing and quite harmless. I wouldn't object to another, though I'd prefer a proper beer. [2.6] \n\nMarch 2017. 355ml brown bottle from some supermarket. Reasonably bold modern hops on a pale biscuit malt base. The usual thing. You either like this sorts of beers or you don’t. They’re not my favourite style. Not enough malt character, too dead, too bland, and too much hop character, too zingy and sharp. And no yeast character - that’s been filtered out. Doesn’t feel like a 6% beer, and certainly not a 6% ale. The malt base could be a lager it so lacks character. Thankfully there’s not too many hops so this is at least drinkable, but it’s otherwise quite dull. [2.4]", "Thursday, April 15, 2021. Bottle, 33cL. 6.2%. Gift by Marielle. Merci :) A  shining amber clear beer with a medium white head ; short retention ; good lacing ! Light caramel, herb, hay, citrus. Light bitter, medium refreshing, weet note ; cristalline. Light to medium body, thin texture, average to soft gaseous, dry fruity refreshing finish. Overall, very good, great ! Pure, crystalline watery feeling ; no cereal-grainy character as in french craft IPAs (Popihn and so on...).", "De un color dorado oscuro, con dos dedos de espuma de buena retención. Cuerpo y carbonatación media. Aroma a lúpulo y malta. En boca destacan matices herbáceos y lupulados. Final seco.", "2 liters keg from home tap\nbitter grapefruit and resinous aroma\nlight sweetish caramel soon overwhelmed from rude hoppy taste\nover carbonated\nit's supposed to be sessionable but difficult to drink", "Nez agrumes. Amertume assez marquée mais ne prend pas le dessus. Mousse assez consistante.", "Clear blond colour, white foam. Nose of tropical fruit, citrus, a bit grassy. Medium sweet, some bitterness. Ok.", "Bière a forte odeur de fruit ,pour moi pêche litchi ,mais a forte amertume qui cache un peu le goût. légère agréable que je reprendrais avec plaisir", "Old rating from 18-05-15 - 355ml bottle, pours amber with a white foamy head. Aromas & tastes of citrus, orange, grapefruit, pine, bread & grass. Medium body. Moderate carbonation. Medium bitter finish. Enjoyable", "0,355 l bottle from Systembolaget Enköping. Good IPA, alhough not among best ones.", "Poured from 12 oz bottle into pint glass. 2\" sudsy off white head drops slowly with moderate lacing. Color is hazy orange with abundant streaming carbonation. Aroma dominated pine, citrus, tangerine, over white bread backbone. Mouthfeel is medium, sticky, with a slowly drying finish. Flavor bready malts with orange and pine resinous hops. Overall: excellent", "Super complex hop profile with an extremely palatable beer taste structure. It will overwhelm some of the more delicate foods, but stands up to (compliments) hearty or spicy meals.", "A strong smell of grapefruit and citrus. The medium large white frothy head has a normal duration, the body is dark orange. A quite bitter and strong taste, very dry. The body is medium strong with a lively carbonation.", "330ml bottle. Pours a darkish gold with medium amounts of pillowy white head. Grassy and pine hops on the nose with no heat. Medium body with mild grass and pine hops at ht efrint and light biscuity malt at the back. Has an interesting flavour throughout which I cannot pick, but I assume its due to being a different water source.", "IPA de llibre. Aroma d'herbes i amargor justa, retrogust agradable i refrescant.", "Blank, bit floral and fruity, very mild, brilliant golden to amber color with small sized white head, taste is bubblegum, floral, resin and citrus, thin body, average carbonation.", "Poured from a bottles, properly chilled. Amber in the glass with a moderate white head. Strong IPA flavor, yet pleasant with dinner. Best not to linger too long on the tongue. Let the smooth brew flow across the palate, and down the throat as an excellent compliment to your dinner.", "(bottle 12 fl.oz. from Americanbeer.cz online shop) Overall: Good IPA, malty-hoppy balanced.\n Aroma: Hops, pine, malty.\n Appearance: Clear dark golden. Medium, white head.\n Taste: Light sweet, malty, caramel, medium bitter, hops, pine, citrusy.\n Palate: Light-medium body. Bitter finish.", "amargor medio\nolor a lupulo herbal y pino\nespuma blanca media\ncolor tipo lager", "# 2311; 10/2020. Citrusy, resiny and tropical fruits in aroma. Deep gold brilliant body; white head. Tropical fruits, slightly caramel and alcohol. Very good IPA. 0,5 l, bottle, supermarket, Schlanders (Südtirol, Italy).", "0,33l lahvové zakoupeno přes nový internetový obchod americanbeer.cz. Na takto vysoké hodnocení docela průměrná IPA. Vysoká karamelovost, to mi na tomto pivu vadí nejvíce... Kdysi v 90 letech asi určitě super, ale v současnosti je pivovarský svět jinde.", "병을 열자마자 흘러나오는 시트러스향. 적당한 탄산과 과하지 않은 솔, 풀향이 깔끔한 마무리를 보여준다. 부담스럽지않게 시간을 보내기에 깔끔한 맥주", "Robe brune clair. Peu de mousse et de bulles . \nNez sur le canabis , le citron , la mangue , des notes de caramel.\nBouche sur la mangue , le caramel. \nAmertume assez forte , final sec.", "Easy IPA to drink and eat, nothing special but I liked, it is a honest IPA.", "Imperial pint can poured into a 20 oz Belgian Tulip.\n\nAroma is strong - it hits as soon as I cracked the can. Citrus and tropical. Orange and melon. Slight pine.\n\nClear deep amber color, topped by a tall bubbly head with OK retention, leaving thick lacing down the glass. Great look.\n\nTaste is an interesting combination of the citrus, tropical fruits, and (as a weaker player) pine. The bitterness begins in the aftertaste of the first sip and grows from there with each successive drink. The aftertaste is decidedly resiny and bitter. This influence grows, giving the entire taste a piney, resiny, and bitter dominance after half-way through or so, more than you might expect from the IBU rating. The citrus and tropical fruits remain as a delightful aspect throughout. I really like the taste of this beer overall.\n\nAs the beer warms, it develops a malty, slightly sweet undercarriage that balances the bitterness quite well.\n\nBody is moderate for the style, perhaps on the thick side (again, for the style).\n\nOverall, an excellent American IPA of the West Coast substyle.", "Aroma : Toasted sweet caramel malt, light citrus fruity hoppiness, with a faint herby/green vegetable note  Taste : As aroma. Light citrus hop, light caramel, light boiled green veg. Not horrible just a all too light and understated", "Bon... une IPA que j'apprécie, un peu au moins, c'est assez rare que pour le souligner. Elle m'a semblé plus maltée que houblonnée, et c'est sans doute ça qui m'a un peu séduit.", "Dark gold, small white head with some retention. Hoppy with grapefruit, tangerine and pine. Moderate body with a good malt content. Taste is quite sweet and malty at first and then a zingy tropical fruit and pine note, and then a moderately high bitterness kicks in but not overbearing. Best consumed warmer than fridge temperature though. This is an very good IPA, my only criticism would be I would like the carbonation to be a bit softer.", "Bona i clàssica West Coast. Predomini maltos, resinosa i punt de caramel. Amargor perfecta. Potent i consistent pels seus 6,2 abv. Fantàstica opció de lineal de supermercat. Ampolla de 355 ml del Carrefour", "With a glint in his eye and a spring in his step Terry Pemberton strode into the bookies and headed for the cashier. Last night he had placed a bet on Lagunitas India Pale Ale being a great beer. Today he was here to claim what was rightfully his.", "The description of this IPA on the beer menu promises citrus and fruit. Instead, I sensed many much heavier, pine-type hops, even a hint of gasoline spirits. A well-balanced strong taste, with just the right bitterness. Refreshing IPA.", "Bière pression bue au Kostaldea à Anglet, mousse peu persistante, robe dorée, fines bulles en petite quantité, senteur et surtout goût persistant au fond du palais avec d'agréables notes d'agrumes prononcées.", "Aroma of some citrus and some pine.  Nice gold color which a white head.  Sweet malt up front.  Some caramel and grapefruit.  Medium bitterness on the finish.", "From a shop in Italy. Golden Amber with a hint of orange. Thin head, very light citrusy nose. Flavor is smooth, thinner than expected for an IPA but refreshing and tasty. Lemon, melon, pine, very clean brew. Gotta get back to the bbq before the chicken burns...", "Clear copper pour with a medium white head. Aroma is fresh and crisp. Hops, pine, citrus fruits, mango, caramel. Taste over medium bitter sweet. Medium bodied with average carbo. Tasty IPA. Not spectacular but tasty nonetheless.", "355 ml bottle @ home, served in a teku glass, due date: 2021/03/17.\n\nAroma: very weak aromas of citrus, grapefruit, toasted malts, hints of sulfur when swirled. Hints of flowery and perfumy overtones.\n\nAppearance: light amber to copper color with light beige and very fluffy foam made of small to medium sized bubbles, high head thickness, low to medium retention, medium Brussels' lacing. No haziness. \n\nTaste: low to medium sweetness, medium bitterness, low sourness. Flavors of citrus, grapefruit, toasted and light caramel malts, caramel, hints of burnt caramel and burnt sugar, orange, tangerine. Balance is slightly toward the bitterness but well balanced for the style.\n\nMouthfeel: medium body, oily to watery texture, medium carbonation, medium long dry finish with medium bitterness and the same previously mentioned flavors. Alcohol is very well hidden and only noticeable because of its throat and mouth warming. Astringency is low but slightly noticeable.\n\nOverall: good appearance, weak aromas and more robust flavors of citrus, grapefruit, toasted and light caramel malts, orange, tangerine. This beer is brewed in Netherlands and maybe it's not as fresh as it should. I want to try the real thing because this one is not very good.", "Color dorado. Buena retención de espuma aunque sin tener una gran Corona. Refrescante. Retrogusto amargo y resinoso. Una ipa clásica", "Colore dorato brillante e schiuma persistente, profumo agrumato e retrogusto amaro resinoso.", "Cappello mediamente denso di dissipazione controllata. Colore arancio. Buona la persistenza dell’aroma con finale luppolato. Gusto una po’ spigoloso ma di buon effetto. Aromi erbacei e resinosi tipici della ipa.", "Bonne amertume. Un nez fruité. Une persistance en bouche. Un léger goût de malt. Plutôt sèche en bouche.", "So we have a weed smelling Beer from a weed loving brewery, maybe that’s why the founder sold to Heineken??? Cause Heineken was founded in Amsterdam if that needed explained. And Amsterdam is the weed capital, if that also needed explained! So the aroma is very interesting to say the least, and the flavour is just mayhem in your mouth, which makes it a fun, but beautifully imperfect Beer. Therefore, this mad experiment kind of works!\n\nRead the full review here:\nwww.beerwithus1.wordpress.com/2020/05/17/lagunitas-ipa", "Steady pour from a 19.2 oz can into an elongated tulip produced a soapy, 2-finger, off-white head riding on a clear, effervescent, honey-amber body. The head held up pretty well, fading slowly to a surface film that left traces of spotty lacing. Early scents of sweet malt and citrus - grapefruit, orange, lemon - with some late pine, wet grass and a whiff of skunky onion. Flavors of grapefruit, pineapple and pine, then crackers, grass and herbs. Well balanced, nicely carbonated, medium bodied, with a dry, mildly bitter, lingering finish. Still solid, West Coast old school!", "Robe paille qui tend sur le caramel\nDouceur d'orange confite en bouquet. Puis cette mousse neigeuse invite à liper. \nTrès amère. \nLa sucrosité attendue disparaît assez rapidement.\nL'amertume l'emporte.\nManque d'équilibre.", "Bottle 0,355ltr: Clear orange coloured brew with an dry bitter taste with hints of grapefruit, caramel an some subtle pine.", "Una cerveza de sabor muy potente en boca y altamente refrescante, al final se percibe altamente el lúpulo y un toque de naranja", "Testa bianca compatta e persistente con texture fine, corpo limpido color rame con splendidi riflessi arancio. Profumo di malto, pane e miele, agrumi, luppolatura erbacea. Al palato elegante base maltata, caramello, cracker, la parte luppolata porta sensazioni agrumate ed un bel finale luppolato, erbaceo e resinoso di pino. Ben bilanciate le componenti dolce e amaro. Corpo leggero ma solido e frizzantezza media e pungente. Buon IPA vecchia scuola.", "355 ml bottle. Dark golden colour, small head with average durability, partly lacing, soft carbonation. Nose is sweet malt, caramel, some honey, and fruity, peaches. Flavour is medium sweet, medium bitter, malty, herbal, grapefruit, light pine. Pretty good one!", "35.5cl can at home. Appearance: crystal clear golden with a fairly big white head. Aroma: quite malty, but mostly hops, orange peel, pineapple on syrup, some citrus. Taste: medium sweetness and high bitterness. Notes of malts, orange peel, hop bitterness. Palate: medium bodied, slick texture, lively carbonation and a dry finish. Overall: quite okay for a supermarket IPA", "Dark orange-gold color with off white head. Smells malty and fruity. Tastes very hoppy up front with a malty-floral sweet , acid aftertaste , not one of my favourites IPA .", "Bouteille de 33 CL achetée chez Super U. Robe dorée quasi limpide avec une fine mousse blanche. Arômes d'agrumes et de citron. Texture crémeuse, carbonatation moyenne, faible amertume et légère. Notes herbacées, houblons. Finale sèche.", "On tap at the Black Tap Bar, Las Vegas. Dark gold in colour with lots of citrus aromas and a fresh, tangy taste.", "Draft at J.M cafe in Rouen. Pours a medium white fluffy head... A clear amber to gold colour. Smells of hops citrus hay and grass. Tast is a lots of hops citrus grass fruity. Lots of carbo..", "355 ml bottle. Pours clear deep golden with small head. A: fruity, caramely, water melon T: medium carbonation and body, malty, mango, quite bitter, dry, much better when it warmed up, high drinkabillity,", "Simple and straightforward with a pine grove aroma, nice bitterness and sharp finish.", "Lovely IPA. Fully rounded with a subtle sweetness to it and no harsh notes. Fully recommended!", "Hops aroma is so subtle, almost imperceptible, a big mistake for an IPA. I liked so much the choose of the malts that give a pleasant biscuit taste without expiring in the caramelly. Golden clean color. Bitter as I expected . The foam is frothy and long lasting. It's a pity for the hops aroma.", "Smooth west coast ipa.fruity,bitter,pine.nothing to complain about.tastes better than typically from a bottle.", "Dzięki Krzysztof.\nWygląd: Barwa złota, klarowna. Piana biała, średniej wysokość, zbudowana głównie z drobnych oczek, opada do ostatniej warstwy pozostawiając średni lacing.\nAromat: Zbalansowane, słodkie białe i egzotyczne owoce, brzoskwinia, mango, gruszka, melon oraz słodowość chlebowa, lekko tostowa z subtelnym akcentem miodu na średnim poziomie. W tle niskie cytrusy w postaci pomelo i pomarańczy.\nSmak: Podobnie jak w aromacie, pojawia się średnia żywica dorównująca składowym z aromatu. W ustach półsłodkie, treściwość średniowysoka, bardzo gładka, kremowa i mączasta z lekką lepkością, wysycenie średnioniskie. Goryczka średnia, żywiczna, całkiem długa i miło zalegająca, przyjemna. Finisz półwytrawny z goryczką żywiczną i nutami owoców tropikalnych. \nOgólnie w aromacie i smaku zbalansowane. W smaku bardzo fajna żywiczna goryczka, pozostająca przez dłuższą chwile w ustach bez żadnego gryzienia, szorstkości. Ciało pełne, pszeniczne.", "This is a very good average ipa. Not the best, not the worst, just consistently good.\n\n---Rated via Beer Buddy for iPhone", "Tight fluffy white head stayed on a light copper coloured still body.\nMalt, stewed fruit & hoppy aroma.\nMedium bodied, soft on the tongue with a well carbonated back.\nBitter hops, malt, stewed fruit, pine & pithy tastes.\nBanging!", "0,355 l Flasche. Helles Bernstein, stabiler Schaum. Riecht und schmeckt nur dezent hopfig, leicht säuerlich, frisch, dazu angenehm bitter.", "Belle robe ambrée avec une mousse blanche discrète. \nDe beaux arômes houblonés.\nSuperbe amertume, belle complexité. \nTop a redeguster avec plaisir", "Bottle. Golden, average and mostly diminishing head. Moderate, malty and dryish - lightly sweetish aroma, faint caramel and light tropical fruitiness, citrus/light grapefruit hoppyness. Body is medium to full, malty and dryish - lightly sweetish, light caramel and light - some tropical fruitiness, some citrus/light grapefruit hoppyness. Finish is average, malty and dryish, - lightly sweetish faint caramel and light tropical fruitiness, citrus/light grapefruit hoppyness,. Well hopped IPA. Could be little bit drier.", "C est pas si mal pour une IPA grand public qui appartient au géant hollandais. Facile à boire", "Una buona IPA ... il profumo del luppolo non è particolarmente presente ma sufficiente per rispecchiare le caratteristiche del sul stile..amaro pungente nel finale nel complesso una buona birra!", "12 oz bottle. Smells of grapefruit and pine. Amber in color and clear. Bitter through and through, tastes of resinous pine and grapefruit, slight malt sweetness. Nice balance. Bitter finish. A solid IPA.", "Body: golden, crispy, thick white head.\nTaste: a bit of melon, bread and honey.\nAftertaste: long and hoppy.\nDecent PA sample, strong enough, full-bodied.", "Good bite, and strong flavor. Heavy aftertaste. Good beer nothing that will wow you. Pours nicely with a golden amber finish and good thick white head.", "I have found this bottle, at one monoprix, at Paris, Faubourg Saint-Antoine. Drinking and enjoying this bottle, at our rented flat, at Colmar, in september 2018. Unfortunately bought by heineken even though I have found this beer correct, a classical IPA with fair notes of pine tree, certain side of sweetness, eucalyptus, dry malt, average hop and bitterness.", "E ovo je prava IPA. Prava američka IPA sa 6,2% alk. Inače su amerikanci vrh što se tiče IPA-e, bar je takav moj dojam. Jako lijep miris, ugodna gorčina, perfekcija od pive. Pitka i traži još jedan gutljaj. Šteta pa nemam bar koju gajbu toga. :-/ uspio sam samo jednu 0,355 bocu donijeti iz Pariza.", "355 ml bottle. Unclear golden, big foamy head. Pine, grapefruit, mango, herbal hops, some caramel. Hoppy bitterness, malty sweetness. Full bodied, oily texture, soft to lively carbonated, dry hoppy finish. Good classic IPA!", "This beer has beautiful color, with an elegant head structure, presenting a quiet, expressive song. However, all this is folderol when the delightful hop bouquet springs forth, carrying one directly into the hop fields, themselves. But that, too, drops away as the dramatic intensity of the beer’s finely balanced flavor profile flows forth. I’m impressed.", "En copa, cerveza dorada con una fina capa de espuma blanca. Aroma fresco a pino y resina, junto con cereal blanco, fruta dulce muy madura, hierba, y una nota floral. En boca, textura ligera y acuosa, de carbonatación baja/media y amargor media en garganta. Sabor dulzón a fruta madura, junto con cereales, caramelo, hierba, pino, y un fondo muy resinoso. Una IPA que pese a no ser un cañón de lúpulo, resulta ser una delicia. Equilibrada, de gran aroma y sabor, con la amargor perfecta.", "Pours copper with really good head. Hoppy grassy sappy aroma. Creamy nutty piney flavor. Not a hop bomb like most west coast ipas, but a really fine balance of classic Brit IPAs and hop forward ones. I like it.", "Una clásica ya de supermercado. Esta buena, lo que hace pensar que cuando eran de verdad CRAFT debido estar espectacular. La consumo bastante", "Uzupełnienie ocen piwnych bez opisu z uwagi na przeniesienie z papierowych zapisków.", "Hazy amber beer with medium head. Citrusy aroma. Big hoppy bitterness with citrus and touch of pine. Lasting bitter aftertaste. I love this beer, partly because it reminds me of being in California.", "Great ipa in DFW, have a comfortable sleep on the plane after drink. 16oz a bit strong.", "Light amber/orange, bit hazy with medium white head. Slight citrus aroma.  Remarkable hoppy bitterness with quite strong lemon sourness.  Lasting bitter aftertaste", "355 ml bottle. Clear gold color with average white head. Smells nice coriander with some grapefruits. Taste are average IPA hops bitternes with some coriander notes and hidden grapefruits. Easy drinkable and refreshing. Average time aftertase grapefruits bitternes and some pineapple taste.", "Could be 4 seasons in CANADA! Reminds me of 1960s Labatt 'IPA', a brew faithful to the roots of the ideal recipe.", "Bottiglia 33ml. Colore ambrato chiaro, bollicina fine e schiuma media. Birra mediamente corposa dal profumo fresco di agrumi e miele. Sapore luppolato con buona persistenza. Non amo le Ipa ma a mio gusto questa é una birra gradevole.", "Didn’t like it. Uncommon taste of pineapples is really disruptive. I wouldn’t get this one again, I’d rather choose another beer.", "On tap at 'Foodhallen'. Clear, deep amber with a medium large, frothy, almost stable, off-white head. Sweetish, gently fruity-resiny aroma of mango, orange jam and some pine. Gently sweet, malty, moderately bitter, quite resiny and slightly fruity taste of orange jam, pine and some mango, followed by a short, gently bitter, quite resiny and slightly grassy finish. Medium body, smooth, slightly creamy and moderately effervescent mouthfeel, soft carbonation. Pleasant old school IPA.", "Golden pour with a nice creamy white head.  Citrusy with a hint of malt.  Very drinkable, good value, an everyday IPA.", "Aromat bardzo ładny, nie ma do czego się przyczepić. Niestety w smaku słabo, bardzo jednowymiarowo. Goryczka mocno zalega", "Decent tasting IPA. Aroma of pineapple. Doesn't really have the ordinary taste of the IPA.", "A good IPA that I had in the afternoon sun in Amsterdam. Definitely recommendable IPA.", "Draught at the craft beer shop in Maji Square near Yuan Shan MRT, on Jayne's leaving day. Aroma: pineapple, processed cheese. Appearance: clear dark amber, residual lacing. Palate: medium-bodied and astringent, average carbonation; bitter, very astringent finish. Taste: medium-bitter, grapefruit, some vanilla. Refreshing but ordinary.", "I just do not like this and I love IPA's. If it's the only IPA available to order I drink something else.", "A bitter disappointment - and not in a good way. Did Heineken took away all the flavour and hops?", "Llena de aroma y sabor tropical y de hierba fresca. Intensa, muy equilibrada, refrescante, de gran textura media y enorme bebestibilidad. Fantástica!", "Clear golden colour with an average white head. Malty, citrus, some lemon peel, piney, soft carbonation.", "Poured almost copper color, half inch but relatively thick head which stuck around and provided nice lacing to the end.  It was an ok balance of hops and malty background but the finish was harshly dry and bitter which leaves me with an overall \"meh\".\nOn tap at The Lake View House on Orange Lake, Newburgh, NY.", "Esta é uma cerveja excelente, normal, mas sem duvida a repetir. Ligeiramente amarga (gosto muito)", "Ipa très classique fruitée amertume moyenne sans interêt particulier mais facile a boire", "Bottle 355ml at M/S Silja Serenade. BBE 2020-02-19. Pours clear golden, off white head. Malts, caramel, grapefruit, pine, fruity hops.  Medium body, average carbonation, bitter finish.\n\nOriginal rating 8-3-8-3-15 from bottle (sample) at SBWF 2009 2009-09-26.", "Bottle, 0.355l. Clear amber/copper pour, two finger soapy white head. Good retention, long lasting. Lots of lacing on the glass. Nice on the nose, malty background, good hop character, fruity and herbal notes. \n\nMedium body, medium carbonation. Relatively thick texture, pleasantly chewy. Bittersweet taste, more on the bitter side. Seems a bit harsh and unbalanced but I have to say that this sample doesn't seem too fresh. Poor storage probably, shame. Otherwise, aroma is mostly fine, caramel malt a little bit more pronounced then it should be, hops in the background. Grassy hops and citruses. Strong herbal spicy notes. Dry. Finish is dominated by harsh lingering bitterness and caramel malt. Yeah, like I said - not so fresh sample, sadly.\n\nTherefore, I'll score it a bit lower then it probably deserves but I'll adjust my rating accordingly once I get ahold of a fresh sample.", "Lagunitas IPA 6.2%. Golden, citrusy aroma, light bodied, pale malt, earthy, tropical fruit, citrus fruit, pine, bitter fruity finish. Pleasant IPA from Petaluma, California 🇺🇸", "Bottle 0,33L. Clear golden/cooper color with small, frothy, white head. Aroma of pine, grass, nettle and herbs. Taste goes from light bitter start to medium to heavy bitter hoppy finish. Medium body, dry texture, soft carbonation, metallic finish. Very pleasant,  hoppy, bitter ipa!", "Nice taste if not a little sharp. Had it on holiday for the first time after being reluctant to try it but was pleasantly surprised. Overall a nice tipple.", "Muy buena IPA, con gran amargor. Buena espuma, buen color, agradable al paladar aunque puede resultar cítrica", "The beer that turned me onto IPAs. Still my go-to. Pricey but delicious. A little piney, more citrusy but not too much. If you don't like this, you don't like beer.", "#3219\nClear, gold, medium white head. Grainy aroma, some fruit. Taste is dry, grainy and grassy, lightly bitter, floral  and bit spicy. Medium & medium.", "355ml bottle. Pours clear deep golden colour, medium sized off-white head stays. Aroma is quite, grainy, malty sweet, buttery. Taste is malty, grainy, buttery, burnt caramel, aome mild grassy hops. Medium body, average carbonation. Easily drinkable, sweet brew", "Aromas cítricos y frutales\nAspecto rubio claro espuma poco persistente \nEn boca frutal y final cítrico amargo \n\n---Rated via Beer Buddy for iPhone", "Gold with a frothy to foamy white head. Peach and pine aroma. Taste is straightforward mildly bitter without any twists. Dry at the end. Okay.", "Draft at Moriartys. Clear gold pour with soft white foam. Big splashes of lace. Somewhat malty IPA. Feels full but not overly sweet. Earthy citrusy hops. Sugar cane. Mandarins. Bamboo. Warms to some additional woodiness. Not overly complex but well done.", "Tap. Dark orange colored, hazy with a full creamy white head. Nose is full of tropical fruits, mostly passion fruit along with some pineapple and citrus notes and hints of pine. Good strong bitter taste that is balanced by a light sweetness. Medium bodied and carbonated with a smooth mouthfeel. Flavor is tropical us well. Passion fruit and citrus with a stronger malty caramel note. Leaves a bitter and fruity aftertaste.", "Dark Golden, Clear, white BeerHead, with frothy, abundant foam. OK Head retention. Powerful citrusy and tropical fruits hints on the nose, like orange, litchi, pineapple, and zesty.Medium sweetness, soft carbonation, High bitterness,  crispy mouthfeel. Quite malty-sweetness in the mouth, also having light caramel, orange, litchi, slightly piney, and hop resins. Hoppy in the aftertaste.", "09.07.2019 -- 0.355l bottle from auchan in strasbourg, bb 12.12.2019. pours a clear golden with a medium head. aroma of woody hops, caramel. flavour of chewed pencil, spruce, grapefruit zest. not too sweet, more woody than juicy. long bitter finish. pleasant.", "This is a amazing, I have never try it! Taste good and I will buy it again.", "Bottle from Albert Heijn. Pours clear golden, bubbly off white head. C hop nose, some diacetyl. Smooth palatable. Bitter but balanced. Standard IPA", "Bottle 0.355l, many thanks, Rooz! Clear, deep gold colored. AROMA- citrusy, spicy, tropical fruit, malt, pleasant alcohol. FLAVOR- neutral, bitter, citrusy, tropical fruit, spicy and woody hops, slight touch of paper. Fuller bodied. \nGood, for macro brew.", "Mam sentyment do Lagunitas, bo to jeden z pierwszych kraftów jakie wypiłem świadomie. Oczywiście teraz ciężko jest je nazwać kraftowym (dla nie zorientowanych browar został wykupiony przez Heineken) Kolor złoty, praktycznie klarowny. Aromat niski, lekko owocowy. Smak słodki, owocowy, dość ciężki, ale mocno pijalny.", "Casi roza las IPAs belgas, donde el sabor maltoso y los lupulos nobles hacen que no sea amarga en exceso. Muy bien equilibrada. Espuma blanca de dos dedos con buena retencion", "Spina da 0,20. Schiuma scarsa e volatile. Colore oro. Carbonatura adeguata. Aromi erbacei, fiori di campo e pompelmo. Gusto molto deciso e secco, aggressiva al palato. IPA con gradazione moderata. Finale breve ma intenso. Consiglio 7/10.", "Color naranja pálido,sin turbiedad, transparente. Espuma blanca de dos dedos de espesor y muy buena retención. Aroma herbal, más ligeramente fruta tropical y cítrico, grano y malta caramelo al atemperar. Sabor en esa línea, algo más cítrico que tropical, ligero caramelo al atemperar, final seco, de amargor entre herbal y resinoso, alcohol bien integrado. Textura entre acuosa y oleosa. Carbonatación media.", "Drank in the waldorf pub Manchester, Friday night (2 days ago) I really enjoyed it, my missus was drinking it too she hates beer and she was impressed. Crisp, refreshing", "Belle couleur et bonne odeur. Une bonne ipa avec des notes de fruits pas trop marque et une amertume assez légère", "Bottle: 330 ml, at home Price: 1.99 eur\n\nLabai, labai gera IPA.", "Fyldig skum, mellem karbonering\nLet til mellem Humlet, ikke så bitter.\nSvag røget smag.", "Una cerveza Indian no muy amarga. Se sale un poco de la norma en este tipo. Agradable y gustosa. Muy rica.", "Alleen al het serveren in een confituurpot doet de waarde van dit bier halveren. Walgelijk. Weinig karakter, je proeft alleen felle hopbitterheid, zijnde stro, den en aarde, beetje citrus, weinig aromabitterheid.  Zo zie je maar dat het erin steken van zoveel mogelijk hoppen (43!) het bier niet noodzakelijk beter maakt.  Verveelt zeer snel.  En dit zou dan één van de populairste bieren van Amerika moeten zijn...", "Color dorado translúcido con espuma media blanca de buena retención y residuo medio. Aroma ligero a frutas de hueso maduras, hierba y caramelo. Sabor a caramelo, melocotón maduro, resina y notas a membrillo, pomelo y hierba. Dulzor ligero afrutado con final amargo resinoso de larga duración. Textura semi-oleosa, cuerpo medio y carbonatación medio-alta. Una muy buena IPA de fuerte carácter americano que roza lo rancio, resinosa y a precio decente.", "Fles op terras Brasserie Thuys, Sint-Oedenrode. Licht roodbruin bier met schuim. Smaak is bitter hoppig en fruitig met iets van thee, citrus en ananas. Mooie smaak balans.", "Espuma blanquecina que permanece con una consistencia media, color amarillo anaranjado transparente con burbujas puntuales brotando, aroma ligero y floral en nariz, sabor muy agradable con notas frutales no muy amarga y final seco.", "Clear pale golden colour, light white head. Strong fruity aroma, hints of pineapple, mango and tangerine. Bitter taste, hoppy flavor overall, some sweet malt blended with it. Light body, medium carbonation, bitter aftertaste. Good.", "Good straightforward and well balanced IPA. Hops and malt sit well together and a satisfying bitterness comes in at the end.", "Botella de 355 ml @ Carrefour Zaragoza.\nColor dorado ámbar, cristalina. Espuma blanca algo escasa, poca retención.\nAromas cítricos, pino y ligeras notas a cereal. En boca es afrutada (pomelo, piel de naranja), herbal y algo dulzona. Amargor medio-bajo. Final seco.", "0,355 l bottle. Pours amber golden with big rocky off white head. Plenty lacing from medium lasting head that leaves a permanent veil. Aroma  is quite hoppy, pine, tropical fruit, citruses along with caramel and bready malt base. Taste is medium sweet and medium bitter. Body is medium, mouthfeel slick and carbonation above average. Finish is long, hop driven with pleasant lingering bitterness. Very nice.", "V stanicnom pivovare. Krasna silna tropickoovocno chmelova vona. Medova farba a husta pena. Chut chmelova svieza mierne cukrikova. Na konci dlho ostava.", "Colore giallo scuro-ambrato, schiuma densa e persistente che vira verso il giallo, composta di bolle sottili. \n\nAl naso un aroma \"fresco\" di frutti tropicali (mango, etc).\nNel gusto viene lasciato spazio a note di agrumi.\nL'amaro al palato è forte e persistente. Il corpo è medio-alto. L'alcool si fa sentire ma non è invadente, non c'è la sensazione di \"calore\".\nIl finale riporta note fresche ed erbacee, con quel classico gusto acidulo e un po' secco che si sente in molte IPA. \n\nLa carbonazione è medio-alta. Perlage medio-sottile.\n\nL'intensità olfattiva e al gusto è molto forte ed è facile abituarsi subito agli aromi e anestetizzarsi il palato. Conviene fare qualche pausa o pulirsi il palato di tanto in tanto con un po' di cibo.\nInteressante come durante la bevuta emergano tutti i possibili principali profili aromatici del luppolo (frutti, poi agrumi, poi erbaceo).", "Pours clear dark golden with a white head. The aroma is slightly hoppy with some mats, pine, resin and bread. Medium body with a light carbonation, sweet and a light bitter. The flavor is not really IPA-like hoppy with pine, resin and some grapefruit along some bread-isch taste. Finishes with a piney bitterness. Overall decent but not really very special.", "Orange color, middle foam size. Good beer, aroma and taste fit into the style.", "Blonde au goût très prononcé: ce n'est pas une bière de soif diluée mais une bière solide complexe. Le houblon domine un arrière goût un peu amer. Pas mauvaise.", "Bevuta alla spina.\nAroma con buona componente di luppolo.\nColore ambrato, schiuma media. Molto limpida.\nGusto luppolato e amaro.\nfgP", "On tap in black tap, dubai. Pours golden copper with good head. Aroma is beatifull, fruity, mango, pineapple and zesty. Taste little let down compared to nose. Overall good beer.", "12 fl oz bottle. Appearance is an almost clear golden-copper colour, topped with a big two fingers head of white froth, which persists for a while. Aromas are a hoppy mix of tropical fruits, pineapple and mango I would hazard, but not distinct, and floral hops. Taste is nicely balanced combination of tropical fruity sweetness, malts, pine and bitter, without any flavour dominating. Medium bodied, nice average carbonation.", "Bottiglia. Il gusto al naso è indirizzato verso il luppolo. L'olfatto viene stimolato in maniera elevata e l'esistenza olfattiva è apprezzabile. Il cappello di schiuma ha una buona tenuta. La grandezza delle bollicine è medio-fine. Bollicine medio-fini costituiscono anche la forma del perlage. Il colore è giallo ambrato. Il corpo è strutturato. L'amaro è deciso. La forza gustativa è elevata e la durata è buona. Il gusto è piacevole. Le sensazioni boccali finali risultano luppolate e di pronta beva. Il finale è amarognolo. Il retrogusto è intenso. Al gusto vengono donati toni di miele, frutta secca, luppolo, agrumi, pompelmo e ananas.", "Kolor jasny bursztyn, lekko mętne. Biała czapa piany, obfita, drobna i trwała.\nNos: stęchłe cytrusy, żywica z drzew iglastych, mokre słody takie trochę już stęchłe.\nPaszcza: wyraźna słodycz, goryczka średnia, \nWłaśnie zauważyłem że piwo dzisiaj kupione przeze mnie w sklepie jest już dwa miesiące po terminie. Także spróbuje podejść niedługo jeszcze raz do tego piwa i skoryguję ocenę bo ta jest poniżej średniej dla tego piwa...\nPrzy drugiej próbie już zupełnie inaczej.\nPiękne aromaty egzotycznych owoców. Idealna goryczka w smaku.\nPozostaje mi tylko podnieść mocno ocenę dla tego piwa.", "Aroma 7. Appearance 4. Taste 7. Palate 4. Overall 15. Hops and citrus fruits aroma. Bitterness, mango, and citrus fruits taste. Long palate.", "Piwo koloru złotego, klarowne z jasną, puszystą pianką. W aromacie przyjemne cytrusy i dojrzałe, słodkie owoce tropikalne. W smaku dużo więcej cytrusów, a zwłaszcza grejpfruta, w tle owoce tropikalne. Trochę za wysokie wysycenie jak dla mnie, alkohol dobrze ukryty, ciało ok. Grejpfrutowa goryczka na finiszu. Na wczasach w miejscu, w którym trudno o jakieś dobre ipa, to piwo smakuje całkiem przyzwoicie.", "Amarilla dorada, translúcida. Eminentemente cítrica, equilibrada, no aporta nada nuevo pero cumple. Le falta algo de cuerpo no", "De Hipercor. En copa Teku. Jugando a Life of a Pixel Classic. IPA suave, no muy amarga, citrica, donde el dulzor de la malta no queda tapado por el lupulo y le da un agradable caracter acaramelado", "Bottle shared. Pours golden color. Aroma of citrus, malts, sweetness, pine, tropical fruits. Mediumish body, quite bitter.", "Copper pour. A: exotic fruit, pineapple, lychee, kiwi, citrus. T: bit watery, some malts, medium bitter. Finish is kiwi.", "Aroma: citrus, hoppy, little floral\nAppearance: amber, clear, white foam, nice head, \nTaste: hoppy, bitter, citrus \nMouthfeel: fresh, thin", "Dobry balans, zywicznego chmielu i tostowej podnudowy slodowej niszczy tepa goryczka.", "Bottle in a bar in Basel. Pours a clear dark golden with a white head. The aroma is medium hoppy and lightly malty with pine, resin and bread. Medium body with a light carbonation, a medium sweetness and a light bitterness. The flavor is again medium hoppy with pine, resin and some grapefruit along some bready malt. Finishes with a medium piney bitterness. Overall decent but not very special.\n\nAroma: 7\nAppearance: 4\nTaste: 7\nMouthfeel: 4\nOverall: 13", "Golden with firm white head. Lifted citrus hops with a caramel malt undertone. Palate clean, sweet delivery with a firm bitter finish.", "Salon piva.  Deep golden color with medium white head. Aroma of caramel, citrus hops. Taste, caramel malt, citrus hops, zest, pines. Medium long hoppy bitter finish.", "Tap at Salon piva. Easy drinking. Light caramelly backbone, moderate bitterness lingering into a long finish. Citrusy zesty hops character. Simple, good.", "Bottle as a gift drunk at home. Orange appearance with thin white head. Aroma is malt, earthy, hoppy and caramel. Flavour is fruity, hoppy, dry and malts.", "Fijne IPA uit het schap bij de lokale AH. Citrus, lekker hoppig midden,ietwat flauwe afdronk. 6,2% uit de USA. Maar onderdeel van Heineken.", "Gold with a nice white head and a floral, hoppy nose. Well-carbonated with a malty mouthfeel and a hoppy finish.", "Klassiker, schönes WestCoast IPA ohne viel drumherum , vollmundig, rund. Hohe Drinkability", "355ml bottle. Clear dark golden with a thin dissipating white head. Aroma of herbs, citrus hops, orange, bready malts, grass. Taste is similar to aroma. Slightly sweet arrival, which quickly develops into a hoppy bitterness which is the backbone of this beer. Malts subtly make their presence felt as well. Dry bitter finish. Medium mouthfeel. Solid.", "On tap at Schmoozy's, TLV airport. Clear gold, white head. Mild pine and citrus aroma, bitter, slightly dry, pink grapefruit taste with a hint of malt. Medium body, lively fizz, slightly buttery finish - taps are sure well-maintained here...", "Eines muss man den Amis lassen: IPA brauen können sie -besonders die von der Westküste.\nSo ist dieses ein wunderbar feingehopftes Bier mit schön komponierten Aromen, wo die Balance zwischen Bitterkeit und Süffigkeit passt.\nEin Bier für einen Feierabend, wenn die Außen-Temperatur auch etwas höher ist.", "Pours a clear, copper-gold, with minimal head. Aroma is quite grassy, with some bread, a touch of citrus, and a strong tang of piney hops. Flavor follows, with the hops more dominant. Quite a bitter, hoppy bite to the finish of this one. It's a good, workhorse of a beer, nothing too fancy here.", "Tap (O'Learys, Torp Airport). Clear, dark golden colour. Aroma is pour, delicate citrus, malty. Medium herbal, long bitterness. Too much carbonated but not so bad.", "Bottle. Golden blonde. Slightly herbal, citric aroma And flavor. Moderate hop character. Even a bit of smoke. Drinkable.", "35,5cl bottle, clear amber color, small lasting white head, malt aroma with fresh grass and grapefruit notes, balanced bitter flavor, light to medium body, floral finish with pine aftertaste, nice and refreshing", "Bottle at Jinso (Amsterdam Arena Boulevard). Dark yellow with a white head that fades rather quickly. Aroma of citrus and hops. The taste is bitter but with a sour undertone. The aftertaste is bitter!", "This beer have a beautiful taste. It has a hoppier taste, but it's not too heavy, and least but not last it has a very massive foam.", "Wonderful orange peel  and mango aroma, light head and orange hue color. The taste is absolutely exceptional wonderful with fresh hops and orange crisp citrus and again a taste of mango that knocks a Blue Moon out any day.", "Grabbed this as along with my 2nd sampling of New Dogtown Pale Ale.  For some reason I am finding the Pale Ale hoppier than this.  For an IPA, and compared to the other IPA/hybrids from Lags, I thought this would be hoppier than what it is.  Still a smooth IPA, crisp for the summer season, but will be going back to the Lil' Sumtins/Sumtin' Extras, Lucky 13s, or some of their others in the future.  Glad I finally got to try this after all these years....as it slipped by and had thought I had sampled.", "6 pack 355ml bottles, £4.99 in Harrods rival Home Bargain Bletchley. Decent brew straight from the bottle. Fruity, slightly spicy, fresh hops. Easy drinking and very enjoyable.", "Bottled Bumble Bee's Baja Grill, Santa Fe, New Mexico, USA. Not overly complex, but pleasantly bitter and easy to drink IPA.", "Golden body and white head. Sweet bread, grass, some citrus and mango aroma. Hop flavors of pine and tropical fruits with bitter finish. Medium body and carbonation. A good beer.", "evenwichtige IPA\nredelijk zwaar, maar niet storend\nschuimkraag verdwijnt snel\naanrader", "Bottle from Albert Heijn supermarket in Gorinchem, The Netherlands. \nThe beer is clear golden to amber colored and has a nice stable white head, with very good carbonation. \nThe aroma is light malty and very fruity, with notes of caramel malts, citrus, grass, flowers, mango, oranges, tropical fruits and spices. \nThe taste is medium bodied and starts with caramel malts, and goes to hoppy bitterness with a nice fruit explosion and in the end spices. \nThe finish is refreshingly dry and pretty bitter.", "Botella 355ml  Color Ambar clara,espuma blanca,altas,fina,resistente.Aroma notas citricas,pino,frutal.Sabor amargor moderado,citrico,frutal", "12floz bottle, no date, marker cost is $9/six-pack, pint glass. Aroma - grapefruit and honey. Appearance  - golden with freat clarity and a whitish head that provides lacing. Taste - moderately bitter, grapefruit and toast. Mouthfeel - medium bodied and carbonation. Overall - your prototypical AIPA...good.", "Amber body, white foamy head, just one of the best west coast IPAs out there", "Clear amber color with off-white head. Aroma has piney hops and sweet orange peel. Taste is a bit sweet at first with tangerine flavor, gets more bitter towards the finish with resiny hop notes and bittersweet orange candy. Medium body and carbonation. Really well balanced and easy drinking IPA.", "Dark yellow with a medium, off-white head. The aroma is of grapefruit and resin. The taste is likewise, solid grapefruit and pine resin with just a hint of maltiness. Very solid IPA.", "Very hoppy IPA with strong bitterness. Appearance is deep orange, almost clear.", "As good as they come... I wish we had some more Lagunitas selections in Canada - I can only get this one in the chubby 355ml bottles (also the 12th of Never)... I think they went a little crazy with the \"43 different hops and 65 various malts\" but what do I know - I just drink them...! A great very satisfying beer for all occasions - just a notch below the 12th!", "Excellent bier.  Hoppy smell bitterrness expected,  but not the hop bombs which call themselves IPA.  This is another of what I call a true IPA.  On tasting the wonderful carbonation pushes the malt around the mouth with the hops and the lingering bitterness.  To be honest the true wonderful hop flavour lies in the after taste.  Beautiful golden colour great head retention and soooo sessionable if you can stand 6% bier all day.  The perfect bier.", "Appearance: bright golden, great head\nAroma: good nose, fresh citrus and pine\nPalate: medium Full mouthfeel, medium low carbonation\nTaste: solid hop flavours, pine, tropical fruits\nOverall: great beer", "It’s an awesome IPA man. Said nobody ever. NO. It’s an overkill of rotten hops.", "Fra flaske\nKlar og gylden med hvidt skum.\nAroma af harpiks, metal, malt, citrus.\nSmager let og bittert med høj karbonering. \nBitter finish.", "Dark yellow/orange in color, foam leaves nice and thick traice of it on the walls of glass. Taste: balanced bitter, lingeres in aftertaste.", "Bevuta in bottiglia.  IPA dal colore dorato. Buona e non particolarmente amara.", "5 January 2019. At Westies, Ghent. Cheers to Eurogamer crew!\n\nFrom tap. Pours clear golden/orange with a lasting, small, frothy, off-white head; little lacing. Aroma of lime juice, lemon zest, unripe mandarin, mango, pineapple, perfumed hand soap, flowers, yellow grapefruit, golden berries, pine needle & onion. Taste is light fruity sweet, 'basic' apple peel, some pineapple & mango on a bready malty base, faintly yeasty; light to medium hoppy bitter middle brings yellow grapefruit & orange rind, a bit piney & grassy too, accent of sourish lemon zest. Dryish, piney & grassy hoppy finish, lingering bitter fruit rinds, yeast, mango & apple peel. Medium body, slick/oily texture, soft carbonation. Classic IPA, drinkable & accessible.", "Robe Blonde. \nLégère mousse.\nPleine de bulles.\nAmertume et goût typique du houblon Citra: Fruit de la passion, légères touches d'ananas.\n\nUne bonne IPA industrielle.", "Un fruité d’agrumes mettant en vedette l’orange, le citron et le pamplemousse titille le nez. Notes de sapin Beaumier et subtilités florales également perçues. Grosse mousse dense et crémeuse sur liquide ambré, clair et pétillant, laissant une magnifique dentelle sur le verre. Entrée de bouche effervescente et piquante suivi d’un léger fruité et d’une finale plutôt terreuse. Le fruité et de levure et des houblons est important et se développe sous forme d’orange, de pêche, de poire et de subtiles fleurs des champs. La base maltée est sous-jacente au fruité et nous laisse une impression de doux caramel. La finale se veut un mélange de terre et de sapin. De corpulence moyenne et de texture onctueuse, elle développe une vive effervescence qui lui donne un indice de buvabilité très élevé. Une IPA Américaine certes et superbement bien bâtie, mais avec une touche Anglaise bien sentie.", "The original and first IPA I fell in love with. Strong citrus smells, and full aromas. Slight bitterness, yet a great example of an American west coast style IPA.", "Flasche 0,355l: Bernstein, leicht orange, klar, stabiler feinporiger Schaum; sehr frische + fruchtige Nase, fruchtige Süße, Zitrusnoten, Orangen, Limetten, Limettensaft, kräftige frische Hopfennoten, Malz, Getreide, etwas Karamell, Hefearomen, leichte fruchtige Säure; fruchtiger + frischer Körper, kräftige frische Hopfennoten, würzig, Zitrusnoten, bittere Orangen, Grapefruit, etwas Grapefruitzest, cremig, kräftige Kohlensäure, leichte Hefearomen, zunehmend trockener; angenehmer fruchtig-trockener Nachgang mit kräftigen Hopfenaromen", "Draft.  Reasonably hoppy aroma and flavor, but has a mild off-flavor, like a singer in a choir who's just off-key to be noticed.  Overall not bad, just not a first-tier IPA.", "355mL d'une IPA d'une brasserie à cheval entre la Californie et l'Illinois, voilà ce que nous réserve cette Lagunitas au nom bien hispanique. Blonde bien rousse et totalement translucide, petit collet de mousse blanche qui colle au verre, stable sur 1mm.  Nez très floral dans la grande tradition des IPA modernes Américaines, sur la bergamote, la lavande, la sauge, le thé vert, le jasmin ainsi que sur les agrumes (citron vert, pamplemousse, mandarine). Les arômes de caramel et de cassonade sont aussi très présents, peut être même un peu trop pour une IPA ce qui a tendance à l’alourdir. En bouche, bonne carbonatation, alcool digne de ses 6.2%, beaucoup de sucres comme les senteurs le laissaient présager, texture souple un peu collante et pour finir une bonne amertume assez vive sur le démarrage mais qui sait s'étaler sur la longueur. Côté arômes, on est sur sa faim pour ne pas dire sur sa soif. C'est assez neutre sur le malt, et hélas, on ne ressent pas vraiment les notes d'agrumes au palet ni le grand frisson sur la langue. L'arrière bouche est maigre, et dans la longueur ne persiste que des notes sucrées/maltées qui finissent par nous lasser. Il en résulte l'impression de boire un jus de malt pétillant et houblonné grossièrement. Une bière très moyenne, buvable cependant mais sans aucune accroche notable.", "Passible, though not particularly notable IPA.  Sweeter malt base. Piney floral hops that fairly mild. Decent balance, ok in a pinch.", "0,35l bottle. Pours clear golden/copper with off-white head. Aroma of citrus, citrus peel, piney, tropical fruits, more peel than anything else in the aroma. Taste is tropical fruit(mostly mango), orange/tangerine, fruity. Light body, decent carbonation.", "Clear golden pour with a fine thick off white head. Nice lacing. Unusual low hop intensity in the aroma. More caramel malty. Decent sweetness and an ok bitterness. Fine carbonation level. Caramel malty, mild resinous and a bit grapefruit hoppy. Decent beer, but I hope for some more hops in the profile.\n[Bottle from Systembolaget in Sweden]", "Pours amber with fine carbonation and a thick white head. Aroma of malt and hops. Taste is smooth with a sharp hop bite that gradually fades to malt. Palate contains lemongrass, citrus and pine. Excellent IPA.", "Aroma is medium to heavy hoppy and light malty. It smells like grapefruit, pepper, hay, quite resinous, with a subtle note of mango or passion fruit. Clear golden to amber color with a medium sized, frothy, white head. Flavor is medium sweet, medium bitter. It tastes like grain, tropical fruit, herbs or green tea, less resinous. Body is medium, mouthfeel is thin to oily. Finish is short and medium bitter. Nice, but not really my taste. 0,33l bottle from Ammersin Vienna.", "Draught at Lundy Foot's Bar, Dublin, Ireland. Poured a crystal clear amber with 5mm of white open foam that retained very well and laced well. Carbonation low, average and fine to medium. Aroma strongly of citrusy hops and pine. Taste of grapefruit and resinous pine with a nice strong hoppy bitterness; tasty, fruity, juicy. Light to medium body. Slightly dry with a resinous mouthfeel and a lingering bitterness.", "Draught. Cooked veggies, corn. Onion in mouth. Harsh bitterness but in a way I pretty like.  Not bad airport timekiller.", "Fles 35,5cl bij Hardrock café in Dubai.  Hopbitters, citrus, licht droog, pineapple, tropische fruit, malten komen er achteraan. (6-12-2018).", "Heineken, so not sure you can call it draft. That said, its a nice drink. Darker that i like my IPAs.", "Light amber colour. Clear. Aroma is a little bit fruity, I reckon. Taste is fairly sweet with a medium level of bitterness. Meh.", "Bottle shared with JFE at Vaaland Bryghuus 01.12.18. Translucent golden. Persistent white head and lacing. Excellent aroma and taste of dried tropical fruits, mango, citrus and Sevilla marmalade. Medium high bitterness. Full mouthfeel.", "Aromatic, mango and banana. Fruity and appealing, well balanced, fine malt balance", "20oz at the Gordon Ramsay's, Las Vegas. Aroma is light mango, light banana. Appearance is cristal golden with a fine white head. Dry. Full body. Great.", "Lukt: sevje, humle, sorachi ace fra brooklyn (gjær?). Malt: karamell. \nSmak: humlete: gress, litt sevja, sitrus, appelsin?, skog, furu. Medium malt: caramell, litt havrete, \nVeldig fin og balansert. Kan sies å være lik en sierra nevada, bare med mindre malt og mindre skog. Denne er litt mer forsiktig. \nEn veldig god og «avslappa» IPA: prøver ikke å få deg starstruck. Den er bare en god øl. \nLett å drikke, lett å elske.\n7,2/10\n181126", "Very bitter and rather dry, citrus flavours are enjoyable but all in all not a drink you can enjoy after the first bottle.", "Pours clear golden with white head. Well carbonated, good head retention. Citrus and melon hop aroma along with a bready and slight caramel malt aroma. Quite a bit of hop bitterness in the flavour. Fairly light mouthfeel, fades quickly in the finish. I’d like a little more body and a fuller finish, but nonetheless a good and solid IPA.", "Color ámbar, con una ligera neblina. Dos dedos de espuma con buena retención. Aroma y gusto en la misma línea, hierba, pino, pomelo y malta caramelo. Cuerpo acuoso. En buenas condiciones es una gran cerveza, pero dada su alta exportación te puedes encontrar con botellas i barriles con el lúpulo degradado.", "Burk 355 ml från Systembolaget. Guldgul och med skum som sedan lägger sig på insidan av glaset. Doft av ananas och mango. Smak av humle, apelsin, mango, honung och tallbarr. Rejäl beska med torr eftersmak. Mycket god och prisvärd IPA.", "Profumata, discreta, gradevole. Colore d'oro carico, schiuma abbondante e persistente. Naso non invadente di agrumi ed erbe fresche, al palato amaro di luppolo ben legato con gli aromi fruttati. Amaro persistente e non eccessivo. Carbonazione bel calibrata.", "One of the best beers I've had! Clear light amber with not too fine medium head. Strong fruity hops aroma in the nose, dominated by red berries and citrus, but not exaggerated fruity hops aroma i the mouth, actually almost as much flowery. Luckily not too sweet, very nice and strong body. Just a good combination of components all around.", "Bottle. Best before 01 2019. Clear deep golden. Tall rocky head. Perfect retention. Aroma: honey, grains, resiny hops. Medium body. Taste: on the hop side, medium bitter with light sweet background. Clean. Long bitter hoppy finish. Good", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "Thin head, fruity, subtle burnt tangerine flavour, long bitter finish. Nice.", "Buona birra, colore ambrato chiaro con una schiuma biancastra, piacevoli odori di agrumi. Al palato fa trapelare la sua alcolicità che persiste un bel po’ dopo la bevuta. Abbastanza rotonda, dolciastra e senza particolari sfumature. Una buona birra.", "355 ml bottle, served in a snifter. Poured clear golden amber with one finger white head. Aroma: grassy hops, flowers, pine, caramel, grapefruit, orange peel, lemon peel, sweet malts. Taste: citrus, grass, pine, caramel, bitter hops, lemon, orange, grapefruit, pineapple, vanilla, flowers, lemon merengue, sweet malts, bread with raspberry jam, figs. Light to medium body with hoppy bittersweet finish. Nice...", "@ Bjällerödsvägen 21/10-18. Bottle from Systembolaget. Fruity and hoppy with citrus and grapefruit. Body is medium, the finish is dry and fruity.", "Donkerblond/oranjekleurig met romige off-white schuimkraag die redelijk snel inzakt. Mandarijn, appelsien, caramel, lichte hars. Mooi vol, licht romig in de mond met een mild bittere afdronk. Prima ipa.", "A: Light amber with a medium white head\r\nN: Orange and lemon zest\r\nT: Nice and bitter. Orange pith, orange zest, nice juiciness. \r\nP: Medium-thin\r\nO: Absolutely brilliant and clean", "0.33l. Pours in cold orange colour with short living white head. Aromas of citrus, grapefruit. Lightly sweet, higly bitter no sourness, grapefruity bitter aftertaste. Medium body, thick feel, average carbonization.", "Fruitige en bloemige IPA met tonen van hop en van bitterheid. Bier heeft een mooie hoeveelheid koolzuur en een droge nasmaak. -backlog de BierApp-", "Tap @ Cafe Kobalt, Amsterdam X 2018. Goeie standaard IPA met een frisse doorzichtige gele kleur alsof het een lager betreft. Fruitig smaakvol, niet te bitter, niet te zoet en goed doordrinkbaar. Maar wat een vreselijk lomp glas wordt het in geserveerd. Het lijkt op een jampot. Ik snap niet waarom de brouwer hiervoor gekozen heeft. Dit glas komt de frisse fruitige smaak ook zeker niet te goede. Dat is jammer, dit doe ik eigenlijk nooit maar heb gevraagd of het volgende biertje in een glas van de concurrent kon worden ingeschonken. Om toch optimaal van deze IPA te kunnen genieten. Origineel glas eerst een jam potje en nu een vaasje allebij geen succes.", "Flesje gedeeld door Inoven. Het is een goudgeel licht troebel bier met een matig wit schuim. Het heeft een aroma van banaan en hop. De smaak is hoppig, fruitig en wat hooiachtig.", "Flesje gedeeld met Tomhendriksen. Goudgeel licht troebel bier met matig schuim dat snel weg trekt. Aroma van banaan en sinaasappel. Smaak is hoppig, fruitig en hooiachtig. Nasmaak is bitter.", "La lagunitas se défend bien. Son amertume attaque directement avec des saveurs boisées et épicées et un retour de cannelle. Ensuite on surfe sur les traditionnels agrumes, mais c’est plutôt léger et court. La longueur est la rondeur caramélisée sont présentes et agréables. Pour autant, ça demeure un tout petit peu déséquilibré. Mes les saveurs boisées sont excellentes. Une fausse craft, mais bonne ipa quand même", "IPA très légère mais pas désagréable, très désaltérante. Un goût de houblon américain, léger, sans profondeur.", "Aroma; pale malt, flower, herb, sweet apricot, fruit. Look; lowhead, clear golden body. Taste; hops, pale malt, resiny caramel, fine weed, grapefruit peel, wood, and finishes straight n hoppy. Feel; normal body and gentle co2. Overall; straight crystal ipa. [35.5cl.btl b@Systembolaget, T@H7] 6374'14", "Bottle. Crystal clear golden with frothy white head. The aroma has notes of citrus (orange, lemon), some tropical fruits, herbs and some maltiness. The flavor is very bitter and mild sweet with notes of citrus (orange, lemon), citrus peels, piney, tropical fruits, malt, \"green\" and grassy. Slightly dry, medium-bodied.", "Dark yellow and good head with very Nice lacing on the glass. Taste is a little watery. But nicely hopped. \n\n---Rated via Beer Buddy for iPhone", "Flasche am Flughafen in Dallas. Gold-gelb, kein Scahum, moderate Kohelnsäure. Sanftes Aroma nach Aprikose, Mango, Mandarine. Geschmack: Würzig, Heu, Frucht (Zitrus, Orange, Grapefruit) Saftartiger Antrunk.", "Lekki aromat cytrusów, trochę słodu. W smaku lekka słodycz, przyjemna cytrusowa owocowość, może trochę mango, fajnie przebija posmak herbatnika. Goryczka wyważona, aczkolwiek wyraźna. Nie jest landrynkowe. Jak dla mnie piwo ma to czego można oczekiwać od codziennej AIPY. Mi smakowało.", "Nice citrus nose. Fairly hoppy. Bit of a bite going down. Nice after taste. \n\n---Rated via Beer Buddy for iPhone", "F: huge, egg-white good retention.\r\nC: gold, clear.\r\nA: malty, bit citrus, caramel fruity, roasted onion, pine resin, paprika, grapefruits, hint of tropical fruits.\r\nT: malty backbone, grapefruits, orange, mango, bit peppery, bit pine, red currants, medium body and carbonation, yes lack some fresh fruity feeling but represents beginning for this American IPA beer style many years ago, enjoyed, 355ml bottle from Carrefour Market in Vertus, France.", "Bottled from AH in Mestreech. Color is hazy orange with a think quickly diminishing white head. Hoppy nose. Aroma is dry American hops, fruity and some malts. Flavour dry bitter Finishes with a soap tone and dry hoppy with a subdued bitterness.", "Decent IPA beer with the nice fruity flavors some pine lingering in the background and a bold bitter finish. Not bad seems like and average IPA. Nice long good aftertaste.", "Zapach średnio intensywny, słód, cytrusy, zioła, żywica. Kolor ciemnozłoty, klarowne. Piana obfita, drobna, średnio trwała, lekki lacing. W smaku lekka słodycz, średnia pełnia, słód, cytrusy, zioła, żywica. Goryczka wysoka, wysycenie średnie.", "Good IPA. A bit sharp though. Green apple-ish taste with a malty slightly metallic after taste. Very sparkling which I prefer, reminds me of soda water. Not too complex but all together a good IPA experience.", "355 ml bottle. It is poured light amber color with a small white foam. Malty grapefruit aroma with a hops. Taste moderate sweet malt, over medium bitter hoppy, notes of grapefruit.", "Light ambar colour with a nice white compact head.\r\nAroma is light malt and pine hoops\r\nTaste is very nice. Well balanced caramel, citric and peach/appricot with a medium hoppy bitterness.\r\nNot a extreme IPA, but really good.", "Une robe blonde doré suprlombé d'une fine mousse qui se diffuse rapidement. \nAu nez le houblon se fait sentir \nBonne carbonation. \nLa première bouche présente un groupe fruité et amer pour ensuite ne laisser place qu'à lamer.", "Mooi helder, zoet moutig, bloemig, licht tropisch, citrus , iets grapefruit, redelijk harsige bitter.... mooi doordrinkbare IPA", "Robe ambré clair, limpide, belle carbonatation, mousse correcte aux nuances rousses. Nez de houblons aromatiques, aux agrumes et fruits exotiques, assez léger. En bouche, grosse amertume en attaque, arômes de fruits exotiques, pas mal de corps, avec du caramel, qui équilibre bien l'amertume. Agréable et bien fait, l'amertume tend à s'atténuer en fin de bouche.", "Quite biscuity and malty, a solid old school IPA with medium bitterness. Needs a bit more fruit punch for my taste but a good big brand option if it's there.", "Aroma of fruits, pine, malt and some tropical notes as well. Deep Golden with a white head. Medium sweet and medium + bitter. Medium body with average carbonation. Dry and bitter finish. Overall an OK IPA.", "19/VII/18 - 355ml bottle from Albert Heijn (Ghelamco, Gent), purchased on 8/VI/18, shared @ home - BB: 29/III/19 (so I thought this was less than 3 months old, clearly they put more than 12 months as a best-by date... Probably 18 months or so? Ridiculous! (2018-849) \n\n\r\nClear orange beer, lots of CO2 chains working their way up in the glass, big creamy solid little irregular yellowish head, pretty stable, bit adhesive. Aroma: very malty, grains, bit of caramel, bit dusty. Where's my hops??? MF: soft carbon, medium body. Taste: very malty, grains, metallic bitterness, very unpleasant, man this is bad, how the hell is this an ipa? (Discovered afterwards it's probably 9 months old...) Aftertaste: alcohol burn, more malts and metallic in the finish, this just taste like a very bitter lager instead of an ipa. Well, if Lagunitas thinks this beer is still good to drink for another 9 months, this is the review they deserve.", "Pours somewhat hazy amber colour, topped with medium small white head, not so lasting. Quite resiny nose with some sweet fruity notes, peachy. Moderate bitterness, resiny with lots of gentle fruity character going on. A bit peppery in the finish. Lasting and quite strong aftertaste. Medium body. Good IPA, but nothing spectacular.", "Bottle. from Walmart, Florida. Very subtle aroma of light citrus and soft, dew-cooled pine. Clean, refreshing citrus hop flavor that fades quickly and a decent bitterness that finishes clean. This is an overall easily drinkable, slightly hoppy, balanced beer. This is one of the first IPAs I ever had, years ago, at a place in Orlando called Cafe Tu-Tu-Tangos. I loved it, thought I like IPAs because of it, then spent years being confused by a string of poorly cranked out FL IPAs trying to out-bitter the West Coast craft guys. Better breweries of late have made me an IPA fan for sure. Tasting this again now I see why I liked it initially. This is in the ballpark of Sierra Nevada Pale Ale, but even more approachable. Not remarkable at first, but so drinkable, and if you have a few, they get better and better.", "Flaska på Westpub. Kan inte förstå hur jag inte rate:ad denna tidigare. Guldfärgad med beigevit krona. Mer klassisk västkust:ig IPA med toner av kåda, granskott, citrus, grape och apelsinmarmelad som vägs upp av lite kola och knäckiga toner från malten. Trevlig.", "Ipa de 6,2 % abv.\r\nMon exemplaire était à 5 mois avant sa date.\r\nCouleur doré moyen, à la clarté pure, brillante.\r\nBulles fines, partout, vives.\r\nMousse blanche, à fins flocons, stable à 2 mm.\r\nArômes d'ananas, mandarine, orange.\r\n1ère bouche à l'entame malt/houblon, avec une pointe d'épices.\r\nArrière-bouche relativement simple, astringente.\r\n2ème qui diminue fortement.\r\nArrière-bouche à l'amertume verte.\r\n3ème qui devient insignifiante.\r\nArrière-bouche très mal accordée.\r\nLa longueur n'arrange rien.\r\nJambes très collantes.\r\nLevure faible.\r\nAlcool totalement inefficace.\r\nFinale banale.\r\nCONCLUSION : pas de quoi hanter les mémoires … Sur l'étiquette\r\nle brasseur nous dit \" la bière parle, les hommes marmonnent \".\r\nEt ici, précisément sa bière marmonne … Petit couac .. (3/2/2/1/4)", "Robe cuivrée, fine mousse blanche. Classique, résine, fruits exotiques, herbacée. Pas mal !", "Balanserad arom med karamellmalt, tropik och ananas. Smakmässigt något tunn med dominerande tropiska toner. En  lätt efterhängsen bäska.", "From the bottle, this pours a flawless appearance of deep copper orange with a foamy long-lasting head, classic IPA. A little more rustic tarnish to it than others perhaps, all the more appetizing. Aroma is strong on citrus hops, strikingly…", "Bottle 35,5cl. Clear golden with a white head. Mixed aroma of malt and hops, not very present. Neutral bitter taste, not lots of flavour, but straight bitter. Medium length.", "[Rate 04-08-2018: 6-4-6-4-13 = 3.3]\r\nDrank it now two times from draught in Amsterdams pubs, but with different result. First time having a nice hoppy flavour (and even a late 'burp' delivering me that nice sense... ;-). But second time I didn't really smell very much hoppiness, and didn't taste so much more than a vague bitterness. Nice golden pour with white head; and OK carbo. I average these various experiences in my rate; hope to taste it a third time (or from bottle).\r\n[Re-rate 24-09-2018: 6-4-7-4-13 = 3.4]\r\nBottle at home pours clear golden with a near-white head, falling down but lasting. Aroma is hoppy but not strong; bit earthy and fruity. Taste moderate bitter with more firm bitter aftertaste. It's a nice IPA.", "8/2/18\r\nHad on National IPA day after a shopping excursion over the river to Jersey.\r\n\r\nPoured from bottle into a Lagunitas shaker pint. Transparent amber with a moderate head. \r\n\r\nNose is sticky resinous pine and citrus pith.\r\n\r\nTaste is citrus pith and pine with a touch of bready malt to balance. Dry and bitter initially but gives way to a nice malt sweetness. Grapefruit pith comes through big on the finish. No shortage of hops, but nicely balanced.\r\n\r\nPalate is a soft, medium-light. Not a ton of carbonation and quite drinkable with malt sweetness and grapefruit bitterness lingering.\r\n\r\nOverall, an excellent IPA that's balanced and super drinkable. Strongly hopped and bitter, but a good malty balance. No earth-shattering flavors, but more or less flawless. Another winner from Lagunitas!", "Gylden og helt klar. Hvitt lyst skum. Aroma av malt. Smaken er av mild granbar og noe sitrus, samt malt. Tynn konsistens.", "Moderat hopfiger, bitter-würziger Beginn. Spritzig, trockene Herbe, grasig. Moderat hopfig bleibend, vollmundig, Heu. Mittellanger Nachhall. Okay. 10/9/9/9//9", "Barwa zlota, klarowna. Piana sredniopecherzykowa, szybko redukuje sie do pierscienia. Aromat mocny, tropikalny, slodko- przyprawowy. Smak owocowo- przyprawowo- zywiczny. Spora goryczka, troszke zalega, ale jest przyjemnie.", "IPA molto amara, non agrumata, con un gusto deciso e rinfrescante.   Da gustare con calma", "Not too impressive aroma, with weak hints of resin and wood. Medium bitter and medium sweet taste, with hints of alcoholic spiciness and a slightly dry mouthfeel. Body is on the lighter side for an IPA of this caliber.", "Bottle 0.355L.\r\nClear orange body with a large, frothy, off-white head, mostly lasting with some lacing; very low density of medium-sized bubbles.\r\nModerate-to-heavy hoppy (citrus, grass, pine) and light malty (some caramel) aroma.\r\nModerate-to-heavy bitter and moderate sweet flavour; long bitter finish.\r\nMedium body with oily texture; soft carbonation.", "Achetée à Carrefour. Nez assez malté et un peu houblonné mais rien de fou. Bouche sèche amère un peu résineuse plutôt sympa. Pas si mal que ça !", "\"Heineken annonce aujourd'hui qu'il a acquis toutes les actions restantes de Lagunitas Brewing Company\", en juillet 2017. Trouvé chez Leclerc à 1,69 €. Bouteille de 33 cl 8 mois de la LDC. Couleur orange clair, carbonatation moyenne, et petit col. Reste dans les grandes lignes, des IPA, légèrement fruité, légèrement amère, mais manque un peu de fraicheur. Rien d'exceptionnel rien de mauvais.", "Cette IPA est honorable lorsque l'on sait que c'est un produit industriel. Mais je n'irai pas plus loin, elle manque en effet de présence en bouche et de longueur pour être une \"bonne\" IPA\". Nous restons dans le moyen de bonne facture donc. Robe blond doré fort sympathique en verre avec une mousse blanc cassée de 3 mm. Le nez est appréciable sur les fruits exotiques, les agrumes et la pêche. A la dégustation, le résineux apparaît pour être bien présent. L'attaque est donc sur le résineux et l'amertume mais manque de consistance. La deuxième bouche se densifie cependant pour présenter des arômes de fruits exotiques et d'agrumes en complément. L'arrière bouche est quant à elle sur une amertume herbacée et saillante. La troisième bouche, la plus amère (IBU de 51,5) se repositionne sur le résineux et précède un final décevant où l'amertume retombe. L'alcool à 6,2 % est honnête par contre.", "Plenty of floral aromas but bit of a bland taste. I'd expect a bit more punch from an IPA. Also they seem to have recently reduced the keg ABV from 6.2% to 5.5%.", "Some people don't seem to like this anymore following Heineken buying a large stake in the company. Has the beer changed since they bought it? I can't tell any difference. Whilst i don't agree with 'Big Beer' swallowing up craft brewers, it doesn\"t make this a bad beer overnight. Still perfectly good ipa. Pours clear amber with small white head. Mild classic ipa aroma, hoppy and bitter as you'd expect from the style. Is it the best ipa I've had, no, but just because it's now owned by a huge multinational doesn't make it suddenly worth disowning as some people suggest. If the quality drops then I'll change my mind, but for now it's still worth a look.", "35,5 cl. bottle @ home, bought @ Albert Heijn Leersum.\r\nClear dark golden with a white head. Malty citrus aroma with a considerable lack of hops. Bitter taste. High carbonation. Very basic but not unpleasant IPA.", "Clear light beer with light beige head.  Aroma is hops,  grape fruit,  malt, fruits.  Sweet,  medium bitterness.  Good fruity IPA.", "Barwa złota, piana biała.\r\nAromat średnio intensywny, tytoń, żywica, cytrusy.\r\nCzyste w smaku, wysoka i zalegająca tytoniowa goryczka.", "On tap at Thema. Clear amber colour, small white head, aroma of hops, citruses, taste as well. It's very good, but bit boring.", "Golden colored with high white head\r\nAroma of honey, malt and grass.\r\nTaste: citrus, grass, honey and malt. Well balanced and drinkable.", "Bottle from supermarket in France. Golden color, white head. Pretty basic ipa, a bit loke a very hoppy lager... Not for me", "Flaske fra Vinmonopolet Tromsø - Langnes. Gylden. Høyt tett skum. Daler veldig sakte. Pen lacing. God, fyldig fruktaroma. Myk munnfølelse. Smaken balansert. Mørke plommer. Syrlig fruktig ettersmak.", "Bottle. Color: Clear orange golden, white head. Aroma: Hop, grapefruit. Taste: Moderate sweet malt, over medium bitter hoppy, notes of grapefruit. Same finish. Medium body, average carbonation. Ok.", "Rivers Pub Rouen. Une IPA qui ne révolutionne pas le genre mais qui se boit transquillement. Désaltérante.", "33 cl. bottle. Deep gold/clear amber with a cream head. Strong floral hoppy aroma aroma with orange and citrus. Taste is medium bitter with some sweetness. Medium bodied and oily textured with a quite bitter finish. Carbonation is average. Finish is a bit too bitter for my taste. But it is still a solid beer.", "Guldig klar vätska med vitt skum. Doft av majs, hö och lite fruktiga toner. Söt len fyllig smak med balanserad beska. God!", "Gyllengul färg. Bra skumbildning och stabilitet. Tydlig citruskarraktär. Hög beska utan att bli för hög. Frisk och klar citruston i smak. \n\n---Rated via Beer Buddy for iPhone", "Flasa Nobell craft beer.Pena samponova nedrzala dlho.Farba zlatista cira.Vona kvetiny,slabsie citrus,cukrik.Chut svieza citrus,cukrik intenzivnejsie,sladovost,chmel.Telo stredne.Dochut pekna chmelova.", "une Ipa legere qui envoie son amertume maitrise en toute fin... a boire tres fraiche quand il fait chaud #fifa2018", "Klar gyllengul öl med vitt skum. Doft av citrus, tallbarr, och lätt maltighet.\nDet samma återkommer i smaken.", "Pours golden with small head. Aroma is citrus and grapefruit.Taste starts with a little sweet,little bit sour.Aftertaste is orange and grapefruit.Bitterness finish.Light body.", "First tasted this beer with my son at a bar in New York. Absolutely delicious considering I expected all the beers over there to taste like Bud. What a surprise! Very yummy beer with a strong citrus flavor, perfect as a thirst quencher. Pity the bottles are so small but then it is quite strong. Delighted to have it available in UK. Well done Heineken for spotting a winner!", "Une belle couleur ambrée, mousse disparaissant très vite, notes d'agrumes au nez, une amertume en bouche assez longue sans trop saturer le palais.\nUne fraîcheur agréable qui persiste assez longtemps. Une bonne découverte pour Carrefour Saint-Priest.", "Light orange with golden hints, perfectly transparent. A quite big and frothy white head shows good retention and nice lacing. Aroma has a light crackery and maybe biscuity base, citric notes (more on the fleshy/jammy side of things though) with grapefruit most noticeable, moderately intense piney and grassy notes. Taste reflects aroma notes, with medium sweet and medium bitterness and a balanced finish that shows a bit more of grass/pine. Possibly rather sweet for the style, expecially in the finish which is less dry than usual. Light to medium bodied with average carbonation, goes down quite easy. Overall an enjoyable 'simplified' ipa, surely flawless. Surely as well not impressive.", "Pours clear apricot with a medium beige head, good retention. Aromas of pine resin, grapefruit, caramel, and dough. Medium body, good carbonation, medium dry. Lightly sweet, medium bitter finishes with a lingering resinous finish. A no-nonsense, big, bitter, West coast IPA.", "0,355l bottle, courtesy of the distributor, Pours almost clear golden liquid, small white soapy head, Aroma: fade, slightly citrus, orange, Taste: light to medium sweet, light to medium bitter, light sour, citrus, lemon peel, malty, Palate: medium body, soft carbonation, thick mouthfeel, abrupt citrus malty aftertaste, Overall: not bad, but did not really enjoyed. Boring. Not enough bitter, not enough carbonated, not enough flavorful.", "Draft. Clear orange golden with a creamy head. Aroma of grapefruit, orange and apples. Sweet, citrusy, lemon peel, light maltiness, mild bitterness. Light bodied , soft carbonation, easy drinking. Nice.", "Ambrato chiaro, limpida, schiuma candida persistente. Aroma agrumato molto gradevole con note resinose. Il gusto conferma gli aromi, con un caramello leggero che bilancia l'amaro spiccato ma non invadente. Carbonazione media che supporta il corpo medio e l'amaro robusto.\r\nMolto gradevole.", "Couleur cuivrée; mousse blanche; arômes et goût maltés et fruités; bière très légèrement douce avec finale bien amère", "12 oz draft at Beer Bar. Pours clear gold with a bright white head. Citrus and grass aromas with malt underneath. Heavy lacing. Nicely balanced flavors of grapefruit and pine. Malts prevent too much hoppiness and the lingering tart  finish is nice.", "(nez > mangue, > pin, ~berga, kumquat, bouche hop, ~poivrée, pin, ~légère, facile, ~savoureuse, 43 hops, 65 malts =))", "Bottle flew straight form Seatle to Warsaw (Poland). Aromat little oxidized, caramel, toffee, little citrus. Taste little bitterness, medium sweetnes.", "Acheter à Carrefour Wasquehal.\r\nBouteille de 35,5cl.\r\nCouleur blonde reflet ambre , belle couleur et beaux reflets.\r\nMousse qui forme un léger col qui ne tient pas.\r\nAu nez : de beau notes agrumes , fruité et céréales.\r\nEn bouche : une amertume présente franche mais peut intense .\r\nLégèrement herbacé et foin .\r\nAgréable et longue.\r\nUne IPA bien fait .", "Uma IPA tradicional com amargor bem balanceado e paladar bem agradável. Aroma bem intenso e cor âmbar e espuma branca.", "Bouteille 33 cl achetée chez Carrefour market à Lille Fives. Robe dorée. \n\nCette bière est d'apparence assez plate, bulles peu visibles et mousse non persistante.\nGoût très agréable typique des IPA, équilibrée avec des saveurs houblonnées et une belle amertume, sans être trop présente. Mérite d'être servie bien fraîche. \n\nUne bière fraîche que j'apprécie particulièrement en terrasse avant un barbecue !", "Bouteille de 35,5cl. Couleur dorée limpide, mousse moyenne de tenue moyenne. Des arômes principalement sur l' agrume, c 'est également très végétal avec une grande longueur. Une IPA légère pas trop forte mais goûtue et plutôt pas mal équilibrée. Trouvée à Intermarché.", "Bärnstensfärgad klar med vit. Doftar och smakar citrus och lite maltigt. Ok öl som inte sticker ut", "Found in bottle in Chicago area. The color is appealing as is the aroma. The taste leaves me underwhelmed though. Very much middle-of-the-road standard for the style.", "On tap at The Camden Eye, London. Pours a copper gold with a white head. Aroma: bisuity malt, mild citrus, bread notes. Not aromatic. Taste: biscuity malt, grain, mild citrus, cardboard, straw flavours. Thin to medium bodied. High carbonation. A bit overcarbonated. Moderate bitterness. This is easy to drink but there is not much to it. A very basic flavour balance. Decent but not good.", "Just a great beer. Drank numerous times when I was in San Francisco. The sort of beer I love and couldn't find that many places in S.F.  or never in California let alone New Zealand. cereal, grass, resin, basement aromas, leather, smoke,", "Na salone piva v starej trznici.\r\nFarba: zlatista\r\nVona: citrusova\r\nChut: taktiez citrus horka dochut", "On tap at Salon Piva apríl 2018\r\nQuite grassy. But still hop centric. Wonder how it was before Heineken", "Tap at Salon piva 4/ 2018. Hopy taste, resin, caramel notes, citrus fruit. Clear golden color, white head. Hopy taste, malty notes, citrus fruit, resin, light sweet, medium bitter. Medium body, slick texture, soft to average carbonation and hopy bitter finish. Very good.", "Van 't vat. Mooi helder oranjekleurig bier met een witte schuimkraag. Geur: hoppig, fruit, citrus, agrum, wat exotisch fruit en pompelmoes. Smaak: Hopbitter, fruitig, citrus, agrum, harsachtig, mooi in balans met moutzoet. Medium volmondig. Goede koolzuurprikkel. Afdronk: droog hopbitter, agrum, wat moutzoet.", "Van 't vat in Gainsbar te Kortrijk. U: Helder goudblond-oranje met een witte schuimkraag. G: Tropische fruitbom gecombineerd met citrus. S: Moutzoet met een stevige citrusbitterheid. Tussenin wat harsige en gisttoetsen. M: Doordrinker met medium carbonatie.", "Clear yellow/ochre liquid, small head. Strong aroma of hops, with a hint of fruit and yeast. Light body, average carbonation. Taste is bitter, with a hint of fruits.", "Bottle at Beehive, Gatwick South Terminal. It pours hazy dark amber with a thick, off-white head. Aroma is a lot of orange (peel, flesh, juice; all in); some iron filings and fragrant daisies. Nice. Taste is dry, with soft carb and quite intense bitterness (but not shocking, mind you). Long lasting, refreshing and nice.", "Really smooth robust hoppy IPA without the need to be totally tropical. Medium bodied with a nice bitter finish. Very nice!", "Bottiglia 355 ml, schiuma fine bianco sporco persistente, al naso frutta tropicale agrumi, in bocca malto spezie frutta tropicale uva, corpo leggero, carbonazione moderata, lieve acidula, dolce con deciso amaro lungo nel finale. Classica IPA da battaglia. 07.04.18 @ Caffè Clerici Luino", "Tap at Belushis, Hammersmith. Hoppy aromas of tropical fruit, possibly subtle biscuit. Cler gold-amber body with white head. Taste is very good with tropical fruit and some maltiness. Great IPA overall.", "Bottle at Gothenburg AirPort, bbd 12/1/2019 so should be about 90 days Old. Not the freshest but still not bad for Europe. Citrus, pine, grass, apricot, and a foul smell/taste of old stuff. Meh this is awful and infected.", "Great easy drinking IPA. Golden pour. Light flowers, citrus aroma. A little sweet and not super hoppy. Goes down smooth", "Pint on tap at the Quadrant, Brighton. Golden amber beer with solid white head. No carbonation but laces well. Nose is earthy, dry, tropical. Slight fizz followed by fruit caramels. Great beer, a pleasure.", "Draught@pub in Champagny. Clear golden with a medium white head. Aroma tropical fruits, some hops. Taste mainly sweet, hoppy finish.", "Bottle 355ml. Pours gold with a light white head. Aroma is pine and flowers. Medium carbonation and medium body. Taste is pine and citrus ending with a weird dry bitter taste.", "Rødgylden klat skum hvid \ncitrus grapemalt blomstkorn \nBitter meget sød modrate \nOile livlig \n@fox\n\n---Rated via Beer Buddy for iPhone", "Very drinkable, not very hoppy, medium carbonation, nothing to savour,  night out beer", "I'm not surprised why this IPA is the most selling IPA in the world. It's just an amazing beer, that's all i can say.", "DWG; Bottle 355ml. Pours moderate, hazy gold with a moderate, frothy, lasting and lacing off-white head. Nose is moderate, honey, citrus, peach and light spice. Taste is moderate sweet and bitter with a somewhat lasting tropic finish. Body is medium, texture is oily, carbonation is soft.", "Cerveza ahumada de fuerte olor. Carbonatación media. Buena presentación y final amargo.", "Where’s the hops? Only IPA on the menu. Won’t have this a second time. Craft beer - NOT", "Tasty McGee is what they're calling it. Excellent hoppy build with a tasteful aroma.", "Un buon sapore amaro mentre la si beve, non troppo agrumata, ma lascia in bocca un ottimo sapore amarognolo che asciuga la bocca", "Classical IPA. Fruity notes and a bit of leather coming straight after first sniff followed by even more fruits and a bit of spices. Taste is just as complex.", "355ml bottle from UK supermarket. Pours clear, warm-gold, like california sunshine! 1 finger white foam. Minimal lacing. Dominant aroma is honey with apples and hint of spice. Medium bitter taste with long-lasting bitter hoppy finish. A benchmark West Coast IPA, but not a hop bomb IMO. Not too challenging and certainly not a chore. Just very pleasant, drinkable brew", "Pours yellow with white head. Aromas of pine and green hops. Tastes like it smells. Green, vegetal and hoppy. Nice.", "Bottle. Golden/Amber colour, finger width of head. Strong hoppy/juniper aroma. Bitter/sweet taste.", "Sensacional! Na minha opinião uma da melhores cervejas que já bebi! \nO Aroma do lúpulo utilizado é maravilhoso!!\nQue cerveja!!!", "Bottle. Clear yellow with white head. Aroma is flowery hops and strong hay. Very pleasant smell.  Balanced carbonation. Bitter-sour but pleasant finish.", "Clear amber with a medium white head. Aroma is flowers, orange and pineapple. Taste is resin, lime and mango", "Pretty good beer. Nice flavor. IPA taste was easy to drink. Not too filling. Good beer to drink with a good steak. \n\n---Rated via Beer Buddy for iPhone", "Barwa jasnozłota, klarowna, piana grubopęcherzykowa, nietrwała. Aromat przyjemny, acz niezbyt intensywny, będący połączeniem cytrusów i słodowości. W smaku słodko, goryczka średnia i bardzo krótka, więc piwo raczej po słodkiej niż wytrawnej stronie. Przyjemne piwo, choć nic szczególnego.", "Grapefruit aroma. Clear yellow/amber body with thick white head. Nice palate. Flavour is a soft IPA, nice, not too much pine.", "La probé por primera vez hace un par de años en botella en USA, hoy la he probado de nuevo de barril en Barcelona. Buen aroma y buen final. Una muy buena IPA", "My absolute favorite IPA! Great taste, good finish. I also enjoy Lagunitas DayTime - a marvelous brew!\r\nKeep it coming, guys!", "Lighter IPA with a bitter finish, and very easy going down. Medium head, and not many notes picked up. Still very good.", "Czterdzieści trzy chmiele? Sześćdziesiąt pięć słodów? Tę proporcje czuć niestety w smaku. Sucho-słodowa ciekawostka. Kraft Heinekena? To ja dziękuję, nie wspieram", "Clean medium-dark gold. Sparse head. Aroma intensity 3.25/5. Egg, honey and acacia aroma. Medium to heavy bitter. Sweet back-of-the-mouth feel. Medium body", "Probada en botella en El Lúpulo Feroz de Oviedo 10/2/2018. La última vez que la probé estaba bastante rica, sin destacar por encima de otras IPAs americanas. Pero esta vez ha sido una decepción: apenas aroma, sabor rozando la oxidación. Amargor en una cerveza con poco cuerpo. Es posible que la cerveza tenga ya unos meses y por eso ya no esté al 100%", "Bottle. Pale color, med white head.\r\nAroma, salt and flowers. Taste: salt, medium bitter ending - easy beer", "Yeasty aroma. Honey-colour pour, billowy pale head. Bitter bread taste, more bitter finish.", "Great aroma and nice IPA, bottle structure is little weird. Beer taste great and definitely one of my favorites.", "Pours a clear, deep golden amber coloration with a medium, fizzy head. Smells of caramel malt, grapefruit and orange rind, with a hint of pine. Taste is malt-forward, with pretty little hop character and a certain grainy/earthy quality. Caramel, biscuity malts most noticeable, with mild hoppy notes of grapefruit, orange rind and pine. Crisp and dry, with a medium bitterness in the aftertaste. This the archetype of what I like to refer to as an \"old school IPA\". Malt-forward, mildly hopped, with certain grainy/earthy notes and dry, piney bitterness. Nicely balanced, but not my cup of tea, as I really prefer stronger hopped brews.", "It pours a somewhat hazy gold with a large white long lasting head. It has the aroma of tropical fruit, mango, tangerine, pine & grapefruit. It has a nice bitterness to it and tastes of pine, grapefruit, resin, citrus & flowers. This is a classic west coast IPA. I greatly enjoyed drinking this and highly recommend it.", "Review based on the BJCP2015 guidelines (style 21A). Bottle 35.5 cl - Batch L2280 (BBF 30.03.2018) AROMA: medium-low hop notes with a pine and fruity character. low malt background with a toffee character. APPEARANCE: deep gold color and clear. medium ivory head, moussy, with good retention. TASTE: medium-low piny hop notes with a soft lightly toffee malt background. medium to medium-high bitterness with a dry and bitter finish. PALATE: medium-low body with medium-low carbonation. OVERALL: an american IPA where the hops are not very intense (maybe the sample isnt very fresh).", "citrus, herbs, golden, orange, red, brown, clear, frothy, minimal head, white foam, light sweetness, medium bitterness, lightly sour, medium body, light body, sticky, average carbonation, bitter,", "The definition of a west coast IPA, Lagunitas IPA features crisp citrus and pine hop character layered atop a light pale malt backbone. The hops are juicy and in your fade. A nice wash of carbonation brings the hop spice to a crescendo in the finish. Pours pretty light copper with a healthy white head, and ample lacing.", "Don’t let the simple label fool you. This is a great little beer. Aroma is a little floral and fruity and the taste is just over the reserved line. A light pour with a clean taste that allows for several follow-ups. \nThe flavour is well balanced between hops and malt and  stays consistent for about 2/3 the glass and then it’s a sweeter finish. \nEasy to enjoy!", "12-ounce bottle pours clear gold with a creamy off-white head; lots of lacing. Aroma: citrus and tropical fruits, honey, pine. Flavor: grapefruit, orange, pineapple, mango, pine. Mouthfeel: medium-bodied, dry and crisp.", "From January 2011. \r\n\r\nI bought a six pack and brought it home before I looked at the bottles...loaded with floaties. Checking on the Julian date, I see it was bottled June 10. Oh well.\r\n\r\nIt has a nice honey gold colour with a minimal head of foam and very little lacing. I'm keeping the floaties in the bottle...\r\n\r\nBig lemon citrus notes with some biscuit notes in the smell. \r\n\r\nDitto for the taste only here it doesn't show much balance and the hop flavour seems harsh to me. It's rather thin bodied, lowish with the carbonation, and isn't all that drinkable.\r\n\r\nAs is, it doesn't impress me but if I come across fresher samples, I'll give it another go and see if a change in my review is needed.", "Pours clear golden yellow with two fingers thick white head.\r\nMalty sweet and slightly citrus aroma, balanced bittersweet taste, nice mouthfeel.\r\nSimple and effective IPA.", "Bottle 355ml. Nice light amber colour. Candy smell with some herbal aroma as well and malts. Sweet taste, bitternes almost zero, medium body. Hoops, herbs, still a bit of candy taste. Overal, interesting beer.", "0.33l bottle. Hazy golden color with medium white head. Aroma: candy, pineapple, caramel. Taste: candy, caramel, toffee, grapefruit. Medium body, moderate carbonation, high bitterness.", "Golden color, small white head. Aromas of citrus, malt, soap, pine and slight syrup. Medium bitter taste with grass, pine, lemon peel and hops.", "Nice pale looking IPA. Flowery and hoppy and quite grassy, clean pint of beer and slips down easily.", "Une bière sèche, amère avec des saveurs d'agrumes, de pamplemousse et légèrement maltée. Une bonne IPA.", "Léger col de mousse blanche, bière de couleur cuivre, bulles fines. Bel arôme de fruits exotiques. Le fruité est moins expressif en bouche, mais nous retrouvons ces fruits exotiques, peut être des litchis, sur une belle amertume. Une IPA US industrielle mais de belle facture pour nous européen. Je la recommande pour habituer son palais aux saveurs houblonnées sans amertume gigantesque. 355 ml chez Monoprix", "light citrus/pine aromas. gold and clear in color with great head. taste is balanced with nice citrus, pine, faint resin, and light crystal malt notes", "33cl bottle at Circus, Rimini, Italy. Pours transparent intense gold with irregular white foam, very fine. Aroma is citrus, with a little caramel, some mandarin when just opened. Body is average with good carbonation. Taste is bitter, with limited sweetness. Finish is average.", "bottle. aroma: wet malt, caramel, fruity esters,  light hops, light solvent. medium body, medium unpleasant bitterness. nothing special", "Lagunitas India Pale Ale (IPA)\r\nIndia Pale Ale (IPA)\r\n747413\r\n\n\r\nLukt: Citrus og honning.\r\nUtseende: Gyllen.\r\nSkum/kullsyre: Tynt skum, heng langs kant.\r\nSmak: Citrus, karamell, bitter avslutning.\r\nHvor: O’Leary’s, OSL Airport, Gardermoen.\r\nMedium: Tapp@400ml, ABV@6,2%, Når@19.12.2017.", "On tap at Bryan’s American Grille.  Virtually nothing on the nose. Poured a nice golden color, not head retention though.  Taste is standard west coast IPA, keg might be a bit older. Easy drinking, good bitterness. Light beer mouthfeel isn’t great.", "Flavor is very one dimensional and that flavor is bitter. Not really any fruit notes that I like in IPAs.", "Tra le migliori IPA.  Luppolatura eccellente, aromi variopinti. Voto personale 8.5/10", "Appearance- clear and amber, a clingy 1-finger white head. Aroma- fruity hops, lemon, orange, pineapple, tropical fruit hints. Taste- lots of bitter hops, hop resin, orange peel, clingy bitterness, juicy fruit, pithy fruit, fluffy malt in the background. Lingering bitter finish.", "This is a great go to IPA. Perfectly balanced with a nice hoppy, and floral character but not over powering. It's a great beer to pair with your favorite pizza or just enjoy by itself on a nice hot day.", "Tame aroma of hops, mainly citrus and grass. Taste is a bit better though, with a healthy amount of bitterness and crispness. Bitter herbs, grapefruit, pine. A bit watery, lacks potency. It's decent and pretty generic.", "From the tap (6.2%), free sample from the owner, The Admiral, Glasgow on 5 Dec 2017: floral, pine aroma, golden with a large foamy cream head, grassy, fruity, sweet, gentle fizz, hides the abv very well.", "Dec 17 : 4.0 Belle couleur cuivrée, pas de mousse. L'ipa est bien aromatique, amertume bien présente. Bonne ipa!\nMai 19 : 3.6 Regoutée suite à une promo chez Carrefour. Rien d'extra dans cette ipa, commune\nJuillet 21 : 3.8 Résineuse, amère, sèche, ipa dans les codes, bien pour une bière de supermarché.", "Pours amber colour with fruity hoppy aroma . Tastes good with medium body and good carbonation", "fresh, light fruity aroma with a bit of dankiness. well balanced, ligh and refreshing, extremely drinkable!", "Golden with a white head - Fruity hop aroma with some herbal notes as well - Malt body to support a good hop flavour that has some fruity notes and a herbal flavourn in the back - The herbal hops goes into the finish that goes dry - This was good", "10-09-17 // draft at The Euston Tap, London. Classic IPA. Golden coloured, light hoppy nose. Sweet mlaty Backbone with a piney, citrus hop character. Medium bitter.", "Questa IPA si presenta con una bella schiuma e un ottimo aroma di agrumi, pompelmo in particolare. Il gusto ricorda l'aroma con l'aggiunta dell'amaro dei luppoli, molto ben bilanciato. Carbonatura decisamente azzecata che accompagna il retrogusto amaro, molto piacevole.", "It has a nice combination of citrus malt and spruce hops.  The appearance was a red/golden color that leads to a white head.  Has a sweet flavor with a light body, lively carbonation and a bitter finish.", "Keg at the Royal Standard, Wandsworth. Vague hoppy aroma. Hazy amber. Frothy but blotchy white head. Light bitter. Some sourness around the edges. Light. Thin. Fizzy. Average for the style.", "Appearance: dark golden color, with big foamy head\r\nAroma: malty, caramel, cereal.  \r\nTaste: malty, hops, orange, caramel, and ends a bit bitter.", "A hop head's dream, very hoppy, more bitter than fruity but some citrus in there too. If there one downside to this is the carbonation, so fizzy. And it's so tasty that you drink it quick. So you get tipsy quick, 6.2% so no wonder.and you're burping too. Drink it with a meal, and then move onto the session beers.", "From a bottle. Pours a clear, dark yellow color, with a big, foamy, beige head. Sharp, piney and citrusy aroma, with some honey, minerals, and damp grass. Very bitter, and not much malt backbone. Light to medium body, with a sharp and slick palate. This is a pretty nice, aromatic IPA.", "Draft in Ma’dam restaurant in the A’dam Tower.  Really delicious IPA: would defenity recommand this one", "Apariencia : ámbar translúcido (aprox.\r\n6 SRM); cabeza blanco hueso; buena retención; buen encaje\r\nAroma: piel de toronja y fruta confitada, ligeras notas de resinas, té y malta\r\nBoca: generosa malta con notas de toronja blanca; amargor medio-alto (45 IBU aprox.) de larga duración con notas de madera en el retrogusto; cuerpo ligero-medio; buena carbonatación.", "Old rating rerated 08.11.2017, 12 oz bottle @ Vertshuset, Odda:\n\nNice fizzy-creamy mediumlasting head. Aroma is slightly dry grassy, leafs, old lawn, hay, minerals, light malts, paper, hops, old moss, bark. Taste is slightly dry and harsh grassy, weeds, hay, old leafs, bark, minerals, paper, harsh hops, old moss, metal tank, cardboard. Medium bitterness, watery and harsh metallic mouthfeel. Boring.", "On tap The Dubliners - Strasbourg. Couleur jaune dorée et bonne mousse. Nez bien houblonné gras, resineux-pin. Gout bien houblonné résineux, litchi, raisin, herbeux. Bon corps. Fin bien amere avec note amande amere.", "Had a pint at the Piccadilly Tap, Manchester. Very refreshing, with a pleasing bitterness. Not as tasty as the bottled version though.\r\nA nice beer to start the day, and could imagine having a fair few pints. Surprisingly light and watery for a brew over six percent.", "Lett uklart gulbrunt med fint skum. Herlig fruktig duft med mye ananas og sitrus. Følger ikke i smaken i det hele tatt. Vannaktig og besk med lett frukt og karamell.", "Very nice indeed Very nice indeed Very nice indeed Very nice indeed Very nice indeed Very nice indeed \n\n---Rated via Beer Buddy for iPhone", "Robe blonde dorée, limpide, légère mousse blanche qui ne tient pas. Nez houblonné : résine et agrumes. Le citron et le pamplemousse dominent largment la bouche, petite présence de la base maltée. Belle amertume persistante, corps moyen et rond. Carbo légère. IPA convenable, mais un peu quelconque, je suis un peu déçu...", "Indian Pale Larger americana. Fuerte aroma a hierba, flores y frutas. Poca espuma blanca. Sabor complejo fundamentalmente amargo. Gusto a lúpulo, cítricos, hierbas, pino?. Poca malta. Retrogusto muy amargo y seco. No es mi estilo de cerveza.", "Dejlig amerikask IPA med masser af bitterhed. Superfrisk øl, Kedeligt udseende,", "On tap at cafe De pijp, Amsterdam. Pours golden color, white head. Aroma of citrusy hops. Taste is medium bitter, medium sweet, citrusy fruits, hoppy.", "Clear gold beer with a thin white head. It has aroma of citrus and herb. Taste is citrus and pleasant bitterness with a little spice. A pretty solid IPA !", "40 ans d'hadel. Ar�me fruit de la passion puissant Peu de mousse et carbo faible. Bien ronde en bouche. Fruits exotiques bien pr�sent. Une bonne ipa.", "Bottle at Morrosko Sabadell. Crystal clear dark orange with white head. Complex aroma: citric, pear and sweet fruits. Long bitterness. Light and easy. Honest, tough, classic IPA.", "Tasted bottled @Morrosko, Sabadell. Pours copper with white head. Aroma of fruits and citrics. Sweet and bitter.\n\n---Rated via Beer Buddy for iPhone", "Bottle. Clear golden with big soapy off-white head. Citrus, malt, hops. Moderate bitter. Moderate sweet. Good!", "12 oz bottle @ Beijing China 深金色透明酒身 白色小颗粒泡沫 消散较快 嗅觉 葡萄 焦糖 麦芽 入口 微苦 焦糖 紫葡萄汁儿 味道 回味 前期近似无味 后端转微苦 微微涩感 持续时间短且非常平淡 酒体中等 沙口感弱 酒精感无\n\n---Rated via Beer Buddy for iPhone", "Clear golden color with white head. Aroma of tropical fruits, citrus. Sweetish taste, but long light bitter finish. Well balanced beer and enjoyable. A good ipa.", "On tap at Angelo's Coal Fired Pizza. Nice copper color and citrusy nose. Not a whole lot of malt with the taste being primarily citrus . An OK beer that we probably will not revisit.", "Partagée avec mon cher Appiantiqua dans nos verres \"saveurs bières\",belle robe orangée surmontée d'une mousse blanche peu persistante avec une carbonatation moyenne.Le nez nous offre des arômes d'agrumes avec des notes d'alcool vieilli en barriques.La bouche nous amène des saveurs à l'image du nez nous laissant sur une bonne amertume et fraîcheur très plaisante.Une IPA de caractère qui se laisserait bien boire en écoutant \"Hotel California\" des Eagles!!!!", "Dégustée avec mon petit Kittenbieer dans un verre \"Saveurs bières\".\r\nTempérature de début 6 à 7°.\r\nRobe orangée surmontée d'une fine mousse blanche peu persistante; carbonatation moyenne.\r\nNez subtil sur des arômes de houblons et d'agrumes avec une note boisée.\r\nLe goût est remarquablement équilibré avec une belle amertume: les houblons sont de grande qualité et on apprécie les saveurs fruitées qui ont du caractère.\r\nLe palais est long, frais et sans aucune lourdeur.\r\nUne très bonne IPA à boire en écoutant \"Going to California\" de Led Zeppelin!!", "Damn fine tasty beer. Doesn't give you that head shaker first mouthful. Nice to sit and chill with. Nice kick in the later hours too.", "Hfghhjjjhjjghjkhgjhfhj gf fhjjhhkkhgjhhhhghhghhhhhhvjhggjvxhgfhhhgggghhggggghhhhjjjhhghhj\n\n---Rated via Beer Buddy for iPhone", "I don't love this beer as much as everyone else does. Not enough body for the bitterness, which is somewhat harsh and not super pleasant. \n\n---Rated via Beer Buddy for iPhone", "I wanted to try this popular one for a while. Why not after a good construction day while watching Fear the Walking Dead. A god IPA.", "One of the best beers, great taste and well balanced IPA with a nice clean hop finish. Found this beer in a 24pk at Costco for $25. It was there for about 5 weeks and have not seen it since. I buy it at the local stores, at best $9.99 for a 6pk. Still think about that Costco deal, wish I stocked up for that price", "Notes of oranges and grapefruit. Dry body, slightly hoppy with bitter finish. So so.", "bottle. Poured clear medium amber with a thin white head. Aroma of sulphury hops. Medium bodied, prickly carbonation, lingering astringent finish. Full of piney hop flavour, peppery and tart, malt characters pushed aside.", "Bit of a mediocre beer this, was expecting a classical taste, but it misses a true signature, similar as Sierra Nevada IPA doesn't.", "Was drinking on a ferry to Riga from Stockholm. Good enough, but nothing special", "Bottle from duty free shop on the ferry to Newcastle. Was not cooled properly, but still very drinkable and aromatic. Aroma: straight hops. Flavor: hops, but without a bitterness that could be unpleasant. Nice brew.", "355ml bottle (thanks tiong). Clear dark golden color. Medium size, thick yellow head, stays. Caramel, sweet, bit of cloth, malty in aroma. Papery, malty, sweet, hops in taste. Papery, malty and hops in aftertaste. Got taste, but they sit in different corners. Unbalanced brew.", "(London 2017) 1/2 Pint Keg @ Euston Tap (West). Clear amber, creamy white. Nose is grainy soapy cereal. Taste is soap, caramel, grainy, cereal, lacking hop. Cereal & grain body. Wow this was surprisingly weak maybe just a case of the beer world moving in preferences but he classic Stone beers still work amazingly, these guys present themselves as the IPA brewery! Weak.", "On tap at O'learys, Troms� Airport. Pours a clear amber colour with a light beige head. Fruity aroma of grapefruit, pineapple, papaya, pine, lime and grass. Hoppy flavour of pine, grass and grapefruit and grassy hops in the end. Has a slick mouthfeel, medium body and a medium to heavy bitterness. A quite hoppy and solid IPA.", "Bottle from Wolters, Wasserbillig, Luxembourg!\r\n\n\r\nPours orange golden with a solid head. Aroma has pine, orange and lots of herbs. Taste has much herbal hops, fruits, pine and orange peel. Finish is long lasting, pine, blood orange and herbs.", "On tap @Trapizzino Café (Rome). Ambrata viva, limpida, schiuma bianca media persistente. Al naso sentori di malto, agrumi, erbaceo, cicoria, ossidazione. In bocca va meglio, base di malto media con amaro medio, sicuramente non freschissima, le manca un po' di spunto. Corpo medio, carbonazione media. Si beve, ma non è certo in condizioni accettabili.", "355ml bottle, has a really nice hoppy aroma (citrus, pine). Refreshing beer with the character (bitterness).", "Thought I had rated this earlier but not so. Therefore we proceed. Drank out of the 12 oz bottle, that's what you do. Pleasant taste, lightly lemon, grapefruit, resin. Decently hoppy, just nothing to put it front of numerous other IPAs. Try again? Of course.", "0,3 litre Bottle from systembolaget Charlottenberg. Clear Golden with big white head. Malts, hops and Citrus aroma and taste.", "Bottle, good presentation, not so much aroma as expected, nice head, balanced. Nice but a pit pricy for what it is.", "355 bottle from Waitrose, Sunningdale. Amber colour with white head. Grass, pine resin, citrus, bitter hops, floral hops. Body is a bit too thin and watery.", "marvelous, hoppy, citrusy initial taste; smooth and refreshing; very complex", "Not a bad beer overall, have had better and of course there are worse beers or ales around\n\n---Rated via Beer Buddy for iPhone", "Clear golden with little white head. Aroma is parmesan grapes dandelion lime wheat. Taste is spicy spiky sour juice and bitter pale oily malt. Drinkable but not quaffable. Not bad.", "Very decent and drinkable west coast stuff. Citrus and pine and a pleasant bitter punch at the end.", "Tap (?) at cannibale royale. Pours golden with whiteish head. Aroma is hoppy, citric. Flavor is sweet and bitter, hoppy, citrus, rather mellow. Overall: very good.", "355ml Flasche. Klar und dunkelgolden mit mittelgroßer Schaumkrone. Erfrischend. Karamellnoten. Mandarinenaroma. Leicht herb. Ordentlicher Körper. Runder Abgang.", "August 20, 2017\nBottle. Very nice, quite bitter, grapefruit, very hoppy, citrus, fruity, tropical fruit.\n6/3/7/4/17\n\nJune 6 2020\nBottle 330mk. Pours golden-orange with a short head. Tastes bitter front most, than mild sweetness. Carbonation is medium high. Flavors of strong hops, herbal, tropical fruits, mango, pineapple, malt, vegetal. Nice.\n6/3/7/4/17", "Colore ambrato chiaro. Schiuma leggera e poco presente. Discretamente gassata. Forte profumo di frutti tropicali (mango, papaya e frutto della passione), molto piacevole. Gusto che rispecchia l’odore in un primo momento ma dopo averla assaporata sulla lingua si sprigiona un forte retrogusto amaro che dopo un po stufa. DISCRETA BIRRA", "Taste: crisp, snap of bitter cascade, piney hops, dry finish. Subtle fresh floral nose. Gold, clear, nice soft refined white head and ring of lattice. Medium to Med/lite body. Traditional American IPA.", "bread, grass, dough, I taste rice but it was not a choice. Lagunitas has gone down hill since they sold out. If I wanted a Heineken I would have bought one. Very disappointing.", "Cítrica y frutal. Espuma moderada. En temperatura ambiente sigue siendo rica.", "Golden coloured ale with a frothy white head.\r\n\r\nAroma: malty, grassy, piney and some sweetness.\r\n\r\nTaste: sweet, citrus, hop oil, malty and some caramel ends quite bitter.\r\n\r\nAverage carbonation with a medium mouthfeel.", "Awesome IPA. Really love this one though pretty expensive in the Netherlands", "Aroma is a blend of light citrus and some spice. Flavor is citrus and grass with a bit of spice and pine. There is some toasted malt in there too which balances nicely and is a different take compared to most ipas that are the usual heavy citrus hit.  Finishes with bitterness that hangs around for a while but still good. Easy drinking IPA.", "Average typical American India pale ale. Good but not great. Would like to see either more malty flavor or hop flavor.\n\n---Rated via Beer Buddy for iPhone", "355 ml bottle @home,bb 22/02/2018.\r\nAmber,clear. Biscuit and pine aroma.\r\nHerbal,resinous,bittersweet taste. Oily.", "From tap at café Helmers, together with Huub. Very strong aroma (good!), taste is also great, a very goog IPA.", "Tap @Café Helmers, Amsterdam (with wilde_joost), poured into a jar glass (don’t like the glass). Hazy medium amber, small frothy off-white head, good retention and lacing; aroma pale malts, grapefruit, lemon, grassy hops; taste medium sweet and bitter, malty, fruity; fruity bittersweet finish; medium body, oily texture, soft carbonation; well-balanced, good example of an IPA.", "On tap at The Beef Brother, Edinburgh. Comes with a clear, bright amber color and nice white head. The nose isnt very fruity. Nose is herbal hops with some citric aromas. Taste is herbal hops, resinous, some malts, some fruity. Long lasting herbal-rsinous finish.", "Den mest komplekse ipa , jeg har smagt!!\n 43 humle typer og 65 malt sorter ..... hvor det runde afslutning af karamel malt sidder lige i skabet", "Light tan head, thick and milky over a golden body. Clearer than most IPAs.  The aroma is herbal with touches of flowers and citrus. The taste is good with a traditional IPA finish, but the flavor is strong.  It's more sour than bitter. A good gateway IPA.", "28.07.2017\nKolor pomaranczowo miedziany, klarowny.\r\nPiana jest biala, wysoka i bardzo trwala. Topniejac pozostawia sporo sladów.\r\nAromat jest silnie owocowy. Tropiki i cytrusy, slodycz i lekka kwaskowosc. Bardzo przyjemny bukiet aromatu uzupelniaja akcenty zywiczne, te jednak nie sa bardzo intensywne.\r\nMam wrazenie, ze w smaku mocniejsze sa akcenty zywiczne, dopiero pózniej pojawia sie slodycz tropików i nuty kwaskowe, cytrusowe. Smaku dodaje grapefruitowa goryczka, tutaj dluga, lekko zalegajaca. \r\nNasycenia na poziomie srednim, pasuje, piwo jest nieco lekkie.\n\n03.07.2020\nKolor miodowy, bursztynowy, klarowny. Piana biała, wysoka i trwała. Nie pozostawia zdobień.\nAromat słodki owocowy z delikatną nutą karmelową.\nW smaku podobnie, słodko owocowo. Tutaj jednak słodycz złamana jest wyraźną, intensywną goryczką.\nWysycenie wysokie. Ciało średnie. Posmak owocowo goryczkowy.\nWygląd 3, Aromat 7, Smak 7, Podniebienie 4, Razem 17, Ocena 3,8", "Tap tijdens Vierdaagse Nijmegen, bierfeest Joris Ivens-plein. Lekkere doordrink IPA, niet overmatig sterk van smaak, maar wel veel bloemrijke smaakschakeringen. Prima", "Humlet som en IPA, men den er lidt svag i afslutningen......................", "Nice out of the bottle with a good foam head. Pretty standard IPA, but good quality. Balance of hops, herbs, malt, citrus. Very enjoyable", "0,4L tap på Hoffman i Ålesund. Aroma sitrus, aprikos, humle. Utseende tåkete gylden men kremet offwhite skum som varer. Smak sitrus, aprikos, ananas, noe karamell. En øl fruktig smak og aroma, men noe kort i smaken. Det er endel bitterhet. God øl", "355ml Bottle - Pours light amber, orange, clear with off-white head with good lacing. Fruity and fresh citrus aroma. Similar taste. Nothing to add of value to the 2664 other ratings really. Enjoyed.", "Pint from tap at the Star and Anchor. Classic IPA, hoppy, a hint in the aroma to flowers, malty and slightly grassy to flavour. Always a good choice.", "Pretty average IPA with a weak aroma and quite simple taste. Also slightly thin bodied and a bit too much carbonation.", "355cl bottle purchased @ Mondial de la bière Paris.Robe dorée à la fine mousse blanche. Au nez on est sur les fruits tropicaux. Attaque agréable sur la pêche de vigne et le sureau. Fin très sèche sur l’amertume.", "True classic. Hoppy, grassy, slightly orangey flavours. Solid aftertaste. Ejnoyed this for many years now.", "Above average IPA, yet not the greatest. Pours a solid apple juice gold. Maintains a solid half inch head steadily throughout the drink. Pleasantly bitter yet goes down smooth. Strongly recommend it in a glass over bottle (although the bottle is cool), garnish with an orange for optimized taste. Overall, solid beer. Would drink again. \n\n---Rated via Beer Buddy for iPhone", "This is a nice tasting IPA, no frills nothing fancy just a good go to drink if you're craving an IPA\n\n---Rated via Beer Buddy for iPhone", "Distinctly average IPA. Delivers the minimum of everything you’d expect without committing the cardinal sin of \"bitter for the sake of bitter.\" Very stiff, boring taste. Slightly grassy.", "Pale orange/yellow color with a nice creamy head, staying.Aroma is very hoppy, citrus, maybe peach, slightly resin. Taste is malty, mostly caramel malts, some bready notes. Sweet, but immediately dry and bitter, but really well balanced. The 6.2% is well hidden, very easy to drink. Perfect with the hot.", "Aroma of citrus and herb. Clear gold beer with a thin white head. Taste is citrus, pleasant bitterness, with a spiced finale. A good IPA !", "Pours a light gold with a nice white head. Aroma of hops and malt, citrus and fresh cut grass. Taste is light malt, floral and citrus hops, caramel, and spice. Very enjoyable.", "Pours golden with a nice foam. Flowery, citrusy aroma. Taste is slightly toasty with plenty of grapefruit and some herbs and straw. Solid IPA.", "11/20 fine IPA, bit middle of the road but decent taste and good abv. It’s ok but wouldn’t have again"]}