{"reviews": ["How: Can.\nWhere: Systembolaget.\nAppearance: Amber colour with an off-white head.\nAroma: Malt, caramel, hops, citrus, grapefruit, grass.\nBody: Medium body and carbonation.\nFlavour: Malt, caramel, fruit, hops, citrus.", "Pours redish almost clear amber with a medium lasting off white head. Nose is roasted bread a little pine resin, chocolate. Taste: Malt, liqourice, roasted, good mouth bitterness. Overall: Nice and heavy ale I like it.", "Stovepipe can. Brown pour with reddish highlights when held to a light. Big sudsy beige head with good retention and ample lacing. \nThe aroma is strong with pine resins and toffee. The taste is bitter hops forward with bitter pine, sticks, leaves and dark malts. Palate is full and viscous. Finishes long and bitter. Overall: decent. Revisiting an old favorite, I haven't had one of these these since about 2008(or so). Seems to me they have upped the IBU's. This strikes me as a beer that is bitter just for bitters sake", "Rödbrun färg och fint beiget skum med små bubblor, ger ett maltigt intryck rent visuellt. Kraftig arom med fruktiga och knäckiga toner, men också en frisk parfymerad citrusdoft som väger upp det hela snyggt. \n\nMedium kropp med relativt torrt avslut vilket behövs för att öka drickbarheten! En del maltsmak av karamell och frukt, men väldigt mycket humle; kåda, tall och citrus. Beskan dominerar och sitter kvar länge. Inte en balanserad öl, vill uppenbarligen sticka ut! Intressant att den är så gigantisk i smaken utan att kännas kladdig eller rörig, välbryggd på så sätt. Beskan är för kraftig för min smak, den är skarp och gräsig, en rejäl käftsmäll. Inget man glömmer i första taget, men helt klart intressant och tänjer på gränserna. Gillar aromen väldigt mycket, mer än smaken. Jag förstår tjusningen och gillar man kraftfulla smakupplevelser som ger en kick, typ som att äta en riktigt stark vindaloo, så är detta en mycket bra öl för ändamålet då den också är välbryggd. Problemet med denna typ av öl som ska tänja på gränserna tycker jag ofta är att de blir endimensionella, men här finns absolut flera lager, även om det inte riktigt är för mig.", "Dimmigt mahogny med tjockt beige skum. Doftar fruktigt, maltigt, lite kryddigt och pepprig, kaffe och choklad.. Smaken fyllig, lite söt, sedan besk. Eftersmaken lång, gräddig med markant beska. Mer IPA än Ale.", "Can. Dark brown with a beige head. Heavy aroma of makt, yeast and alcohol. Really bitter - not for everyone.", "Dark brown colour with a creamy head.\nAroma: roasted malt, chocolate, cacao, raisins, some caramel. \nTaste: roasted malt, hops, cacao, coffee. Dry, coffee-ish bitterness.", "2 finger warm beige head. Dissipates rather quickly. Small bits of lacing.\nSemi-clear, deep ruby coloured beer.\n\nAroma of copper, oats, raisins, white grape and a hint of lemon. Very subdued.\n\nTaste of the same minus white grape and lemon. Add instead pillowy soft grains with a touch of bitter coffee and rye in the finish.\n\nMouthfeel is silky soft with a great medium-high creeping bitterness. Low carbonation. Slightly sticky. Not too heavy.\n\nOverall: A great staple beer. Mild like a, well... Mild. But with a bigger landing and much more bitter. Infinitely satisfying in its simplicity.", "Burk från systembolaget. Bärnstensfärgad öl med beiget skum. Trevlig öl med fina toner av karamell, humle, grapefrukt och granskott. Torr fin avslutning.", "Can @ Friends/Chef: Pours clear amber/copper with good off-white soapy head and lacing. aroma/taste: barley, bread, caramel, pine, alcohol, light citrus, light toast, light berries, light metallic, molasses and grassy notes. palette: strong hoppy aroma, average carbonation, medium to full body, average to high sweetness, dominated by a notable bitterness, average to long duration, bitter and light dry finish and an oily texture. Overall: bombastic US strong ale", "De color ámbar obscuro - marrón, es turbia con restos abundantes de levadura de gran tamaño que dan un aspecto peculiar al líquido. Forma una espuma de baja altura de color blanco, que no persiste mucho y tiene mediana retención.\nEn nariz es floral, algo frutal, pero no sé destaca la malta, si acaso en una ligera nota a caramelo escondida en el fondo.\nEn boca es amarga de entrada. Refrescante, destaca el lupulo, con un trasfondo algo dulce que equilibra.", "Kastanjefarvet, uklar med fint brunt skum. Let citrus og karamel duft. Stærk lakridssmag med fin bitterhed.", "Bruin bier met stevige schuimkraag. Na openen spuit het bier eruit. Smaak is bitter en licht kruidig met iets van hars, wat dennen en gras. Heel aparte, maar eenmaal gewend een goede smaak.", "Mørk kraftig maltet humlet frugtig ale, med bitter malt eftersmag der varer ved.", "One pint 3.2fl oz can brought back for me from Dallas. Pours dark red with a white head. Aroma of malt and fruity hops. Bitter taste and finish.", "Tap at Besk - wow - such a fine looking ale in the glass with impeccable lacing - super-powered malty aroma a bit like a wee heavy Scottish ale or a dense red ale but better - superbly malty ale with elements of Christmas cake. Soooo drinkable. Gotta say I’m not a malt fan usually but this blew my tiny brain. Lovely.", "Can.Dark reddish colour with small head.Aroma of roasted malt and dark dried fruits nice with good full body and malt finish.", "Deliciously hoppy red ale. Nuff said for this classic. Takes me back to 2012 in Austin, TX :)", "Can from HavnensVin&Tobak. Pours clear dark chestnut brown with medium offwhite head. Aroma is malt, caramel, brown sugar, fudge, rye bread and hints of cinnamon, cardamom and sweet liquorice. Taste is medium sweet, light to medium bitter, light acidic and faint salty. Body is oily with light carbonation. Finish is long and balanced sweet and bitter with notes of brown sugar, caramel, butterscotch, roasted barley, chocolate malt, dried fruit (dates, raisins), bitter grapefruit zest, grassy hops and hints of oak, mint and liquorice. Quite complex and arrogant ;-)", "Piana średnia, beżowa, trwała, zostawiała lacing na szkle, z pewną ilością średnich pęcherzy. Kolor prześwitujący ciemny brąz. Aromat owocowy i słodowy, karmel, przyprawy, cynamon. Smak początek lekko wytrawny, wręcz ze sporą ilością goryczki, ale przebijają się karmel, słód, trochę czekolada i kawa, z czasem te składowe bardziej intensywne, do tego coś owocowego jak grejpfrut, daktyle. Pierwsze piwo w tym stylu i super doświadczenie.", "Aroma of brown sugar, malt, burned caramel, cinnamon and spices\nBrownred colour with medium lasting head\nTaste is malt, licorice, bitter citrus fruits, dates, brown sugar and molasses\nSmooth oily mouthfeel with low carbonation\nGreat beer\nTasted at home", "Almisser deep red colour with large brown / red foam. Smell of malt, caramel and dried fruit. Taste is strong with malt, lightly salted dried fruits, nuts, dades, licorice and a fantastic bitterness. Lasting aftertaste.\nReally appreciate this ale.", "Lattina. Il gusto al naso è indirizzato verso l'orzo tostato. L'olfatto viene stimolato in maniera normale e l'esistenza olfattiva è sufficiente. Il cappello di schiuma ha una buona tenuta. La grandezza delle bollicine è medio-fine. Il liquido è di aspetto velato. Il colore è ambrato rossiccio carico tendente marrone. Il corpo è pieno. L'amaro è deciso. La forza gustativa è elevata e la permanenza è buona. Le sensazioni boccali finali risultano di birra beverina. Il retrogusto è intenso. Al gusto vengono donati toni di caramello, miele, frutta secca, luppolo, resina e agrumi.", "color: marron oscuro casi negro, espuma cremosa y tostada de un par de dedos.\nolor: malta tostada y caramelo, pino, \nsabor: amargor medio-alto, cuerpo medio, oleosa, al final persiste el amargor.", "Hazy brown with a massive off-white head. Rich hoppy aroma. Taste is spicy licorice, bitter malts with a gently bitter palate.", "Aroma: Malty sweet with caramel and citrus. \nFlavour: Sweet malt and fruity with caramel and notes of citrus. Aftertaste is malty sweet. \nColour: Amber with an offwhite head. 23/4-2018", "Ar: ciemne i karmelowe slody, karmel, skorka ciemnego chleba, super intensywnosc. Wyg: ciemny, metnawy bursztyn, piana gruba, gruboziarnista, mega brudzi, jakas zawiesina wisi. Sm: wysycenie srednie, slodowo, lekka palonosc, duzo karmelu, zlozone, alko fajnie schowane, lekko w posmaku wychodzi, skorka chleba, lekka goryczka palono-karmelowa. Pos: Palono-karmelowa goryczka, lekkie alko w tle, dlugi i zmienny.", "Blik 47,3cl thuis. Rood fruit, goed bitter, pine, grapefruit, maltig, caramel, licht stroperig, hoestdrank, kruidig, droog, flink hoppig. Geen doordrinker. (11-12-2020).", "Aroma of some pine and sweet malt.  Reddish amber color with a thick tan head.  Rich sweet malt up front.  Fresh Caramel nots get hit with heavy piney bitterness.  Balance gives way to a resinous bitter coating on the finish.  Light to medium mouth feel with increasing bitterness in tongue during aftertaste.  A little boozy.  Good for bitter fans.", "How: can. BB: 12/01/21\nHead: off white, two fingers.\nColour: deep amber, hazy.\nAroma: red berries, caramel, bread, herbal, pine.\nTaste: medium to full body, below average carbonation, red berries, caramel, bread, citrus fruits, herbal& resinous bitterness. Quite bitter.\nBread, caramel& red berries in long aftertaste.", "Auf jeden Fall muss dieses Bier getestet werden, alleine schon wegen dem Text auf dem Etikett.\n Schaum relativ konstant.\nGeruch: schokaladig karamellig maligne\nFarbe: dunkel braun\nGeschmack:Bitterschokolade die sich in Alkohol verliebt.\nSchmeckt nicht jedem mir dafür umso mehr", "Has a funky aftertaste, like that bitterness you get from trying to peel a grapefruit with your teeth. Not my favorite dark ale, probably wouldn’t get this again￼", "16 oz. can. Deep ruby appearance with large caramel tinted foam head. Suds aggressively cling to the glass. Pine aroma. First sip is rather disagreeable and heavy. Had to stop and check the bitterness. 100 IBUs? In a 7%+ beer? Very strong and dry, driven by powerful barley and hops with almost no sweetness in sight. You'll get no mercy from this beer. The bitterness carries over into the aftertaste. Rye and charred barley. Smoky, burnt. Can't say I'm a huge fan of this. For a big beer from Stone, I would take Ruination over this any day.\n\nAll that's not to say this is a bad drink. Just harsh and relentless in bitterness. Probably better with dinner instead of solo. The biggest flaw here is the lack of balancing sweetness. As a Stone lover in general, this one is technically sound, just as a matter of preference not the style I would reach for.", "Encore une bière surcotée qui a tout joué sur le design. Trés reussi au demeurant.Bien trop amère . Pour les amateurs de chocolat houblonné.", "This is a strong beer. If you are not into or familiar with ipa’s I wouldn’t start with this one. For me I like it. Color is very dark, aroma is heavy, taste is good gets smoother as you keep drinking it the 1st few sips you’ll be like oohhh this is strong but after a few it’s good. Will definitely give you a buzz. Would definitely get this beer again.", "Rood achtig bruin bier met weinig wit schuim. Smaakt alcohol zoet, en licht alcohol sterk. Heeft daarnaast lichte granen en bloemen. Ook is er een beetje perzik en citrus te proeven. Op het einde is er nog een karton achtig bittertje te proeven.", "reddish brown with a small dense off white head. Medium sweet, low sour, high bitter. Prominent charred aroma, some caramel. Improves as it warms.", "Can. Color: Murky reddish brown, yellowish white head. Aroma: Floral hop, malt, caramel. Taste: Floral and slightly citrus hopbitterness with caramel and malty background. Very slightly boozy. Over moderate bitterness, moderate sweet. Bitter and dry-ish hoppy finish. Ok.", "This beer remind you one \"IIPA - Imperial\" but the taste is little more bitter and has less tropical fruits but in general remind you very well one \"IIPA\" beer.\nThe aroma is very strong and give you lot of hops and caramel nose. The taste is really very bitter in the beginning and more in the finish. The beer is very hoppy. Lot of caramel, grapefruit notes here. Also the beer is malty too and little dry. The carboration is moderate.\nOverall i'm not big fan for bitter and very hoppy beers. So i can't be objective but if you like hoppy beers, this can satisfied you for sure.", "Frisch fruchtige und vergoren fruchtige Noten. Den sehr hohen Alkoholgehalt merkt man kaum. Sehr herb bitter, bleibt noch lange im Mund. Ist mir etwas zu viel des guten.", "Malty sweet and floral hop aroma.  Aroma reminds me of Dogfish Head IPAs.  Taste is, caramel malt at the start with a huge kick of grapefruit bitterness.  Bitter aftertaste that lingers.  I would classify this as an amber IPA.  Good for the style but it’s not my style", "16 Fl Oz can. Pours brown with a reddish tinge and a large, beige head. Aromas of a bit of pine, some caramel, and woody notes. Tastes of nutty/woody malts, boozy, dry, bitter on the back end. Medium body, assertive carbonation, lingering boozy/bitter bite. A little intense for my tastes.", "47.3cl can at home. Pours a dark amber/reddish colour with a medium-sized off-white head. Strong malty, piney aroma with some hops. Taste is 90% pine, malty, slightly hoppy and caramel.  A bitter finish and a heavy bitter aftertaste.", "Notes found in an old notebook unearthed during a bit of spring cleaning. Drank sometime during 2010. Dark brown pour with a beige head. Stewed apple,coriander, cinnamon, blackberries in the aroma. Taste is bitter chocolate, sultanas,wood,raspberries. Good alcohol burn. Fierce hoppy finish.", "Clear ruby red/orange pour. Malty nose. Boozy, caramel tones with a nice balanced bitterness", "Bardzo wytrawne, mocno chmielone, nieco zalegające i łodygowe. Bardzo intensywnie.", "Barwa ciemno bursztynowa, rubinowa. Piana biała, wysoka, trwała. Jest bardzo sztywna, ładnie krążkuje znacząc każdy łyk.\nAromat chmielowy, tutaj fajne, acz lekko intensywne nuty owocowe, ziołowe, dalej słodowe nuty karmelowe, ziemistość, akcenty tytoniowo popiołowe. \nW smaku najwyraźniejsze są popiołowe i tytoniowe akcenty, kolejna jest ziemistość, zioła, karmel i słodowość, nuty owocowe nieznaczne. Silna, intensywna goryczka to kolejny atrybut \"Arroganta\". \nNasycenie średnie, pełnia powyżej średniej. Piwo jest nieco szorstkie. Posmak długi, karmelowo ziemisty.", "Malty nose, nutty brown colour. Dirty white foam. Heavy alcohol taste, unrefined bitterness with malty flavours trying to balance it unsuccessfully. Average...", "Poured into pint glass.  Dark amber color with frothy head.   First taste was big and bold and I didn’t think I was worthy.  But after a couple drinks this beer keeps you wanting more.   Great beer to enjoy while making dinner.  I will be buying more in the future", "500 ml can. Pours dark ruby ​​brown in color with creamy foam. The aroma of roasted malt, nuts and dark fruits. The taste is pleasantly bitter and with nuts and grapefruit. A touch of alcohol in the aftertaste.", "Color cobrizo, genera abundante espuma cremosa color canela. Huele de maravilla, a caramelo y cítricos. All echártela a la boca la Arrogant te sube a una montaña rusa de sensaciones. Quizás sea eso lo que desconcierta a tanta gente. Su lata de medio litro te hace transitar por el dulce caramelo de los malteados, tonos torrefactos, el amargor sin concesiones del lúpulo, pepinazos licorosos y un final seco. \n\nEstá claro que para gustos los colores, pero a mí personalmente una birra que me remueve de ese modo… ME GUSTA!", "Aromat: karmel, taki twardy, zioła, trochę przyjemnego alkoholu, zboże;\n Wygląd: ładna piana i lacing, klarowne, ciemno miedziane;\nSmak: karmel, wysoka ziołowa goryczka trochę zalegająca, zioła, słodowość, ciemny chleb;\nPodniebienie: nisko nasycone, gładkie, sporo ciała;", "Ar: malt, red fruit, berries, dark bread Ap: dark ruby, brown creamy head T: malty, med sweetness, dry finish P: med body", "Aroma slightly hopped with American foreigners of maio. Dark ruby red color with dense and fairly persistent foam", "Dark ruby red color with dense and fairly persistent foam. Aroma slightly hopped.", "Pours reddish brown with a royal humongous foam crown. Aroma of cyrup, sweet malts, nuts and dark bread. Taste is initially sweet with flavors of cyrup and even a slight hint of red berries. Solid malty backbone, yeast and decent voltage of alcohol take over with a more bready and nutty taste. Hops bring in a nice dryish impression to finish. Medium bodied, overall a satisfying thick mouthfeel. Good balanced ale in all aspects, but unfortunately doesn't stand out either. Strong recommendation, but won't included in my tales of most epic beers.", "Can from Alko Arkadia, Helsinki. Pours murky brown with a big frothy head. The aroma features a mix of bready, nutty maltiness and piney hoppiness. Taste is dry, initially malty, towards finish medium to heavily bitter. Dry nutty flavours dominate initially, later pine and a touch of grapefruit. Fairly balanced between malts and hops. The mouthfeel is medium-bodied and smooth, average carbonation. Decent brew.", "Can. Dark amber color, steady thuck white head. Fruity, resinous aroma. Dry, high bitter taste. Hoppy floral, fruity aftertaste, caramel maltiness. Low carbonation, full body.", "Bevuta alla spina.\nAroma lievemente luppolato con esteri americani di maio. Colore rosso rubino scuro con schiuma densa e abbastanza persistente.\nFgpr", "Birra dal colore ambrato scuro un po' velata, con schiuma beige abbondandee persistente.  Al naso non è molto potente cmq si swntono aromi di malto, caramello, toffee, pane nero, agrumi, resina. In bocca le note sono più intense: caramello, toffee, pane nero agrumi, per poi virare decisamente verso un amaro deciso, resinoso, terroso. Un amaro che rimane ben presente anche nel retrogusto ben bilanciato dalle note màltate.", "Pine, caramel, malts aroma.\nFlavour is nuts and grapefruit. Intense bitterness, coffee. Alcohol is felt, but in an OK way. A bit metal in the aftertaste.\nInteresting ale, even though alcohol breaks through.", "Quite surprised that I missed rating this.  Pours a dark amber with a full beige head that settles slowly.  The aroma is big on pine and grapefruit, with milder caramel, raisin, and earthy malt.  The taste is dry and brings forth an intense bitterness.  Among the flavors, I still find potent pine along with a healthy resin.  There are moderate amounts of caramel and earth, and than gentle floral notes, raisin, and coffee.  Bitter pine finish.  Full bodied and smooth in texture.  You don't find very many like this one these days.  Solid and recommended.", "0.5 l can. Pours clear amber with thick brownish head. A: white cabbage, malty T: medium body and carbonation, firstly harsh malty, harshness quickly disappeared with little bit of warmth, then it gets nice and smooth with some light coffee notes", "Can 0,50L. Clear ruby/amber color with big, frothy, off-white head. Aroma of roasted malts, caramel, nuts, candy, biscuits and gentle hint of dark fruits.  Taste is heavy to harsh bitter and with nuts and grapefruit. A touch of alcohol in the aftertaste. Medium to full body, dry texture, soft carbonation,  metallic finish.", "Cherry-colored, hazy, nice creamy head. Aroma is sweet, candy, sugar, cherries, grapes, sweet malt and nuts. Unlike the aroma, the taste is of an intense and deep bitter, a lots of hops, the alcohol is there but very soft, with hints of cherries. The finish is long and strongly bitter. The bitterness in the taste and in the aftertaste is very nice.", "Can. Hazy, dark chestnut brown, coppery. Sizeable offwhite head, foamy and lasting. Mild biscuity nose, some nuts and sweet fruity notes, hints of roast. Moderate bitterness, hoppy and herbal. Lasting aftertaste. Some alcohol warmth.", "It's all brute without any real finesse. It's like using a three-wood when you're already on the green.", "MANY Years ago when I tried this I admittedly fell into the “you’re not worthy” category.  Palates change, and I’d say this strong ale is delicious.  Malty, with mild alcohol burn, and with a wonderful hop presence at the back end.  Great American sipper.", "Fantastisch arrogant bastard ale met 7,2% alcohol van de Stone Brouwerij in Berlijn. Donker, hoppig, zoetig, zeer onderscheidende smaak.", "Riecht würzig, dunkel röstig und leicht fruchtig. Ergießt sich dunkel und sehr trüb. Viel Schaum. Der Antrunk ist sehr vollmundig und kräftig. Schmeckt extrem intensiv, Aromen von Tannenharz, Aprikose, Beeren und Röstmalz. Bittert sehr stark bis in die Magengegend. Sehr langer Nachhall. Aussergewöhnliches IPA der extra Klasse", "Pours a dingy brown and topped with a thicker head of off-white froth.  Aromas of earthy hops with a caramel malt backbone.  Taste shows bready, heavily toasted caramel malts.  Mouthfeel a sticky malt.  The hops are aggressive and the malt profile is in the background", "rough hop aroma.\ndeep grapefruit body with a little sweety.\nLong bitter aftertaste.", "Can, medium long lasting off white, hazy seep red color,  bubbly head, caramel biscuit aroma with some herbs and a hint of smoke, caramel biscuity flavor with a strong and mellow grapefruit and shrubs bitterness that lingers and lingers, very nicely balanced. Very nice and enjoyable.", "From can (brewed in Berlin). Pours clear dark brown with a small beige head. Nutty, earthy aroma with some caramel and hops. Medium body, average carbonation. Taste is light sweet, medium to high bitter. Long bitter aftertaste.", "Rojo oscuro. Aroma a malta. Espuma media. Carboinatacion baja. Cuerpo medio alto. Sabor extraño con un cierto dulzor al inicio que se convierte rápido en amargo desagradable. Retrogusto amargusimo. No me gusto nada.", "Limenka 0,5L - kupljena u Spicy daysu - Berlinska verzija...visoki postotak alkohola se gotovo i ne osjeti u okusu...suho...s dosta gorčine na kraju", "Dark amber, thick bubbly head and it's lively. Smell is a little fruit and dry hop which follows through into a big, dry flavour. A little toasty malt, bitter hop, some fruit which just about carries through into the backtaste for balance. It's decent and tastes its strength.", "Really very aggressive. Dark brown color, small size foam. Very concentrate citrus aroma, and very concentrate grapefruit bitterness in the taste. Awesome beer.", "Wow ca dépote !\nPin agrumes, un peu amer, bière sèche et mousse crémeuse.\nJe m'en souviendrai", "Pours dark amber with a massive, structured beige head. Aroma is slightly sour, some caramel notes and a light hoppy aroma. Taste is very aggressivr upfront, a real CO2 kick, but it quickly gives way to a smooth, balanced body, which is then attacked from the back with a hoppy kick. Strong hoppy aftertaste.", "Otestováno v rámci degustace v ostravském podniku Beers no.1. Detainější hodnocení přidám později.", "Backlog z poprzedniego katalogu, ocena wystawiona na podstawie wspomnień z grudnia 2017", "AR: Hopfen, Harz, kräuterig, karamell, Gras\nAP: leicht trübes rotbraun\nTA: bitter, Hopfen, Harz, kräuterig, Gras", "From reading about the beer I was expecting a variety of aromas, but did not sense much more than piny hops. I will give this Bastard the benefit of the doubt and assume the beer was too cold, old or both.  The malt taste hardly comes through in the middle, through the overpowering hops. The bitterness lingers on well after finishing this beer. I had expected more and feel this beer is overrated.", "0.5l can. Pours hazy red with a large thick head. Aroma of dark fruits, caramel. Taste of roast malts, caramel, dark fruits. Strong bitter aftertaste. Not bad.", "Аромат горький, солод, совсем немного хмеля, легкая травянистость. Цвет темно коричневый, пена средняя. Вкус горький и ядреный с самого начала. Много солода, легкие травяные нотки, намеки на мед. При глотке не резкая но сильная и продолжительная хмелевая составляющая, при чем без ноток цитруса, исключительно еловые вещи. В общем пиво для мужиков, а я наверно буду сидеть в петушином углу и пить Хугарден.", "Pours reddish/copper with a big brown head. Aroma is alcohol, malt and some caramel. Body is rather plain and one-sided... Malt and alcohol but not something that stands out. High bitterness. Expected more with these ratings", "16 ounce can at the house bought at Winking Lizard Macedonia Ohio. Smell both hops and malt. Rare combination for the same beer. Clear brown in color with a big light tan head. Taste the malt, smooth and alcohol is well hidden. Nice malted after taste. Really nice for the style and been around 20 years. A classic! Cheers!", "A rather generic malt aroma with some grass and treacle - not too bad and unexpectedly restrained. But the balance is way out of whack, with a dose of bitterness that simply doesn't suit the bouquet at all. Like a Fernet Branca (or, worse, a German Underberg). That kills off any chance of depth or complexity. I think this beer is totally overrated - and wonder who falls for the adolescent marketing.", "Aroma of nuts, caramel & almonds. Hazy reddish brown with a low creamy tanned head. Very bitter taste. Medium body, slick texture & average carbonation.", "Can. Dark red amber ale. Thick light tan cream head. Nose is mild, light malts, a teensy bit banana. The taste is quite harsh, which is to be expected. There's tobacco notes, a slight burn, some lingering fruits, a deep maltiness. It's quite complex, and deserves a sip, a mouthplay and some time pulling out the flavour profile. I wasn't expecting this - I think I as expecting a hug bitter IPA style ale, which this isn't.", "Can. Hazy amber to copper. Medium to large light beige head with medium retention. Aroma intensity 3.75/5. A good balance between hops, malt and yeast in the nose with notes of hay, cut grass, melon and cheese. Hops stand out in the mouth, with long finish heavy bitter. You keep chewing the beer after a long time. Medium body", "That's a beer defining a style. American strong ale in its best. dark brown color with dark beige head. Great balance between sweetness and bitterness. Even the high IBU you want some more.", "16 oz can. Great read on the label. Smells of a hint of citrus and pine, wasn't expecting that from the color. Brown in color. A delightful mix of sweet and bitter. A bit of caramel flavor, followed by a little pine and citrus. Has a lingering bitterness. Quite tasty.", "0.5l can, bought at Berlin Schoenefeld Airport. Dark brown body with a hint of ruby. Beige creamy head. Aroma is complex, caramel, roasted malt, vanilla, some fruity freshness. Taste is roasted malt, caramel, liquor and some fruits in the background. Moderate carbonation, mild palate. Yet, aggressive aftertaste, bitter, burnt, smoky wood. Lasts very long. Typical American concept: remarkable beer with a strong, one-sided character, but still manages to show complexity.", "The can says I won’t like it. They were right. And this sentence is so I can have 75 characters to make beer buddy happy. Wish I could keep my private notes private\n\n---Rated via Beer Buddy for iPhone", "Ale, Strong Ale, Black IPA? Just a nice beer. I drink it for years if I can get it. Not too sweet, not too bitter but also not bland. I wish it was easier available.", "Can @ Wawa, Sarasota. Drank from the can so no head description. Dark brown as molasses. Aroma of roasty dark chocolate and slight vanilla, wood, light smoke, and dark fruits. Taste the same...and smooth as silk! So yummy. Best ASA i ever had.", "caramel, hay, amber, clear, frothy, medium sweetness, medium bitterness, medium body, average carbonation,", "Minimal off white head on a reddish brown still body.\r\nMedium bodied, sharp, clean & dry on the palate.\r\nBitter under ripe fruits, acrid tasting", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "Pours dark coppery brown, big tan head. Ar9ma of roast mal, pecans, earth, pine, cocoa, turpentine. Flavor is bitter upfront, overt alcohol, some malt, tarry, earthy. Nice creamy mouthfeel before the alcoholic bitter aftertaste k8cks in. Interesting, but they were right, I don't like it that much.", "Been a while since I've had this beer, but I remember it being very strong tasting. Nice malt backbone with a hint of sweetness and a bold up front hop flavor, though not to bitter for me. I really liked this beer", "From a can. Dark bronze in colour with a thick head.\r\nA caramel fruit and biscuity aroma.Full bodied with quite a bitter taste. Fruity and malty.\r\nDefinitely quality but quite a peculiar taste which might not appeal to everyone.", "I enjoyed this beer.  Stout and not a fizzy drink. Itll put hair on your chest.", "After a few years break from this beer I decided to come back fresh and rate it. It is bitter, very much so, like west coast people love, but it has a lot of backbone to balance it, so I understand why itis known as a great beer. Drank in Vienna", "Malty and sweet aroma. Great caramell taste, fruity and taste of orange, honney & hops. Deep orange colour. Well balanced :-)", "Can @ home, from Fleggaard. Clear amber w a beige head, nice lacings. Aroma heavy malty (caramel, roasted) and hoppy (grapefruity, citrusy). Flavor medium+ sweet and bitter with a long duration. Body medium+, oily, soft carbonated.", "Color granate, translúcida. Espuma beige abundante y duradera. Aroma a maltas y, en menor medida, herbal. Sabor, en un primer momento a maltas y caramelo hasta que aparece el amargor, un poco agresivo. Esa sensación perdura bastante. No flaquees, ese demonio se quiere reír de tí.", "Forte, più come corpo che come alcool. L'amaro che molti lamentano ha un attacco immediato, che però viene immediatamente contrastato dalla corposità. La schiuma è molto cremosa, morbida e persistente. Tecnicamente perfetta. Senza dubbio è questione di gusti, ma non è una birra da riprendere immediatamente dopo averla finita. Degustata dalla lattina, che permette una spillatura davvero perfetta!", "Mid-high body. Very complex tastes. A bit fruity flavour. High alcohol. Bitter beer around 100 ibu i guess. Its my top 10 beer", "Dos dedos de espuma de gran retención. En aroma se encuentran leves notas herbáceas y especiadas del lúpulo, además de un gran carácter maltoso y por último a frutos secos.\nEn boca es de gran cuerpo, fuerte presencia de las maltas y notas levemente tostadas, acompañado de cierto dulzor, luego llega el amargor intenso y levemente resinoso, para finalizar con un prolongado retro gusto amargo. Excelente cerveza", "From tall can. Super bitter, tastes strongly of sweet tropical banana at first, washed back by malt and finishes with high hoppiness. Very bitter.", "0,5l can. Pours cloudy mahogany with off-white head. Aroma of malt, caramel. a resinous bitterness, herbs, some toast also. Taste is bitter, malty, caramel. a cough syrup-like herbal and licorice note, dark fruits as it develops more. Finishes with bitter notes.", "50cl can, rating based on past tasting aiming completion of rating profile. solid american ale with well hidden alcohol, maltiness fairly matching hoppy notes. very good", "Can, 500 ml @ The Old Fishing Shack, CY. Another great ale with high alcohol content. Reddish brown colour, light beige head stays for a long time. Biscuit, strong sweet malty aromas with a hint of cherry inside. I thought it's British - the style suggests me it's British, but it's American, and comes from Berlin - funny. Brutal rich palate, relatively high IBU, long aftertaste. Amazing piece of beermaking again. Stone Brewery goes big! Just great from every angle. Top category ale!", "En copa, cerveza oscura color caramelo, con una generosa capa de espuma color hueso de buena retención. Aroma muy intenso a cereales y caramelo, con matices de madera y licor. En boca, textura acuosa pero bastante compleja. Presenta fuerte amargor al inicio del trago, la cual perdura tras el trago. Resulta bastante dulzona, con presencia muy marcada de cereales, regaliz, licor y madera. Se detecta cierta presencia de alcohol en nariz tras el trago. Una cerveza compleja, fuerte e intensa, para tomar con calma y respeto.", "Can. Pours a dark brown colour with a fluffy white head, hoppy aroma with plenty of fruit, the taste is medium bitterness and fruity with a dry bitter finish.", "This is the beer that rocked my world 5 or 6 years back when I first had it. It brought me back to drinking beer. It probably had some influence in starting me brewing too. Picked this up in a long can for the first time today at Tanaka Shoten. They took the earthquake last week pretty bad and lost a lot of stock. I went in to see how they were and saw this one. I’m aware canning technique is at a higher level nowadays and I can’t say I was disappointed but it seemed different. Nose was there, caramel, sweet raisiny thing that doesn’t exactly promise much, but something in the back I like but I’m not sure about. Complex. Mouthfeel is great and slippery. Finish is bitter and bitter.\nI love this beer to no end. I’d drink it everyday, but alas, I’m too cheap... or so it says on the matching glass I bought to go with the can of beer I got for nearly 700 yen.\nPacking a punch at 7.2 the sticky sweet quenched by bitter is one of my favorites. Seem to remember enjoying it more from the bottle for some reason though.", "Can. Aroma is malt, citrus and basement. Taste is bitter and malty with a hint of grapefruit. Bitter aftertaste.", "Varies, but generally a very good ale. Pinch of bitterness at the top end but get over that and it's very rewarding.", "Why is this a beer? This is by far the goopiest of hops. It's terrible and no one should drink this past one swig.\n\n---Rated via Beer Buddy for iPhone", "Can. Thanks zvsn. Slightly hazy bronze with big bubbly beige head. Sweetish aroma with notes of caramel, dried fruits, tea bag and some fruitiness. The flavor is sweet with notes of alcohol, dried fruits, tea bag, caramel and some hops. Full-bodied. Too old, unfortunately.", "Can, 0.5l. Deep red/brown pour, one finger frothy beige head. Medium retention, solid lacing on the glass. Heavily malty nose, lots of caramel and toffee notes, herbal touch, slightly liquory. \r\n\r\nThin to medium body, medium carbonation. Average mouthfeel and texture. Mildly sweet taste combined with strong bitterness. Aroma is high malt with caramel and toffee dominating, low to medium hops, grassy. Lots of bitter herbal liquory notes. Strong alcohol presence, drying mouthfeel with pronounced burn on the tongue. Finishes long - dry, bitter and boozy.\r\n\r\nOverall, pretty good ale. Not for everyone and not for every occasion, but personally this one hits the spot. Nice.", "Can (bbd 08/18). Hazy amber with a huge beige head. Aroma of honey, toffee, marmalade, caramel. Sweet, honey, oxidized, fruity, toasted bread, toffee, alcohol, bitter finish. Medium bodied. Need to dry again.", "Pivo u limenci.\nPopijeno u Stella Beer2Go dućanu i kušaoni piva u Medulinu.\nJbt. Gorko\nAroma je fina sladna i lagano karamelasta , i malko suhovoćna.\nSa obzirom na tako sladnu aromu , očekivao sam nešto \"punije\" tijelo , a ustvari je više na Engleske Bittere , možda mrvicu punije. \nOkus slatkast i jbn. gorak !\nKonačna ocjena je da je pivo zaista arogantno !\n\"Hoperi\", obavezno probati ! ;)", "From a beer hawk mystery case. Very bitter , sweet , caramel, malts.  A little like a very bitter brown ale. Lingering bitterness.  Needs the bitter taste to balance the sweetness.  Not bad.", "0,5 l. Can. From Spicy Days Zagreb. Brown color with off white head. Malt and caramel aroma. Bitter, caramel and dark malt taste.", "On tap at Cobb's Landing, Ft. Pierce, FL. Ordered this after ordering Founder's All Day IPA that had just kicked. I'm an IPA fan, and like both West coast and NEIPA/East coast styles. Have had both Stone IPA and Stone Delicious IPA, and have yet to be as amazed by Stone as so many seem to be. Thought I'd give then another try with this, and am so glad I did. The aroma is orange peel, grapefruit, pine, and I get some slight bready notes. The taste is powerfully citrus and dank hops, with a balancing malt flavor of barely sweet toastiness. Then the finish is clean but with a delayed burst of white grapefruit pith bitterness. This is a far more balanced beer than the other Stone IPAs I've had so far. It is big, yes, but balanced and delicious in a unique way. Glad I tried it. Will look for it in bottles or cans to try again.", "Bardzo gęsta wysoka piana, Ciemna barwa, prawie jak black ipa, mętne. Piana bardzo ładnie zdobi szkło. W zapachu owoce, żywica, karmel. W smaku słodowo żywiczne. Bardzo ciekawe połączenie. Wychodzi też wyraźny karmel, alkohol jak z tych cukierków czekoladowych. W posmaku oprócz bardzo silnej goryczki (lekko zalegającej, chamskiej, minimalnie chemicznej ale jednak uzależniającej :) ) przypalona skórka od chleba. Warto zapoznać się z tym piwem, aczkolwiek nie widzę sensu żeby kupić je ponownie. Nazwa piwa adekwatna do tego co prezentuje, co doceniam :)", "Cerveza bastante agresiva en paladar, trago rico y con matices a regaliz, densa, rica pero de trago complicado redondeado", "7/26/18\r\nAt Whole Foods after finishing psych inpatient. \r\n\r\nDeep translucent brown with a moderate khaki head. \r\n\r\nNose is sweet citrus hops with a hint of caramel maltiness. \r\n\r\nTaste is all hops. Bracingly bitter through and through. More piney than expected from the nose. Ends with a big dose of hoppy funk. \r\n\r\nBig palate with lots of carbonation. Hops bitterness stays until you eat something else. \r\n\r\nOverall, this is as aggressive as the label indicates but a bit heavier and more one-dimensional than I’d hope for in a really hoppy beer.", "0.5l can in Berlin. Brewed in Germany.\nPours dark hazy brown. Very bitter finish. After a few sips normalises, but the aftertaste still lingers.\nHard alcohol taste.", "Kolor bursztynowo czerwony. W zapachu troszkę alkoholu, słodowosc. W smaku rodzynki, trochę karmelu, wyraźna goryczka.", "Ocena na podstawie wspomnień z degustacji na potrzeby uzupełnienia profilu.", "Too much carbonation it just does not allow the beer to make its presence felt. Bitter finish. For some reason I get this heavy uncomfortable feeling in my stomach as I if I have eaten fast food and the food is sitting there and it is not getting digested. I bought a 6 pack and every time I open a new can I hope to find something new that will justify the high ratings. But it is the same old taste and feeling of disappointment.", "From 1 pint can. Pours dark brown with brownish head. Malt and bitterness afterkick, pretty strong.", "Puszka 500 ml. Zdecydowanie lepsze od wersji double. Ciemne, mocne, mętne, raczej goryczkowe amerykańsko ale nieprzesadnie. Takie lepkie (karmel, rodzyny), ale też imperialne, gładkie. Bardzo dobre, porządny kraft, porządnie ułożone i zbalansowane; ale to półka maximum minus 1.", "Burk på Torrön. Härlig maltig saltmättad doft. Tung malig smak med lite källartoner. Smaken något tunn för att få högre betyg. Beskan mycket trevlig", "Reddish-brown beer with lots of dark beige head, stays. Aroma is sweet malt, slight honey, hops. Taste is mostly malt, hops, but also slight bitterness from alcohol. Medium sweet, medium bitterness. Medium carbonation and medium body. Well balanced. Drinkable, pretty good beer.", "Fresh out of a can. Pours hazy but shiny chestnut brown with a tight, creamy light tan head. Looks superb and I can't fault it. Treacle toffee sweeties are prominent on the nose with a floral touch of honey. Dry, grassy leaf builds a hefty bitter bite on the finish. Full, silky body with a light, crisp carbonation. There's a smooth and mature feel to this.  Looks aside, I was pretty underwhelmed with it to begin with but it rests and comes to life in the glass. It wins me over you big brown ale.", "Bottle@summer cottage, from Alko. Medium/strong nuances of caramel malts, a lot of hops, resin, some toffee. Medium taste spectrum and medium aftertaste with hoppy resin and malts. Averagely balanced. Medium body with medium carbonation. Overall, quite flavor packed and sturdy product that still keeps its freshness via the bitter vibe. 8 4 7 4 15", "Cloudy ruby-brown color with some particles, solid light brown head. Malty aromas, caramel and fermented dark fruits. At first, a direct hit of earthy bitterness, long and intense, that increases towards the end. Taste of roasted malt, ash, coffee and roasted nuts. Medium-high body, carbonation on point and an sticky resinous bitterness. The best unbalanced beer I've tasted.", "Exceptional beer. Unique palate with many flavors. Perfect alcohol content. Truly a great beer. \n\n---Rated via Beer Buddy for iPhone", "22 ounce bottle. Orange, copper pour. Large, dense frothy beige head. Toasted malt nose hints at toffee and baked bread. Bittersweet toasted malt flavor upfront. Sharp and bitter, with resiny notes throughout. Burnt sugar and bitter pine. Intensely robust, but delicious.long bitter finish and aftertaste.", "Kompot! Sweet caramel and fruit, strong malt character. Cloudy amber to brown color with medium to big sized beige head. Caramel and fruit taste with bitter finish. Medium body, lively carbonation, some warming effect. //can from Magic Beer Room", "Amertume d'une peau d'agrume (chinotto par exemple) et caramel fumé. Expérience intéressante. Robe marron sombre avec des reflets orange.", "Beer with copper color, medium bitterness, flat carbonized, good volume of foam, a good ale beer, (drunk a 30cl tap beer in \"Žlutá Pumpa\", Praha, CZ #699)(#4 US)(#3 California).", "Clear dark amber with an impressive lasting tan rocky head. Sweet smell, with mango and bubblegum in the nose. Solid mango aroma, extreme wood laquer hoppiness that overshadows almost anything beyond the mango. Floral, peach, elderberry, light citrus touches, did I mention wood laquer? Penetrating dominant heavy bitterness of black tea that's been brewed way too long, medium sweetness. Nice mouthfeel, long bitter finish. In essence, this tastes like a decent IPA that's been mindlessly overhopped.", "473ml Can. Pours a deep mahogany with lots of fluffy off white head. Rich malty nose with biscuits and subtle hints of toffee. Medium body with almost no carbonation. Strong malt flavours with a strong acidic hop palate. Similar to what I tasted in the Stone IPA but this has more body and flavour to mask it. After having two cans from the same brewery in this condition I have to assume it was the can itself.", "Аромат солодовый, карамельный. Пена слоновой кости плотная, пиво красного цвета, полупрозрачное. Во вкусе солодовый вкус хорошего Эля, карамельный солод на месте с терпкой хмелевой горчинкой, послевкусие с фруктовыми и хвойными нотками, не срочно но и не сухо, в целом хороший такой эль", "An amazing beer with the right amount of citrus hop notes with just enough of a sweet malt in the background. A very refreshing beer I could enjoy time and time again. A good favorite for sure. \n\n---Rated via Beer Buddy for iPhone", "Phenomenal beer. Dark and malty with a bouquet like an aboriginal's armpit.", "Pours dark shadowy amber with thick cream-colored, sticky foam. Nose is malt, dried plums. Taste has some alcohol masked with malt, bourbon and some citrus with a hint of burnt molasses.", "Original Review 7/6/10 when brewed by Stone - I haven't tried Stone's IPA yet, but imagine it would be similar to this...maybe a little lighter based on what their pale ale was like and their other brews that I tried. I liked the Ruination better, but was a few bucks more. Been meaning to sample this for a while, so finally glad that I did. I see this at certain bars and gastropubs from time to time so want to know what I'm getting into before I pay $5-6 a pint. Would and will drink again I'm sure, but wouldn't say it is one of my favorite IPA-ish type ales.", "Fra 0,5 boks på Mi2 Cardinal april-18: mahognyfarge med flott skum som varer. Saftig aroma og smak med mørk malt, svisker, rå skogbunn, mørk sjokolade, solvarme urter i hagen og noe appelsinaktig. Kunne tenkt meg litt mer sødme, synes den er på grensen til ubalanse.", "resin, floral, grass, spruce, citrus, herbs, sparkling, cloudy, amber, orange, red, brown, golden, frothy, minimal head, white foam, very bitter, medium bitterness, medium sourness, heavily sour, heavy cloying sweetness, medium sweetness, salty,", "Shared can at Mi2 at Cardinal 23.04.18. Translucent dark orange. Foamy and persistent off-white head. Fine, but slightly earthy, aroma of oranges, bitter marmalade, succade and malt. Taste of American hops and sweet and bitter marmalade. High bitterness.", "Not quite balanced. Too much bitter hops for the very slim body.  But exciting aroma, although a bit perfumed", "Kolor bursztynowy w kierunku czerwonego, bardzo obfita, brązowawa piana. W aromacie toffie, karmel, rodzynki, przejrzałe owoce. W smaku karmel, dojrzałe owoce, figi. Trochę zbyt zalegająca goryczka, nie przypada mi to do gustu. Generalnie piwo bardzo spoko.", "Reddish with of white head and slightly malty nose. Taste is rich in malts and hops. The devil is most likely the presence of bitter hops. Palate is rather long and Holding on to almost medicinal hops. Quite nice.", "Geruch \nhopfig, Zitrusnoten, Mandarine, leicht malzig. \nGeschmack \nhopfig, bitter, schöne Zitrusnoten, weicher Körper, im Abgang wieder hopfig herb, mit dezenter zitrusnote. Globus", "On tap at Fakin bar, Zagreb. Amber color with big brownish head. Bittersweet malt aroma with fruity notes and bitter aftertaste.", "Faktycznie dość ekstremalne piwo. Zapach alkoholowo-goryczkowy w stylu amerykańskim. W smaku dość podobnie, trochę alkoholowo, ale głównie baaardzo wyraźna żywiczna goryczka. Dość jednowymiarowe piwo, ale myślę że w dobrym sensie, po prostu moc goryczki. Na plus bardzo gęsta piana i ładna barwa oraz zabawne opakowanie. Warto spróbować.", "Tap @ Alles Elbe Hamburg.\nOrangebrun med højt skum.\nAroma af malt, koriander, kanel. \nKrydret og sød i munden. Fuld krop.", "Puszk z marketu w Seelow. Barwa ciemnego bursztyna o odcieniu czerwieni. Piana wysoka gęsta wolno opada, ładnie oblepia szkło. Aromat ziołowy, kwiatowy, trawiasty, nieco łodygowy a w tle karmele i syrop. W smaku trawiasta gorycz, karmelowa, nieco miodowa słodycz, finisz ziołowy wytrawny z odczuciem wysokiego IBU. Po niedługim czasie zaczyna męczyć. Piwo bezwzględnie goryczkowe dla fanów IBU.", "Mocny aromat ciemnych suszonych owoców, miodu, drożdży, biszkoptu. Smak lekko podpalany, spora goryczka grejpfrutowo-pestkowa, trochę kawy, belgijskie klimaty drożdżowe. Bardzo pijalne, ale goryczka zbyt przytłaczająca jak na mój gust. I am not worthy.", "Pours a ruby-copper with tan head. Grainy, hoppy nose. A bit of a harshness on the palate, but not in an unpleasant way. Vegetal, floral, and bitter as hell!", "Sweet malty aroma. Clear dark ruby body with an robust head which falls reluctantly. Heavy rich sweet malt with warming. Delicious and robust.", "V craft beer. Vona karamelovo kavova. Farba cerveno hneda. Chut kavova s horkastou koncovkou.", "Birra complicada, de color marrón turbio, buen cuerpo, aroma a caramelo y madera, gusto maltoso dulce y con una amargor bastante cañera y persistente, parece una Scoth Ale pero lupulizada, para nada esconde el alcohol. Mola esta vacile de birra.", "On Cask. I Know, why this is one of the most famous IPA... Very Very Hoppy, and Surely is not for the drinker of the commercial beer..I LIKE IT!!!", "7.2% hazy brown in colour with a good head, sweet malt aroma and a very bitter but nice taste.", "Miedziane, opalizujące, piana złamana biel, drobna i średnia, zdobi lekko szkło. Aromat wyraźna słodowość, karmel, owoce (rodzynki ale też truskawki) chmielowość leśna nieco żywiczna. Smak to słodowa podstawa i konkretna kontra goryczki już od pierwszego łyku, fakt długa, ale cóż... Jest owocowość, ciasteczkowość i chmielowa nalewka, przyjemnie wyklejająca. Nasycenie niżej średniej, gładkie i drobne.", "473 ml can bought at Q Club in SoHo, Central.\r\n\r\n\n\nLooks: Clear amber red colour; Explosive four finger head with long lasting crumpety beige foam; Excellent sticky lacing with very fizzy carbonation.\r\n\r\n\n\nAroma: Very fragrant Ale malt, with pineapple, citrus, tropical fruits, red fruits, strong caramel, strong toffee, toast, floral, molasses, spices, herbs, strong dry biscuits, yeast, lemon and grass.\r\n\r\n\n\nTaste: Medium sweet full Amber Ale malt, with strong burnt toffee, caramel, red fruits, floral, molasses, spices, pine, herbs, strong dry biscuits, strong lemon, strong bitter grassy hops.\r\n\r\n\n\nBody: Mid to full body; Dry, slick and oozy palate.\r\n\r\n\n\nMouth Feel: Very good Amber maltyness in a thick background, very dry and rich. Strong bitterness burnt toffee and toast dominates, surrounded by red fruits and caramel. Flowery with medium sweetness, piney herbal with lemon to round. Intensely good!\r\n\r\n\n\nHoppiness: Pineapple, citrus, tropical fruits, floral, spices, herbs, lemon and grass in nose. Floral, spices, pine, herbs, strong lemon and grass in taste; Bitterness - malt and hops - is very strong for a lasting, very high astringent bitter sweet burnt malty finish.\r\n\r\n\n\nAfter Taste: Very dry. Herbal oozy and very bitter to mouth.\r\n\r\n\n\nComments: This is a strong Amber Ale with no holds barred, where the aroma is rich biscuity malty and tropical hoppy, its taste is immensely burnt toasty character, adding the good piney lemony hops and its bitterness is probably second to none (with exceptions of Nine Dragons Fist of Fury). A strong beer for the strong minded. Recommended!", "Wygląd: Brawa ciemno miedziana, klarowna z bursztynowymi odcieniami. Piana od razu po nalaniu spora drobnopęcherzykowa beżowo - lekko żółta, po chwili opada do cienkiej warstewki, delikatnie olepiając szkło.\r\nAromat: Słabo intensywny, głównie słodowy - jasny karmel, trochę tostowy i chlebowy, min. toffie. Potem delikatnie rodzynki i cytrusy. Całość uzupełniona o akcenty chmielowe - ziołowo iglakowe.\r\nSmak: Na starcie spora podbudowa słodowa taka sama jak w aromacie. z niewielką ilością rodzynek i cytrusów. Z tylu ziołowy chmiel. Słodowość fajnie przechodzi do mocnej, długiej i zalegającej (ale przyjemnie) goryczki ziołowej. Finisz nisko wytrawny, goryczkowy, lekko alkoholowy. After gorzkawo ziołowy z słodkością słodową. Treściwość średnia z dosyć gładkim ciałem, wysycenie średnie. \r\nKlasyczne piwo, dosyć charakterystyczne, takie bieda BW mocno doprawione chmielem.", "Pours a dark ruby with nice head. Smell is hoppy and spicy. Hoppy and malty, balanced, upon the touch of my tounge. Afterwards I noticed flavors, and volitiles, of cloves and other spices I cannot name. Very interesting brew and not the first one I've had since it's easy to get in Myrtle Beach if you know where to look. Hits the spot if I'm in the mood for a punchy, aggressive beer that's hoppy but not an IPA or DIPA. Moral of this this all......\r\n\r\n\r\nIf you see it, buy it! You owe it to yourself", "resin, citrus, dough, caramel, nuts, toast, good beer, but very overrated and not really my favourite style.", "Bière arrogante, dont je me pose la question de savoir si cela vaut la peine de la coter ..\r\nQuand je vois ce style de texte (\"you are not worthy\", et ce n'est rien au regard de la notice arrière !!) sur une bête cannette à la face de rat, je suis prêt à m'en aller.\r\nBref .. une bière de 7,2 % abv, ce qui - pour les States - constitue une \"strong\" .. on croit rêver !!\r\nCe n'est en tout cas pas un moteur de Harley !!\r\nLa validité du bidule est tout juste de 10 mois !! (Là on est dans l'industriel ..).\r\nCouleur roux bordeaux foncé, à la clarté nette.\r\nBulles fines, partout.\r\nMousse beige, épaisse, crémeuse, stable à 3 mm.\r\nArômes de potiron, poire, malt cara.\r\n1ère bouche souple, à l'entame fruit/bois/résine/réglisse.\r\nArrière-bouche assez sur la réglisse.\r\n2ème bouche malt cara/épices.\r\nArrière-bouche à le densité inférieure à la 1ère (déjà).\r\n3ème avec fruits confits et muscade.\r\nArrière-bouche peu équilibrée, épicée.\r\nLongueur en baisse progressive et perte totale d'harmonie.\r\nJambes hyper collantes.\r\nLevure basique.\r\nAlcool qui ne fait pas son niveau, il ne travaille aucunement les saveurs.\r\nFinale très médicinale.\r\nCONCLUSION : avec des propos médisants envers ceux qui n'apprécieraient pas (éventuellement)\r\nce liquide coloré, on ne peut qu'être très en retrait !!\r\nAttitude strictement indigne .. et petite bière à la face de rat. (2/3/2/2/1)", "Ocena na podstawie wspomnień z degustacji, puszka 0,5 (Berlin) kupiona w hipermarkecie.", "aroma of a sac full of pennies whilst eating a caramel.\ntaste is caramels and malt; even less hoppy than the aroma.\nappearance is equal parts red, brown and gold; copper with the tint of a gulf of Mexico sunset. the mix of large and tiny bubbles resembles a cafe laté.\nthe palate is perhaps the most impressive part of this beer, besides the awesome marketing. somehow, the bitter hops emerge through the malt and deny any sweetness.\noverall, I can see how this would be mind-blowing in the year 1997 (think: Sierra Nevada,) but two decades later, many other offerings are more attractive on many levels.", "Hodně kontroverzně udělané pivo, které mě dosti překvapilo, i když to úplně není můj šálek kávy. Americké strong ale piva jsou mi dosti podobné silným hořkým ipám. Ale i tak oceňuji originalitu.", "(brun, nez hop, > sucre brun, fruit red/noir/sec, mad dry, > pineau, rétro fructosée, kill-∞-hoppy-ing me softly)", "Aroma - is big rich pine and crystal malt. It's bold.\r\nAppearance - is a dark amber with a big white head.\r\nTaste - rich pine and crystal malt.\r\nPalate - medium body, average texture, average carbonation, and a bitter finish.", "Puszka 0,5 l. Piwo uwarzone w Berlinie. Wypita 14.01.2018. Data ważności 26.11.2017. Mimo upływu ważności piwo nie traci na jakości. Barwa miedziana - rubinowa, zmętniona. Genialna, beżowa, gęsta i trwała piana. Tworzy niezły czop. Aromat dość intensywny, cytrusowy. Od razu czuć amerykański chmiel. W smaku karmelowe, słodkie. Alkohol jest wyczuwalny, ale nie dominuje. Wysycenie średnie.", "Berlin Brewed. A: Darkest shade of amber, medium sized tanned head, left lots of lacing. S: Dark chocolate and cocoa beans. T: Very bitter high quality dark chocolate, cherries, very long lingering bitter finish. M: Very smooth, almost creamy texture, low carbonation. O: A real wintery ale, very nice.", "2. Verkostung 2018: \r\n\r\nStone Arrogant Bastard gegen Stone Ruination Double IPA. Der Bastard kam bei der ersten Verkostung nicht gut weg. Kastanienfarben und blank mit einer großen Krone aus beigem Schaum. In der Nase dunkles Malz und bitterer Hopfen. Diesmal ist das DIPA wärmer, das macht es etwas erträglicher. Der Körper ist voluminös, die Kohlensäure gering. Der Geschmack ist stark herb vom Hopfen mit Verstärkung der bitteren Noten des Malzes. Das war es aber auch schon. Extrem herb vom Hopfen ohne besonderes Hopfenaroma und bitter vom dunklen Malz. Meine 40% Bewertung in Prosa heißt “trinkbar aber nicht gut” und das passt hier wie die sprichwörtliche Faust aufs Auge. Da ist das Ruination DIPA einen Tick besser.\r\n40%\r\n\r\n1. Verkostung 2017:\r\n\r\nAuf dem Etikett ist doch alles gesagt: \r\nwir sind arrogant und unser Bier schmeckt Scheiße! \r\nDem kann ich nur zustimmen. Ich glaube bei unserem Tasting hat keiner sein Glas ausgetrunken, ganz im Gegensatz zum Chouffe Houblon. Das ist auch ein IPA, das hat noch mehr Alkohol und das kann im Gegensatz zum Stone Braukunst aufweisen. \r\nWenn ich mir noch eine Dose runterquäle folgt eine detaillierte Beschreibung.\r\n40%", "Aroma of hops, fruits, dark caramel. Dark amber color with brown head. Dark caramel, malt, dry finish, bitter. Medium body, medium carbonation.", "500ml can from RusBeerShop in Moscow, Berlin-brewed version. Pours clear copper with a medium-sized beige head. Aroma is grapefruit, toffee, hops. Taste is caramel malt, citrus, heavy bitter, warming alcohol.", "Bruin oranje bier, medium, aroma is malt, citrus, grapefruit, Taste is the same, dry bitter taste and aftertaste, not bad", "Poured a clear copper with a thick tan head. Tastes like grapefruit with some caramel. Lots of hops. Ok beer.", "Can from Berlin. Pours orange copper color with a transient beige head and a hoppy, fruity aroma.", "-bERLIN-BREWED vERSION\r\nL:\r\n-pours a cloudy copper-brown with a big,frothy,sand-coloured head\r\n-medium to high carbonation visible\r\nS:\r\n-raisins,syrupy,piney,grassy,plums\r\nT:\r\n-pine,resin,plums,cherries,nutty\r\n-high bitterniss for the style\r\nF:\r\n-medium,smooth carbonation\r\n-medium body\r\nO:\r\nAfter all those years Arrogant Bastard still delivers as a great Beer.", "Rubinowa barwa z trwałą, ładną pianą. Aromat biedny, trochę kawy i żywicy. Na pierwszym planie konkretna goryczka, kawa, trochę karmelu. Na dłuższą metę dla mnie mdłe. Alko dobrze ukryte. Ok, nic więcej.", "Pours a clear deep mahogany with a full beige head. Nose is sweet malt and hops.Taste is sweet malt, toffee with a bitter aftertaste that lingers. 16 oz can Canned: 11/8/17 Fresh. BBY: 3/18/17", "0.5l can. Hazy ruby body with a huge, thick and lasting dark beige head. Looks great for sure. The aroma is mostly about dried fruits like dates and raisins with just a bit of citruses and pine and some nutmeg to give it a spicy twist. The taste on the other hand is all about hops. Loads of pine and some grapeseed in the taste without the dried fruits present in the aroma. Only a bit of toast here to represent the malts. Could be way better with a bit of caramel or dried fruits in the taste, but I still find this nice. Its price is also very nice (it was brewed in Berlin and I bought it in Budapest).", "It's a strong ale, for sure. Too much hop flavor for my tastes, there's no hint of malty undertone, just hops. It looks great, with the color and head, but i wish it was balanced better.", "Uzupełnienie profilu notatki.\r\nPiana obfita zdobi szkło, utrzymuje się. Kolor zmętniony bursztyn wpadający w czerwień. Aromat ubogi, delikatnie las, iglaki. Smak pełnia, karmel, ALE-owa delikatna owocowośc, chmielenie w żywiczny-cytrusowy charakter. Wyraźna dość wysoka, lekko zalegająca goryczka, alkohol ukryty. Piwo dobre, solidne, pije sie przyjemnie, choć jak na styl za mało american i za mało strong. Na pewno bez zachwytów i top50 w ratebeer mnie dziwi bo są lepsze piwa w stylu bez tego tytułu.", "Pre-RateBeer review, so no tasting notes. 4/5 note jotted in my 1001 Beers guide. Will return to this beer when I get the chance. Had on draught as a guest beer in a BrewDog bar.", "Pours a deep, dark ruby red coloration with a large, creamy head. Smells faintly of biscuity, caramel malt, toffee and red berries, with a hint of citrus and pine. Taste follows the nose, with a firm, slightly sweet and caramelly malt presence backed up by bitter, resinous, hops and notes of pine, toffee, red berries: redcurrant, strawberry and citrus: grapefruit, lime peel, as well as just a hint of chocolate. Finishes with a strong bitterness and some red berries and pine lingering in the aftertaste. Full mouthfeel with a medium/rich body and medium carbonation This is an expertly crafted and balanced Amber Ale that has great complexity to it without sacrificing drinkability. The balance between sweet malts and quite bitter, resinous hops is exceptional here, with some nice layers of citrus and red berries, as well as slight toffee and chocolate notes inbetween. Arrogant Bastard will forever be my go-to beer, as long as I can get it fresh anyway. While some might say that this ages nicely, it really needs that resinous bitterness to work in my opinion, which really starts to fade out after about 10+ weeks.", "Probably the most unpleasant beer I've ever tried. And you lose points for being cocks. Perhaps there's a good beer in there somewhere, but then they added drain cleaner. There is no need for this level of astringency. If Trump made beer, it would have this level of self confidence and total lack of taste and drinkability.", "Arogancko puszczone w żywioł słodu i chmielu, w tonacji gorzkiego karmelu, mogłoby być zdyskwalifikowane za niezrównoważenie gdyby nie piarowy elaborat na etykiecie i legenda awangardy craftowej. Do przyjęcia, pozycja obowiązkowa z powodów historycznych.", "Brown colored beer with a hudge white head.  Taste is bitter and malty. Long bitter afthertaste.", "0,5l can from Pivný raj bottleshop, Bratislava, Pours deep murky red to brown liquid, big frothy tan head, Aroma: bittersweet, full and complexe, citrus, grapefruit, pine, malty, caramel, red fruits, candied, fruits, zesty, Taste: medium to heavy sweet, heavy bitter, light to medium sour, grapefruit, citrus, zesty, malty, very hopy, caramel, red candied fruits, slightly warming alcohol, Palate: medium heavy to heavy body, soft carbonation, creamy to thick mouthfeel, long almost harsh, bitter finish, Overall: very good, enjoyed, thought would not be able to drink a second one, too much bitter. Domininant is the overwhelming citrus bitterness complimented with rich malty, caramel and candied notes.", "Vom Fass (Brewed at Berlin/D) Stone Brewing Berlin 2016-06 getrunken. Ich habe hier ein aggressives Bier vor mir. Es hat mir nicht geschmeckt. Abgesehen davon ist es ziemlich fraglich, dass ich genug Geschmack oder Erfahrung besitze, ein Bier mit dieser Qualität und Intensität richtig genießen zu können. Stone riet mir also, in gewohnten Gefilden zu bleiben... - Gute Idee der Werbabteilung von Stone also lasse ich diese dunkle Hopfen-Bitterbombe hinter mir und freue mich über ein schönes anderes Bier...", "24-09-17 // 500ml can at Stone Brewing Tap-Takeover at Naiv in Frankfurt. Shared with Greg Koch himself!! Hazy Brown beer, solid head. Sweetisch nose. Taste of roasted malts, heavy sweetness, with an aggressive bitterness with Grapefruit touches.", "Bottle at home. Pours red brown amber with a frothy beige head. Aroma is heavy roasted malt, sweet malts, caramel, grapefruit, moderately hoppy. Taste is heavy sweet malts, then big bitterness, juicy hops, light grapefruit. Medium to full body, soft carbpnation. Long dry, bitter finish. It's a beer that's big on flavour, but it's not for me.", "0,3 litre draft at Seb's Hotel, Hamar. Cloudy Brown with medium offwhite head. Not Too bad.", "Pours a reddish brown color. One finger beige head. Okay retention, great lacing.\n\nAroma is malty, very malty. Caramel. Very hoppy.\n\nTaste is quite strong. Quite bitter. It's also sweet.\n\nMouthfeel is full bodied. It's heavy, thick. It's a sipper, no chugging this one. Smooth.\n\nOverall, this is very good. I would buy it again, and I would recommend it.", "From Mar 2007\r\n\r\nPours from 22oz bottle(room temp) a clear deep amber with a huge head of foam that just won't quit. Solid layer with lots of lacing.\r\n\r\nThe smell is very hoppy. I note grapefruit in big abundance.\r\n\r\nThe taste on first sip is hugely hoppy. Lots of citrus that makes your mouth want to pucker but just before it does, the malt moves in and somewhat tames the hops. No, more than that. The malt actually takes over the flavour and I'm not talking really sweet caramel malt...wait...yes I am. Wow. You fooled me. ;^) Boy, is this a treat.\r\n\r\nFurther sips in and I'm getting more of the balanced flavours but mind you, while the hops and malt seem to be working in unison, I cannot deny that the said flavours are as big and bold as the great outdoors. Like the label says, this is an aggressive beer and it refuses to let you just sit there and reach a comfort zone; when you're sipping on it, it takes center stage and all others things going on around you become mere side shows. What an egotistical brew and...I'm loving it!\r\n\r\nBottom line: A fantastic brew that will earn your attention whether you wish to or not. Highly recommended!", "From the tap at FOB, Rimini, Italy. Pours a beautiful red with nice reflections. Aroma is toasted, caramel. Body is average, with limited carbonation. Taste is toasted at first, then quite some bitterness kicks in, an old school one. Finish seems not that long initially, but bitterness comes up when you least expect it and lasts very long.", "one of my favorites; reddish-brown color; malty, piney aroma; really well balanced; bready malt and piney hops; assertive and full of flavor and arrogance", "Cor âmbar com tonalidade rubi, translúcida e com leve brilho; espuma bege com médias formação e persistência e bom lacing.\r\nAroma intenso de lúpulos resinosos com caramelo e cítrico de toranja em segundo plano e ainda um toque de álcool.\r\nSabor já de início com bastante amargor resinoso e leve caramelo, com meio fugaz de dulçor de frutas amarelas e final de amargor resinoso \"arrogante\"acompanhado em segundo plano de madeira e álcool; retrogosto intenso e persistente de amargor adstringente com um toque de álcool.\r\nCorpo médio e baixa carbonatação.", "W aromacie na początku dzieje się niewiele lecz po lekkim ogrzaniu piwa aż nadto wyraźnie aktywują się gotowane warzywka.\r\nW smaku przyjemny balans słodu i goryczki chociaż bez charakterystycznych punktów odniesienia (lub zaczepienia).\r\nNienajgorsze piwo.\r\nA może piwo dobre tylko\r\nI'm not worthy?", "From tap at Stone Brewing World Bistro & Gardens, Berlin. Nearly clear, dark copper color with a beige head. The aroma is lightly hoppy (orange, pine) along with some honey, some bready malt and hints of yeast in the back. Medium body with a light sweetness and a medium bitterness. The flavor is light to medium malty (biscuit, caramel, honey) followed by lots of bitter hops and some woody notes.\r\n\r\n\n\nAroma: 7 \nAppearance: 4 \nTaste: 7 \nPalate: 4 \nOverall: 13", "Wersja z Berlina. Ciemnobursztynowo-rubinowa barwa, zamglone, piana kremowa, średnio obfita, drobne i średnie pęcherzyki, zostawia ładny lacing.\r\nW aromacie rodzynki, truskawki, nektar, lekki miód, lekki karmel, lekkie owoce tropikalne, żywica, nieco cytrusów.\r\nW smaku chmielowe - świeży chmiel, nieco łodygi, trochę melona i grejpfruta i rodzynkowe, dużo rodzynek. Nieco porzeczki. Poza tym słodki nektar, karmel. W posmaku chmielowe, łodygowe, słodkawe. Goryczka dość mocna, tytoniowa, lekko zalega. Wysycenie średnie.", "Pint can poured in Glass. An excellent American Strong Ale. (I admit I haven't tried many American Strong Ale's) Pours a dark Amber/medium brown. Fluffy head that dies down after a few minutes with a little lacing. The aroma was the only thing underwhelming about the beer. the taste is very robust. Caramel, mild citrus, malty, slightly sweet, and finishes just a little bitter. Best part is the message on the back. If you don't like this beer --keep it to yourself. Classic.", "„Arrogant Bastard Ale\", Dose (50 cl) aus einem Supermarkt in Berlin. - Laut Dose „gebraut in Deutschland von Stone Brewing Berlin“ - und trotzdem von RAB unter der kalifornischen Mutterbrauerei geführt? - Dunkelgoldbraun, schwach trüb, rasch zerfallender Schaum. - In der Nase tiefe, warme aber gar nicht allzu intensive IPA-Aromen: Mango, Orangenschale, Nadelwald, Harz. - Im Antrunk intensive Grapefruit-Hopfenherbe mit wuchtiger harziger Bittere. Fülliger karamelmalzig-nussiger Körper. Milder rezent, vollmundig. Im Abgang - natürlich - noch mehr hammerharte harzige, leicht holzige Bittere. - Noch ein gutes Stück stärker  als die meisten IPAs aber keineswegs besser, auch nicht sonderlich komplex. Ein großmäuliges Bier, das alle Stereotypen auf die Spitze treibt; genau das Richtige für verhaltensunsichere Craft-Bier-Adepten ...", "Dark amber/cider color; Medium body; Aroma of caramel malt, spicy hops, & some citrus; Flavor of slight sweet malt, caramel/toffee, spicy hops, and citrus; Finish is slightly bitter; Nicely balanced; Overall, a classic - very good.", "(Keg) This is another classic from the Stone Brewing enterprise. Pours a clear dark amber beer, with ultra-fine carbonation, and a creamy beige head. Rich aroma of rum and raisins, fig and plum pudding, vanilla, smooth bourbon whisky, warm winter spices, and vanilla. A subtle pine and mineral finish. Smooth, light, delicious. \r\n\r\nThough the taste is slightly underwhelming, the aroma is simply mind-blowing.", "50cl can brewed in Berlin. Smooth malty and moderate sweetish beginning. Fruity bitterness with herbal hints. Intense bittered, but round and refreshing in total. Long fruity malty bitter aftertaste, caramel, toffee, intense bittered. Great!", "500ml can from Beer Hawk. Pours dense, ruby with a ark, ample head. It’s thick and syrupy with a mild aroma of figs. The taste is fierce and malty, dry and bitter with pine and plum. Reminded me of Old Peculiar. The more you drink, the better it tastes.", "Barwa miedziana, piwo klarowne, piana beżowa, uboga. \r\nAromat średnio-intensywny, karmel, niuanse suszonych owoców i tytoniowo -ziemisty chmiel. \r\nW smaku pełne, karmel, melasa, cukier trzcinowy i średniej wysokości tytoniowa lekko cierpka goryczka.", "Tap @ Beertemple, Amsterdam IX 2017. Goeie schuimer waarbij het fijn aan het glas blijft plakken en met een verleidelijke ambere kleur. Fijne niet heel sterke geur. Volle zoete smaak. Bloemig met honing. Met een wauw effect. Is dit ook een Ale? En strong voor 7,2??? Dat noem ik nog vrij bescheiden. :-) Het heeft dus een beetje zoete smaak met onder karamel? Gewoon een fantastisch hoppig biertje met een diepe rijke smaak zonder al te zoet te worden. Dat ik hem vaker drink is nu gewoon een feit!!!", "Cerveza muy muy amarga pero también muy bien equilibrada por sus maltas,con cuerpo, buena espuma.", "Great beer if you like the dark frothy full of flavor type beers!! Very smooth and tasty!\n\n---Rated via Beer Buddy for iPhone", "I have to give this one an overall best for their presentation, I was laughing throughout drinking this beer. \"It's funny, because it's true.\"", "Started to read the description and had to try after the first sentence. The worst part of this beer is.... finding others like it!  I cannot wait for them to expand their line of beers.", "Barwa miedziana, przejrzysta, piana średniopęcherzykowa, bardzo trwała. W aromacie słodowo, karmelowo, trochę wiśni a w tle amerykański chmiel. W smaku mocno goryczkowe, zalegające, ale w przyjemny sposób. Wyczuwalny karmel, wiśnia, amerykański chmiel, toffi oraz nuty chlebowe. Pełnia średnia, alkohol niewyczuwalny. Wysycenie na średnim poziomie.", "0.5L can. Dark amber color, fluffy fat beige foam on top, stays. Moldy, raisin, stale wood aroma. Mmm. Rye, bread, caramel taste. Nice bitter finish. Lovely bitter mouthfeel. Good beer.", "Murky dark amber, huge off-white head, good persistence and lacing. Aroma shows caramel malts, slight dark bread and resinous hoppiness. It's fairly intense and fresh but quite monotonous. Taste has medium sweetness, medium to high bitterness and persistent resinous bitterness in the aftertaste. Notes are of caramel, resinous/piney hops, slightest earthiness and spiciness. Medium body with average carbonation, drinks quite easily. Decently enjoyable and very much unimpressive. The only thing arrogant about this is pretentious labeling.", "Hazy mahogany color, beige head. Malty nose, bread, caramel, brown sugar, fruity notes, hint of yeast. Sweet taste, caramel, rich malty, grapefruit, resin, bitter finish, well balanced. Definitely not my favorite style, but this one really did it. Medium to full body, soft carbonation, smooth texture. \n\r\n7, 4, 9, 5, 17", "I found this can, in one Coop, supermarket in Prilly. I drank it on Monday, relax, at home with my wife. Personnaly, it is not my favourite one of this brewery. Of course, it is drinkable and strong like the Evil, a beer to become drunk like the drunk men that you could see at the Riponne, in Lausanne with the difference that this beer is better than the 88. The body is brown/red/copper, regular carbonation for the style, thin and white foam. The taste has a really strong presence of alcool, you feel that coming through your body like the Russian vodka, malty, sweet, some hop but the malt is dominating and the alcool gives this note of sweetness, not bad, perfect before to sleep.", "500 ml can (Berlin),bb 03/02/2018.\r\nReddish/brown,clear. Light beige head,medium lacing.\r\nCaramel,herbal aroma.\r\nTaste - bittersweet (bitter mostly),caramel,bitter finish. Flat,one dimensional,just bitter,nothing more. Meh.", "500 ml Berlin can. Pours with reddish-brown color and a medium off-white head.Nose of earthy hops, roasted malts, some yeast and some toffee. Very strong, bitter taste, slightly licorice sweet, resinous. Strong bitter finish.", "Bottle, present from US brought to Uk by Jo. Backlog entry. Entering my historic scores for US beers whilst visiting New York. No tasting notes kept, just rating.", "Can (Berlin)! Medium amber opaque brown with a medium tan foam subsiding slow. Scent is dense notes of barleywine. Cherrywood. Taste is light, frothy, lightly citric barleywine, I think. Possibly properties of rye. Finish is dry and light. Tiny bit of apple, hinting at imperfection. Great.", "F: huge, tan/tanned, good retention.\r\nC: dark to dark coppery against the light, hazy.\r\nA: a lot of caramel malt, fruity, grapefruit, biscuits.\r\nT: big malty backbone, biscuits, citrus, fruity, caramel, long lasting bitterness on the palate, bit herbal/floral, bit warming alcohol, full body, low to medium carbonation, very good, really enjoyed, 50cl can as “Stone (Berlin) Arrogant Bastard Ale” from Bierwinkel De Hopduvel in Gent.", "Birra davvero aggressiva, non posso dire che mi sia piaciuta davvero. � una strong Ale rossastra con Aroma stranamente puzzoso, al palato amaro davvero strong e impegnativo.", "Si eres novato en el mundo artesanal, mejor trata con otra cerveza menos agresiva y mas balanceada", "12oz bottle. Pours mahogany brown with a thick beige head. Aroma is pine, toffee, and lots of malt. Taste is very hoppy (pine and earth) matched with lots of malt (toffee, toast, caramel, hints of dough, etc.) with some fruits and a touch of metal as well. Light-medium body. Moderate carbonation. Creamy mouthfeel.", "From 473ml can. Poured with rich, inch high head with great retention. Aroma was of metallic berries, not good. Aroma is more caramel malt as it warms. Taste is of malt with a little sweetness, then strong bitterness in the back end. Not that impressed", "500 ml can as Stone Berlin. Served in tulip. Pours blood red, with big fluffy and firm head. Fantastic look. Bitter grapefruit aroma and some other tropical fruits, elderflower, some dark cherry, some metallic and earthy notes. Heavy hoppy bitterness. Alcohol perfectly hidden. Soft carbonated, full body. Bitter finish. Palatable. Long lasting aftertaste. This beer has character.", "De Arrogant Brewing(U. S. A.) la famosa Arrogant Bastard Ale una American Strong Ale que inicio siendo fabricada por Stone Brewing(U. S. A.) como cerveza de aniversario pero se populariz� tanto que decidieron crear una submarca que la elaborara todo el a�o y en diferentes variantes como las que est�n a�ejadas en barricas de roble, barricas en donde se a�ejo bourbon previamente, version doble, de centeno, etc. Esta es la cl�sica con 7.2% ABV y 100 IBU’s, cabe mencionar que el estilo no es muy reproducido ya que es muy similar a un American Barley Wine, prob�mosla.\r\nEn apariencia nos encontramos con una corona de espuma mediana de burbujas compactas a medias, la retenci�n no es mala, posee una tonalidad marr�n con destellos rojizos, es turbia y de cuerpo pleno.\r\nEn aromas es de intensidad media con notas de lupulos a toronja, cascara de naranja, pin�cea y resinosa, hay olores de malta similares a tofee, az�car candy, pan tostado, nuez, muy compleja y dif�cil de descifrar.\r\nEn paladar la primera impresi�n es un fuerte amargor con sabores c�tricos como toronja, naranja y pi�a seguido de un buen golpe de malta que otorga car�cter a pan tostado, caramelo, tofee, az�car morena, ligeramente frutos secos, el final es seco y resinoso, la amargura se queda de forma residual y hay un cierto toque jabonoso que si llega a desagradar, una cerveza fuerte algo desbalanceada, no es para todos los paladares, aunque tiene muchos seguidores por lo que representa ya que es un icono en el �mbito de las cervezas extremas y el bum por el amargor, un obligado para los amantes del l�pulo y es mas por ello que la receta ya no se a modificado pudiendo mejorarla aun mas conociendo la calidad de Stone.", "Espesa más no lo suficiente. Aroma poco fuerte. Es mejor el sabor que el olor. \nUna verdadera cerveza artesanal. Mucha espuma. Fuerte sensación de malta. El punto justo de amargura. Muy recomendable. \n\n---Rated via Beer Buddy for iPhone", "A deep ruby beer with a small white head. Aroma is hoppy, piney and malty. Tate is very bitter, resinous and piney, caramel malt. Great beer", "I haven’t had this in a few moons had to rate after reading blueruin’s rate below. With BJCP style guidelines, this was not as impressive as previously remembered, but nevertheless it has been a huge gateway ale for the Americans over many years. No esters but raisins aroma with bitter musk. Appearance is spot on, medium tan head. Taste is low malt, licorice, even as warmed. A high bitter hop but a good bittersweet crisp finish. Mouthfeel was spot on and the overall impression was an ale that was unbalanced and uncomplimentary in the hops and malts, an arrogant bastard.", "EU version. Can. Musty aroma, murky unpleasant tang like an old pub or wet carpet. This is like a beefed up version of an English brown ale, and for me it just doesn’t work. The US version must be better than this, or there is some bizarre hype going on - this is just one-note clumsy bitterness.", "Can in paradise bay, Malta, from Stone Berlin brewery, nice design. Brown color, clear, thick creamy light tan head. Hoppy upfront, light toasted malts and loads of bittering hops with some charcoal earthy/rocky tones. Medium to full body, very long desert-dry finish, intensely bitter yet fairly easy to drink. Lacks of fruity overtones, really straight and bastard indeed.", "Caoba nebulosa. Estupenda espuma beige cremosa, duradera. Gran aspecto. Aroma tostado ligeramente lácteo. Excelente en boca, muy bien de gas, de cuerpo moderado, y un rico sabor acaramelado, con presencia de licor, frutos secos, café... y un final muy seco y amargo. Te quedas saboreando largo rato el final que deja en boca. Muy buena.", "Barwa miedziana, piana jasnobrazowa, wysoka, z duzymi pecherzykami. W aromacie duzo slodowosci, nieco chmielowych zapachów - grejpfrut, mango. Dosc wysoka goryczka, przyjemna i dlugo pozostajaca ale nie meczaca. Dobry balans miedzy slodowoscia a chmielowoscia. Jest nieco agresywnie, ale bez przesady.", "Dark amber, very large and lasting head, nice lasing. Good news end with the aroma which is just empty - some malts, maybe oak. Taste is completely dominated by aggressive, long lasting bitterness. Nothing else is happening here, some malt notes. Watery texture, soft carbonation.Berlin version, maybe the US is better?", "First had in California as a young lad but it’s remained a staple through my adult life", "0.5l can. Dark Brown color with medium white head. Aroma: red berries, pine, citrus, caramel. Taste: red berries, warming touch od alcohol, high hoppy bitterness. Full body, moderate carbonation.", "Pours amber, copper & mostly translucent with a nice four-finger light tan head with an aroma of malt. Tastes of sweet malt & caramel upfront with a scotch/whiskey body and a mild hop finish. Tastes similar to a scotch ale with a hint of hop bitterness. It’s well balanced with sweet malt & hops.", "Bordowa barwa. Ladna grubsza piana. W zapachu grejfrutowe i wyraznie slodowe. W skamku wyrazna przyjemna goryczka przez dluzszy czas pozostajaca na podniebieniu. Piwo naprawde warte polecenia!", "Stylistically I don't really know how to classify this beer, but I know I like it! Bitter but malty, boozy but still pleasant to drink: this is a beer I don't see myself getting tired of.", "You are not worth it, truth be told no one is. It is quite strong, maybe just a bit bitter. But be aware that you should have just a little bit, after more than one there is high risk of having a bad next day.", "Taste: rich, smooth, malty, roasted flavors balance well with just the right amount of hops for this style. Mildly spice malt nose. Deep mahogany/copper hue, mostly clear, with a tan head and some lace. Medium/full body. Very drinkable.", "Can. Dark amber colot. Aroma: good malt, nectar, dried fruits, raisins, citrus and fruit. Taste: sweet and bitter, dried fruits, plum wine, pleasant hop bitterness, raisins.", "Flasche in den USA und jetzt auch 0,5l Dose aus Berlin. Braun kastanienfarbenes klares Bier, schöne Kohlensäurebläschen an der Glaswand. Brauner hoher Schaum. Toffe, Malz, Karamel und Hopfen in der Nase. Dazu etwas reifer Käse. Der Antrunk ist ein Schlag ins Gesicht. Wuchtig bittere Kräuter. Viel Hopfen. Hat was von Fernet Branka. Dazu Malz und verbranntes Karamell. Langes extrem bitteres Finish. Eisenkraut. Dieses Bier war eines meiner ersten Craftbiere, dass ich 1998 in den USA getrunken habe. Es ist bis heute eines meiner Lieblinge. Es mag bessere geben, aber den ersten Craftbeer Geschmack vergesse ich nie! Toll, dass es das jetzt auch frisch aus Deutschland gibt. Go Stone!", "Caramel and pines in aroma - nice! Red-ish colour, nice head (a bit too big while pouring). Intense caramel taste, malty. Excellent IPA, must-taste!", "Aromas of caramel, lots of it. Pours a hazy dark brown with pillowy head. Taste of toast and caramel and dough. Really great.", "Review based on the BJCP2015 guidelines (style 22B). Can 50 cl - Batch 170418DE0103 (BBF 13.JAN2018). AROMA: médium malt aroma with notes of caramel, maillard (bread crust) and slight nutty. Background of smooth alcohol with a vinous aspecto. APPEARANCE: âmbar color and clear. large light Brown head with good retention. leg formation. TASTE: medium-high malt flavor with notes of caramel, toasty, bread crust and a faint resin hop note. médium-high bitterness with a dry and bitter finish that endures. PALATE: médium body with médium carbonation. OVERALL: and american strong ale without much hop presence.", "hay, grass, barnyard, licorice, woody, amber, hazy, sparkling, rocky head, white foam, very bitter, medium body, slick feel, sticky, lively, astringent, bitter, long finish,", "Phenomenal really. There is berry, there is Hops, there is caramel malts, and when they all blend together it just works. Really like it. Good beer.", "I discovered this gem about a dozen years ago, in a restaurant in Oakland. To be honest, I ordered it because the name intrigued me. What I soon realized, however, was that it was a great beer. I went out the next day in search for some to bring home. While it’s not my everyday drinker, I always keep it on hand for those occasions when I want something special.", "tap @ random beerweekend (budapest) amber-brown colour, medium body, low carbonated, caramel, malty, bread, biscuit, fruity, dry aftertaste", "Excellent IPA! It is soft and slick but still hardcore enough to satisfy the rough drinkers! I went in unexpecting, but this is truely a nice surprise. High score.", "Wow. en fantastisk øl. God fyldig smag. Tilpas med bitterhed og sødme. Lidt kedeligt udseende", "I have had this several times, have no idea why I haven’t rated it. Clear amber to copper, medium tan head. Caramelly and bready malt, loads of piney and citric hops. Medium to full bodied, medium carbonation. Dry, high bitterness.", "Can from Beer52.Deep amber-chestnut with a big beige head. Big flavours of port and fruit - plum and orange maybe - followed by hefty pine hops & some grapefruit too. Sweet up front but a big bitterness balances it. Overall it’s a big beer (possibly even punching above it’s not inconsiderable strength), but a balanced beer - and a very tasty one at that. Nice one.", "Can. Pours clear rubyt with medium foamy reddish head. Aroma is fruity with loads of caramel, biscuits, spices, touch of licuorice, cherry. Taste: solid malty background, light sweet, moderate to heavy bitter, caramel and biscuity mouthfeel. Heavy body, soft carbonation, lively texture, heavy bitter finish. Superb smooth nose, super aggressive mouthfee, love it!", "0,5 l Dose. Rotes, leicht trübes Bier, stabiler, cremefarbener Schaum, perfekte Gardine. Riecht nach roten Beeren. Schmeckt leicht nach Röstaroma, rote Früchte, leicht malzig süß, lang anhaltend bitter, schön cremig, vollmundig.", "Tuima, maukas, potkua löytyy ja kitkeryyttä. Rauhassa kun maistelee, niin maku avautuu ja pyöristyy.", "50 cl. can @ Home. \r\nAroma: not very intense aromas of toasted malts, caramel, malts, bread crust, biscuits. Only very subtle hops’ overtones. Hints of alcohol.\r\nAppearance: deep amber to brown color with high head thickness. Very creamy foam. Beige head made of mid to big sized bubbles. Low to medium hazyness. Very high retention. Medium Brussels’ lacing.\r\nTaste: medium sweetness, medium bitterness, no sourness. Flavors of toasted malts, caramel, bread crust, biscuits. Burnt caramel and roasted malts overtones. Balance is towards the sweetness. No much perceived bitternessat first. Sweet at first and more bitter towards the end. Alcohol level is noticeable in the flavor. \r\nPalate: medium body, oily to creamy texture, low to medium carbonation, very long bittersweet (more bitter than sweet and increasingly bitter) finish with flavors of toasted malts, caramel, hints of burnt caramel and roasted malts. The bitterness is slightly astringent.\r\nOverall: very good color and appearance. Not very intense but good toasted malts and caramel aromas. Good flavors too. Not much noticeable hops in aroma or flavor. A very good beer. Pretty pleasant and drinkable. Very complex mix of flavors. Intriguing.", "Une bière brune, aux reflets rubis, avec une grosse carbonatation et une bonne effervescence. Au nez, caramel, toffee, réglisse noire, et un espèce de côté de grain fumé bizarre que j’ai jamais senti auparavant dans une bière. En bouche, on remarque tout de suite une absence totale d’effervescence, mes yeux me jouent des tours. C’est fort malté! Le gout de toffee est fort present, le côté caramélisé de l’alcool également. Il y a également une petite amertume... ca me fait somme toute penser à un barleywine à l’américaine... avec peut-être un peu moins de corps. L’amertume se fait certainement autant présente qu’un petit côté fumé qui ne démord pas. Pas mon style préféré, mais définitivement une bière complexe qui mérite d’être essayé au moins une fois.", "Can. Pours dark amber with lovely fluffy light brown head. Aroma is caramel, alcohol, candy, somewhat metallic. Taste is sweet with caramel, alcohol, somewhat spicey.", "beautiful appearance of clear dark amber to mahogany colour, extremely huge, dense beige-ish head, which lasts for several minutes; aroma of dried fruity and resiny notes, some toasted bread and biscuits; taste of intensive hoppy bitterness, malty-syrupy sweetness, some dried fruits and orange zest; great beer but still, will not be my favourite...anyway, its appearance is really one of the best I’ve ever seen so far!", "I don't know much about beer rating but this is a great beer if your a beer person. Definitely will drink again \n\n---Rated via Beer Buddy for iPhone", "LCI. Uit de fles geschonken. Heerlijke strong ale: bitter, moutig, caramel, hops. Mooie zacht bittere afdronk. Heerlijk", "Chocolade bruine kleur met een goede kraag. Ruikt fruitig, moutig, citrus. Smaakt fruitig, zoetig, suiker. Veel koolzuur.", "50cl-blik van bij Dranken de Caigny te Essen. U: Donkerkoperkleurig met een licht beige schuimkraag. G: Hoppig, karamel en bessen. S: Karamelzoet met een stevige hopbitterheid. M: Volmondig met medium carbonatie.", "Dark garnet beer with a short beige head. Roasted aromas, red fruits, caramel-licorice, bitter of hop. The taste is actually intense, very roasted and dry, with a strong hoppy presence, earthy and citrus-pine. Note of coffee, grounds, wood, dry fruits and herbs. A good industrial beer in spite of the arrogance which we try to rig out.", "Bruin, roodbruin bier met crèmekleurige schuimkraag. Geur: hoppig, C-hop. Smaak: bitter, hopbitter, groene hop, wat harsachtig, reete strak + nog wat toffee! Lekker! Medium volmondig. Zachte koolzuurprikkel. Afdronk: lang, bitter.", "16floz can ($2, COD: 08.04.2016, BBD: 12.02.2016) poured into an imperial nonic glass. It looks great, a reddish-brown with a creamy head, and some sediment that settles to the bottom. Caramel, fig, and currants compose the aroma profile. Full body and hoppy, strong rustic flavoring of well toasted bread and sharp cheddar. Perhaps my tastes have changed, since the abundance of hoppy beers mean that those were on vanguard don’t stick out as much and there is a now more of a desire to have maltier beers to juxtapose hop beer overload. Regardless it is still good, even when past its BBD. Allso, I could go into a meandering rant about Arrogant Brewing and Stone Brewing, but I’ll save it.", "Stærk sprittet. Stor sødme der desværre ikke smager så meget at andet end lys malt.", "Kolor ciemnoczerowny, piana obfita, grubooczkowa, trwała. W aromacie karmel, żywica, lekkie owocei alkohol. W smaku więcej karmelu, ciemne i ciężkie owoce w tle. Goryczka wysoka, ziołowa i alkoholowa. Dość słodkie i gładkie, alkohol rozgrzewający.", "This is a pretty decent ale, not yhe best one I’ve ever had but decent. Or maybe \"It is quite doubtful that\" I \" have the taste or sophistication to be able to appreciate an ale of this quality and depth\" or so the wording 6-pack carrier states...", "Pours dark rouge with lasting off white lacing. As described, an aggressive beer, big hop forward sophistication of depth is required to like this bad boy . Well named!", "Nos: karmel, trochę ziół, sporo żywicy od chmielu. W smaku dość konkretna podbudowa słodowa, lekkie miodowe nuty utlenienia, jednak z drugiej strony atakuje ziołowa goryczka. Pod koniec picia czuć też delikatnie obecność alkoholu, który nie drapie po gardle jak wóda, dość szybko odparowuje, przypominając tylko o mocy piwa. Piwo nie zaliczę do tych kładących na łopatki, ale jest dobrze zbalansowane i nie ma większych wad.", "Rotbraun mit einer sehr stabilen hellbraunen Schaumkrone. Geruch ist malzig kräuterig. Der Antrunk ist kräftig malzig, leicht süßlich, dann aber enorm bitter, kräuterig leicht medizinisch.", "50cl can from Germany. dark amber. medium to big beige head. hops, malts, spices, caramel, medium bitterness that lingers on. low to medium carbonation.", "Copenhagen 28/5 2017. 50 cl can from Meny. Kind of Arrogant looking Devil with a mug of beer - of course - on the label. Pours hazy ruby with slighty off-white head. Settles as thin transparent layer of foam. No lacing. Aroma is heavy sweet. Fermented - almost decayed - fruit, sulfur, caramel and very distinct alcohol. Light carbonation and thick oily palate. Flavor is quite well balanced. Heavy sweetness followed by aggressive fruity bitterness. Quite a mouthful - but a pleasant one.", "Didn’t like this at all. Completely unbalanced with strange bitterness reminiscent of vomit. It didn’t get the lowest rating due to some nice malty flavors lurking in the back.", "pours rich ruby amber with a medium off white head. Rich floral and tropical fruity aroma. Bitter from the start and all the way through. Dark fruits come through as the bitter fades. Big beer that punches above it’s 7.2. Good, but I wouldn’t session it.", "Aroma: pine, caramel, resin, herbal, some red fruits\r\nTaste: medium bitter, moderate sweet, pine, resin, caramel, honey, floral, fruity", "Hazy amber color with tall off-white head. Aroma is very hoppy, some caramel and toffee. Taste is heavy bitter with sweetish notes. Dry finish. I wasn’t very excited on this beer at first, but it gets better the more I drink it. Pretty good.", "Zaskakujące piwo, aczkolwiek przesadzone w swym ekstremiźmie. Prezentuje się bardzo ładnie, tworzy gęstą, drobnopęcherzykową pianę, a samo ma kolor miedziany. W aromacie sporo nut słodowych kojarzących się herbatnikami. Całość dopełniają subtelne nuty owocowe - głównie wiśniowe. W smaku jest wytrawnie. Początkowa delikatna słodycz słodowa zostaje gwałtownie przełamana bardzo agresywną żywiczną, ale noszącą znamiona tępości - goryczką. Z tyłu przewijają się delikatne nuty syropowe. Całość jest gęsta, umiarkowanie nasycona i niezbalansowana - aczkolwiek chyba o to chodziło. Mimo że zaskoczyło to ostatecznie ani pali, ani chłodzi.", "Słodowy ulepek w smaku i zapachu. Do tego mocno przegazowany i z tępą, zalegającą goryczką. Taki Vip czy inne mocne, tyle że zamiast z biedry to z usej. Czy tam z Niemiec. Raczej ciekawostka.", "Miedziane, praktycznie klarowne piwo o obfitej pianie, która zdobi szkło i pozostaje do końca w formie sporej warstewki na powierzchni. Aromat przyjemny, słodowy, owoce tropikalne. W smaku gęste, lekko słodkie, owocowe, lekko żywiczne. Goryczka wysoka,krótka, szlachetna, żywiczna. Ogólnie świetne piwo, treściwe, goryczkowe, fajnie czuć chmiel, a przy tym dość pijalne.", "Kastanienfarben mit wuchtiger Schaumkrone. Röstmalziger Antrunk, extrem bitterer crapefruitartiger Mittelteil, sehr stark gehopft. Trocken im Abgang.", "light body, bitter, very bitter, medium sourness, \r\nNot too impressed. Slogan is great but the taste or description on the bottle leaves much to answer for. \r\nI would place this as an IPA, not the strong american ale.\r\nHonestly going wash my mouth out with Bud Light now", "Aroma is some caramel, maybe a touch of citrus, almost nonpresent - probably the weakest thing about the beer. Pours reddish mahogany with large off-white head. In taste maltiness including some dark malt & caramel (malt balance reminds me of bocks), with plenty of hoppy citrus and maybe some resin. Relatively high bitterness, though it’s herbal/seedy/ash-like and feels partially derived from alcohol - a bit unpleasant. Full body with nice mouthfeel, medium carbonation. Gets better (more balanced) as it warms up. It’s alright, but I expected far more from all the hype.", "spruce, citrus, earthy, alcohol, skunky, amber, cloudy, frothy, light sweetness, very bitter, full body, thick feel, average carbonation, bitter. Some may like it. I did not!", "In lattina. Ambra carico con riglessi mogano e abbondante schiuma crema. Al naso caramello e pane nero. Al palato un buon corpo e soprattutto il motivo per cui è nata: l’amaro che permane a lungo.", "0,5l Dose. Dunkelrotes Bier mit toller Schaumkrone. Geruch nach trockenen Früchten und Citrusaroma. Es schmeckt nach Toffee, Citrusaroma, etwas nach Bitterschokolade und reifen Früchten.", "A really lovely clear mahogany color with a fine tan head. Looks good and inviting. Fine lacing also. Quite moderate intensity in the aroma. Mostly caramel malt in the nose. Not that inviting. Medium + body and a fine carbonation level. Easy to drink. Not enough sweetness to back up the bitterness. A bit unbalanced actually.", "Can from bierlinie. Pours dark Red. Nose is citrus, red fruits, toffee. Palate is bitter chocolate, dried fruit, wood. Very bitter. Thought this would be crazier. A bit disappointed, but would probably liked it less if it would be crazier.", "I’m surprised this beer has an almost 10/10 rating but I’m not surprised at the same time because their marketing stragedy is very good \"if you don’t like this beer keep it too yourself\" it’s a chugging beer. All who rated 10/10 on this poor excuse of an ale are all a bunch of middle aged alcoholics who use the guise of being a sophisticated conisour to be a bunch of drunks but also to cover up the fact that this beer tasted like shit and you’re simply conforming to what you preceive as cool thanks to they’re amazing ad compaign.", "Fajnie si? rozlewa po gardle, wysoka goryczka, bogaty smak. Kojarzy mi si? z barley wine. Aromat s?odki, owocowy", "50cl blik. Helder robijnrood kleur, fijne romige licht bruine schuimkraag. Aroma van karamel en noten. Smaak is zoet, citrus, karamel en noten. Vol Lichaam, Veel koolzuur.", "Na samym początku zdziwiła mnie ciemnobursztynowa barwa, spodziewałem się czegoś jaśniejszego. Trochę też zmartwiła bo nie przepadam za karmelem w mocno chmielonych piwach, ale tu zaskoczenie na plus. Wróćmy do aromatu, jest karmel, są cytrusy, dosyć intensywny, przyjemny. Piana skąpa, utrzymująca się. W smaku jest pełne, karmelowe, ale nie słodkie. Goryczka cytrusowa, średnia do wysokiej stanowi przyjemną kontrę do karmelowości. Wysycenie niskie, alkoholu brak. Bardzo fajne piwo, wydaje mi się że karmel tu pasuje przez to że jest konkret goryczkowe, nie jest jak w wielu IPA dodany żeby trochę ugrzecznić piwo tylko stanowi jego podstawę. American Amber Ale to najbardziej zbliżony styl dla tego piwa.", "tap. Aroma of nuts, caramel malts, light hoppy and light fruit esters. Beer has got agressive unpleasant bitterness, Imagine that uve got mouth full of aspirine, blee", "Zapach przyjemny, slodkawy, karmelowy, lekko palony. W smaku również słodycz, karmel. Bardzo dobre", "Aspetto perfetto, ma per il resto mi aspetto di meglio. Gradevole al naso, ma non fa impazzire. In bocca si avverte soprattutto l'amaro e il biscottato, ma poco altro.\n\n---Rated via Beer Buddy for iPhone", "300ml on tap at the RedHot Munich. Aroma is green walnut, malt, light citrus. Appearance is dark brown with a brown foam. Taste is bitter and very light sweet. Dry. Good.", "Can. Dark copper, beige head. Nose is caramel, dark dried fruits, toasted malts. Medium body, light carbonation. Taste: medium sweet and medium-high bitter. Burnt sugar, caramel, dried fruits, bitterness. Long dry bitter finish. Good.", "The beer has gpt a deep dark brown colour with a steady head and smooth body. Aroma of hops and pine. Taste of hops, pine, spruce, woods, biscuits, grass and citrus. Dry-hoppy finish.", "Puszka, barwa rubinowa, gęsta, kremowa piana która utrzymuje się dosyć długo i estetycznie oblepia szkło. Aromat nie jest zbyt intensywny, pachnie tak karmelowo-herbatnikowo, trochę jak bitter. W smaku na początku wyczuwa się dosyć intensywną goryczkę, która dominuje wszystko inne. W tle pałęta się trochę karmelu i jak ja to nazywam \"kremowości\". Śladów intesywnego chmielenia nie stwierdzono ani w smaku, ani w aromacie. Jest ok, ale nic specjalnego.", "Pours dark copper with an off white head. Aroma is citrus, pine and carmel malt. Full bodied with a good sweet and bitter balance. It has every right to be arrogant.", "Poured from the 0.5 liter can, Stone Berlin. Hazy brown, immediate boozy aromas upon openning, beige head. Some biscuity notes, hops (but a mixture of floral and little bit of citrus) and booze on the nose. The carbonation is too high in my opinion. When the beer warms and is less carbonated it gets pretty drinkable, like a mix of english ipa with some american hops. The bitterness is more floral than citrussy and not so high quality. Overall the beer is ok but not my style.", "Shared can at Arne & Ulrike?s. Unfortunately almost at best before date, brewed in Berlin. Pours reddish brown with beige head. Aroma of pine needles, sherry, caramel, citrus, cherries. Tastes sweet with a good load of bitterness. Medium bodied, bitter finish.", "Clear brown with a medium white head. Aroma is malt, pine and raisin.Taste is hops, caramel and malt", "Puszka. Piwo lekko metne w kolorze brazowym nalewa sie z obfita sredniopecherzykowa piana ktora zostawia ladne zdobienia na szkle. W aromacie nuty ziolo-korzenne z domieszka ciemnego chleba. Czuc tez zywice i troche grejpfruta. W smaku orzechy,karmel i troche owocow cytrusowych. Wysycenie i goryczka na srednim poziomie. Polpelne cialo i wyrazny alkohol, raczej nie bede fanem tego piwa.", "Puszka z carrefoura. W aromacie zabrakło mi tego co w piwie określa przymiotnik - amerykański. Czyli chmieli. Nieobecne w zapachu za to intensywne w smaku. Jest goryczka cytrusowa. Wyraźna. Ciemna bursztynowa barwa. Nierównomierna ale trwała piana.", "floral, clear, brown, white foam, medium bitterness, lively, medium body, dry finish,", "Klares dunkelrot mit reichlich Schaum. Malzig, Karamell, Nüsse, leicht fruchtig, Blutorange, harzig, bitter.", "Tap at Beer Salon Prague 2017.\r\nDeep amber, lingering head. Aroma herbal. Palate medium, high carbonation. Taste grapefruit, elderflower, bit of harsh earthiness. Long lasting biterness. Not very enjoyed, possibly spoiled keg shipped from overseas.", "You read the label and you rated it below 100%, then this beer isn’t for you. Go back to your amber piss water!", "Amber kleurig boer met een beige kleurige dikke schuimkraag erop.\r\n\r\nAroma: fruitig, karamel\r\n\r\nSmaak: fruitig, karamel, moutig, klein beetje alcohol en een bittere afdronk.\r\n\r\nLekker!", "Bomber. Ruby color with a brown hue. Light khaki head. Woody, spicy, hoppy aroma and fig maltiness. Strong backbone. Dense malts, everything about this beer seems big. Quite a bit of pine bitterness, cake, brown bread, dark dried fruit. Full body. Bitterness and alcohol in the finish.", "0,5l blik van bierwinkel alkmaar. donker bruin met een creme kraag. Tarwe brood en donker en rood fruit. Laurier in de afdronk", "In a can - brewed in Berlin. Malty aroma. Appearance, beige/brown head, hazy, dark red colour. A very bitter taste, heavy. A long lasting bitter aftertaste. I have always enjoyed this beer.", "Barwa mahoniowa, piana średnia. Aromat karmelowy, cytrusowy, chmielowy. W smaku słodkawe, tytoniowe, przyprawowe ze świetną, mocną goryczką na koniec. Fajnie wykleja i grzeje gardło. Alko nie wyczuwalne.", "Tap at Ma Che Siete Venuti a Fa in Rome-Italy. Reddish amber clear, tick ivory foam. Nose: mild notes of mou, rich amber maltiness, a bit caramel. Mouth is East Amber, clean, with a pungent and peppery aftertaste. \r\n\r\n---Rated via Beer Buddy for iPhone", "Can. Stone Berlin. Mahogany brown. Nice head. Smells of big caramel, nectar, tropical hops. Medium body. Dry taste. Caramel, nuts. Tropical fruit. Medium bitterness. Very good.\n\n-- rated with beerbasher/winphone", "Pours nice in a red amber deep colour with firm head. Nose is very malty with light sweetness and roundness. Taste is very rich, herbal with lots of hops. Bitterness with clear classic notes. Palate is loooong and bitter. Real cool beer.", "0,5l can. Pours dark copper with medium sized white head. Toasted caramel malts, strong hoppy piney character. Love the bitterness.", "Canette - De couleur brune avec une mousse fauve moyenne qui tient bien - Au nez énormément de houblon, énormément de résine, agrumes, pin, herbacé, caramel, fruits rouge, figue - En bouche toujours autant de houblons, beaucoup de malt, caramel, biscuit, torréfaction, en fin de bouche ca tabasse du houblon, une grosse amertume se développe progressivement - Corp moyen, amertume forte, carbonation correcte, amère et sucrée, final amère et herbacée - Un standart, mais carrément trop", "Canned. Pours deep amber with huge beige head. Basically both the aroma and taste are dominated by prominently bitter hops that are underpinned with well balanced sweet malty/caramel notes. On the palate it’s bittersweet first and laters turns to lingering bitterness. Not an overcomplicated beer, but surely a well made one.", "L - Deep amber with a copper head\r\nS - Rich malt and hops with a twinge of booze on the nose \r\nT - Huge flavors. Similar to the nose with rich, tasty malts and hops - very hoppy. Roasty and toasty with caramel notes with a bit of booze on the back end. It’s like a greatest hits of IPA, barleywine, and an amber ale. \r\nF - Full bodied with medium carbonation - very smooth \r\nO - All beers from Stone are typically on point but this one is just one of my all time favorites. It’s somewhat like an IPA, somewhat like a barelywine, somewhat like an Amber - it’s near perfect. If Double Bastard didn’t exist I’d say this was near perfection when it comes to American Strong Ales", "Berlin version, 0.5l can. Pours deep dark amber-brown with a big fluffy head. Nose is toasted toffee, a little yeast and spice, distant red fruit, cola and cocoa. Toasty, resinous, slightly sweet and very, very bitter.", "Can. Dark ruby to brown, little bit hazy with nice, big, very solid, frothy, white head and good lacing. Reach, sweet malty aroma with some resin, bread and maybe citrus tones. Medium body, roasted in taste with significant bitterness in the finish, sticky and pleasant mouth feel. It’s strong in taste and in aroma, it’s solid, it’s good!", "Tap. Deep beautiful amber colour. Small head. Fresh citrus start, heavy great fulfilled body with a slightly higher maltiness than expected from the type. Great balanced, but heavy bitter aftertaste.", "50cl can, Geers. Pours dark red / mahogany. Very thick beige head. Large bubbles on top. Nose is hops and cara malts, gives a candy blend. Als cookies in the nose. Aroma of hoppelletcake and bitter biscuits. Taste is only sweet in scent, bitter throughout the rest of it. Slight wood finish or maybe it’s the cara roast. It’s somewhat like an IPA, with the lack of yeast profile/esters and with the bold bitterness. But it’s less dryhopped and has a malty backbone.", "(Berlin version, 1 pint can) imagine a perfect strong lager beer. No extravagancy. Nice head, Nice Color and texture. Hoppy and fruity but not too much. Wunderbar.", "50 cl can, brewed in Berlin. Poured in to a Snifter. Dark amber colour with a medium sized, lightly tanned head. Fruity aroma with citrus, resins, caramel malts, toasted notes and pines. Taste is very bitter. Medium to full body with an oily texture and a soft carbonation. Finishes lasting dry and bitter with citrus, resin and pines. Nothing but subtle, as the writings on the can also suggests. Rather hopforward, which I like.", "Can 500 ml, pours clear dark amber with high beige head. Very flat aroma with some notes of wet paper with hints of honey citrus peel, sweat, some very light fruitiness and resin. In taste very earthy, dry and completely dominated by a long ashy bitterness. I’m not sure if the european can version is so much different from the original but this is by far not what I call a good beer.", "Poured from a 50cl can at home. Dark brown-amber-red with a bone coloured, frothy head with good lacing. Slightly caramel and smoky malt aroma. Medium to medium-strong bitterness. Mild sweetness. Quite full bodied. Lasting bitterness and smoky aftertaste.", "Canned 500ml. -Courtesy of and shared with Marko, thanks. Nice amber/brown coloured, medium sized beige head that stays for a while, light dried fruits in the nose. Sweet malty, caramel, hops, dried fruits and alcohol with touch of herbs and wood in the finish. Good beer but nothing thrilling here.", "On tap at Craft Beer Gallery. Dark reddish amber colour, rich aroma full of hops, caramel. Very rich taste - high on bitterness, coffee, hops, blackberries. Long fruity finish. Another magnificent beer.", "On tap at B33R Gallery. \r\nWorld class you say. Well, it’s not bad after all. Very bitter and hoppy. Now trying to remember my last double but whatever I think it was not so aggressive. You bloody basrard!", "This bastard is a big bold beer full of hops and flavours and has a slightly peppered smoked finish on the palette. This beer is full of itself. It looks down on you and is condescending towards you. You feel intimidated and that’s the way he wants it.", "Berlin version, 0.5l can, ffrom Ludo, shared with ogivlado. Dry, heavy aroma, woody, some oniony and fruity hoppiness. caramel, initially too dry, gets better as it opens up. Taste... woody, earthy, slightly nutty dry maltiness, a touch of caramel, ashy, herbal hoppiness, onion. Full, well balanced really, but I’m not thrilled. Medium bitter finish. I might not be worthy, but this isn’t worthy of a rave review from me either, so I guess we’re even.", "Huge Carmel and toffy and nutty kick, lots of tasty bitter hops on the back end. Strong but not overwhelming. This is pretty good stuff!", "bomber pours dark brown with tan head aroma is sweet and roasted malt taste follows smooth drinking", "Aroma - pleasant and complex, predominantly with caramelized malt, caramel, toffee, chocolate with milk and nuts, honey, some dried fruits, a bit of yeasts. Taste - identical with aroma, with some fresh grounded grains and a log and pleasant bitterness. Very good!", "Can from beer52 beer club. Fabulous beer, dark and malty and you can taste the caramel in there. Not as hoppy as I was expecting to find but great nonetheless. Very strong, you know you’ve had a tin of this!", "Can from Wine Rack, Burpham. The EU version. Hops and malts, slightly pungent - not as strong an aroma as I was expecting. A medium chestnut. Light beige head, creamy but it soon recedes. Bitter, but the hops are never over the top. Medium bodied. Oily. A lot of carbonation going on there. Long but restrained finish. I like that warming sensation you get from a beer of this ABV but not really getting much of that. I like it but this mutha is not as up in my face as I was expecting.", "This beer is quite hoppy; hoppy in a way that kind of distracts from what else is going on with it. It’s good, but it’s got a dry finish that’s almost overstated.", "Stone Berlin, puszka, data do 01.04.2017 r. Barwa bursztynowa, zmętnienie dość spore, bardzo ładna, trwała piana, zdobiąca szkło. W aromacie dominuje miód, gdzieś w tle słody, karmel, kwiaty. W smaku bardzo podobnie, jest dość słodko, wszystko kontrowane wysoką goryczką. Bez szału.", "World class brew. Creamy lightbrown good mostly lasting head. Amber colour. Heavy malty and hoppy aroma.", "Aromas of caramel, toffee, slight pine and lemon citrus. Taste is as it smells: caramel, toffee, lemon. Although, a stronger grapefruit rind presence builds as it travels down the tongue; and pine notes appear in the finish and after taste as well.", "can @ home\r\nclear brown, cappuccino head\r\ncream, butterscotch, spices, nutmeg, clows, liquour, hops\r\nbitter, caramel, herbaceous, dry hoppy bitter finish\r\nvery drinkable", "Somehow I’ve never rated this one, though I’ve had it several times over the past 15 years or so. Anyway, Heavy malty nose, medium roast, herbs, berries, tree bark, and light smoke. Dark amber/brown color, with a large rocky head and very thick, sticky lace. Roast malt, tangy and piney, caramel, quite herbal, tiny bit of smoke, and moderate back-end bitterness. Medium body. Very tasty.", "Keg Half Pint at White Horse American Beer Festival 2009, Parsons Green, London in July 2009 - Mahogany Red in colour. Aggressively hopped; citrus piney oily hops. Solid malts; roasty malty, caramel, toffee. Fruity; citrus. Sweetish throughout with a bitter hoppy finish. (2009-07)", "0,5 l can (From the Berlin Brewery) shared.\r\nAppearance:Clear brown body ,with a rough creamy white head. \r\nAroma: Hughe, a lot malt, caramel, toffee, witha lot of pine and resin, some fruity tones.Taste: Is moderate sweet and heavy bitter while still finding a balance. Allmost full body, average carbonation.\r\n\r\nQuality ? Yes..\r\nDepth ?, Hmm, Imho I would say no, because this is one big power house.Going in agressive and hard, but lacking the nuances to make it really great. Still for people who are all for richness and still drinkable this is one beer to get.", "Can 0,5 l. I have no idea if really produced in California as I bougth it in the supermarekt in Warsaw, Poand. The beer is unfortunatelly very dissapointing. Not really interesting beer. Just strong bitterness, moldy and caramel aroma and taste. Too long bitter finish. Once again: dissapointing.", "Nice and strong American Ale. Really bitter but it fits perfectly to the citrus and caramel notes. Enjoyed it but you have to be in the mud to drink it", "50 cl Berlin can. Dark, deep red colour with a good off-white head. Aromas of toffee, sweet bread, malts, alcohol, grass. Flavour and palate are pretty straight-forward, low carbonation with fairly strong bitterness all throughout. Flavours are not very distinct, overpowered by the bitterness. Good malty body, but can’t find much else. Overall quite good, the right kind of sweet aroma, a little too bitter in the style for my taste, but the malty body makes up for it a bit.", "Poured from a pint can into a tulip glass. The beer is a nice dark brown red that lets you know you are in for a hoppy ride. The smell is perhaps the weakest aspect of this classic beer. It doesn’t give you much to work with and is pretty indistinct. Tastewise this doesn’t quite seem like the facepunch of hops that it felt like 10+ years ago, but it is still a tasty combo of hops with a malty backbone. Overall, this is a classic beer that I have enjoyed for many years and still pick up semi-regularly. I like that it is available in cans now, too!", "50cl can. Hazy brown amber with a small tan head. Caramel, citrus and light piny. Nice.", "Malty in the nose. Pours brown amber. Malty bready taste gives way to hoppy bitterness that lingers. Overall very palateable.", "Can. Amber color, medium white head. Aroma is hoppy, zesty and piney, light citrusy with floral notes. Taste starts malty, light caramely, zest and pines, decent citrusy and floral with long hoppy finish", "0.5l can. Hopy aroma, pine, flowers. Clear copper color, pale beige head. Hopy taste malty notes, pine, floral notes, high, but pleasant bitter. Full body, creamy texture, soft carbonation and dry, bitter finish. Very good.", "A most fitting inauguration beer. Here’s to you Donald, may your reign be short and forgettable! Malty, sweet and strong aroma of dark dried fruits, lightly roasted malt and caramel, with some brown sugar in the back. The flavour is surprisingly hoppy, with distinct notes of grapefruit and even some grass that easily balances the dark dried fruits and caramel. Also hints of spices in the back. Moderate sweet taste with a rather heavy bitter finish. Medium body, smooth and dry texture and fairly soft carbonation. This arrogant bastard is a nice one (as opposed the other arrogant bastard that is currently polluting my TV screen).\n\r\n[50 cl can, enjoyed 7 months after canning, trade with an Untappd dude]", "Can 0,5.\r\nBrown color, hazy. Aroma: caramel, nuts, dark berries. Taste: bitter start, hoppy, quite strong ABV feels, long bitter finish. Good beer.", "Vierte ámbar oscuro con media cabeza de espuma beige de larga retención; aromas a malta tostada, caramelo, fruta madura, lúpulo, resina y licor, en boca entrada potente, maltosa y ligeramente amarga y muy seca, notas terrosas y a resina, largo retrogusto, maltoso, amargo y seco, cuerpo medio y correcto carbónico, cerveza con carácter que puede gustar o no, el lúpulo está equilibrado con la malta.", "Cerveza color ámbar rojizo. Aromas de predominio cítrico, con toques acaramelados. Al paladar se perciben lúpulos cítricos, con un poco de toque a caramelo con el retrogusto amargo característico de esta cervecería, el cual perdura unos minutos. Excelente cerveza. \n\n---Rated via Beer Buddy for iPhone", "Can from Pivný raj. Clear Amber colour, Light beige head. Aroma is piny, resiny hops, caramel and some roasty malty notes. Taste is piny hops, caramel, malts. Hops and Very high bitterness in aftertaste. Pleasant carbonation. Good.", "Can from Berlin - BB May 2017. Malty aroma of dark fruits. So flat in taste... some grass, some herbs, tea (?), earth and nothing much more. Bitter, disturbing aftertaste. Huge disappointment. What the fuck with this legendary ale???", "Can. Dark amber, large tan head. Aroma earthy, malts, caramel, hints if grass and citrus. Medium full body. Taste mainly hoppy with subtle sweet caramel tones. Bitter finish.\n\n---Rated via Beer Buddy for iPhone", "Très agressive - comme son nom l’indique - une expérience originale au demeurant.", "Malty, heavy aroma with some hoppy resin notes. Heavy herbal and resin bitterness. Felt some disappointment after tasting. Well it’s a Bastard.", "Stone Berlin. Puszka 500ml. Barwa rubinowa, piwo opalizujące. Piana bardzo obfita, zbita, kremowa w kolorze beżowym. Wygląda pięknie. Aromat jest bardzo ciekawy. Ciemne owoce, rodzynki - przypomina belgijskiego quadrupla. Do tego dochodzi fajna chmielowość: żywica, igły sosnowe. Na słodko. Piwo w smaku jest również bardzo ciekawe, są rodzynki, ciemne owoce, karmel i chmiel. Za tym idzie konkretna goryczka, grejpfrutowo-żywiczna. Wysoka i przyjemna. Piwo bardzo ciekawe, warte sprobowania.", "WoW an Arrogant Bastard just popped up right in front of me. And a big waring on the can that I might not like this. Ha ha it is surely a solid lovely brew. Everyone likes this.\nA really lovely clear mahogany color with a fine tan head. Looks good and inviting. Fine lacing also. Quite moderate intensity in the aroma. Mostly caramel malt in the nose. Not that inviting. Medium + body and a fine carbonation level. Easy to drink. Not enough sweetness to back up the bitterness. A bit unbalanced actually. Caramel bomb de lux. It actually kills the grapefruit hoppy goodies almost completely. Not good. Also some dried fruit in the flavor.\nThe warning was right. I did not like this.\n[Can from Vinmonopolet Aker Brygge in Oslo, Norway]", "Can from Salt Horse. Murky ruby body with a dense beige head. Good lacing. Aroma of caramel and earth. Flavour of cranberry, stewed tea and a bitter finish. Medium body with an oily mouthfeel. Light fizz. Mega hoppy - which I normally love - but I found this beer to be, frankly, quite boring. I expected much more based on previous reviews.", "Pours a dark caramel color. Aroma has some wood and toffee notes. Taste has caramel, dark fruits and some booze. Strong hop presence as well. Lingering bitterness. Very complex, very tasty", "Plechovka, silné výborné pivo. Greg Koch umí, můj první kousek, ale zaujal.", "Rødbrun klar med fingerhøyt beige skum. Lukter tørket frukt, karamell og korn. Mye bitterhet. Grape og sitrusskall, noe brent karamell. Middels lang.", "Pours dark ruby colour with full beige head. Aroma is caramel and hops. Taste is, appropriately, bitter from the start. Notes of caramel and citrus, lots of grassy, fruity hops with a bit of malt cutting through. Medium bodied and moderate carbonation. Not an overly complex taste, but it’s jammed full of flavour.", "16/20 really interesting taste with bitterness and citrus. Really malty too. Smooth. Good alcohol hit\n\n---Rated via Beer Buddy for iPhone", "Bottle. Hazy, brown. pours brown head. Aroma: wooden, malt, caramel, and maybe some citra hops. Taste: oak, caramel,malt, brown sugar, medium sweet, medium bitter. Palate: medium to full body. Overall: it’s very good :)", "Can. Opaque brown with a nice tan head with ample lacing. Malty aroma with flavors of caramel, dark fruits and brown sugar. It is like a good Belgian Quad with the extra bitterness of an American IPA.", "Poured from a 16 ounce can. This was a gusher, really Stone? Lame. Pours clear amber/brown with a tan head. This is a malty strong beer. The alcohol is noticeable and warming. The hop bitterness is firm and helps clear away the maltiness. The bitterness lingers.", "Mørk brunrød farge med litt kremete Lys beige skum. Lukter av humle/grape, krydder, sødme og karamell. Medium fylde og medium karbonert. Smaker sødme samtidig sitrus/grape smak. Bitter avslutning. God:-)", "Nice fruity hop aroma, amber and really clear. Malty hoppy a little sweet on mouth. Intense hop finish. A great beer", "Can. Pours mahogany Brown with a beige head. Aroma of dark fruits, caramel, plums, syrup, hops and brown sugar. Taste of hops, dark fruits, caramel, grains and slight citrus.", "Tapp. Mørk brun farge, moderat karbonert med fyldig skumtopp. Smaker karamell mørk frukt sitrus", "Can, Berlin version. Nice, ruby colour, caramel, dried fruit, plums, ripe apples, subtle and spicy hoppy notes, a hint of cinnamon, and a rough, unpleasant bitterness that makes the beer fall out of balance. Interesting stuff, were it not for the bitterness.", "Can. Brown with huge pale brown head. I wasn´t very impressed with this, for sure an agressive beer but lacks complexity. Aroma mainly malt caramel, not much hopps. The bb data was 04.2017 I wonder if it was a bit old, but I´ve just bought it. Taste dry and bitter with a good malty bode.Bitter finish.", "Color marrón oscuro, con reflejos rojizos, opaco, con capa de espuma marrón de dos dedos de grosor (buena retención). No mucha carbonatación. Ahora maltoso y resinoso, muy profundo. El sabor soy incapaz de definirlo, me parece un despropósito de elementos que no soy capaz de discernir. Según entra parece dulce, con notas de café, después se nota algo más lupulada y alcohólica; y una vez ya tragada, llega el amargor, in crescendo entre trago y trago. Lo más reseñable, aparte de su impecable aspecto, es eso, el amargor. Y, aun asi, no me convence del todo, porque es tan fuerte que inhibe mi paladar y no me permite saborear nada a partir del tercer o cuatro trago ¿Es una birra agresiva? Sí. Y no me gusta. No creo que haya que ser sofisticado para disfrutarla, más bien lo contrario. Ruda, extraña, pretenciosa y lejos de las expectativas creadas, pero, ¡eh!, esto me pasa casi a diario y parece que a todo el mundo le gusta. So, try it.", "Can. Stone Berlin. Thick brownish red. Small but nice and lasting head. The strong aroma of malts bursts out of the can and immediately makes me wanna drink a scotch single malt...malts, dark berries, malts, hops, honey and more malts. Taste is fruity, malty and bitter piney hops. Caramel, raisins, honey and grapefruits. There’s a hint of sweetness beneath the hops overload. Highly carbonated. The aftertaste is extremely bitter and seems to last forever. A very aggressive and equally impressive beer. Complex and full of BAM! I love it but the beer snob elite marketing is childish.", "Backlog. Synchronizing with notes and Untappd.\n\r\nCaramel and citrus fruitiness. Clear brown with a cream head. Rather bitter with a lot of caramel present over the citric bitterness of a grapefruit on the finish the pine kicks in. Well made IIPA but I was expecting more from this legendary beer.", "Densa, color oxido, malteada, muchas notas de regaliz y poco se nota su elevado alcohol, muy rica", "Almost a chocolate licorice roasted malt aroma with piney hop finish. Taste is a malt bomb, but not sticky palate, with piney bitter hop balance. Finish is bitter dry piney. This is a full flavored beer with some great flavors, but the bitter hops overpower. It is good, and aggressive is what they are going for, but it is not the most hoppy beer, just very hoppy on the piney bitter side of the spectrum.", "Murky ruby color with a smallish tan, dissipating head. Very little lacing. Aroma is fruity hops and at the same time malty. Resin, caramel and cheese. Taste is medium bitter which evolves towards the end. Resin, dark fruits, a bit vinous, notes of cough syrup and spices. Medium body, medium carbonation, long bitter finish. An interesting beer.", "(can, 50cl) Hazy, ruby colour with a firm and mid-sized tanned foamy head. Earthy and mildly fruity hops with shades of resin, accompanied by mildly nutty and sugary malty accents, caramel and yeasty notes. Quite bitter and slightly sweet flavour, full bodied with a smooth carbonation. Dark and nutty cara-malt character with earthy hoppy notes, spruce and pine as well as subtle fruity notes; bitter hoppy and mildly sweet finish with lingering earthy and piney hops, hints of caramel in the aftertaste. Well-embedded alcoholic strength. Superb. 03.XII.16", "Can. Creamy lightbrown good mostly lasting head. Amber colour. Heavy malty and hoppy aroma. Heavy bitter flavor. Long heavy bitter finish. Creamy palate. Almost as good as expected, and I expected a lot.....World class brew.", "Can\r\nAroma-fruits, citrus\r\nAppearance-amber, hazy, tan foam, \r\nTaste-medium bitterness, medium sourness, light sweetness, \r\nPalate-medium body, sticky, average carbonation, long finish, \r\nOverall-very good", "650ml bomber. Pours clear dark ruby/chestnut brown with a big foamy tan head. Aroma: sweet dark fruity malt, caramel. Taste: rich, sweet, dark fruits, caramel, toffee, plum, a little warming alcohol, pine. Slightly bitter finish. Medium body, low carbonation. Silky smooth. Really nice.", "Kolor: Mahoń, klarowne. \r\nPiana: Obfita, oblepia szkło, długo się utrzymuje.\r\nZapach: Karmel, zioła. Przyjemny, klasyczny.\r\nSmak: Pełne, karmelowe. Goryczka wysoka, ostra, tytoniowa, zostająca długo ale przyjemna.\r\nWysycenie: Średnie, OK.\r\nOpakowanie: Przyciągająca wzrok etykieta, niedokładny skład. \r\nUwagi: Warka 17.04.17 Klasyczne angielskie ale z wysoką goryczką.", "Berlin canned version. Hazy brownish color with off-white head. Aroma has some caramel, orange, nutty malt and earthy hops. Taste is also nutty with some earthy hops on the finish. Medium body, quite smooth on the palate. Overall it’s quite good and easy to drink for its ABV.", "Ganz schön arrogant im Glas, in der Nase Malz und Frucht, soweit schonmal sehr lecker. Im Trunk alkoholisch, leichte Süße, Karamell. Im Abgang langer alkoholischer Nachklang, nussig, holzig.", "Can, Stone Berlin: great artwork. Chestnut brown, beige head. Roasted malty caramel and espresso and aggressively bitter, tropical fruity and resinous hops, clove, nutmeg, earthy, dry, a tat herbal/liquorice. Good body, lively carbonation.", "amber met witte kraag. aroma van caramel, hoppig, toffee, geroosterd. Smaken zijn zwak zoet, mout, geroosterde mouten, caramel, donker fruit, gras, iets droge afdronk, den, medium body, zachte co2, ok", "500ml can from House of trembling Madness, York. Deep ruby brown with a dense tan head. Aroma of bread and walnuts. Banana bread, nuts and spice flavour. Bitter on the tongue. Silky palate astringent finish. Pleasant enough, but I wanted to REALLY like this, and was a bit underwhelmed.", "Hard to find fresh in T. but when you do, drink it. Still a classic and has not disappointed. Big bitter bite with big malt and rich nutty body. Mild spice and bread aromas deceive the big bite in the finish.", "Can 50 cl. Pours a clear red to opaque with a medium yellowish off-white head and an aroma of roasted malts, lemon, toffee, syrup, dried plums, earth, dried leaves, alcohol, cloves, grassy hops, coffee and pine. The taste is medium sweet with a long bitter, coffee like finish. I do like it!", "A well balanced double IPA with citrus and resinous hops. Medium body with slight bread character. Excellent brew.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "Opaque, dark amber brown color with a tanned, dense foam head. Aroma is heavy hops, mainly citrus, some floral. Huge malts presence in the aroma. Flavor is moderated sweet, with a powerful and really long bitter end. Body is medium, texture is oily, average carbonation.", "Can from mchughs. Pours tea brown with thin foam head. Aroma is spice, pine, dough, tea, wood, earth. Flavour is is a earthy caramel with a dry spiced alcohol finish.", "500 ml can. Clear dark red beer, firm beige head, some of it lasting long. Aroma is caramel, grass, pine, grapefruit and hints of dark fruits. Taste is medium sweet and medium to heavy bitter, caramel, grapefruit, leading to a grassy, long bitter finish. Medium to full body, soft carbonation. Yes, this is an aggressive beer.", "Nice marketing :) Ruby with little brown head. Aroma of aroma hops (Citra?), that is Papaya, some other tropic fruit, caramel, a little roast and wax, brown sugar, maybe even mocha or coffee. Taste is lots of everything, spicy pepper, hop bitterness, dark chocolate bitterness, not much sweetness though. Finish is like after a cup of coffee, with some additional sour fruity stuff. Light and watery on the tongue. Medium body. Not so heavy actually. Complex and deep. Not bad.", "Can at home. Pours a hazy deep mahogany colour and a big beige head. Aroma of pine, oak, wild berries, chocolate, spices, dried fruit, ammonia and grass. The flavour has more hops with grapefruit, pine, grass and some chocolate and wild berries. A little dry in the end. Has a slick mouth feel, medium to heavy body, and solid bitterness. A pretty hoppy and powerful ale, and the aroma is more complex than the flavour.", "Tap. Pours brown with lazing tan head. Aroma has malt, grain, straw, caramel and nutty notes and a grassy hoppiness with hints of pine. Taste is malty with dark malts, grain and straw, caramel, walnuts and is hoppy with grass and notes of pine. Finish is malty, hoppy and quite bitter.", "Halve liter blik van craft beer winkel in Lobberich. Donkerbruinrode kleur\r\nRuikt vooral moutig maar ook wat citrusfruitigs. Smaak is bitterhoppig met een flinke mout bijsmaak. Bittere afdronk. Gebalanceerd.", "Bottle. Hazy, brown. Medium light brown head. Aroma has oak, honey, malt and citrus. \r\n\r\nTaste has malt, pine, citrus, oak, caramel, brown sugar. Layered with interesting tastes. Smooth. Proper aftertaste.", "Caramel, pine, grapefruit, maybe some passion fruit, a very strong character that has a great palate, just legendary.", "Color marrone con riflessi aranciati, schiuma beige fine non abbondante e nemmeno troppo persistente. Al naso sentori maltati e terrosi, leggermente agrumati ed erbacei. Corpo pieno e pulito, carbonazione nella media. Al palato entra subito decisa con l’amaro che quasi soffoca le papille. intensità di aromi che virano verso l’erbaceo pesantemente e verso il terroso. Il biscottato contrasta a tratti questa sensazione.", "Caramel and alcohol, reddish amber with a good ocher head, medium body, medium carbonation, intense but elegant bitterness that remains for few minutes...probably not so bitter like the original version but a very bastard ale.", "Can, brewed in Berlin. Stunned this is not rated. Nose is malt, yeast, toffee, herbal hops, sweet tropical note, hint of vanilla. Taste is malt, toffee, rye, caramel, bread, leading to a bitter grapefruit, pith and herbal, pine hop note. Mouthfeel is exceptionally smooth. I rarely bother commenting on appearance, but this is a beautiful beer, deep amber, chestnut with a pillow head. It’s not my favourite style but an exceptional example, though I always slightly wish I was drinking a BA version.", "Mørkt, herlig øl med fint skum. Dufter sterkt av kaffe, lakris og mørke Bær. Fruktig smak med sterk bitterhet sammen med kaffen. Tommel opp.", "Nice dark ruby red hue, slight creamy tan foam. Aroma is a bit malty - caramel, brown sugar, cherry, plum. Taste is also malty with bready notes and sweet to start and dry to finish. Notes of vanilla, black cherry, caramel, rye toast. Assertively bitter. There’s a somewhat of a cough syrup taste in the finish, but beyond that, this is exceptional.", "Can 0,5ltr: Dark brown colored brew with an dry bitter taste, hints of caramel, grapefruit, oranges, honey and pine. On the legendary list too, this one from California (Its really from Aberdeenshire, Scotland).", "Dark, caramely brown in colour with thick brownish head. Sweet, hoppy and smoky on the nose. Initially very bitter taste, followed by smokiness, then bitter sweet on the end. Also quite carbonated. Big, tasty bastard of a beer.", "Very acceptable aroma and a delightful deep rusty orange amber appearance. Carbonation is perfect and this one slides down the pipes quite easily. I was very pleased with this one and found myself wondering exactly why I hadn’t had it before now....Proof my tastes are being honed and changing as well...upon researching, I found I had this one a year or so ago before I was rating here. I sure wouldn’t have given it a fair shake then so it worked out well because it’s def a brew that will be in my glass often after this tasty experience.", "1pt bottle. Dark reddish brown with a beige head. The aroma is sweet caramel and syrup. The taste is heavy sweet, syrupy and medium bitter. Piny hops. Over rated and priced.", "50cl can. Dark red brown color, thick head. Earthy hop aroma, toffee and dark caramel (kind of like a beefed up ESP?). More citrus and bitter hop resin in the flavor, nice maltiness. A great beer all around.", "Deep copper pour with a tan head.Flavour is rich caramel malt, citrus, pine. Lingering pithy bitterness. Great stuff.", "On tap @ What’s Brewing, Stavanger. Pours mahogany, with a big creamy, off white head. Aroma is hoppy notes, with resin and citrusy notes of orange peel and grapefruit, as well as roasted malts with bread and honey. Medium body, with soft to average carbonation. Flavour is bitter, with resin, citrusy orange peel and grapefruit, as well as malts with cereals and toffee. Lingering bitter finish. Balanced and quaffable.", "Bottle. Pours an amber colour with a small off-white head. Aroma is caramel, pine, some hops. Taste is similar, some spices and herbs.", "First arrogant bastard I’ve drinken in a long time. Very happy about how delicious it is.", "On can. Pours an amber-reddish colour, with a big off white head. Medium retention and a good lace. Aroma of wood, caramel, pine, spices, quinine, hops. Medium body, with a great carbonation and astringent texture. Taste of caramel, spices, herbs, resines, quinine. AStringent finish. Aggresive and great beer.", "16 oz can. Pours deep mahogany with a huge tan head that lingers leaving huge lacing. Aroma of overripe fruit, sweet malt and a hint of cinammon. Fruity, sweet malt flavor, quickly giving way to long, herby and piney hops linger, leaving tongue a bit numb. Thick and oily mouthfeel with lots of warm alcohol linger. Overall, liking the balance. Not as aromatic, but good malt to hop profile.", "500ml can from Brewdog shop.\r\nBig off white head, good retention, good lacing. Hazy dark amber body. Woody nose, raisin, brown sugar, a little honey. Flavour is sweet malt, biscuit, dark fruits, hop bitterness follows and lasts well. Great mouthfeel, creamy, oily and a little sticky. Like a big bastard supercharged brown ale.", "No detail information about the malts, hops and drinktemperature on the can but an awesome story.\r\nRed brown beer with cappuccino head, heavy bitter with a long finish, after a short time you can smell the hops and very light also the malts, light bread, creamy, full body,\r\n(I have the Berlin version with best-before 13.03.2017 and produced 16.06.2016)", "0,5 l can, Berlin version. Bright red brown in the glass, big light tanned head. Looking really good. Sweet malt and fruity on the nose. Taste starts with an all overlasting bitterness. Different taste more in the background. Also alcoholic bitterness. Little bit sticky. Boring due to the bitterness. Expected wayyyy more.", "CAN 50 CL by Stone Berlin. Almost clear dark ruby-brown, nice beige head. The aroma has faint notes of caramel, more dark bread, very light roast. Traces of hops, and a hint of sweet cheese pie. Taste: just an impression of caramel, bready. The strong spicy bitterness - hoppy and slightly roasty - makes it feel dry and easy-drinkig. Light boozy notes just add to the spiciness. Silky smooth and easy-drinkig. Very good.", "Can from Berlin. Aroma rich in malts, with some bread, cherry accompanied by hoppy notes (fruity and herbal). A little bit of alcohol when warmed up. High bitterness, medium sweetness. Nice,fruity aftertaste. Not bad overall - would have been better produced in smaller can.", "W aromacie kwiaty, ciemne owoce, rodzynki, fenole, troszkę po belgijsku, słodko, bardzo przyjemnie. W wyglądzie rubinowe z gęstą, beżową pianą. Smak bogaty, z jednej strony ciemnych owoców, fig, rodzynek, przypominający triple, z drugiej chmielowa kontra w postaci ostrej grejpfrutowej goryczki, cytrusowości, ale takiej gorzkiej. Fajne połączenie szkół belgisjkiej i amerykańskiej. Finisz drożdżowy, zbożowy, karmelowy. Gdzieś tam w tle wyczuwalne akcenty z mocnych, słodowych piw. Czarna puszka idealnie pasuje do tego trunku. Ogólnie solidny amerykański strong ale, ciekawy, dość pijalny i ostry. Niezłe piwo.", "Can at Cafe Sara, june 28th 2016. Brown body with an offwhite head. Aroma of caramel, earth and pine. Strong bitterness, grass, caramel in taste, with a very light flowery note, sticky body with a bready and grassy finish.", "Pours clear deep amber/Brown with good beige head. Aromas of bread, honey and hint of herbal spice and Raisins. Good carbonation and mouth feel. Taste is malty and molasses with hint of citrus zest and pepper. Finish is medium sweet and nice bitter hit.", "Poured from a 22 oz bottle into a pint glass. The appearance is a clean dark amber/mahogany color with a finger of fluffy tan head of foam. On the aroma there is toast, caramel and toffee malt. The taste is full of toast, roast, toffee and caramel malts with a little bit of rye in the mix. The finish is fresh cedar and pine. Very woody and dry.", "Hatalmas bézs, tartós hab, barna szín. Illata enyhe, némi karamell és fűszerek. Karamell, pici pörkölt maláta, fűszerek ízei érezhetők, hosszú lecsengéssel. Selymes, közepesen testes és szénsavas, erősen keserű. Jól felépített, izgalmas sör.", "Couleur brune, forte mousse cremeuse. Nez houblonné résineux et caramel brun. Gout houblonné résineux avec caramel brun, malt, note menthe sauvage, reglisse sauvage. Corps moyen. Bonne amertume agrume pamplemousse, herbes en fin de bouche.", "Ciężko mi ocenić je obiektywnie. Z jednej strony mamy przyjemny aromat i świetny wygląd, a z drugiej ciężki, wytrwany smak, który mnie akurat drażni w tym piwie. Chyba taki był zamysł piwowara. Cóż, piwo ok, ale raczej do niego nie wrócę...", "Can from Hops & Crafts Exeter( Stone Berlin canned 21/07/17). Pours clear deep Amber with a 3 finger light beige head . Aroma f Amber malt,biscuit ,berries ,pine & hop resin,plus some caramel. Taste is malty ,caramel ,piney hop,biscuit,red berries,initially sweet but bitterness quickly kicking in with some citrus & warming alcohol. Medium bodied & smooth great mouth covering mouth feel .the finish is malty,caramelly,biscuity ,piney ,hop fruity with good bitterness & some dryness.", "Can, pours dark amber with a cream head. Quite hoppy with pine, resin and some fruity notes, caramel, toffee. Because of the aggressive bittering it’s kind of hard for the flavours to make a difference. Basically, it’s aggressively bittered and behind the great wall of bitterness there’s ’just’ an ok tasting beer to make out. It’s not bad, but somehow this beer is lost on me (ie. I don’t understand the continuous stream of rave reviews)", "This hit the spot. Caramel color. Dried fruit, cedar, pine aroma and flavor. Big piney hop bite with some great toasted malt.", "Deep orange with a medium yellow head. No lacing. Astringent and dry aroma with wood, motor-oil, orange, honny. Bitter taste of quinine, licorine, caramel and orange. Aftertaste of apples and dry apricot that lingers.", "Canned, 0.5 l.\r\nOpal reddish brown colour, creamy stabile beige head, which laces.\r\nFruity nose.\r\nTaste of dark fruits and grapefruit, aroma brings caramel, toast, resin, and citrusses, mouthfeel is syrupy.\r\nLingering and warming, bittersweet, hoppy finish.\r\nEnjoyable.", "Great Ale. Really nice aroma of American hops with great bitter taste. Really drinkable despite high alcohol volume. Definitely will try again.", "Can, bought @Beershoppen, Kolding. Pours clear dark golden to amber with a medium, staying, creamy White head. Aroma has caramel, malty bitterness, grass, sweetness. Medium carbonation, fine dry and creamy, Flavour has okay initial sweetness, does feel a tad sugary, toasted caramel. Bitterness is heavy and kinda comes off as a tad harsh. Still good though.", "Lovely dark ruby red hue, slight creamy tan membrane of foam. Aroma is deep and malty - caramel, brown sugar, cherry, plum. Taste is malty, bready, sweet to start and dry to finish. Notes of vanilla, black cherry, caramel, rye toast. Assertively bitter. There’s a mild cough-syrup impression in the finish, but beyond that, this is exceptional.", "Can. Wonderful beer. This is the standard to which you should compare all ales or pale ales: if it’s better, it’s really good.", "Bursztynowo czerwone. Piana drobna, obfita, bursztynowa. \r\nAromat gorzkawy, lekko ziołowy. \r\nDość przyjemny\r\nW smaku gorzkawe, lekko alkoholowe. Ale nie narzuca się. \r\nGorzkawy posmak. \r\nCiekawe, ale spodziewałem się czegoś więcej.", "A friendly 22 oz. brown bottle from Albertson’s joined me for this rating. ABA (which I nickname ODB) is my go-to for a cost-conscious top level ale. Great presence, just the right head for nice lacing on my tall glass stein. Really a nice nutty opening taste along with some smoke, lingers for awhile. Pine, resiny, perhaps a hint of chocolate. Complex. ABA does not slam you with a flavor jolt, just really tasty. At 7.2% ABA is elevated but does not kick your rear end. Probably my favorite right now next to some Belgians. I always try to have a bottle on hand cause you just don’t know. Oh yeah.", "Uit 50cl blik. Amber van kleur, crème kleurige schuimkraag die lang blijft, troebel....ziet er dik en rijk uit.....koolzuur is lastig te zien.\nAroma: Duidelijk rijkelijk moutig, brood/ biscuit, grapefruit, pijnboom, hoppy, aarde, grassig en een karamel hint.\nSmaak: Grapefruit, ananas, perzik, juice, volle hopbitter, pijnboom en harsachtig......een behoorlijke IPA kant aan deze Strong Ale.\nDaarnaast vol moutig (geroosterd), karamel, erg dik en Juicy en wat kruidig en netelig/floraal. Ook een lichte alcohol warmte is merkbaar. \nBody is vol, mondgevoel is zacht, romig en dik,  afdronk is lang bitter en droog.\nKLASSE Ale van Stone Berlin! En de tekst is ook erg grappig :-)", "Deep ruby color with a tan head. Strong aroma of malts, caramel, pine and hops. Complex taste of malts, oak, dried dark fruit, lacks the touch of hops, though. Full oily body, medium carbonation, medium to long finish, definitely dry, heavy bitterness. A strong ale indeed.", "Can at home. Pours dark amber with large off-white head. Aroma is mild malts. Taste is malts, oak and american hops. Medium long finish. Medium carbonation. Really nice ale.", "Can. Auburn color nice cakey head. Caramel toffee sappy resiny hops yes! Deep bitterness lasts forever really. Oily mouthfeel, so much hops. Plus points for palate smashing finish! Intense as hell and thats why it bucked the trend so hard. I remember the elvis presley San Diego county fair at del mar fairgrounds in 2002 and trying this there thinking jesus thatll kill someome. 16 years later its still a kick in the ass.", "Pours a deep amber with a modest creamy head. Malty aroma with caramel, citrus and pine needles. Full body, oily feel, average carbonation. Taste kicks off with lots of bitterness from grapefruit, coffee, roasted malt and some marzipan. Loooong and hoppy finish.", "Deep ruby red color. Medium carbonation. Malt dominated aroma with some caramel, light chocolate, and some piney hop smells. Nice balance of flavor. Deep and malty, chocolatey, with some sharp citrus hop notes to cut through. Good beer.", "Aroma; brown malts, milky hops (?), fermented milk chocolate or something, dough - hmm, very special. Look; brown, beige resistant head. Taste; hops, roasted malts, dark caramel, black chocolate, solid portion bitter fruits - leading to a solid hoppy finish with black bitter chocolate. Feel; ok, solid, straight to it. Overall; yes, it’s a strong ale. [50cl.can 7.2% BB.06MAR17, brewed in D, Stone Brewing Berlin &german barcode]", "heavy cloying sweetness, very bitter, full body, This was just a quick grab for me at the store and I guess I’m really not worthy. For me, It’s like a shot of expensive liquor: you can tell it’s really good but it wasn’t enjoyable. lol The aftertaste was great though!", "This is an epic brew. Outstanding malty bitterness with a superb dominating aroma. A solid head and an excellent mouthfeel. Like almost an IPA with a serious maltiness to it, hmm, maybe more the ale than the IPA, hard to quite work out which dominates. Excellent \n\n---Rated via Beer Buddy for iPhone", "German version. Deep copper, medium lasting beige head. Aroma if caramel, grapefruits, slightly piney. Flavours of caramel, strong bitter backones that comes right away. Grapefruites, other citrus, piney. Long verry bitter bone dry finish. Quite pungent. I would have like a hoppier nose. It's a 3 month old can always kept in a fridge so the aroma might be weaker. It probably was crazy in 1997, kinda feel outdated.\n\n---Rated via Beer Buddy for iPhone", "Pours dark red amber, with an abundant creamy head. Looks very good, and inviting.\r\nThe aroma is bready and rich of sweet malts and caramel, hopps come later but not so strong.\r\nTaste is balanced and reflects the aroma: sweet malts first, then the hops; the long lasting aftertaste is quite bitter but bearable.\r\nMedium body and carbonation, way more drinkable than expected.\r\nCertainly a good beer, but not mindblowing.", "On tap. Clear amber with tan head. Aroma of malt, caramel, bread, heavy hoppy. Sweet caramel flavour, berries, herbal hoppy bitter finish", "Aroma has richness of malts, caramel, wood and some fruits. Taste has strong malts,caramel, some roasted and some herbs. A bitter and slight harsh ending. Good,", "[Can. German edition] Aroma is dominated by caramel and some roasted malts with earthiness in the background. Reddish amber in the glass with sparkling structure. Tan foam, good lacing. The long bitterness settles on the palate. Dried fruits and coffee cherries at the finish. Really disappointing.", "Dit is een straf bier, maar dat belooft het zelf al op het blik. Aroma: koffie en zuidvruchten. Smaak: hoog bittergehalte en wat rook. Ook een aangename zoete fruitige laag.", "Can at csakajo. Dark reddish amber/mahagony colour with a small white fast disscipating head. Nose is soy saucy, light molasses. Taste is medium bitterness that turns into a high lingering bitterness. Nice hoppy red ale.", "Heard a lot so had to give it a go and wow, Massive from every angle, Sweetness on the nose, and big rich complex mouth feel with a long bitter finish. Not for a wussie :-)", "Aus der Büchse getrunken (gekauft von Stone (Berlin)). Dunkles trübes Kupfer im Glas. Schöner stabiler Schaum. In der Nase noch zurückhaltend. Aber dann.... Hopfenbombe ohnegleichen und anhaltende Restbittre. Ein sehr anspruchsvolles, knackiges IPA.", "Tap at l’express de lyon in Paris. Strong and quite bitter beer but suprisingly medium bodied. Coffee and roasted malt flavors mixed with dry fruits and a touch of nuts", "Bomber pours a cloudy dark amber with a one finger beige head and abundant lacing. Aroma is grassy, earthy, caramel sweetness. Flavor is primarily chocolate and coffee. Leaves a bitter aftertaste that lingers. This one’s OK but not really my thing.", "Aroma of caramel, dried fruits, bread and a hint of berries and and nuts. Brown with a tan head. Medium + sweet and medium bitter. Medium to full body with a soft carbonation. Dry and bitter finish. Overall an interesting Strong Ale, enjoyable.", "Tap at Stone Berlin. Pours dark amber brown with full tan and creamy head. Fruity and spicy notes, hints of lemon and yeast. Distinctive, but hard to pin down. Medium bitter taste that get stronger in the finish and is balanced by a pleasent grounding sweetness. Medium bodied with medium carbonation and a rather sparkling mouthfeel. Flavor has some fruity, grapefruit and citrus notes and a spicy peppery finish, light touch of caramel and cookies. However the bitterness is dominating the flavor, that remains somewhat hidden and difficult to grab, but nevertheless hints of it’s complexity. Warm and bitter dry finish with a medium strong bitter and lasting aftertaste. Intense and bold as promised but with a mysterious core.", "Bouteille datée du 28/04/2016, bue après un peu moins de 5 mois et avec un BB du 27/07/2016... Robe brune-orangée plutôt claire surmonté d’un léger col de mousse blanchâtre. Arômes de malt caramélisé, houblons herbacés et francs, zestes d’agrumes, cassonade. En bouche, houblons secs, cassonade brûlé, malt caramelisé et grillé. Finale amère et herbacée. Texture légèrement huileuse et corps mince à moyen. Manque de fraîcheur assuré.", "Pours clear dark brown with tan head. Bready, caramel, dried fruits, hoppy, citrus. Very bitter.\n\n---Rated via Beer Buddy for iPhone", "Can from Real Ale Newark. Deep ruby colour with a tan head. Aroma is sweet nutty, spice, bread and caramel. Taste is only light sweet initially with a big and lasting bitter finish.", "Can 500ml. Brewed in Berlin. Zadna wielka rewelacja, owszem piwo wyraziste w smaku cos miedzy belgijskim mocnym Ale a imperialnym podwojnym IPA. Pachnie chmielem amerykanskim, chyba to Amarillo. W smaku gorzkie bardzo wytrawne i zalegajace w ustach, W smaku jest sporo slodyczy, glownie lukrecja i kukulka. Kolor czerwony z kremowa i spora piana, ale opadajaca bardzo szytbko. Piwo jest alkoholowe, wiec ci Aroganci nie postarali sie aby go chociaz troche ukryc.", "Pours dark reddish brown with a tan head. Aroma is vanilla, dark fruits,dark grains, chocolate and alcohol. Taste is heavy bitter and lightly sweet.", "Dose 0,5l: Kupfer, kräftige Trübung, kräftiger stabiler mittelporiger beiger Schaum; frische + kräftig fruchtige Nase, leicht würzig, kräftige fruchtige Süße, dunkle/eingelegte Früchte, Malz, kräftig Malzzucker, dunkles Karamell, getrocknete Früchte, Backpflaumen, dezente Hopfennoten, leicht alkoholisch; frischer + sehr würziger Körper, leichte fruchtige Süße, kräftige Hopfennoten, dunkle fruchtige Bitterkeit, Röstmalz, Malzzucker, dunkles Karamell, cremig, kräftige Kohlensäure, leichte Röstaromen, Kaffee; angenehmer fruchtig-trockener Nachgang mit Hopfennoten", "Pours redish brown with a moderate white head. Hoppy, sweet, caramel aroma. Flavor is moderate sweet and moderate to heavy bitter with note of caramel, hops, alchool. Dry, heavy bitter aftertaste. Really nice!", "kindly given by bartlebier, thanks a lot! A beer you almost can’t help but like, with its entertainingly arrogant beer drinkers’ bashing on every can. Lovely deep red colour, wonderful aromas of creme brulee, pine, spruce, toffee, roasted coconut. This translates into quite a sweet, very malty taste, with piney overtones, hints of milk chocolate and a decent, sugar-coated licorice bitterness. Superrich taste for only 7,2% abv. Creamy mouthfeel. Long lasting, arrogant aftertaste of grapefruity bitterness that kind of kills the hops complexity of the next sips."]}