{"reviews": ["On tap @The Office Bar, Varaždin. Clear copper pour, two finger creamy off-white head, medium retention. Sticky lacing on the glass. Malty…", "Pours dark golden with a medium head. Aroma of citruses and malts. Taste of bread, caramel, malts. Medium bitternes. Lasting sweet and bittery taste", "Pours a cloudy amber with thin white head.\n\nAroma is lovely with marmalade, pine, apricot, pineapple and caramel. Taste is nice and bitter with good mouthfeel and nice hint of booze to keep you sipping.\n\nGood example of the style.", "Caramel,hops.sweet,medium bitterness.\nSome dryness.\nTap@Rock in the city Oulu.", "Good example of the style. Nice floral and herbal hops. Nice color and head. Medium weight.", "Has a bronze hue with a thick and creamy white head. The head left those lovely rings on the glass the whole way down. Piney aroma with a hint of blood orange. Light and crisp with notes of resin, grapefruit and bread. A bit earthy with a bitter finish.", "Brewed in Sweden (Carlsberg) Hop, fruit-grapefruit, a little pine, caramel, malt. bitter grapefruit aftertaste. Despite the commercial origin, this is a good IPA.", "Is classic IPA still something to aim for? This is a solid beer, don’t get me wrong, but it makes me wish for some of the ipa “advancements” that have been made. More subtle malt, more fruity hops, etc.", "Kedelig IPA. Ikke så frugtig i smagen og ikke super duftende. Lidt over i en lager/pilsner. Ravfarvet, ikke hazy. Middel bitterhed", "Stort glest skum. Bärnstensbrun. Ngt vörtig doft. Tämligen fyllig med ökande beska till mellanbitter. Bröd, knäck, låg sötma.", "Color dorado oscuro transparente con espuma media blanca de poca retención y residuo medio. Aroma a malta clara, tierra y hierba seca con notas a fruta madura. Sabor a malta clara o tostada, flores y hierba secas y tierra con notas a fruta madura, galleta , cítricos y ligeras especias. Dulzor y alcohol medios y amargor medio-alto con regusto medio-largo. Textura semi-oleosa, cuerpo medio y carbonatación ligera.", "Amber with a white head and a mild, hoppy nose. Mildly carbonated with a medium mouthfeel and a hoppy finish.", "The aroma is not obvious when you open the bottle, probably because the temperature is too low, pour it into the glass, you can smell citrus, tropical fruits, and herbal aroma, nice... Pale amber in colour, clear, with almost no foam. The taste of citrus is obvious in the mouth, and the taste of sand is strong. At first, I can feel the sweetness, and then suddenly the bitter taste of IPA will occupy the mouth, but it is not very bitter. The aftertaste is herbaceous, slightly sweet. This is a standard IPA, all aspects are good, there is no prominent place, there is no poor place, the price is not expensive, the first choice for entry!\nI opened another bottle tonight, and the bitter taste of the new feeling persisted in my mouth, but bitter accompanied by sweet, this is a special experience!", "Look: Pours clear light amber with a medium quite quick gone off white head. Nose: Caramel, roasted bread. Taste: Fresh, a little caramel, copper in the aftertaste, spices, medium bitterness. Overall: Nice and drinkable, but I'm thinking more brown ale than IPA, just a little more bitter.", "22.03.2016\nAR: Hopfen, Honig, Kiefer, Zitrus, Aprikose, leicht pilzig\nAP: klares goldbraun/kupfer\nTA: erdig, Harz, Frucht, Orange", "33cl bottle from local drinks store, nice recognizable aroma of floral hops and sweet fruits, also candies and some caramel.. pours clear pale copper with white foamy head.. medium bitterness i would say, especially for its 6,9% abv very drinkable and well made with very pleasant and satisfying taste of caramel, tropical fruits, grapefruit, coffee and biscuits, hops and a touch of citrus.. nice dry finish amazing taste and slight bitter mouthfeel in the end. I loved this one honestly and will get it again.", "Pite jakiś czas temu. Ocena w celu uzupełnienia profilu. \nhttps://www.instagram.com/czgr_", "Una IPA dal colore ramato e la schiuma pannosa ed abbondante. Il profumo è luppolato con sentori fruttati esotici accompagnati dal caramello. Il gusto è ben bilanciato tra il dolce del miele che si avverte inizialmente conferendogli un gusto delicato e rotondo, con sentori erbacei che ricordano la corteccia e frutta secca. Il finale è poco accentuato ma caratterizzato da note amarognole. Molto buona.", "Old rating from 19-02-15 - 330ml bottle, pours amber with a white foamy head. Aromas & tastes of citrus, caramel, fruits, toffee, pine, flora & hints of spice. Medium body. Medium bitter finish. Outstanding", "Review: 355ml bottle of Brooklyn Brewery East India Pale Ale: 6.9% vol.\n\nBottle, can, or, if you are lucky enough, draft. \n\nOn pour it looks fantastic, a good sized frothy head, some nice carbonation and a lovely dark golden colour, very appetizing, game on! Very good lacing. \n\nGet a typical IPA aroma, nice and lovely on the nose, fresh.\n\nHas a lagery smell, malty and citrus, also pine and floral notes, and a hint of spice, a bit of everything really, but it works.\n\nOnto the taste, nice and crispy on the tongue, good start, hoppy enough but on the light level.\n\nA very relaxing beer to down, easy to drink and easy to enjoy. Nice creamy tastes, caramel also noted. \n\nNot extraordinary but does the business and I think that’s the whole point of this brew, an IPA for the everyman drinker to enjoy as well as the craft beer nerd.  \n\nOverall I like it, its nice, clean and well balanced, very drinkable, and has a little bite to it which I always like, of course! A 6.9% ABV. that is well hidden!\n\nRecommended and I will be buying again. I knew Brooklyn Brewery wouldn’t let me down…….", "It’s definitely east coast, but not english. Danky hop charcter, but clean and refreshing. Very well made for the style. Craftbier shop adventkalendar", "Kobber uklar skum hvid \nCitrus lys malt grape brød \nBitter meget sød modrate \nOile blød", "Clear but dark golden pour. Reminds me a lot of lager beer, but bitter after taste, not my favorite IPA but way tastier than the Kona IPA", "Bière achetée chez Saveur bière. Nez porté sur les agrumes, en bouche, cette bière est agréable avec moins de notes fruitées qu'au nez, l'amertume est bien équilibrée.", "Colore giallo paglierino, schiuma alta, cremosa e persistente.\nAl naso si sente subito il luppolo e note agrumate.\nIn bocca caramello, nel finale ancora luppolo.\nCarbonazione bassa, finale secco.\nNel complesso bevuta molto piacevole.", "Cerveza con un color ámbar claro y pálido, la espuma era persistente, y con notas florales y frutales. El amargor no se hizo esperar, dejando un retrogusto muy amargo.", "Bière blonde dorée, mousse non persistante, légère trace de mousse en surface.\nNez sur l'agrume, notes de pamplemousse et un peu sur le citron vert  et légèrement métallique.\nEn bouche, amertume en premier abord retour sur l'agrume et finish sur une amertume qui s'estompe progressivement.\nBonne carbonatation.", "Pale copper, small white head. Floral aroma, malt base is a bit thin, euro lager style. Some butterscotch and marmalade, bitter, balanced sweetness.", "Basic delicious IPA with everything it needs to provide. Summer i guess is the best season to enjoy. Mellow but strong hops that wraps up the tongue completely and flushes down quick because of the low carbonation. Good.", "Bra tryck i malten som med humlens hjälp drar till. Toppenöl som måltidsdryck när du du vill framhäva smaker i alla elementen.", "Fles thuis geprobeerd. Het is een donker gougeel bier met een stevig wit schuim. Het aroma is moutig en fruitig. De smaak is moutig, bitter en grapefruit achtig met een wat zoete afdronk.", "Bottle, 33 cl @summerhouse. Pours a clear golden with a frothy white head. A little bubble gum in the nose, bready malt. Taste is medium bitter and burnt caramel. Moderate bitter finish. Slightly oily mouthfeel. Medium carbonation. A nice ordinary beer with a lot of value for money.", "Barwa bursztynowa, mętne. Piana gęsta, czapa utrzymuje się bardzo długo. Ładnie oblepia szkło. Nuty leśne i żywiczne w aromacie. W smaku pomarańcz, grejpfrut. Wyraźna, przyjemna goryczka. Mocno pijalne, alkohol niewyczuwalny.", "Un vrai régal. L’amertume est bien présente mais ce n’est que mieux. Parfaite !", "Classic pilsner look with white head and very yellow. Smell of hops and fruits. Taste of hops with a good bitter aftertaste. Has a bit of stout in mouthfeel. Very nice and refreshing beer to drink on the boat to Samsø", "Aroma of hops and sweet fruits\nLager colour (orange piss) with large lasting head\nTaste of bitter hops, but with a twist of stout (dark malts) quite nice. Slight alcohol hints\nWatery mouthfeel with very mild carbonation\nDecent indeed!", "AROMAT: mocne, dominujące nuty kwiatowo-cytrusowe (w butelce, w szklance mniej intensywne)\n\nWYGLĄD: barwa ciemnozłota, piana drobna, obfita, długo utrzymująca się, lekko opalizujące\n\nSMAK: dominuje \"kwiatowość\" z lekką podbudową słodową; odczuwalna alkoholowość \n\nGORYCZKA: średniowysoka, długo utrzymująca się, ale przyjemna\n\nODCZUCIE W USTACH: nagazowanie średnie/średnioniskie, pełnia średnia może nawet do średniowysokiej\n\nPiwo całkiem pijalne. Osobiście lekko przeszkadza mi zbytnia alkoholowość przechodząca w jakiś bliżej niezidentyfikowany ester (??), lecz jest to STRONG east ipa, więc mieści się to raczej w granicach stylu", "Orange color, big bubbles, but foam which falls very quickly. Very clear beer. \nNose on malt, caramel, and fruity notes.\nMouth on caramel, smoky notes too. Fruity (orange, peach) and freshness. Medium bitterness and medium sweet finish.", "Frisk, let drikkelig ipa. God bitterhed i smagen, måske en smule sød, skummende også en del. Ikke meget efter at smag.", "Bernstein, tolle Krone, voller runder Körper, schön eingebundene Bitterkeit, Maracuja, Citrus, Orangeat.", "Mało chmielowe a bardziej słodowe. Smakuje trochę jak mocny nachmielony lager. Być może wrażenie źle bo blisko daty przydatności. Kupił e za 2.50zł w Tesco i w tej cenie to może i sztos ale oryginalnie prawie 10 PLN i w tej cenie to przeciętna pozycja. \nCo do piwa to na pewno ładna piana. Barwa bursztynowa też ok. Brak wyraźnej owocowości a aromat słaby.", "355 ml bottle, BB Aug 29th 2020. Clear, golden amber, medium white head, nice lacing, lively carbnation. Nice aroma, balanced malts vs hops notes. Rich muthfeel, slightly bitter, light alcohol notes at the back of my throat. Flavours are malty, piny and resiny, long aftertaste with caramel notes. Considering this bottle is six months old, it's still a really Nice beer.", "Tap(Rusty Rat, Wrocław) Jest źle. Zero chmieli. W zapachu nic, w smaku słodko gorzkie. Paskudne i nieprzyjemne.", "Aroma is bit unsuitable with hard candies note, minimal fruitiness and tobacco herbal note. Taste is semi dry with a notes of unknown fruity bites, herbal abrupt bitterness and bit watery base. Not really fresh.", "En IPA med mycket smak som tog kraftiga svängar i munnen, svängarna hade olika grader vissa var snäva medans andra var långa. Fruktig var den också!", "Fin flaska, förhållandevist dyr. En någorlunda okej smak ändå, men inviger ej drickaren i en känsla av mersmak. Men har hög procenthalt så den duger till syfter. Sulle dricka igen om inget bättre finns.", "12oz bottle at The Parish Cafe, Boston on 20/08/2008.  This was such a nice IPA, at the time.  Really zippy and citrusy with a nice malt base.", "0,355 l bottle from Systembolaget, Gothenburg. Good and drinkable IPA, long time known and tasted", "Bottle from supermarket in Copenhagen\n\nNice, deep-golden color. Hazy. Substantial, off-white head lasting several sips.\nNose is like a flower bouquet with a strong, slightly soapy, royal hops scent (something I've really come to enjoy).\n\nTaste has notes of herbs, a not-too-synthetic flower petal sweetness and a very balanced hops bitterness that effectively hides any trace of ethanol. \n\nMedium body, soft and pleasant mouthfeel, medium fizzyness. A layered beer... One of the better ones. Have it with pizza.", "Wytrawne, goryczkowe, chmielenie bardziej ziołowe,ziemiste, przyjemne do posiłku", "W aromacie słodowe, karmelowe, trochę ziół i cytrusów. Smak na początku mocno słodowy, po chwili na pierwszy plan przesuwa się wyraźna goryczka grejpfrutowo-ziołowa (łodygowa), może też jest tu trochę nur żywicznych. IPA w \"starym\" stylu, ale też taka nijaka przypominała mi tę IPA od Książęcego. Do wypicia i zapomnienia.", "Amber clear with a thin head.\nRich IPA smell, but a bit rotten. A strong but agreeable bitterness in taste, nonetheless there is something off in this beer. Low carbonation.\nIt's the second beer I'm having from this brewery. Both of them were funky, in a negative way, although in this one the funk is not as strong.\nAre they using the water from the NYC waterways to brew their beers at the Brooklyn brewery?", "Clear golden pour with white head, good retention. Aroma is rather weak, soft hoppy. Taste is better: resinous, grassy, clear hop bitterness. OK carbo. Nice IPA , although I don't know what's East about it.", "( on tap)\nAroma: pine, citrus fruits, bit malty\nTaste: semi-dry, flavour of pine, grapefruit, citrus fruits and malt.\nPalate: medium body, medium carbonation.\nOverall: Decent.", "Barwa ciemnozłota, zamglone, piana biała, dość obfita, średnio trwała. W aromacie lekkie cytrusy, tropiki, nieco karmelu. W smaku słodowe, lekko karmelowe, leciutkie owoce tropikalne, trochę estrów. Goryczka niska, wysycenie i ciało w normie. Nudne, nawet jak na East Coast.", "Draught @ Kaivopihan Karaokekellari, Helsinki. Sweet, malty and caramely with some hints of hops, toffee, pine, grass and orange peel. Decent.", "Belle dorée/ambrée super limpide mais petite mousse.\nNez caramel, fruits oranges, prunes.\nBouche douce, légèrement sucrée, goûts de fruits, caramel.\nRondeur et amertume : sympa !", "W aromacie dość szeroki bukiet. Jest trochę cytrusowo, trochę kwiatowo, czuć tropikalne owoce, a w tle gdzieś majaczy żywica i biszkopty od słodu. W smaku już trochę gorzej. Dość mocno czuć alkohol, który spycha na dalszy plan ziołowe akcenty chmielu i taką nawet przyjemną chlebowość od słodu. Nie czuć karmelu, trochę też mało ciała jak na east coast, mimo wysokiego ekstraktu. Goryczka intensywna ale czuć ten alkohol do samego końca.", "lattina 50 cl, schiuma bianco sporco fine media persistenza, colore ambrato limpido, al naso è scarsina leggero malto e frutta tropicale, in bocca malto caramello e leggero agrumi, corpo leggero, alcool ben bilanciato, carbonazione moderata, amaro accentuato lungo nel finale. Scarsa anonima, da bere proprio in una lattina da 50 cl come una lager da battaglia. c. COOP Tenero 09.11.19", "Riktigt god öl med mycket smak.\nPassar bra till mat eller bara att sitta och ta några med polarna", "Barwa złota, lekko zamglone. Piana bardzo ładna, obfita, drobnopęcherzykowa, oblepia szkło.\nAromat niezbyt intensywny, słodowo - karmelowy. \nW smaku słodowo-owocowe z lekkim, nie przeszkadzającym karmelem i średnią, nieco trawiastą, łodygową goryczką. Sporo ciała, wysycenie średnie.\nCałkiem dobre i w stylu.", "La IPA de brooklyn brewery une classique très légère peut-être un peu trop en goût. Simple à trouver !", "Piana średnio obfita, drobne i średnie pęcherzyki, dość szybko się redukuje, zostawia szczątkowy lacing. Barwa złota, delikatnie zamglone.\nW aromacie jasny słód, chmiel, nieco banana, nieco miodu.\nW smaku dużo owocowych estrów, głównie jabłko, gruszka, banan, białe owoce. Poza tym nieco aromatów chmielowych, całkiem sporo jasnego słodu.\nGoryczka niska do średniej, ale zalega, nieco ziołowa i chemiczna w odczuciu. Wysycenie średnie do wysokiego. Pełnia średnia do niskiej, w porządku.", "220320 Aromat chmielowe, bardzo cukrowe,, ogólnie coś czuć, ale mało, zapach metaliczny.\nJasno pomarańczowe, klarowne, piana biała ale znika później \nDominujące smaki chmielowe, goryczka duża, ale nie utrzymująca, słodyczy mało.\nNagazowanie średnie, ciało lekkie, trochę ściągająca goryczka, alkohol niewyczuwalna, finisz bardzo gorzki\nPrzypomina trochę bardziej pilsa z takim smaczkami owocowymi z ipy, ogólnie do wypicia można jeszcze kupić i wypić.", "Uzupełnienie ocen piwnych bez opisu z uwagi na przeniesienie z papierowych zapisków.", "Appearance: bright golden,  slight head\nAroma: fresh hops, pine, fruits\nPalate: medium full mouthfeel, medium carbonation\nTaste: fresh, bright, hop forward with tropical fruits. Malt underlying\nOverall: really enjoyed this beer. The ABV is well hidden", "An IPA as I did learn to drink in the USA (eastcoast) around 2015.\na pale golden beer. Resiny,  fruity, zesty, grassy, malty, slightly flowery and a quite bitter aftertaste. I still love these beers and this is a nice example of that style.", "Bottle. Clear light amber, thick but ugly, white head, some lacing. Aroma resin, grassy, malty, slightly flowers, fruity, zesty. Taste thick, smooth, full, somewhat caramel. Carbonation medium to high, tingling. Bitterness high, grassy, herbal, short, nice. Aftertaste grassy, malty, fruity. Good.", "4.08.19, butelka z datą do 14.02.20\nAromat mało intensywny, słodowo-kwiatowy. Smak również nijaki, niemal wyłącznie słodowy, z wyraźnym diacetylem. Średnio-niskie ciało. Goryczka średnio niska, ale nieprzyjemna, łodygowa.", "Klarowne z obfitą pianą. Nieco zbyt jasne. W aromacie głównie dzikie drożdże. W smaku goryczka, cytrusy, dość intensywne. Jest też posmak kwiatowy. W smaku i wyglądzie bardzo dobre.", "Ambergold mit hellbraunem Stich im Glas, dazu stabiler Schaum. In der Nase beerenfruchtig-malzig mit herbem Einschlag. Im Antrunk zuerst bitter, dann Honigmelone, Brombeere, Johannisbeere und Haferkeks mit Rosinen. Malzig-brotiger Nachgeschmack mit herbem Abgang. Erfrischend und rund.", "Golden colour, hazy, small head. Aroma is herbal hops, white bread, biscuit, alcohol, some lemon. Heavy bitterness. English in character. A bit too alcoholic. Decent.", "355 ml bottle from the local supermarket. Appearance is a hazy dull dark gold, with a finger of white froth which has moderate retention. Aroma is lightly hopped with fruity notes, but gone in a flash, and only has malt and years remaining. Taste again is lightly fruity at the start for a brief while, and then malty with a light and short bitter finish.", "Amber color, clear, nice head. Hoppy, fruity, resin nose with some granulate. Intensive, dry, bitter. Good old fashioned ipa.", "W sumie całkiem niezłe. Zapach chmielu takiego ziołowego. W smaku też się on przebija. Bez zbędnych i nieprzyjemnych aromatów.", "Złote, klarowne, piana średnia oczka, nietrwała, dość szybko zredukowała do obrączki i szczątkowej tafli. W aromacie ziołowo-biszkoptowe, mało intensywne. W smaku wyraźna baza słodowa, przełamania równie wyraźną ziołową i wysoką goryczką, niestety mało szlachetną bo z mocnym alkoholowym akcentem. Nasycenie wysokie, duże bąble. Niby stara szkoła, ale jakieś niezbalansowane.", "Robe ambrée, faible mousse blanche. Nez fruité, résine. Goût épicé, amertume. Faible longueur. Agréable.", "Karmelkowe, mdłe, nijakie. Ogólnie nieprzyjemne w piciu, okropna goryczka. Słabe.", "Piwo złociste z białą obfitą piana. W aromacie przyjemnie cytrusowe aczkowiek aromat mógłby być intensywniejszy. W smaku wytrawne cytrusowe z przyjemną goryczką. Bardzo poprawne ipa, szyblo znika ze szklanki.", "On tap in dubai. Nice golden amber color. Nose is warm and buiscuty, with ops hops. Taste doesn't disappoint. Lovely biscuit, and creamy. Good fans lasting finish. Happy with it", "W aromacie karmel i lekko owocowy. Barwa pomarańczowa, piana drobniutka, bardzo ładna. W smaku karmelowe, lekki cytrus, półwytrawne, pełne. Goryczka niska do średniej, przyjemna, wysycenie średnie. Na finiszu lekko słodkie. Lekki żelazo w smaku ale na skórze nie wychodzi. Taki ugrzeczniony east coast który sam w sobie jest łagodnym stylem.", "De geur is enorm citrusachtig. Weinig schuim als je uitschenkt. De smaak valt nog mee voor een ipa. Een van de betere ipas. Gekocht in liqormarket in Puerto Plata.", "Butelka 0,33 l, warzone na licencji przez Carlsberg Sverige. Piwo jasnomiedziane, klarowne. Piana biała, bardzo obfita, gęsta, trwała, piękny lacing. Aromat średnio intensywny, nuty biszkoptowe, karmelowe, żywicy, cytryny, leki cebulkowe (z butelki bardzo silne), po ogrzaniu wychodzi lekka szmata. W smaku umiarkowanie słodkie, słodowość, ciasteczka, karmel, żywica, ziołowość, lekki cytrus, finisz dosyć długi, chmielowy. Pełnia średnia, wysycenie średnie, goryczka średnio intensywna, żywiczno-ziołowa, lekko zalegająca. Ogólnie taki średniak, choć dość pijalny mimo karmelu, raczej na plus niż na minus.", "(nez moyen (faiblesse), bouche generous, first hop-poivrée-pamp, agrumée, back ~fleuri-sec, last ~pin-herbé, s’adoucit)", "Beer with copper color, clear aspect, soft to medium bitterness, good volume of foam on top, soft carbonized, (shared a 35,5cl bottle beer with PG, bought it at \"Supercor\", Braga, PT #896)(#6 US)(#1 NY).", "Piwo klarowne, ładna piana, dość długo się utrzymuje. AROMAT: słodowo chmielowy, lekka metaliczniść od chmielu, poza tym czysto jakby lagerowo. SMAK: średnio pełne, słodowe. Delikatne motywy cytrusowe. Przyjemna delikatna goryczka. Piwo pozostawia jakiś sztucznawy mydlany posmak. Bardzo ugrzecznione aż nudne.", "Barwa złota, piwo krystalicznie klarowne, piana biała. \nAromat malo intesnywny, słodkie pieczywo i tytoniowa nuta chimielu, w tle słodkie czerwone jabłko.\nW smaku chlebowa słodycz, niuanse karmelowe, i średniej wysokości goryczka.", "Bottle. Hazy orange with a medium white head. Aroma: Lemon, pine, grape, grass and yeast. Taste: Quite bitter but a pleasent and crisp, citrussy kind. Balanced nicely by malty sweetness", "In aroma slightly citrusy, but mostly herby. In taste little sweet, sour, with strong ammount of bitterness.", "Pours a golden orange with white head. Light fruity-cardboard aroma and taste. \n\nNotes: bottle pour, Apr ‘19", "barwa cherbaciaana kalrowne. piana srednie oczka pozostaje mala warstwa. aromat chmiel i delikatny karmel. Smak karmel czerwone owoce. goryczka wysoka. wysycenie ciut zawysokie", "Was mit einem \"East India Pale Ale\" gemeint ist, ist mir bis heute nicht ganz klar, aber es muss wohl ein stärkeres IPA sein. Also wem ein amerikanisches IPA zu langweilig ist, der kann zu diesem greifen. \nEs ist eine Hopfensuppe, die ihresgleichen sucht. Dabei hat es schöne fruchtige Aromen, welche nett kombiniert sind. Mir persönlich sticht aber die Bitteres einfach zu stark hervor.", "Bue en pression au Vertigo (Caen)\nNez tropical de pamplemousse.\nRobe ambrée translucide.\nMousse légère.\nEn bouche amertume sèche de pamplemousse et côté juteux de fruit de la passion.", "Barwa mocna złota, klarowna, piana średnia zostawia małą obrączkę. Aromat cytrusowy z wyczuwalną żywicą później zanika i prawie nic nie zostaje. W smaku także bardzo lekkie cytrusy i słodycz, trochę to wszystko zbyt ulotne, uciekające. Goryczka niska, piwo średnie, brak intensywności zarówno w aromacie jak i w smaku.", "Ciemnozłote, klarowne piwo o obfitej pisanie, która zdobi szkło i pozostaje do końca w formie warstewki na powierzchni. Aromat chmielowy, cytrusowy. W smaku słodowe z lekką nutą chmielu. Goryczka średnia. Ogólnie całkiem udane IPA, ma fajny cytrusowy aromat.", "Draft at America Graffiti, Rimini, Italy. Pours brilliant gold with moderate white foam, not persistent and very fine. Aroma is hoppy, malty, citrus. Body is average, like carbonation. Taste is fairly bitter, but well balanced. Finish is average.", "Piana srednia i srednio trwa;a, w aromacie cytrusy, w smaku zywica, cytrusowosc, nieco wrzosowego miodu. Piwo pozostawia troche goryczy po przelknieciu na pewien czas", "12 oz. Clear golden to pale orange appearance with a fluffy, lingering white head. Aroma of floral hops, fresh pine, toasted grain, mild earthiness and a light herbal spice.  Similar flavor, adding mild to moderate bitterness that lingers with a touch of sweetness. Medium body with ample carbonation and a smooth finish. Solid.", "Malty aroma with some hints of citrus. Refreshing, a hint of pine, plenty of malt notes, some citrus and a lovely lingering bitterness. A solid beer overall", "In tap at East Market, Milano, Italy. It pours orange, with a medium, white head. Aroma is orange and citrus. Taste is medium bitter. Body is medium, carbonation is average.", "Resiny, floral and flavoursome. Lychee and bubblegum, satisfying in the mouth and really drinkable. Much better than anticipated, very enjoyable.", "Fairly straightforward IPA - hoppy bitter with some flower aroma. Pleasant head.", "Piana niezbyt bujna. Aromat na początku przyjemnie cytrusowy, ananasowy, lekko słodowy. Potem niemal kompletnie się rozwiewa i pozostaje tylko coś nie do końca przyjemnego. W smaku słodko, landrynkowo, troszeczkę owocowo, po prostu pusto. Goryczka o ile jest, to jest raczej nieprzyjemna. Słabo, nie warto.", "500 ml can at home, bb. 20.1.2020. Pours a clear amber with a white head. The aroma is lightly to medium hoppy and lightly malty with some pine, hints of citric fruits, some herbal notes and bready, biscuity malt in the back. Medium body with a light to medium sweetness and a medium bitterness. The flavor is medium hoppy and lightly to medium malty, similar to the smell, lots of pine, hints of resin, bread, biscuit, hints of honey. Finishes with a light hoppy bitterness. Clean, not exciting but good.\n\nAroma: 7\nAppearance: 4\nTaste: 7\nPalate: 4\nOverall: 12", "Can. Orange citrus aroma with notes of grapefruit, grassy hops and grainy malt. Pours clear golden amber colored with a large off white head that has excellent retention and good lacing. Starts with bright orange citrus and grainy malt flavors. Finishes dry with grapefruit and grassy hop flavors with a sharp bitterness that lingers on the palate after each sip. Pretty nice ipa.", "同一天在🇭🇰将军澳中心商场的jason超商买的都说在上海有 我从来也没有看到过 这次在🇭🇰找到了 果真亚洲的世界之都 全英文 看着眼花 入口后带着明显柑柠的香气 一口就让我想起日本版酿酒狗的punk ipa 香气十足 我一直很喜欢这个味道", "Aromat karmelowo-słodowy i cytrusowy. W smaku pełne, dosyć słodkie z chmielową kontrą. Sama chmielowość jednak niezbyt szlachetna. W porównaniu z Atakiem Karmel... Chmielu wypada blado. Nawet z wczesnymi warkami.\nI tak niezłe", "Ciekawe piwo. Ciekawy smak. Lekko bursztynowy kolor, zapach dość intensywny, w smaku orzeźwiające.", "Me parece demasiado filtrada es mas de apariencia i dustrial pero de aroma y sabor muy correctos y agradables. Me ha gustado. Es una cerveza apata para cualquiera", "Riecht fruchtig nach Mango. Orangenes Bier, wenig Schaum. Der Antrunk ist sehr fruchtig. Schmeckt stark mach Mango, schön herb im Nachtrunk. Nice", "Bière 33 cl obtenue dans un calendrier de l'avent. Blonde transparente. Nez plutôt neutre, manque de notes tropicales. En bouche, pas mauvaise mais plutôt du tout venant, moi qui apprécie ce style je ne suis emballé par celle-ci.", "0,35l bottle. Pours clear golden with white head. Aroma of juicy orange, grapefruit, british hoppiness. Taste is orange, orange peel, grapefruit, tangerine, slightly fruity, peaches, british bitter hops in the finish.", "Amber beer. Bouquet of hops, citrus. In the mouth a pleasant bitter taste\nBirra ambrata. Profumo di luppolo, agrumi. In bocca sentore amaro piacevole", "Zapach średnio intensywny, słód, cytrusy, karmel, zioła, ziemia. Kolor bursztynowy, klarowne. Piana średnio obfita, drobna, średnio trwała, lekki lacing. W smaku umiarkowana słodycz, średnia pełnia, słód, cytrusy, karmel, żywica, zioła. Goryczka średnia, wysycenie średnie.", "Not what I was expecting but decent nonetheless. Malty predominantly with some grassy hop flavours sitting behind. Medium bodied and pleasant bitterness.", "This is my first IPA directly from USA. Maybe this is an auto suggestion but i wasn't drink good beer in this style. Superb flavor. Bitterness not to many. Nice foam and clearness. Perfect IPA for me", "Light amber body and white head. Sweet fruity, some herbs and hints of caramel aroma. Sweet and dry bread and hints of ice tea flavour. Bitter finish. A good beer.", "Can 355 ml from Tesco. Bitter with tropical fruit, citrus and grass. Sweet aroma of tropical fruit, citrus. Drank it straight from the can.", "Bursztynowe klarowne piwo z niezłą białą pianą która opadając ładnie zdobi szkło. Aromat słodowy, chmielowy nuty lasu. Smak wytrawny z dobrą podbudową słodową, goryczka z akcentami lasu żywica, iglaki. W sumie niezła IPA w stylu East coast", "Piwko poprawne. Chmiele, cytrusy, goryczka. Dużo piany. Słodowa IPA. Za tą cenę w Polsce robi się lepsze piwa.", "the aroma is hoppy and fruity with hints of orange, grapefruit, pine, lemon peel, key lime and spicy herbs... the taste is fruity and hoppy with notes of sweet orange, grapefruit, pine needles, kumquat and spicy grasses... the aftertaste is sweet, bitter and dry...", "Õlle on selline jook, et iga uus kord kui klaasi või pudeli suule tõstad, siis leiad midagi uut, sõltuvalt tuhandest-miljonist pisiasjast, mis hetke olukorda mõjutavad. Seega piirdun iga õlle juures selle tekstiga.", "5/4/6/3/11.\r\nBrooklyn East IPA, pasteryzowane, 6,9%. Warzone w Brooklyn Brewery, dystrybutor: Carlsberg Polska Sp. z o.o.\r\nZłote, klarowne, z dobrą pianą. Aromat słodki, miodowy, z nutami kwiatów, owoców tropikalnych i cytrusów. W smaku słodycz, choć nie aż tak uderzająca jak w aromacie, lekka goryczka.", "Aromaty słodkie, karmelowe, trącające o miód. W smaku jest wyważona goryczka na mocnej podbudowie słodowej.  Fajna, nie przegięta dawka chmielu, orzeźwia to piwo, ale nie czyni go napojem cytrusowym. Bardzo porządne piwo.", "Bardzo fajne piwko. Typowe aromaty i smak chmieli brytyjskich, przede wszystkim żywica, plus wyczuwalne również cytrusy. Konkretne piwo, z mocną goryczką, ale nie zalegającą. Piwo bardzo solidne, wyraziste, ale nadal pijalne.\nedit: uwaga na butelki z supermarketów z krótką datą ważności, zdarzają się piwa wykastrowane ze smaku i aromatu", "[25.10.18] tap @PP. Aromat: karmel, zolte owoce w miodzie. Smak: konkretna zywicznosc, ziolowosc, slodkosc, taka rozmyta goryczka w posmaku. 2,3/5", "Clear golden with a medium white head. Aroma is caramel, bread, flowers and malt. Taste is medium bitter and light sweet", "On tap in Uppsala, Sweden.\nAroma is tropical fruit and iced tea. \nAppearance is clear amber with a white head. \nTaste is sweet and dry with citrus, bread and iced tea. \nPalate is sweet, bitter, then a dry finish with high carbonation and fine bubbles. \nOverall is sweet but drying finish and high carbonation is not pleasant.", "Pachnie delikatnie cytrusami, nic specjalnego. Wygląda kapitalnie, wysoka czapa piany, bursztynowe i klarowne. Goryczka karmelowo-żywiczna. To połączenie chmieli daje jakimś cudem wrażenie a'la Mosaic, ale tego chmielu tu nie ma, więc pewnie mi się wydaje. W sumie goryczka średnia do niższej, ale przez ten karmel sesyjnym w smaku bym go nie nazwał. Alkohol dodaje ciała.", "355ml can. Golden in colour and very clear with a small white head. A very sweet hop presence. This is followed through on the taste; a liquorice quality. Okay, but it's really not beyond that. It's East IPA tag might be slightly outdated and in need of a change due to the influx of NEIPA's... as this is definitely a west coast style.. but strange and lacking.", "Tap at Lawendowa. Clear dark orange beer, average white head, good lacing. Aroma of resin, herbs, some citrus and caramel. Taste is very light sweet, medium to heavy bitter, resin, citrus, grapefruit, herbs. Mild bitter resiny and herbal finish. Medium- body, average carbonation. Decent stuff.", "Bottle perhaps a bit old, label very torn and beat up. Some oxidation on the nose, hops are there though, along with a nice strong malt character. A bit of bit a lingering alcohol but pleasant to drink all the same.", "Flaska 355 ml från Systembolaget. Guldfärgad med vitt skum. Doft av humle, ananas och kåda. Smak av humle, ananas, torkad frukt, tallkåda och citrus. Rejäl beska som ligger kvar i gomen.", "Bouteille 35.5cl le 28/07/2018. Verre Saveur Bière. DDM : 11/04/2019.\r\n\r\nMousse : Mousse blanche, 3mm, s’estompe rapidement, grosses bulles.\r\nLiquide : Orange, limpide.\r\nNez : Fruité, caramel, malt, fruit de la passion, agrumes.\r\nBouche : Malt, houblon, fruits, agrumes, résineux.\r\nPalais : Equilibré, très belle douceur avec un final sur l’amertume.", "Nice IPA beer with a pleasant citrus flavor and a good bitter finish. Average carbonation. Clear crisp flavor. Good beer for a hot summer day. Nothing special here.", "Wypite w Pils Pub w Mediolanie. Mocno karmelowe w smaku. Jest też troche cytrusów i żywiczności.", "06-09-18 // 330ml bottle at Guleut mainz. Tradtitional easy IpA with alight body and a hop bitterness. Not much frzit like nowadays. Just simple.", "Cette bière présente une fine mousse crémeuse, une belle robe doré parsemé de fines bulles . Un savant mélange de houblon qui nous apporte un bon équilibre entre amertume et douceur", "W aromacie karmel, czerwone owoce, cytrusy, nuty słodowe. Z wyglądu złote, klarowne, piana biała, całkiem spora. W smaku słodkie, owocowo-karmelowe, pijalność wysoka, goryczka średnia ziołowa. Ogólnie przyzwoita karmelowa ipa", "Strong beer with a slightly too bitter taste for me.\n\nNice bottle and good colour.", "Bottle. Clear deep golden liquid. Moderate white head of average retention. Aroma: honey, nectar, minor resin. Medium body. Taste: rather sweet, massive and clean biscuit malts, additional resiny hops. Medium bitterness. Ok, let's try a fresher one.", "Draft at Hudson's Ribs & Fish (Fishkill, NY). I had tried Brooklyn Lager probably 2 years ago, didn't like it, had been steering away from Brooklyn altogether, but this East IPA was the only craft IPA on draft. It was good! Deeper golden color, clear, with a inch of head. Just shy of a medium body. Smooth drinking and finish. Nice hoppy aroma and bite with citrus followed by very slight sweetness in the background. I enjoyed this and would try it again.   \nUpdate 12/24/2018:  Same restaurant, forgot that had this East IPA before and was as pleasantly surprised the second time as my first review so I am inching the rating up a notch.", "IPA dall'aroma di agrumi e luppoli. Sapore luppolato con agrumi appena accennati, amara ma non torppo. Finale secco.", "Piwo z super historią, bardzo fajnie, że wbija na Polski rynek z dość dużą pompą. Idealne do wypicia w towarzystwie znajomych - bez zadęcia, bez fajerwerków, jednakże na duży plus - cena.", "Lovely volumeius IPA. Aroma is hoppy and floral. Taste is fresh but a bit thin. Above average bitter finish.", "On tap at the Delta Sky Club @ JFK \n\r\nPours dark golden with a medium sized off-white head, light lacing. Citrus, fruity, malts and pine \n\r\nDecent", "355ml bottle from RusBeerShop in Moscow. Bottled in 2017 but still in date. Pours clear gold with a tall off-white head. Aroma is dank hops, caramel, malt, marmalade. Does not smell fresh. Taste is pine, citrus, biscuity malt, big bitterness.", "Täyteläisen hajuinen ja makuinen olut, joka sopi kesäiltaan aurajoen jokilaivassa kuin nyrkki silmään.", "355ml brown bottle poured into a pint glass. Appearance is clear golden with a small frothy white head that reduced quickly. Aroma of pine needles, orange peels, caramel, toast and a hint of brown sugar. Taste is medium-heavy sweet and medium bitter. Palate is full bodied, slightly sticky texture and average carbonation. Brooklyn East IPA is overall a good beer, but somewhat sweeter than I like.", "Gyllene, klar. Lätt humledoft. Smaken som en kraftigt humlad lager. Gott utan att vara något särskilt.", "Bottle golden dark, clear. Classic beer, fine but nothing special. Aroma of mandarine and malt, taste of caramel and pamplemousse peel. bitter, and not a lot of aroma for an east IPA. \n\n---Rated via Beer Buddy for iPhone", "From Club del Gourmet of El Corte Ingles. In Teku glass. Playing Avernum 3. More close to an american amber than an english IPA, has a delicious malty profile, with biscuity and resinous notes and perfect bitterness", "Ar: slightly hopped, malt Ap: orange, creamy head T: med/high bitterness, med sweetness P: lively carb, med body", "Bouteille 335,5cl\n\r\nMousse : Mousse blanche consistante et assez compacte\n\r\nCouleur : Robe orange, limpide et brillante\n\r\nNez : Nez malté, houblon fruité, orange. Nez peu développé en comparaison à la bouche.\n\r\nBouche : Corps malté, houblon amer équilibré par des saveurs d’orange, soupçon malt biscuit / caramélisé, amertume fruitée, légèrement résineuse pour un final assez sec et sucré.\n\r\nAvis : IPA américaine incontestablement maltée, et aux saveurs de houblon fruité puissant. Une IPA de caractère, en opposition aux IPA rafraîchissantes.", "Gold schimmernde Farbe mitfeinporigem Schaum, dominierende malzige Noten gepaart mit dezenten Bitternoten. Nicht ganz mein Stil aber dennoch solides Bier der Craftbeer Pioniere aus New York.", "Citrus, tropical fruits, ice tea, herbs and malts in nose. Pours amber with white head. Taste is medium dry to medium sweet with cereal, bread, citrus, herbs and ice tea. Medium bitter long lasting finish, lively to average carbo. Overall coarse and rather boring. On tap at Pogoń w Piwnicy, Sosnowiec.", "Złote, klarowne ze słabą pianą. Mało intensywny aromat, trochę amerykańskich chmieli i słodowosci. W smaku zdecydowanie lepiej, ale trochę nudno. Spora pełnia, niskie nasycenie i ułożona, średnia goryczka z długim finiszem.", "Can. Clear golden pour with massive white head. Sweet apricot aroma. Taste is sweet, jammy, boiled sweets, moderate bitterness, alcohol well hidden. Nice old school IPA.", "Let drikkelig IPA. Fås billigt i blandt andet netto. 15 kr. Gyldenbrun. Dufter af citrus. Smag er citrus og let humlet. Klassisk sommerøl", "Fles 33cl thuis. Goed bitter, cinnamon, frisse zoettonen, wat maltig. (12-2015).", "Bärnstensfärgad. Smakrik men lite ointressant och tråkig. Lämnade till och med lite kvar i glaset.", "Das fand ich wirklich ein gutes IPA-Bier... kräftig aber nicht zu herb... eine 5 ist völlig ok!\n\n---Rated via Beer Buddy for iPhone", "Pretty good in the style of a true British IPA. Little aroma. Dark Golden alert color with white head, great lacing. Clean bitterness.", "Thuis uit een flesje van de afwijkende inhoud van 355 ml. Helder geel, wit schuim. Een redelijk hoppig aroma, goed smaak. Lekkere ipa.", "Tap at Captain cook. Need to rerated but this was really yummy. A homely ipa that could go the distance \r\nrerated at Bishops Arms Östersund. 3.8 to 3.4", "Dejlig IPA. Helt klart noget der er pengene værd. Mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm\n\n---Rated via Beer Buddy for iPhone", "From a 355cl bottle. Pour golden pale with thin  white head that quickly disappear.  Aroma of grassy hops. Flavours of unpleasant bitter grassy hops, quite frankly bad, grassy, oily  unpleasant.  A drainpour. Typical shit from Carlsberg. Not recommended.", "resin, floral, grass, spruce, citrus, herbs, medium sweetness, medium bitterness, very bitter, heavy cloying sweetness, heavily sour, medium sourness, lightly sour, lightly bitter, light sweetness, light body, thin feel, fizzy, astringent,", "Review based on the BJCP2015 guidelines (style 21A). Bottle 35.5 cl - Batch unreadable (BBF unreadable). AROMA: medium-low oxidized hop aroma (dried grass), followed by a low malty-sweet and almost neutral background. APPERANCE: deep gold and clear. medium-low ivory head with medium retention. TASTE: similar to the aroma with medium-low oxidized hop flavor (dried grass), followed by a medium-low to low malty-sweet neutral background. medium-high bitterness with an almost dry and bitter finish that endures. PALATE: medium-low body with medium carbonation. OVERALL: sample already oxidized.", "East Pale Ale di buon livello, molto luppolata con una buona persistenza dell’amato in bocca. Discreta presentazione.\n\n---Rated via Beer Buddy for iPhone", "23/03/2018 - Can - appearance: pours a golden clear colour with a slightly orange hue. Retains a 1 finger white head.\r\nAroma: floral and pine hop character, sweet caramel malts, minerality, slight citrus aroma\r\nTaste: pine resin dominates, followed by caramel malts, biscuit malts and minerality\r\nOverall a nice beer in this style! Strong pine nose and taste which leads into a strong malt backbone!", "Et ganske godt øl, passer til det meste av mat. Også behagelig som tørstedrikk. \n\n---Rated via Beer Buddy for iPhone", "Aie, une IPA encore... mais au final assez agréable. Une couleur jaune dorée et une belle mousse assez ferme. Le goût ne me semble pas trop amer, c'est tout ce qui compte.", "Aroma cítrico, leve maltado, cristalina, bom amargor, paladar seco, leve dulçor. Vale conhecer e apreciar.", "Jolie couleur ambrée/ caramel foncé.  Au nez arômes de résine, fruité léger et céréales fraîches. A la dégustation un bière avec un corps moyen, un bel équilibre houblon et céréales avec une légère persistance amère. Bière très buvable et bien faite.", "330 ml bottle. Pours with a clear amber color and a mdeium size white head. Malty nose with a caramel-orange sweetness, some bisquit. Fruity taste of lychee and orange with some toffee-caramel follows by some nice pine hops.", "Bottle from supermarket. Deep golden color, white head. Lagerish, sweet malts and big bitterness. Not balanced to me. Not my thing at all.", "Pours clear amber with minimal white head. Aroma is faint floral citrus with grainy malt. Flavor is crisp with a medium body and mild bitter character.\n\n---Rated via Beer Buddy for iPhone", "0.335 l bottle, a gift from my GF. Pours deep, clear golden and persistent head. Nose is spicy and slightly bitter hops, and faint alcohol. In taste the hops are clearly detectable, but only with moderate bitter notes and there's some sweetness to it too. Finish is short and faint bitteress again. Light bodied with average carbonation. Decent European style IPA.", "Bottle. Floral, elderflower, citrus, biscuit, balanced. Herbal bitter with a grassy aftertaste though not too dry. Good, if a tad too grassy.", "Helder, goudgeel bier met witte kraag. Bitter, hop, grapefruit, lychee. Droog. Medium body.", "One of my favorite beer at the moment, with a great bitter tasting and a floral smell", "Bottle. Amber color with white head. Malt and fruit aroma. Citrus, fruit, hop and bitter taste. Bitter finish", "medium amber colour, malty hop aroma. Tastes strong  with good use of hops, medium body , nice finish", "Hop spice malt aroma. Clear Amber colour poor head and lacing. Malt herbal spice malt flavour. Fizzy palate.\n\n---Rated via Beer Buddy for iPhone", "Bottle at some jazz bar in Greenwich Village. Bitter and metallic. An ok alternative to the lagers that were available.", "From Feb 2008\r\n\r\nI got this bottle in a trade with Nutbrown. Thanks Alan!\r\n\r\nIt pours from 12oz bottle a clear gold with a 1 finger head of foam.\r\n\r\nThe smell is equal portions of pungent hops and sweet malt and a note of mint.\r\n\r\nThe taste on first sip is both hoppy and malty with the hops*grassy) just eeking out the malt. Further sips in and the malty character subsides somewhat leaving the hops to dominate...and there's a minty/fruity flavour in the background as well. The mouthfeel is medium and it finishes with a bitter bite that I quite enjoy when I'm in the mood for it. And I am...;^)\r\n\r\nI tried this a few years ago and, iirc, I thought it was a touch maltier than what I'm sipping on today but it's still a good drop and I'd put it in my regular rotation if it was available locally.", "sorry - WAY TOO MUCH HOPS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\nthe taste was not noticed as I gagged on the OVERLOAD of hops.\r\n\r\nmy gosh, there ARE other ingredients to be used in beer.", "0,5 litre draft at T.G.I Fridays Gardermoen. Golden with medium head. Fruity, bitter finnish.", "Bottle. Aroma of citrus fruits. Taste of grapefruits, limes,grassy,caramel sweetness, hoppy light bitter finish", "Somewhat on the sweet side and a little onedimensional, sweet but with that vanilla / butter tinge, taste quickly dissolves, not too hoppy", "Pours dark gold with a white frothy head that is stable and long lasting. Aroma is caramel, apricot, citrus. Taste is bittersweet to bitter. Light warmth at the finish. Body is medium with average carbonation. Pleasant.", "Fles gekocht bij AH, uitgeschonken in een Sint Crispijn glas. Helder goud/amber kleurig, met een kleine witte schuimkraag. Behoorlijk moutig, en kenmerken van graan en karamel in het aroma. De IPA accenten van pijnboom/hars en citrusfruit zijn zeker ook wel aanwezig, maar iets meer als een tweede accent. Toch verraadt de overheersing van mout in plaats van de hop, dat deze fles geen super verse IPA meer is, of het bier moet zo bedoeld zijn natuurlijk. Wel nog steeds een behoorlijk bitter smaakpallet, met tonen van grapefruit, hars en limoen, met een medium carbonatie. De theeachtige accenten geven aan dat dit bier niet zo vers meer is, als een IPA eigenlijk gedronken moet worden. De alcohol is wel duidelijk waarneembaar, met een droge afdronk, bijna Engelse Ale stijl. Een prima IPA, mist voor mij wat diepgang en een krachtiger hop profiel. Wel mooi gebalanceerd in mout en hopbitter, deze Brooklyn East IPA wil ik nog eens drinken, maar dan een wat versere batch.", "Fine IPA, but it lacks serious character imo. Not as smooth and herblike as many other golden US IPAs. It seems hard for big breweries to come up with something with real style.", "Tipica ipa. Colore tra oro e rame schiuma moderata. Mediamente amara, si sentono i luppoli. Secca sul finale.", "From bottle. Transfer of an earlier rating without text recorded, rating only.", "355ml can. Pours golden amber with an off white head. Medium carbonation. Nose is really biscuit and bready, burnt caramel, treacle and some citrus in the background. Sweet, malty medium dense mouth feel. Taste is biscuit, caramel, treacle and orange/grapefruit peel. Very bitter. Touch of pine resin in the finish. An old school IPA. Pretty nice, just a little over sweet for me.", "Head disappears into nowhere a minute or so after pouring. Golden / amber brown in colour. Strong malty backbone with decent levels of refreshing hop aftertaste. Not the best from Brooklyn but very welcoming and very warming at the strength of 6.9%.", "On tap @Dirty Nelly Irish Pub (Alesund). Dorata carica/ambrata scarica, limpida, schiuma bianca media, discretamente persistente. Al naso note di malto, biscotto, erba tagliata, ossidazione, leggero citrico. In bocca è maltata all'attacco con amaro fiacco e privo di spunto. Corpo medio, carbonazione media. Non in gran forma, e comunque molto modesta.", "Orange copper colour, quite transparent. White head with a short lifespan. Smell is hoppy with a touch of fruits and caramel. Taste is light and moderately bitter. Aftertaste is also bitter but not very long-lasting.", "Godt humlet i næsen. Lidt citrus og lidt florale noter.\nGod bitter smag og en let sødme. \nDejlig IPA.", "Clear golden liquid, average head. Fruity aroma of hops. Light body, little bit carbonation. Taste is bitter.", "330 ml can,bb 11/01/2018.\r\nAmber,clear,off white head.\r\nHeavy malt aroma (always puts me off) and pine in background.\r\nTaste - malt,bitter. Meh.", "The color is copper to light orange and slightly hazy. The head is rather soapy and has a medium lifespan. The nose is ripe with notes of muscat, tangerine, herbs, and an afternoon walk in a pine forest. Upon taking a mouthful, the malts attempt to unfold their biscuit flavors when suddenly the hops of four varieties strike with floral bitterness, tangerine peels, herbs, and grape seeds. The dry finish really sticks around and leaves impressions of hazel nuts and tannic tangerine peels behind. A well-balanced hoppy delight.", "Aroma: malt and grapefruit. \nTaste: medium bodied malty flavor from the start. Citrus and grass hops following in the middle. Heavily bitter hoppy aftertaste\n\n---Rated via Beer Buddy for iPhone", "Tel que j'ai pu le lire par ailleurs : une ipa équilibrée entre amertume et douceur. C'est sans exubérance mais c'est réussi!", "Golden color, small white head. Sweet aromas of caramel, fruit, syrup and bread. Slight bitter taste with almonds, caramel, malt and floral hops.", "Can picked up from Tesco, Bicester, Oxon, consumed at home B/H Monday 28th August 2017, whilst preparing Tuna Burgers with a Chinese Cabbage Tsatsiki.  Dark gold in appearance with a mid sized white head. Fruity but with a good dose of caramel.\r\n It’s hoppy enough and rather a pleasant IPA but the flavour is tipped slightly too much in favour of the malt. A7 A4 T7 P4 Ov13 3.5", "On tap at Hollow Nickel. Malty on the nose. Pours a clearish amber. Light bodied. Little malty flavor. Ok.", "Dégustée dans un verre Straffe Hendrick.Robe orangée surmontée d’une mousse blanche peu persistante avec une faible carbonatation.Le nez est sur les agrumes avec des notes houblonnées.La bouche est à l’image du nez avec une pointe d’amertume qui reste en finale laissant une impression agréable de fraîcheur.Une bonne bière IPA d’été sans caractéristiques particulières!13,5/20", "Dégustée dans un verre Straffe Hendrick.\r\nTempérature de début 6 à 7°.\r\nRobe orangée surmontée d’une fine mousse blanche qui se volatilise très vite; faible carbonatation.\r\nNez plutôt agréable sur les agrumes (plus oranges que pamplemousse) mais peu percutant pour une IPA.\r\nLe goût est houblonné mais sans excès et l’ensemble est très rafraîchissant.La palette de saveurs est plaisante mais reste limitée.\r\nLa finale est de longueur moyenne et sur une note amère.\r\nUne IPA de plus, agréable mais sans originalité ... une bière d’été!\r\n13,5/20", "Tap. Amber color with light ivory foam. Nose is slightly flowery, hops. Taste is bittersweet, notes of berries and honey. Strong hops.", "0,33 l Flasche. Bernsteinfarbenes Bier, stabiler, cremeweißer Schaum, schöne Gardine. Riecht erst nach Pfirsich, Ananas, dann malzig, Kirsche. Schmeckt nur leicht fruchtig, malzig, angenehm bitter, etwas laff.", "Fruktig smak og med god bitterhet. God balanse. Likt som Nevada Torpedo, men ikke fullt så bitter.\r\nKjøpt i Dublin \r\n170811", "Bière ambrée présentant une légère amertume qui ne persiste pas en bouche, légère et rafraîchissante. Idéale avec une salade composée.", "Ok IPA. Nice golden pour, blossem and citrus smell. Taste not that interesting, but still a decent ipa.", "Aroma: citrus and faint caramel. Taste: herbs and pine resin, but very subtle notes of spice, apricot and citrus. Great and balanced IPA.", "On bottle @Ølfred - Aarhus Streetfood\r\n\r\nPours golden, with small white foam.\r\nQuite spicy, notes of different kinds of spices - surprisingly not as bitter as expected", "God på smak, høy alkoholprosent ........Anbefales......................................\n\n---Rated via Beer Buddy for iPhone", "Caramel-citrus aroma and taste. Moderate in every aspect, just an average IPA, not much to say.", "En god typisk amerikansk smag af IPA. Fin smag af humlen og en stor eftersmag", "Pinta en L’instant T (Nimes) Aromas a lupulo, buen amargor aunque un poco seco. En apariencia es ambar, bastante filtrada", "Pretty good, I haven't been a fan of Brooklyn that much but the flavor of it was not bad at all. \n\n---Rated via Beer Buddy for iPhone", "Obfita piana, przejrzyste, barwa ciemnozłota. Ładny chmielowy aromat, trochę mało cytrusów. Bardzo dobra goryczka, trochę zalegająca.", "Bottle 355ml. Amber with a white head leaving plenty of lacing. Bready aroma with some sweetness. Taste is malty and more British than an American, with downtoned hops but with a lingering bitter finish.", "330 ml served in flute. Clear orange, fluffy head, not long lasting. Cough syrup, hops, citrus, some bitter herbs, slight apricot notes. Hoppy bitterness, floral and fruity. Bitter long-lasting finish. Lively carbonated, medium bodied. Nice IPA.", "Robe ambrée, mousse crémeuse, moyennement persistante. Nez aseez marqué par des notes de caramel, de malt torréfié sur un fond d’épices, de houblon et d(’agrumes. Bouche à l’attaque droite, nette, bulle serrée et très fraîche, plus longue et plus complexe que la précédente. Une belle IPA de soif", "Klar brun farge med offwhite skumtopp. Lukter av malt, karamell og svakt av sitrus. Forholdsvis tynn og mild i smak. Medium bitter avslutning.", "From tap at Souls (Copenhagen). Just an average IPA, a bit short in flavour. Notes of caramel & citrus, nice but a bit weak. Long bitter finish.", "I poured it from the bottle into a glass. It pours a pale amber with a nice, white head and lacing. The aroma is hops, burnt toast, and caramel. The taste is the same with hints of citrus. This is a solid and nicely balanced IPA.", "Angenehmes Aroma, bernsteinfarben mit kleiner Schaumkrone, die nicht lange hält.\nGeschmacklich sehr leicht, nicht zuviel Bitteraromen, aber auch wenig Fruchtaromen. Dennoch angenehm zu trinken und sommerlich leicht.\n\n---Rated via Beer Buddy for iPhone", "Head is big, creamy, ivory in color and averagely long lasting. Beer is clear and amber golden. Aroma is intense after mango, lemon cest, spice and resin. Taste is malty, a bit sweet that gets quickly covered by a creamy intense hop. Finish is intense with a long lasting hoppy bitterness. Some sourness fights itself through without having a real chance. In overall a very good IPA that lacks a bit fruitiness in taste but comes with one of the best price values in Germany. Carbonation is average and refreshing.", "0,33 l Flasche aus dem E-Center Schuller in Fürth. Oranegold, klar, mit cremiger Schaumkrone und leichtem lacing. In der Nase habe ich Zitrusfrüchte. Im Geschmack süßlich, Zitrusfrüchte, Litschis, gefolgt von einer malzig-herben Mischung", "12 oz bottle from friend. Served in pint glass. Thin head. Some lacing. Beer is a dark golden color. Bitter pine notes with some malt. Not a bad IPA but not really anything special.", "amber, clear, white foam, resin, herbs, citrus, medium body, sticky, average carbonation, bitter, medium sweetness, very bitter,", "Clear amber appearance with white head. Caramel, malt, pine and hoppy aroma. Taste og exotic fruit and citra.", "12oz bottle pours clear gold with white cap aroma is slight hay and floral with a bitter finish", "Color dorado claro, translúcido, espuma blanca poco persistente. Aromas cítricos, malta y caramelo. En boca carbonatación baja, sabores cítricos, pino, resina y amargor bien balanceado que persiste en boca.", "Color ambrato limpido con cappello di schiuma fine e bianca dalla discreta persistenza. Al naso lieve agrumato su una base maltata di caramello. Al palato entra decisa con amaro invasivo, tra vegetale ed erbaceo, con venature di scorza di pompelmo sul finale. Corpo medio leggero con carbonazione spinta. Non convince.", "Bottle. Pours clear light amber with foamy off-white head, caramel malt and piney hops aroma, medium carbonation, medium bitter caramel malt taste with moderate hops influence, thin body, longish bitter finish. Nice brew.", "Bottle: 355 ml, Price: 1,19 eur \n\r\nTiesiog nebloga IPA.....", "Bière limite rousse avec très légère mousse. Un nez avec pas mal d’amertume qui malheureusement ne se prolongé pas dans le goût et le palais, pas trop pétillante, elle est sympa mais sans plus elle manque d’amertume pour être vraiment considérée comme IPA pour moi...", "A classic that originally started my interest in IPAs. Clear with medium white head. Grassy, hoppy with a mix of malts. Dark malts, sweet with floral and grassy hops.", "Aroma: citrus and herbs.\r\nAppearance: clear golden color and white head.\r\nTaste: medium herbal bitterness, weak citrus notes, grapefruit, dry.\r\nPalate: medium body and medium carbonation, bitter finish.\r\nOverall: Really decent IPA.", "Originally rated on 12/29/08. Aroma some pine, and floral notes. Appearance was a light copper color, thin head left decent lace. Flavor is kinda malty for an IPA but its o.k., hints of pine. Mouthfeel was a little sticky, but it had a clean finish. Overall its a decent beer, but nothing to rush out and get.", "On tap at Bill’s Bar & Burger, NYC. Clear medium amber under a large foamy off white head that fades slowly and leaves lots of lace. Nose is light bread with some light citrus and some grass. Flavour follows with light caramel backing a medium- bitterness. Mouth is medium with average carbonation and a lingering lightly bitter finish. \n\n6/3+/6/3/12", "Bernsteinfarben. Kräftig bitter und fruchtig zugleich, ideal für den Sommer.", "I bought this bottle at one Coop in Lausanne, Bergières. In my point of view, it is a solid IPA and good relation price/quality, a dIvine nectar of bitterness, having the impression to eat the forest of pines of Siberia. I drank it yesterday just before to sleep, a good idea of sweetness in our mad world to find some hope. The body is a classical tinted color, announcing what it will be your discover, huge resine notes and perfect bitterness staying for the eternity in your mouth, at the final sip and due to the resine notes, you have a side of sugar, malt hidden by the hop, regular carbonation, thin and white foam, próxima caña hombre!!!!!", "12oz can. Golden with a moderate white head. Aroma is apricot, a little caramel. Bitter hops dominate the flavour, dry, slightly dusty finish", "Coloração dourada para âmbar, translúcida e com creme branco de boa formação, densa e percistente marcando o copo.\n\nO amargo é notado no início junto com um dulcor em pleno equilíbrio, e vai se intensificando na boca chegando a sua plenitude na garganta. No retrogosto o dulçor some deixando um potente e agradável amargor Herbal e seco. \n\nAroma predomina herbal e pinho com malte muito em segundo plano. Álcool bem inserido com 6,9%. Uma IPA muito harmoniosa, potente e com drinkability superior frente ao estilo. \n\n---Rated via Beer Buddy for iPhone", "12 oz bottle poured. Mostly clean, clear golden pour with a thin fizz head. English style IPA for sure if you ask me, mostly due to it being unique to my normal steady. Slight plastic hops aroma, flavor is a cool, plastic hints again. Not off putting though. A late bitter follow. Interesting IPA.", "Légère au palet, légèrement amere, bu dans un diner’s avec un burger et c’est tout ce qu’il fallait pour l’apprécier !", "Birra veramente ben fatta, dall'aspetto perfetto e dall'aroma piacevolissimo. Molto equilibrata in bocca e decisamente beverina.\n\n---Rated via Beer Buddy for iPhone", "Acheter à carrefour coquelle. \nBouteille de 35,5cl.\nCouleur cuivre reflet dorée. \nMousse crémeuse qui ce tiens bien .\nAu nez : note houblon américain, frais et note floral. \nEn bouche : bon corps , note de houblon type mozaic et chinook. Pouvant amer intéressant et assez long en bouche . Plutôt progressive .\nCorps plutôt lager mais amertume et houblonnage bien fait.", "Flaske på Radisson Blu Alna. Aroma sitrus, humle, malt. Utseende klar gylden med hvitt skum. Smak sitrus, humle, malt, grapefrukt. En grei ipa med god fruktighet og bitterhet. Godt øl\n\n---", "Golden colour with white foam. Lots of hops in the aroma and in the taste but a bit to strong.", "Bouteille achetée chez Monoprix. IPA classique pleine d’amertume assez dominante.", "This beer has a very intensive taste and a good after taste.\r\nNice bitter taste 60-80 IBU. Solid IPA.", "Color dorado, translúcido, con capa de espuma de un blanco puro de tres dedos de grosor (buena retención, aspecto cremoso, se pega maravillosamente a las paredes del vaso). Carbonatación media tirando a alta que va perdiendo fuerza en el vaso. La apariencia invita a beber. Textura acuosa. En aroma me recuerda a la Torpedo IPA de Sierra Nevada: resina, cítricos, malta (todo muy sutil y disfrutable). En boca hay cítricos, mucho pino, mango y pomelo, malta... El final es poco amargo, bien balanceado, queda resina en boca durante unos segundos. Invita a dar otro trago casi al instante. No creo que los amantes del lúpulo vayan a disfrutarla demasiado, pero me parece una IPA muy interesante, sutil y perfectamente balanceada. Cuando quiero beber IPAs busco esto antes que una buena dosis de amargor. Me encantaría probarla recién embotellada.", "Pours clear orange. Aroma of citrus grapefruit, and orange. Taste is citrus grapefruit hops. Light and not overly bitter. Not as juicy as I expected from an East Coast IPA. Generally OK, but mostly generic ’C’ hop taste. Enjoyable but I didnt think this was greatly different from many West Coast IPAs", "Uma IPA saborosa, com amargor balanceado. Cor dourada e espuma branca. Aroma um tanto suave e paladar agradável.", "Birra di colore ramato.Schiuma bianca, cremosa e di buona persistenza. All’olfatto sentori di spezie, frutta esotica, e caramello. Al palato birra dal corpo medio, con note Gusto amare e pungente, dove il luppolo predomina con note di frutta esotica, aromatiche e amare del lippolo. Nel finale rimane amara, asciutta e pulita. Una birra piacevole", "Geruch nach Hopfen, Gras, Pfirsich und Mirabellen. Geschmack kräftig, nach hellen Früchten und Likör. Insgesamt etwas alkoholisch, merkwürdiger, nachhängender Nachgeschmack. Mundgefühl cremig, fast ölig.", "From bottle.\r\nAmber gold, very clear color. Tee head fades away quite fast, stays only thin layer and white ring foam around the glass. \r\nClear but strong nose with citrus, orange peel, herbal and hoppy notes. Taste is lightly hoppy with orange peel and grapefruit notes. More than medium length aftertaste with hoppy bitterness and some citrus notes. \r\nVery nice everyday IPA.", "Bottle at home, 18/02/17 ... had this a few times over the years ... finally catching up to rate it!\r\nClear golden with a well appointed off white head.\r\nNose is caramel, grains, malt forward, biscuit, vanilla, lgiht citric peel, hoppy notes.\r\nTaste comprises sweet malts, biscuit crumble, custard, caramel, toasted brioche, light orange peel.\r\nMedium bodied, fine carbonation, semi drying close dashed with hop bitterness.\r\nHistorical recreation or not ... this is not what I want from an IPA in 2017. Drinks Ok if a touch sweet but I doubt I’ll ever head back here!", "From a bottle. Decent example of style, lots of citrus and pine flavours but not a crazy hop bomb.", "Bottle. Golden-orange body and a white rocky head. Aroma of grass, citrus, hay and honey. The taste is medium to heavy bitter and medium sweet. Sticky texture and long bitter finish.", "Good ipa,not the best of brooklyn but it’s good,nice flavour, too much bitter than others of the same brand. White head a little bit yeast", "Lovely amber color. Aroma is herbal, spicy and slight fruity. Taste is very bitter with nice herbal notes.", "Pours a clean amber, full eggshell white head. Aroma of grapefruit, orange sherbet, melon. Medium bodied with a nice creaminess on the back end. Decent taste, bready citrus malts, everything was a bit subdued but it’s crushable.", "Bottle. Deep Gold in colour. Hoppy; piney resinous and spicy (peppery) hops. Fruity; citrus grapefruit, lemongrass. Malty; pale malts, caramel, toffee. Nice hop/fruit/malt balance. Nice resinous hop bite over sweet malts. (Intentionally), not as aggressive as many American IPAs. Very dry lingering finish. Very drinkable. (2010-08)", "Bronze, mostly clear nice yellow creamy foam. Fruit,hopps and flower in the aroma. Caramel, sweet, cream with flowers and geowing hoppiness in the aftertaste.", "Can. Pours pale amber, transparent with a thick thick foam that resides. Scent is a fair blend of American hops, mostly on the early/bitter side. Taste is Grass, pale malt, loads of early to mid hops, approximately 40 IBU. Some slightly unsavory flavors, like sort of muddy. Finish is dry. Good.", "340ml bottle from brewery (thanks Dad!). Pours a slightly hazy deep gold with a creamy off white head with excellent retention and lacing. Aromas of tropical fruit and spicy orange marmalade with a touch of nuttiness. Palate has medium carbonation and medium light body. Flavours of juicy tropical fruit and some caramel sweetness from the malt quickly fades into a dry finish with medium low bitterness. A bit sweet for my tastes, and lacking a bit of bitterness but having said that it is utterly drinkable and I would easily order many more of these at a pub! The whole is greater than the sum of its parts, for sure.", "Pours clear straw golden colour. Medium carbonation. Nice white head with lacing on the glass. Floral aroma, bit of fruit citrus, caramel malt. Low bitterness for the style. Fruity taste with a sweet caramel malt notes. Pick up some citrus, mango and spice. Overall: good for an American IPA trying to be British. Could have higher bitterness.", "Clear amber with little white head. Aroma is lots of papaya, tropic fruit, mandarin. Taste is resin bitterness with only a little fruit sweetness. Quite heavy with clogging resin stuff. Not easily drinkable but still good.", "Gaivus aromatas. Skaidrus, putel? laikosi trumpai. Skanus ipa, gaivaus skonio, su lengvu kart?liu pabaigoje.", "En klar bärnstensfärgad öl med ett lättare vitt skum. En bra balans mellan humle och karamellmalt med inslag av citrus i både doft och smak.", "Karamel achtige kleur. Met een creme kleur schuimkraag. Aroma van wat mout, karamel en Engelse hop. Smaak is karamel, met veel koolzuur en een aangename bittere afdronk.", "Pours golden orange with medium sized white head. Aroma is citrus and peach hops. Taste is bitter hops with some pine and citrus. Okay but not great.", "Bottle 0.355L.\r\nClear amber body with an average, frothy, off-white head, mostly diminishing with a fair lacing; high density of tiny particles.\r\nModerate-to-heavy hoppy (orange) and light-to-moderate malty (caramel) aroma with notes of fruits (apple) and alcohol.\r\nModerate-to-heavy bitter and light-to-moderate sweet flavour; long bitterish finish.\r\nMedium body with oily texture; soft-to-average carbonation.", "Bottle of 35.5cl. I wasn’t expecting much from that bear, but it’s really good. Good bitterness. Balanced between malt and hope.", "33 cl bottle @ home. Clear amber colour with minimal white head. Aroma is balanced between sweet fruits, flowers and herbs, and malty tones. Medium bitter taste, nice palate.", "Bottle. Clear dark golden color, steady white head. A bit muffled fruit and malt aroma, earthy, resinous. Dry taste, with a high bitterness. Malty, fruity aftertaste, earthy. Average carbonation, medium texture.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "Bottle, pours amber-tinged brown with a fast-settling head and aromas of biscuity caramel malt. Initially floral and orange accented, then a little sweet toffee-malt and fruity hops with a lightly bitter overtone, finishing dry-bitter in the northern English style. Very nice.", "Pale amber. Citrusy hops and light caramel in the aroma, with a light hop and malt flavour. Moderately sweet taste with a solidly bitter and dry finish. Full body and prickly carbonation. Overall, a decent IPA. More bitter than hoppy, and somewhat anonymous.", "Can from Oddbins Rosemount. Pours clear copper. Aroma of peach, pine and treacle toffee. Tastes of peach and pineapple with an apparent but gentle malt bitterness. A smooth palate lightened with soft carbonation. Overall a seriously refreshing IPA. Beautifully balanced.", "W aromacie przyjemnie, trochę cytrusów, trochę karmelu, nic za bardzo nie dominuje. W smaku podobnie, też dobry brak wad. Nie zachwyca, ale też nie porywa. Dość ciężkie, ale dobre.", "Can in Brooklyn for 13$, watching the Islanders lose 1-6 against Tampa Bay - You could say: at least they sell it in the stadium and coors light is 12$ as well anyway. But its expensive as hell. Great IPA though, nothing wrong with it. Fruity aromas, bitter finish. Thats what you want when you chose an IPA", "Orange, klar. Geruch nach Citrus und Melone. Leicht Mandarine. Restsüß. Bitter am Ende.", "Tasty IPA. Slightly hazy yellow colour. Orange peel, grass, and hops on the nose. Taste was similar with some tropical notes, unlike a lot of IPAs this one wasn’t too bitter.", "clear copper body with à pretty thick & persistent 2 cm white head.\r\nslight fruity & floral smell fading away for malty & dough notes.\r\nmedium body hint of sweet slight side note of bitterness.\r\n Not hop forward but a nice \"round\" malty backbone.", "355ml bottle into pint glass. Hazy golden bronze beer with foamy white head. Carbonation is steady and fine. Distant bready malt nose with a hint of pepper and lemon. Slight zing on tasting, full-bodied. Refreshing and clean. Finish has hints of grapefruit, lemon, caramel and bubblegum. The peppery bitterness comes back right at the end. Dangerously easy-drinking at 6.9%.", "citrus taste, not too bitte and still malty caramel taste. thin carbonation and head. in the end from malt to bitterness not well balanced. ok IPA", "Clear amber with a little tan head. Aroma is pineapple, mint, orange, bread, cereal, lemon, grass, some floral notes. Kinda complex but weak. Taste is pineapple, peaches, mint, oranges, caramel, honey. Light bitter aftertaste. Tasty and refreshing!", "Bottle from Cotteridge Wines; clear light copper pour with a thin tan head, aroma has sweet malts and toffee, taste has sweet toffee malts, some pine and citrus, chewy sweetness, quite hard work to drink, off eye and ball come to mind, wasn’t expecting much and it delivered on all fronts.", "Pine and some citrus. Good balance and easy drinking. Good malt backbone. Bitter finish. Bottle from mixed sixpack.", "Klares orangegold mit durchschnittlicher Schaumkrone. Malzig, etwas Karamell, Honig, fruchtig, Orange, leicht harzig, sehr süffig.", "Garrett Oliver is one to eschew the use of hops merely to appease the hophead crowd. For him, hops need to serve a stylistic purpose. Even with an IPA, they can’t be tossed in with abandon just for the hell of it. That can take some getting used to for a hop-crazed masochist, i.e., me. Still, getting to try several of these courtesy of our generous hosts in New York gave me the chance to appreciate this English-style IPA. It’s balanced but still noticeably hoppy. Grassy, herbaceous hops redolent of black tea. Beers like this are becoming less common here in the states, but they still have their place.", "Can from Tesco. Lovely looking brew, clean gold with a long lasting white head, good mousse. Big hoppy nose, nicely balanced palate, well hopped with soft malty notes, could be a bit fuller in body. Good beer.", "On tap (Nun’s café- Paris). Color : clear golden ale with very thin white head. Nose : malt and citrus. Aromas : grapefruit, pinus. Dry texture, nice bitterness, low carbonation.", "Aroma: light hops aroma, citrus.\r\nAppearance: golden clear with small head.\r\nTaste: malt, hops, citrus, middle bitterness in finish.\r\nPalate: middle body, middle carbonation.", "Fand ich früher erheblich eindrucksvoller. War definitiv auch anderer Hopfen drin. Egal, ist immer noch ein leckeres IPA, der eher britischen Machart. Hier dominieren erdig würzige Harzflavours, und die typisch amerikanischen Fruchthops kommen subtiler im Background zum Einsatz. Bitterheit bewegt sich im Mittelfeld. Probierschluck von Micha bei der LOCKN NIGHT 2016.", "Caramel, floral, amber with a good white head, light body, medium carbonation, caramel, strong hoppy profile...a very good ipa that doesn’t disdain the tradition.", "355ml can from Tesco. \r\nBig white head settles quickly, good lacing. Clear amber body. Nose is orange toffee, syrup, biscuity malt. Flavour is burnt orange, treacle, caramel, a little spice. Nice lingering bitterness. Good mouthfeel, medium carbonation, gentle fizz on the tongue. Quite sticky on the finish. Good IPA.", "Meh. Decent, but lacks depth, hops and character. Too much of a mainstream beer.", "Butelka 330 ml. Zloty kolor. Piana biala dosc obfita. Karbonacja srednia.Aromat i smak sosnowych szyszek grejfruta owocow tropikalnych. Niezle", "Bue avec Jacky (ramenee par Ludo). Biere ambree a col de mousse moyen a bonne tenue. Carbo importante. Nez d’orange et d’agrumes. Final sur le pamplemousse, amertume prononcee. Biere bien equilibree.", "Bottle. Golden amber color, clear liquid, white head. Grapefruit, pine, zest in aroma. Medium to heavy bitter. Very good.", "Aroma citrico, mango, un poco frutal tirando a manzana roja, despues de un rato tambien empieza a notarse el aroma a malta. Sabor lupulado, aunq se siente tambien la malta caramelo. Un amargor presente pero no fuerte ni aspero. Cuerpo ligero y final seco.", "355ml bottle. Clear golden amber colour with a small white head, good retention. Aroma: piney hops and fruity malts, resin, caramel. Taste: pine, resin, fruity malt, caramel. Oily texture. Bitter aftertaste. Quite nice.", "Fraîcheur, subtilité et équilibre sont les maîtres mots de cette Brooklyn East IPA. L’utilisation de 6 houblons différents n’y es sûrement pas étranger. D’un titrage alcoolique de 6,9 % Abv, la Brooklyn East IPA est d’une ambrée translucide, avec de fines et nombreuses bulles. Elle ne présente que peu de mousse.\r\nLe nez, tout en fraîcheur est sur le pamplemousse, le caramel avec des notes clairement chocolatées. \r\nLa première attaque, douce mais bien présente en bouche est sur le malt et des arômes fleuries. L’amertume, complexe fraîche et épicée, envahit le palais sur des notes de caramel et de résineux (houblons Amarillo, Centennial, East Kent Goldings et Aurora). Les arômes sont parfaitement équilibrés. La finale, très longue et avec une superbe présence en bouche, se porte davantage sur des arômes de pamplemousse (houblons Summit et Cascade).\r\nCette bière se mariera aisément du saumon, des volailles voire avec des plats légèrement épicées au curry par exemple. Elle saura en tout cas vous faire voyager.", "Piwo lekko metne w kolorze zloto-czerwonym z grubopecherzykowa obfita piana ktora zostawia ladny lacing na sciankach. W aromacie biale owoce jak cytryny, brzoskwinie czy liczi. Jest naprawde bardzo owocowo. W smaku dosc slodkie z goryczka na srednim poziomie. Czuc karmel, slody i nuty ziolowe. Zapach zdecydowanie robi robote, w odbiorze smaku troche slabiej ale ogolnie to i tak porzadna IPA.", "Bottle. Clear amber color with tiny white head. Aroma - Pine, citrus, wood. Taste - Bitter, medium sweetness, caramel, pine, citrus, bread.", "Bottiglia. Il gusto al naso si indirizza prevalentemente sul luppolo. L’intensità olfattiva è molto elevata e la persistenza olfattiva è sufficiente. Il cappello di schiuma a bollicine medie ha una discreta resistenza, con carbonazione abbondante. La consistenza del liquido è limpida. La carbonazione è bassa. Il colore è ambrato. Il corpo è strutturato. L’amaro è deciso. L’intensità gustativa è elevata. La persistenza gustativa è buona. Il gusto è piacevole. Le sensazioni boccali finali sono luppolate. Il finale è amarognolo. Il retrogusto è intenso. In bocca l’aroma riporta sentori di miele, resina, frutta secca, pompelmo e castagna.", "Fat på Piccolo Mondo, Malmö. Klar bärnstensfärgad med beiget krämigt skum. Mellanstor, något torr kropp. Stor beska med mycket apelsinmarmelad, citrusskal, bröddeg och honung. Beska som ligger kvar länge.", "Can from local Tesco. Pours clear. Sandy gold in colour. Large, dense, just off-white head. Has staying power. Lots of orange, grapefruit and plenty of pine in the aroma. Quite resinous and oily. Some herbal notes also. Good. Taste has a bittersweetness to start. Syrupy medium to full mouthfeel. Good level of bitterness punching through. Just right. Dry cracker-like malt. A little astringent on the finish but has a little juiciness to it too. Good stuff.....does exactly what it says on the tin", "Dark golden colour, with a medium head, good retention alnd lace. Aroma of fruits, caramel, resine. Medium body, good carbonation. Palate is creamy and sticky. Taste of caramel, resines, bitter finish.", "Kirkas kuparinvärinen olut melko pienellä ja nopeasti katoavalla vaahdolla. Tuoksu aavistuksen vihanneksinen, miedosti jenkkihumaloidun hedelmäinen, kuitenkin selvästi keskivertoa kevyemmällä ja miedommalla otteella. Samoin maku on aika kevyt, makean toffeinen, hedelmäinen ja loppupuoleltaan aavistuksen katkeran greippinen. Yleisilme on kuitenkin selvästi toffeisemman ja pehmeämmän puolella ja ehkä tässä on tavoiteltukin pahimpien katkero- ja humalapommien vastapainoksi jotain muuta, mutta kyllä tämä kaipaisi rapsakampaa humalointia. Prosentteihin nähden yllättävän kevyt.", "Underrated on here I think. Bottle at Black Fox Edinburgh. Pours clear gold, lacy off white head. Aroma of oak chips and mango - very nice. Modest carbonation. Taste of pine, pineapple, slightly sweet (maple syrup), resin. I like this - it’s very drinkable for the abv.", "Couleur ambrée claire, mousse peu mirobolante. Au nez comme en bouche on est sur un mélange de caramel et de résineux. L’amertume est modérée, ça paraît un chouïa sucré, et on sent une légère astringence en fin de bouche. Rien de dingo là-dedans, et ça ne fait pas très IPA tout ça.", "33cl bottle. Pours amber with off white head. Fruits and floral hops with some maltiness. Medium to heavy bitterness, with light to medium sweetness. Basic IPA.", "33 cl bottle. This is a nice IPA that has subtle character and grace. A very smooth and drinkable brew.", "Sattes Gold-gelb. Schwacher Schaum und Karbo. Zitrus leicht melone. Bittere für Ipa ausbaubar. Süffig.", "Tasted very cold from can....aroma has caramel, soft fruits but the flavour just let’s this beer down. Citrus, tick, floral hops, tick but the sheer strength of the alcohol overpowers everything...leaves the palate dry with an unpleasant aftertaste. Not my cup of tea....in fact I would rather have some tea!", "Bernstein rötlich, für ein IPA sehr zurückhaltendes Aroma, kaum Fruchtaromen, dafür stärker malzbetont, stark bitter, nicht unangenehm", "Can. Nose had pronounced yeast, fruits, apple, lychee, a little malt. Taste is fruity, red berry, peach, lychee, hint of lemon, fruit and caramel finish. Mouthfeel is smooth. It’s a traditional ipa with me world hops. Nice", "I don’t like this IPA, the aroma is spot on that’s the best that’s said about this beer. \r\n\r\nThe appearance is normal but it’s kind of hard to score really good or bad on that. \r\n\r\nThe taste is primarily bitter which is normal for an ipa but it feels like complex then I’m used too.\r\n\r\nPalate is good actually, the body is fine and the bubbles don’t feel that forced.\r\n\r\nOveral: Man what a dissapointment. I thought I’d have bought a nice IPA. Even the bitterness isn’t that much and I smell the flowery-ness in the aroma but don’t taste it what so ever.", "A very nice, classic IPA with a note of sandalwood, clear red with a small but firm white head. Very long lasting bitter aftertaste.", "Dark orange colour. Fruity aroma. Taste is sweet and full. Enjoyable bitterness and a bit citrus. Well made. Off course!", "Golden fast klar lm Glas, leicht eingetrübter Schaum, leicht hopfig in der Nase, sehr mild und rund im antrunk, leichte süße, leichte bittere, sehr ausgewogen", "Pours golden and clear with medium offwhite head, little lacing. Nose of zest, malt, fruits, wood, resin, dried fruits and herbs, spice, some caramel. Tastes moderately bitter with a light tang in the middle. Medium body, high carbonation, somewhat sticky finish, no excess alcohol warmth. A nicely balanced subtle IPA.", "Sofort spring einem die Typiache cascade-grapefruit in die Nase. Die findet sich auch wieder im Geschmack. Das Mundgefühl ist schön cremig, der Malzcharakter trocken. Ein IPA das nicht mehr als Cascade und Bittere zu bieten hat, allerdings auch nicht mehr braucht. Sehr sauber.", "Can. Pours clear amber, big foamy off-white head. Aroma is rather mild, more malty than hoppy. Bitterness hits right away on the front. Quick, dry finish. Long aftertaste, with some burn from the alcohol.", "33cl bottle, served in snifter glass. Poured a clear amber with an one finger ivory head. Medium carbonation. Aroma: grassy hops, flowers, malts. Taste: Caramel, grass, vanilla, bread, herbs, orange peels, butterscotch, vanilla, bubblegum. Pretty sweet, light to medium bitterness. Malt dominates over the hops in this IPA. Medium body with a dry bittersweet finish. Pretty good.", "Pours a clear amber with a small white head. Aroma has lots of cascade hops, malt, slight caramel, floral, spicy, grassy hops, slight citrus. Taste is fairly light, medium sweetness, slight bread, malty, bitter finish. Fairly light carbonation and a pretty light body as well.", "Bottle 335 ml. Clear amber with small off-white head. Strong carbonation. Weak caramel aroma - very low on hop aromas. Light bitter taste and aftertaste. Creamy mouthfeel. Average IPA. \n\n ---Rated via Beer Buddy for Android", "Tieforangene Farbe, sehr wenig Schaum, der sich schnell auflöst. Florale und gräserne Duftnoten, etwas Karamel. Im Geschmack deutlich der hohe Alkoholgehalt, wieder Gräser und viel Malz, später Brotnote. Trotz ordentlicher Bitterkeit kommt es erfrischend daher. Bitterkeit hält im Nachgeschmack an.", "On tap@ Mullygan’s Le Mans. Belle robe ambrée, mousse persistante. Nez caramel et céréales grillées. En bouche malts caramélisés. Final amer très long.", "Good clear amber beer. Mine poured with no head. Aroma, slightly malty and fruity. Hop aroma not heavily pronounced. Clean bitterness finishing dry but with a slight herb spice finish. Big hop flavor but not the big citrus from the usual American hop versions. This is more balances. Fruit is there but also a nice herbal and peppery note that is well in balance. A nice drinking IPA at 6.9%\n\n---Rated via Beer Buddy for iPhone", "Poured from 3 singles in a pick a six , this is different from what I would of expected but it is hoppy and easy drinking, slammed all 3 in an hour and enjoyed all 60 minutes of it.", "Light floral aroma with some faint honey. Pours a clear orange red with an off-white head of tight tiny bubbles. Quick dissipating, good lacing. Sweet orange flavors with a following sour hops finish. Medium to heavy carbonation. Doing different things than the typical IPA but sweeter than I like.", "Bottle. A true American IPA. Very hoppy and full bodied. The aftertaste lingers nicely. A must try.", "Draft. Dark orange with a nice white head. Aroma is fruity and hoppy. Flavour is really fruity with slight hops and some earthy notes. Light to moderate bitterness in the aftertaste. Really fruit and really tasty!", "330ml Flasche. Klar und bernsteinfarben mit kleiner Schaumkrone. Blumiges Aroma, dezente Cirusnoten. Leicht herb mit durchschnittlichem Körper.", "The aroma consist of citrus and herbs.Appearance amber and clear with minimal head. Taste of medium bitterness with a full body. The carbonation isizzy but it ends with a long finish,", "Clear medium gold pour, disappearing white head. Nose is English yeast and mild and woody hops. Bitter but balanced. Middle is semi sweet, medium kilned malt, fruity undertones. Finish rounded malt with an earthy hop kiss. Most enjoyable.", "Bottle 33 cl. Pours a clear amber with a medium white head and an aroma of grapefruit, citrus, sweet malts and ripe red fruits. Nice beer!", "Tap. Clear amber with semilasting head. Aroma is pine, caramel and malt. Taste is sweet, fruity, pine and caramalt. Med bitterness and its a bit to sweet.", "Bottle @ Hästöskatan, Kronoby. Pours orangey amber with good beige head. Very clear. Aroma is predominantly malt with a hint of hop and metallic tones. Taste is dank hops, slightly foresty but not piney. Good carbonation and average mouth feel.", "Can from Appellation Wines. Pours clear amber, thin white head. Nose of grapefruit, banana, pine resin. Orange peel bitterness on the palate, hoppy, slightly sweet.", "Bière orange avec une belle mousse blanche. Au nez on sent le houblon, en bouche aussi. Pas très florale...", "Bottle in the Capital Grille, NYC. Colour unknown, I’d guess on the deeper side of amber. A balanced IPA, quite malty with a decent hop level of bitterness. Certainly didn’t feel 6.9%. Well made but there’s a certain house taste of these Brooklyn beers which makes them all feel a bit the same and it isn’t my favourite. This beer would probably be better out of a cask.", "330ml can: Pours a clear amber with good off white head. Tastes of pine resin and slight citrus. Overall a nice IPA.", "Ipa flojita buen sabor ......\nPero el aroma y la espuma dejan mucho que desear\nAmargor muy sutil.", "Versa di arancione scuro quasi ramato con schiuma bianca quasi inconsistente. Aroma fruttato con note marcate di luppolo. Idem in bocca dove risulta molto fresca. Finale lungo e piacevolmente amaro. Insomma una IPA più che discreta e soprattutto molto beverina...va giù che è un piacere.", "Diminishing head, but lasting throughout the glass. Less pronounced flavor, malty and fruity. Bitterness becoming thinner, going to sweet, lasting finish. Very light, although alcohol can be felt.", "I was surprised by this supermarket beer! I’m no expert but I’ve tried much worse beers", "Clear amber with small off white head that quickly recedes to a film. Biscuity malt aroma, with some marmalade notes. The taste has a toasty malt character, grassy and grapefruit citrus hop tang, a little marmalade. Light to medium bodied, reasonably low carbonation and a little acidic bite without any sourness. Solid if unspectacular IPA.", "Refrigerated 12 oz. brown bottle, best by July 2016, poured into a snifter. Clear light orange with small white head. Aroma is citrus hops, medium body, lower carbonation, and some lacing. Taste is citrus hops with nice malt backbone. Solid beer.", "Ganske udemærket IPA øl. Naturligvis fra USA. Det er en forholdsvis mild humlebombe-oplevelse - som jeg vil anbefale til 'nybegyndere' indenfor IPA. God oplevelse.", "F: creamy, huge, off-white, with good retention.\r\nC: deep gold to orange, clear.\r\nA: light citrus, caramel, orange, tangerine, pine, toast, light yeast.\r\nT: malty, sweet orange, tangerine, hint of pine resin, caramel, light toast, lemon, herbal, good balanced not very offensive but pretty tasty and drinkable summer IPA, 355ml bottle from AH supermarket in Amsterdam.", "Pours orangey amber with good beige head. Very clear. Aroma is predominantly malt with a hint of hop and metallic tones. Taste is dank hops, slightly foresty but not piney. Good carbonation and average mouth feel. Finish is sweet with a touch of honey and very little bitterness.", "Bottle at Navneløs concert at Jazzhouse. Medium-bodied, very drinkable, ultimately a hoppier version of a traditional English IPA. Brooklyn is really getting their standard beers out at non-beer bars and venues, which is a welcome relief from the pale lager syndrome, but compared to other of their beers (Sorachi Ace saison!) it is pretty average.", "lichte oranje kleur soppige schuimkraag ruikt als geurige jasmijn rijst.\r\nin de mond een aangename bitter gloed aard smaak ook in de afdronk die iets langer dan kort maar niet onaangenaam is", "Restrained aroma in a gold pour. Hop forward balance with light fruity body and sustained bitter finish. Nice - but nothing to write home about.", "Aus der Flasche vom Händler des Vertrauens.Dunbkelgolden im Glas mit mittelmäßiger Schaumkrone. Im Geruch und Geschmack zu untentschlossen. Von Carlsberg in D vertrieben, das war’s dann wohl ...", "Thick off-white head but short, clear yellow to amber color. Hop and malt aroma. Medium bitter and light sweet. Average carbonation, medium body.", "pours a slightly cloudy orange with average head and carbonation. The aroma is sweet. Tangerines, buttered popcorn, a little bit of yeast. The flavor backs the sweetness down just a little in favor of lemony hops and a dry finish.", "355 ml. bottle. 17/12/2015 bottled. Lightly hazy oily amber orange, little head. Nose is bitter harsh oily pine resin, low fruity qualities hops with substantial malt base, grainy caramel & dark bread malts. Taste is bitter herbal oily pine resin & flowers with herbal caramel & toffee malts, bitter oily tea, earl grey, light vanilla sweetness in the back. Meltier than you average IPA (it is not super fresh), tad aggressive but it suits it well. I definitely get the English connection / deScription. Tastes a bit like a mix between Brooklyn & Goose Island Goose IPA. Not your typical USA IPA que the English thing (it is more English inspired than anything classical or modern Britisch) but I rather like it. Between this, their Lager & magnificent Sorachi Ace, this brewery has a very solid standard line-up I get their popularity even if I didn’t care at all for Black Chocolate Stout.", "33cl @ bottle. Ottima Ipa della Brooklyn. Presa in un esselunga con un ottimo rapporto qualità prezzo.", "2X 330 ml bottles purchased in Tesco’s, served cold at home: Golden plum and resin aroma. Fruity, nutty, bitter sweet kumquat and digestive biscuit flavour.. Crisp palate, nice.", "Bottle a dark golden yellow colored beer with a white head aroma malts citrus fruits and hops flavor malts citrus fruits spicy and hops", "Not much hint of the alcohol to say it nearly 7%. Nice colour small head doughy texture very east drinking went down a dream not to much complexity but very enjoyable", "Aroma is a pleasant hope malt approach. Flavor’s out of balance though- wrong blends of the bitter, sweet, and tart components. Thanks to Dustin for the sample.", "Un peu hoppy, belle petit IPA d’été chaude. Facile à boire. Malte en nez, caramel. Petit goût d’agrumes.", "A mix of US style IPA, and some more traditional UK based hops, with quite a strong malt influence. Ok, but not special.", "Flaschenbier. Bernsteinfarben. Hopfig und starke Zitrus Aromen. Ausgewogener eher süßlicher Geschmack.", "35,5 cl bottle at home. Pours clear golden with medium yellowish head that dissipates fast. Aroma: lots of hops, resin, grapefruit, lemon. Some undifined savory note is present. Taste: low to medium sweetness with high bitterness. Notes of lemon, orange zest and caramel malts. Dry-bitter hoppy finish. Palate: slick texture with soft carbonation.", "Aroma and taste have a lot of peach with undertones of citrus. Really clean, fresh texture. Super drinkable but not remarkable.", "Amber liquid. Modest head which disappears quickly. Peachy, fruity aroma. Citrussy beginning. Overwhelming peach taste in the middle. Hints of tea and some sweetness. Citrussy and hoppy finish. Bitterness and hints of citruses in aftertaste. Something is bothering in that taste. It is not balanced. Beer is still drinkable but nothing special.", "Perfectly clear copper color with minimal white head. Light carbonation. Not much aroma or hop bite. However, This is a very drinkable beer. Nothing to write home about but definitely not bad.", "Copper colour, almost perfectly transparent. Head is small but dense and persistent. In the aroma, pine is the main note, nicely backed by a solid bready foundation. Some lemon and a spicy hint are also detectable. Taste closely reflects the aroma, with a very clean profile. Finish and aftertaste are dry and bitter, but not overly so. Medium body, light to medium carbonation, quite smooth. Clean, refreshing and perfectly balanced. Not impressive, but sure well crafted", "clear orange brown with medium white head, aroma is citric fruity with something i can’t put a name on, very sweet, caramel, malt, some orange, medium bitter, hoppy bitter finish with a lingering sweetness, some earthy pine tangy hop flavors, but hop taste is more soft, fizzy carbonation", "Not bitter but good strong hops. Excellent appearance, not much head, very light nose, carbonation is fine, rounded taste and good palate. My favorite beer.", "Pours bright medium clear gold. Big fluffy white head. Aroma is piney, flowery, hay, grassy. Taste is medium sweet bready malt, pine, and mild hop bitterness.", "Ik vond het echt een lekker biertje. Niks overdreven in smaak, gewoon een goede wegdrinker.", "Clear orange color with foam ring. Shy smell with orange peel nose. The taste is tart before the bitterness kicks in. The beer has a solid hoppy decent orange peel/tropical fruity touch with a sufficient body to work well together. The taste gets better after a while. Bitter tart light dry and creamy aftertaste.", "Jolie petite découverte bien que je m'attendais à une bière plus houblonnée et plus amère pour une IPA. Jolis arômes d'agrumes et amertume contenue. Une bière qui s'est laissée boire sans aucun soucis.", "12 ounce bottle. Brassy gold color topped by a frothy white head with clinging lace. Slight fruity, spicy malt aroma. Crisp bittersweet hops upfront. Slightly spicy with toasty malt and vanilla notes. Spicy bitter hops remain throughout and linger on the tongue. This is a nice IPA that has subtle character and grace. A very smooth and drinkable brew.", "Cerveja com um gosto suave de malte e furtas cítricas, não muito densa. Pouca espuma mas muito fácil de beber. Boa.", "12 oz bottle served in a pint glass (from notes).\r\n\r\nPours a clear pale amber with a good off-white head that has very good retention. \r\n\r\nAroma is the weak point of this otherwise very good beer. Earthy hops and medium malt are present, but so is a slight mustiness and too much in the way of effects of the modesty high ABV.\r\n\r\nThese minor defects more or less disappear in the excellent taste. Not only is an excellent sweet/bitter balance (a bit sweeter than normal) achieved, but some nice citrus flavor comes through along with some hop earthiness. \r\n\r\nO - exceptionally enjoyable, and notably sweet and fruity version of an English IPA.", "L: pours an almost clear amber with small head. \r\nS: floral hops and some pine resin, caramel, malt, very pleasing. \r\nT: strong malt presence, more pine, nice mix of a hoppy and sweet finish. \r\nF: medium-bodied, hides the alcohol, slightly warming on the end with the malt. \r\nO: a delicious and easy-drinking east coast IPA. Easy on the bitter, strong on the balance and malt flourishes.", "Gekauft im Lafayette, Berlin. Klassisches IPA, leider etwas zu fad und wässrig für meinen Geschmack. Sehr bitter.", "Aroma resinoso, corpo medio, al palato biscotto, dolce, cereali, luppolatura resinosa e leggermente citrica, non molto persistente.", "Didn’t expect so much. Nose is fulfilled with classical IPA notes - sweetness, hops, malt, citrus, fruits etc. Taste follows. Medium body, not too hard to drink, but not too easy as well. Good IPA!", "Goudblond bier met dun wit schuim. Geur: snoeperig, marshmallow, rozenwater. Smaak: zoetig – bitterig, mandarijn, geparfumeerde fruitigheid maar op een goede manier, Turks fruit! Dit is een zeer toegankelijke IPA of ééntje die voor velen drinkbaar bitter is. Afdronk: droog bitterig en terug rozenwater. Al bij al leuk.", "Pours with a small and dissipating head with some fine lacing.Well balanced mix of fruit and malt, not overpowering. The initial taste is also well balanced and the finish relatively short but not too bitter.", "Pleasant surprise. Maybe not so powerful or fancy, but well balanced, intense hop mix. Herbal, citrus, bit spicy, light pine, decent malty background\r\nModerate to light bitterness with pleasant aftertaste. Well balanced.. O.K. brew", "Bottle, thanks Siipi. Pours orange with a decent white head. Aroma is fruity, citrus, light lime. Taste follows along the same lines. Not very bitter.", "Cloudy brown appearance with little head. Tastes of hops, citrus, spruce and grass. Medium-heavy body, much carbonation and a lasting fresh finish of hops and grass. Fresh and carbonated", "Kolor: klarowny, bursztynowy. Piana ca?kiem spora, ?ó?tawa, niestety krótkotrwa?a. Do?? brzydko p?ka.\nAromat: g?ównie s?odkie owoce tropikalne, troch? cytrusów z wyra?nym pomelo.\nSmak: ponownie s?odkie tropiki, karmel, pó?niej polelo, grapefruit, troch? pomara?czy.\nGoryczka grapefruitowa, wybijaj?ca si? ponad s?odycz tropików, nadaje ton.\nWysycenie: ?rednie, alkohol idealnie schowany.", "35.5cl bottle at home from Biernavigatie.nl. Body is clear pale golden, head is small, white, fizzy, mostly diminishing, good lacing. Nose is lagerish fruity, flavor is pilsner malty, metallic, floral, honey. Medium sweet, medium hoppy bitter, light floral sourish. Finish is long lasting hoppy medium bittersweet, slightly acidic metallic. Light body, thin texture, average carbonation. Easy, refreshing, very lagerish, but quite hoppy, a bit boring though.", "Helder donkergeel/oranje bier zonder schuim. Smaak is bitter hoppig met iets van ananas en thee. Lekkere maar ietwat vlakke IPA.", "Gewoon een prima ipa met een flinke bitter. Smaak is echter vrij vlak en vlot weer weg. \n\n---Rated via Beer Buddy for iPhone", "Nice sappy hop aromas to this beer. Clear copper color with very light head. Bitter front that mellows towards the finish. Lasting bitterness after the sip.", "Bottle on train picked up from beer hawk. Medium golden coloured pour with a lasting white froth. Aroma is spicy herbal hop, gruit and hints of citrus rind. Quite interesting nose. Flavour is composed of semi chewy biscuit grains, little rye bread, spicy hop, pine needle, some resin, good English hop character, bitterness is bold and fairly clean. Palate is mid sweet, rounded, highish carbonation, light resin on the tongue. Lingering spicy hop.", "AH. Bek vol smaak, bitter, droog maar ook vettig. Gruizig. Klein zuurtje erin.. Backlog from 2015/07/14.\n\n\r\nHet Klooster, Delft. Caramel blond white head sweet mald very swee t. Hoppy fruity. Gronderig, ranzige olie. Ok.", "Bottle. Clear dark gold with a short-lived white head. Aroma of citrus fruits, pine and malts. Taste follows aroma with a solid malt backbone. Fruity and piney. Bitter finish. Medium carbonation. Balanced. Very nice.", "Pours slightly hazy golden. Weak pine, citrus, toffee, bread crumb, grass. Medium bodied, medium-high bitterness. \n\n---Rated via Beer Buddy for iPhone", "Pours Amber with a white head. Aroma is grassy and of hops. Body is light and texture is watery and a bit dry. Taste is fresh and fruity with a bit pine neddles coming in. Ends with a little bitterness and acicity tinkeling the tongue.", "A highly aromatic beer. It is clearly one of my favorite. I liked the hops they use.", "Drought pint at The Tipping Point Brewery Company on 12-Nov-2015. Pale amber colour with a thick white head. Medium to softly carbonated. Aroma of citrus, pine and malt. Floral taste, citrus, sweet malt and hops. A nice refreshing fruity pale ale.", "330mk bottle at RedHot Munich. Aroma is light pineapple, light peaches. Pale yellow to golden with a strong texturized foam. Taste is medium bitter and light sweet. Almost no carbonation, a bit watery and thin. Good though.", "Color ámbar oscuro opaco, poca espuma. Olores a fruta dulce y malta, algo así como melocotón y compota. En boca empieza dulce pero cambia para dejar un final amargo con un punto cítrico, q me ha sorprendido gratamente. Quizás no se sale un poco de lo q el resto de IPAs marcan como estilo, pero no desmerece nada. Sin duda la volveré a tomar.", "Pours a dark amber from a bottle. Aroma of golden syrup. Flavor is vegetally sweet, like root beer or European sodas made with real plant bits, hints of lemon. Doesn’t look, smell, or taste like an IPA to me. Blech.", "Good hoppy smell...not too much... A little bit of spice but could be from last beer, a little maltiness in there too, taste is a very mild IPA... Pretty good...little bit of sweetness with the mild bitterness, nothing very special here though...straightforward", "Bottle. Deep golden color. Aroma: honey malt sweetness, wild flowers, citrus and a little fruits. Taste: sweet malt and honey, wine, citrus, normal hop bitterness.", "Fruitée, légère avec une longueur en bouche honorable. Tres legerement amère. Une belle decouverte", "Flasche 0,33l: Bernstein, kupfer, klar, stabiler mittelporiger Schaum; fruchtige + sehr würzige Nase, kräftige Süße, dunkle Früchte, Zitrusnoten, kräftige Hopfennoten, Malz, Getreide, etwas Karamell, würziger Hönig, leichte Röstaromen, Hefenoten, fruchtig-würzige Bitterkeit; fruchtiger + würziger Körper, leichte Süße, kräftige Hopfennoten, dunkle Früchte, kräftige Zitrusnoten, Pinie, Malz, Getreide, Karamell, cremig, kräftige Kohlensäure, Hefearomen; angenehmer würzig-trockener Nachgang", "14.11.2015-bottle-0,355l- Clear amber with white head. Malty, pine, hints of tropical fruit. lively carbonisation, well balanced.", "Helder oranjekleurig met witte schuimkraag die aan het glas blijft plakken. Aroma van appelsien, citrus, bubblegum. Smaken van marsepein, ananas, mandarijn. Lekker drinkbaar bier met hoppige afdronk. Had misschien net iets bitterder en droger mogen zijn maar dat is persoonlijke smaak.", "Transparent light amber appearance. Very hoppy aroma. Thick cap. Tastes bitter, however too much waterish", "Alone at home. Clear golden colored beer with medium white head and medium carbonation. Hopped floral aroma. Full sparkling palate. Finish is hopped bitter with sweet hints. \n\n ---Rated via Beer Buddy for Android", "The beer has a dark golden yellow/orange color. The beer is very clear and not very fizzling. When pouring, a thick layer of rough white foam forms. The foam disappears really fast and almost nothing is left. The looks are common for IPA. The beer has a nice smell. It is a typical IPA smell. I smell hops, ofcourse, which result in a rich fruity citrusy aroma. The smell is really rich. The taste comprehends this. There is a nice fruity hop flavor, rest strong. There is a nice combination between sweet, bitter and sour. A very nice beer, but not very special.", "Good beer with great taste. Really enjoyed it. Really nice appearance, nice amber color. Really enjoyable. \n\n---Rated via Beer Buddy for iPhone", "12oz Flasche. Goldbraune Farbe, wennig Schaum. Kräftiges Hopfenaroma, grapefruit. Im Geschmack schön bitter mit einem Hauch verbrannter Karamell.", "Not a very good appearance for me, no head at all..but very nice notes on the nose, fruity and citrusy aromas are just mindblowing..medium to full body with nice sweet and bittery finish", "0.355 l bottle from local AH, bottled three months ago (6/7/2015). Clear, golden amber with a thin, frothy, slowly diminishing, white head. Sweetish, fruity-resiny aroma of honey, caramel, pine, apricot jam and orange. Sweetish, fruity-resiny taste of pine, honey, caramel, apricot jam and orange, followed by a medium long, slightly bitter finish. Medium body, slightly creamy to oily mouthfeel, soft to average carbonation. Very malty with weak hops, not what I would call refreshing. Easy drinkable though, quite decent.", "Clear amber color, modest head. A: citrus, faint hint of exotic fruit, bitterness, watermelon, yeast note. T: medium crisp, fruity bitterness with watermelon and lime notes. Moderate bitter. Dry but fruity aftertaste. Not bad.", "leather, citrus, white foam, hazy, pale, light sweetness, medium bitterness, lightly sour, light body, sticky, average carbonation, bitter,", "Clear amber color with airy head. Aroma of citrus, hops and caramel. Taste is a little sweet ending with nice bitter finish. Enjoyable.", "Bottle at Steam Hellsinki. Tropical fruits, citrus, grass and caramel. Somewhat sweet and bitter. Long and slightly bitter finish.", "Bottle. Clear copper color, white head. Malty and hoppy aroma, caramel notes. Malty body, hoppy, fruity.", "Very transparent and light amber color. The aroma is totally dominated by the bitter hops taste, the taste itself is sadley (aswell) dominated by the hops bitterness.\nBut it’s not a bad bitterness, just a bit too hopped taste \nThe carbonation is maybe a little bit too high but otherwise it’s great.", "35,5 cl bottle from Vinmonopolet. Pours cloudy golden with a medium big head. Aromas of hops, flowers and grass. Taste is bitter. Alright IPA I guess.", "Hellorange Farbe mit leichtem fast weissem Schaum.\r\nFruchtige Nase mit Pfirsich und Ananas.\r\nDer hohe Alkoholgehalt schlägt sich leicht im Geschmack nieder und wird von einer wunderbaren hopfigkeit begleitet. Die Bitterkeit bleibt noch angenehm im Gaumen hängen, ohne aufdringlich zu sein.\r\nSchmecht mir sehr! Ein geradliniges IPA ohne Schnickschnack, dafür ist es perfekt in seiner Einfachheit!", "IPA sympathique, couleur assez sombre, goût très léger sur les agrumes, assez malté, des notes d’orange, de caramel et de miel. Goût assez simple et une relative longueur en bouche. Un peu trop sucrée à mon goût pour une IPA. Un ensemble correct tout de même.", "Leckeres IPA, wenig Frucht, relativ herb. Kaum bis kein Schaum, recht klar, bei jeder Trinktemperatur. Hat eine tolle Farbe.\nIn der Nase leichter Pfirsich und im Geschmack fast wie ein helles Sommerbier. Ursprünglich wohl mal Saison...\nSehr lecker, aber kein Highlight!\n\n---Rated via Beer Buddy for iPhone", "Aroma is floral. Head is non existent and goes flat quickly. Perfumey and nutty hops. Can’t get anything other than a bitter floral hop finish. It seems smooth but the high alcohol content goes straight to the head. A very heavy IPA.", "35,5 cl. bottle @ home, bought @ Albert Heijn Culemborg.\r\nClear amber with a thin white head. tropical fruit aroma with some pineapple and malts. Medium bitter taste with medium to low carbonation. Nice gentle malty IPA.", "At Home gold blond-colored body with a white head and with a citrus fruity hop aroma a spicy yeast sweet fruity dry bitter taste with a alcholic bitter finish", "Colore dorato carico, limpido. Schiuma bianca abb pannosa e piena. Buon intensità di luppolo al naso. Si conferma molto buona alla bevuta, con ingresso luppolato, continua intensa e l’amaro si bilancia con il dolce. Del malto. Media. Carbonazione, alcol 7% si avverte. Sul pasto è ottima", "Clear, amber. Moderate, white head which starts to fade away after around 5 minutes.\r\nNose: Lots of hops, sweet maltiness, dried grass, some pine. Lovely, \r\n\"promising\" nose.\r\nTaste: Medium light bodied, noticeable hops bitterness, refreshing, spicy (hops again), slightly sweet and almost \"fruity\". Massive carbonation, frothing in the mouth. Long finish, combining a pronounced hops bitterness with a malty sweetness . \r\nExcept for the nose, which is great, it´s not a very complex or complicated beer, just well made and a lot of hops. \r\nFor me this is either a summer or food beer (or both, of course). Went well with brown crab au naturel.", "Cerveja de cor dourada, ambar, com turbidez leve. Aroma fortemente lupulado, com notas de queijo. Amargor moderado, mas razoavelmente taninoso. Sabor de caramelo. Cerveja sem grande destaque.", "- Look: Copper\r\n- Nose: Soft pine sugar hops; lime citrus; some caramel-y toffee malt. \r\n- Body + Finish: Oily (high-ABV), almost ginger-sweet malt; hops too.\r\n- Like a super-charged Doom Bar. Slightly more floral, and oily (higher ABV?) than its stablemate Brooklyn Lager. Lots to like about this.", "How:  Bottled.  Aroma:  Heavy citrus hops flavors.  Appearance:  Light amber colour, with medium heavy head.  Taste:  Ligth sweet, bitter light to medium.  Palate:  light to medium body, texture slick to a bit sticky, soft carbotnation, long lasting finish.", "Bottled. Color of cloudy, amber, white foam. Aroma: citrus, herbs. Taste: light sweetness, medium bitterness. Palate: light body, slick feel, soft carbonation, long finish.", "Bottle. Amber color with medium-big white head. Clear. In aroma dominates caramel, pines, tobacco. Flavor of dates, tobacco. Some peppernes and grassiness also inside. Hoppy finish. But body of beer is really flavourfull and well balanced with hops. Overall: Personally, I would add some toast, bread character but still really nice brew.", "Almost clear light amber, foamy head and lacing. \nA little sweetness up front followed by light bitterness and some complexity. \nFirst few sips were metallic but that was washed away with more sips with salsa and chips. \n$9.99/multi sixer at Wegmans Leesburg VA", "Aroma:\n\n\nMedium aroma of malts, caramel, fruit, tea, hops and citrus.\n\n\n\n\nAppearance:\n\n\nClear/hazy golden/amber beer with a slight/medium off-white head.\n\n\n\n\nTaste/Palate:\n\n\nStarts medium sweet with malts, caramel and fruit; ends slightly bitter and dry with tea, hops and citrus.\n\n\n\n\nOverall:\n\n\nThis beer is rather intense, complex and balanced. The aroma could have been stronger. A lot of malts, but not many hops to match it. A tasteful beer for sure, but could have been much better.", "One of more or less light body IPA. Amber colour, white top. Hoppy and bitter. Concerning its commercial note, more than decent. Very drinkable. Pine notes.", "355 ml. Fast dissapiring white head. Golden. Pine, malt and dry-hop notes. Taste caramel, some grape. Nice mouthfeel and balance. Malt Sweetnes and hop bitternes Well balanced . A god IPA standard\n\n---Rated via Beer Buddy for iPhone", "Pours a clear amber with a small white head that disappears quickly. Aroma is sweet malt, grass with hints of Scottish heather towards the end (weird). Taste is heavy on the biscuit malt, citrus is pretty prominent with a slight piney finish. A decent beer but would prefer less malt and more hops.", "Que puedo decir, estupenda IPA. Maltosay lupulosa y amarga. Buen cuerpo buena espuma. Hail!", "Smells like pilsner with some sugar and lime. Clear golden colour with almost no head. I dont like it. Its flat, malty and just a tiny bit of hops. Boring!", "Clear copper coloured beer with weak head and some subtle bubbling.Smell is grass lime sweet-bitterness. Hint of white pepper.Taste is bitter sweet. Dry astringent finish. Lime sweetness. Crisp with a nice fizz. Sticky finish.", "Hazy deep Amber thin semi Lacy head; aroma is softly sweet and subtly hoppy; flava is nice hops mild up front then more forward hop bitter; feels medium slight fizz; finishes hoppy and softly caramelly", "Maker: Brooklyn Brewery, New York, USA ***\r\nBeer: Brooklyn East India Pale Ale (bottled, unfiltered, 330ml) ***\r\nStyle: India Pale Ale (IPA) ***\r\nALC.VOL.: 6.9% ***\r\n\r\n\"Brooklyn East India Pale Ale, originally a summer seasonal, has been getting raves since becoming a year round offering in 1996. Garrett Oliver, a student of English brewing and beer history, uses English malts and hops to brew his EIPA in the classic, heavily-hopped style of the 19th century beers created for British soldiers serving in India. \" [brewery notes] ***\r\n\r\nColour: Hazy deep orange, with a small, off-white head. ***\r\nNose: Citrus, pinewood, hints of caramel, herbs. ***\r\nTexture: Full-bodied, a bit oily. Mild carbonation. ***\r\nTaste: Grapefruit, pinewood, resin, some caramel malts. Very fruity, but still not sweetish. More resin towards the middle. Hoppy, bitter, but with a slight caramel sweet note in the background, which leads into the finish. Resin and caramel notes there, the aftertaste dominated by the latter, along with pine, but no more resin. ***\r\n\r\nImpressions: Powerful English-style IPA from Brooklyn with a nice balance of bitter and fruity notes, and some depth to it. Eminently drinkable (be careful, it’s 6.9%), highly recommended.", "Pours clear amber with medium white head. Hoppy nose. Aromas of citrus, grapferuit, resinous pine and some caramel. Average carbonation, medium body. Long bitter and piney finish. Rather great average IPA.", "Ipa de 6,9 % abv en format 35,5 cl, avec des houblons américains et du East Kent Golding pour une\r\nautre face de l’amertume.\r\nCouleur ambré moyen, à la clarté nette.\r\nBulles très fines, par milliers en fontaine centrale virevoltante. Magnifique.\r\nMousse beige moyen, crémeuse, qui nappe à 2 mm.\r\nArômes de malt grillé, fruit confit, pâte de fruits, fruit de la passion.\r\n1ère bouche souple au splendide ensemble fruit/malt/levure.\r\nArrière-bouche dense, tout à fait à l’équilibre, avec une amertume merveilleuse.\r\n2ème au sublime équilibre malt/houblon/fruit.\r\nArrière-bouche qui touche à la perfection.\r\n3ème superbe bouche avec du tabac brun, pointe de seigle, pain complet.\r\nArrière-bouche harmonieuse, et très heureuse amertume.\r\nLongueur de toute beauté, avec des épices fines, quelques herbes, du bois blanc, de la résine.\r\nJambes fines, marquées, un rien huileuses.\r\nLevure fine, un peu résineuse, très belle ligne.\r\nAlcool au magnifique dosage, entre du consistant et une aide à l’amertume.\r\nFinale qui est une merveille pure.\r\nCONCLUSION : comme l’explique le brasseur, il n’a pas voulu d’une ipa qui arrache l’émail des dents (joie image !!), mais d’une ipa équilibrée entre amertume et douceur. Quelle prodigieuse conception, et quelle belle réalisation !! When east beats west ...", "Nice bitterness, little sticky resinous, somewhat malty. Veggies, what else can I really say. Bottle from a Gall and Gall", "Average of-white head with good retention. Clear orange amber colour. Aroma is citrus, floral and malt. Taste is hoppy bitter, floral and malt. A quite good malty IPA.", "Aroma of high hoppiness, citrus and grapefruit. Taste is light malts, hoppy and friendly. A decent classic that works everyday.", "Beautiful light brown colour. Has a light caramel flavour. I was hoping for a more fruity taste. \n\n ---Rated via Beer Buddy for Android", "Bottle in Brussels. Nice orange body with thin head. Nose is floral, citrus and hops. Taste is maltier, with skunkiness. And some caramel. Bitter in the finish.", "Clear orange body, medium white head. Aroma of citrus, orange peal and light caramel notes. Flavour of citrus, orange, light caramel notes. Bitterness in the background. Medium bitter and dry finish. Not an hop bomb but quite good.\n\n---Rated via Beer Buddy for iPhone", "Pours a clear amber body with a thin head. Nice hoppy aroma. Very nice taste with fruity tones and a bitter end.\n\n---Rated via Beer Buddy for iPhone", "Pours golden with no head. A bit citrusy and some hops. Easy to drink. But dont have the hoppyness of a ipa", "355ml bottle. Light unclear golden orange color with off white head. Malty and hoppy aroma, caramel, bread, pine, grassy, light fruity. Sweet and bitter taste like aroma. Medium oily body with soft carbonation.", "355cc bottle. Pours Clear Orange with thin white off head. It is a bit citrussy, floral, grassy/earthy and spicy. Malty flavour is almost like a premium lager. Some caramel sweetness in the midle but mostly bitter. Nice overall", "@ Basunen 15-7-31: mycket beskeden doft. Smaken är ganska söt och maltig i tillägg till att den känns ganska flat.", "Bought at the local supermarket, AH.\r\nClear amber beer with a small white cup, low carbonation.\r\nTaste is very fruity, tasty little bitter, grapefruit, citrus.", "Très douce, bel équilibre entre amertume et corps légèrement sucré. On reste sur des agrumes agréables pour une IPA très légère.", "Bottle. Pours hazy amber with almost no head, what’s wrong here? Very low carbonized and some tastes that I’ve had with IPAs that were too old. Best before 04/16 though which is odd for an IPA.", "Très peu de mousse, une couleur jaune orangé, un arôme houblonné, au goût une forte présence d’amertume qui dure. 33 Cl Galeries Lafayette.", "Not a very strong smell. Poor head retention and light color. Nice balanced taste that has lasting flavor on middle of tongue. Nice pale, not strong like ipa should.", "Bottle @ home. Amber colour with a medium sized white head. Smells hops, malts, sweet, fresh, nice. Tastes hops, sweet, fresh, nice. Thin to medium body, nice carbo.", "Medium foam. Good aroma of hops and flower. Full-bodied flavor where the hops provide space for a discreet floral taste. Palate is citrus with prolonged hoppy biterness. Fine and tasty IPA.", "355 ml bottle@home.\r\nAppearance: cloudy yellow golden with nice white head.\r\nAroma: lemon, c-hops.\r\nTaste: decent citrus, medium bitter.\r\nPalate: refreshing, somewhat watery, lasting light bitter, medium CO2.\r\nOverall: nice.", "Pours a light caramel body with a medium head. Floral hop beginning with a nice citrus finish. Enjoyable session brew. \n\n---Rated via Beer Buddy for iPhone", "Barwa zlota, klarowne, niewielka drobnopecherzykowa piana. Aromat karmelowo-cytrusowy, ciezki. Smak mocny, alkoholowy z wyrazna dobrze korespondujaca goryczka. Czuc rozgrzewanie w przelyku. Nie ma szalu.\nButelka 10.02.2016", "Hultsfred, flaska. Fruktig väl sammansatt arom. Vitt skum. Mycket välbalanserad. Pålitlig och en tröst bland idiotbittra ipa:s", "Drank with Thierry in Malden 15-7. Okay IPA but a bit flat, not very much rich hop tastes.", "33cl bottle at home. Hazy golden with a medium white soapy head. Medium body with moderate carbonation. Medium bitterness with subtle fruity sweetness. Pine, grapefruit, citrus, caramel and peach. A tasty IPA.", "Balanced IPA with a piney aroma. Taste of stone fruits. Clean bitterness. A good IPA", "Small, fast gone yellowish head over faintly veiled orange-copper beer. Citrussy, limepeel, oranges; faintly meaty nose. Quite bitter, but a smooth bitterness; marmalade, bit astringent. Finish is a tad less fresh, more alternative flour-like. Light body - feels a lot more spritzy than its lame looks. Quite good, if indeed certainly not a West Coast IPA.", "A malty beer with some hop traces. More like an a maty impetial pils than a IPA. Ok.", "The aroma is full of hops, pine needle, caramel, citrus and flowers. The taste is full of hops, caramel, citrus and flowers. The color is dark caramel. A pretty decent beer.", "Can\r\nAroma- floral, mango\r\nAppearance-golden, hazy, white foam, \r\nTaste-medium bitterness, medium sweetness, lightly sour, \r\nPalate-medium body, slick feel, average carbonation, abrupt finish\r\nOverall-very good", "Very acessible and a bit boring. The nose is nicely fresh floral hops. The flavor is malty fruity fresh with nice hops but not very bitter. Middle of the road.", "Bottled from AH in Mestreech. Orange colour with huge white head. Hoppy and fruity nose. Aroma is hops, fruits and, vitrus tones and caramel. Flavour is the same with mix of hops. Bitter hoppy ending. Great!", "0,33l bottle @Flesland, then another bottle in Oslo. Mild aroma, nothing special. Flavour is ok regarding hops and bitterness. Not a fantastic beer, but a decent, albeit a mild, IPA.", "IPA americana apresenta coloração acobreada,creme médio duradouro,aroma delicioso de malte com toques cítricos,no sabor lúpulo domina dando um amargor gostoso;malte e álcool se juntam formando um belo conjunto.Cerveja forte,robusta com personalidade;uma IPA bem feita e de respeito.", "Botella. @La Taberna de Hank, Luanco. 13/06/2015. Color amarillo,  aroma frutal, sabor frutal resinoso.", "Color té oscuro, cobrizo. Espuma muy abundante, ligeramente manchada. Aroma lupulado clásico, espaciado cítrico, uva. Cuerpo suave y cremoso. Sabor muy lupulado con un carácter especialmente seco. Agradable buen ejemplo de IPA inglesa hecha en US.", "Bottle. Clear gold/yellow, white head. In aroma is herbs, flowers, not intense as the bottle was quite old. In taste malty base and hoppy flavours from aroma. Medium body, medium bitter, very balanced. Nice one.", "A very easy drinkable India pale ale. A good beer for newbies. Try it if you havent", "One of my favourite pale ales. Beautiful golden body and light on the carbonization. Hoppy and refreshingly bitterness. Tones of honey and caramel. caramel, herbs, vanilla, amber, clear, medium sweetness, medium bitterness, full body, soft carbonation, long finish"]}