{"reviews": ["Bottle from Rabbit Hash General, drunk in Palmyra. Dark red brown, big pretty head. Complex roasted nose that reminds me of pecan fudge; plum/prune. Giant caramel flavor, butterscotch fudge, big bitterness balancing the sweetness. I love the complexity. Very good balance for such a heavy eight percenter!", "Mooie scotch ale. Deze is wat minder zoet dan de meeste, maar heeft wel viscositeit. Prima body van melkchocolade, kandij, wat koffie, hop voor een diepere bitterheid, gedroogde vijg.", "zapach przyjemny, słodki, ciężki, wertersy, praliny, słodki karmel, jasna melasa, spieczona skórka z drożdżówki, makowiec, krówka, w tle słodkie i kwaskowe czerwone owoce. okrągły, złożony. kolor miedziany, lekko opalizujący, piana beżowa, drobna, ogfita, dość trwała jak na styl. w smaku pełne, ciężkie, karmel, spieczony chleb, masa ziół, ziemia, tytoń, praliny, drewno, trochę przypalonego drewna, torf, czarna herbata, w tle alkohol, cierpki i wytrawny, ale przyjemny. całość dobrze zgrana, okrągła i lepka, ciężka, ale nie męcząca. goryczka wysoka, karmelowa, ziołowa, alkoholowa, długa, ściągająca, bardzo dobrze kontruje słodowość. nasycenie wysokie.", "Alone at home. Brown colored beer brownish head and lots of carbonation. Malty chocolate coffee aroma. Full sparkling palate.  Finish is malty coffee alcoholic bitter sweet.", "Colore marrone scuro, schiuma nocciola, media compatta. Al naso aromi di malto, caramello, note affumicate. Al palato note di malto, nocciola e liquirizia, il gusto è mediamente dolce, il finale è leggermente terroso e secco. Il gusto è dolce, Una birra molto armonica e pulita in cui il dolce ed il secco sono ben equilibrati, l'alcol si percepisce ma comunque rimane molto bevibile.", "thuis een donker bruin kleurig lichaam met een wit bruinige kop en met een geroosterde mout donker fruit karamel aroma een geroosterde mout donker fruit koffie karamel droge bitter smaak met een alcoholische bitter einde", "Dark brown colour, perhaps with some haziness though it's a hard to tell in a dark beer. At most one and a half finger of dark greyish/light brownish head, which soon recedes to a thin layer but still leaves nice lacing. Nice malty depth in a quite vivid aroma: toffee and caramel, plus light nuttiness and a hint of espresso coffee. Some dark or red fruit notes in the background. All among a nice warming feel. Taste notes more or less follow the aroma, though in not so nitid kind of way: the malty sweetness feels more 'generic' and is followed by a nice smoky/peated note. There's a nice warming feel as the smell suggested and lightly (pleasantly) perceptible alcohol. It's a very sweet beer but there's also a good amount of bitterness to bring balance, with a sweet edge in the mouth and a balanced finish that shows a hint of earthiness. Medium to dense in body with quite light carbonation, resulting in a nice half creamy, half smooth mouthfeel. A very nice one.", "Ambrata scura, limpida, schiuma color nocciola, persistente. Al naso note di caramello, nocciola, dattero ma anche qualche nota ossidata (carruba). Al palato leggermente meglio. Corpo medio, secca, carbonazione fine.", "Pours a beautiful deep mahogany color, with a good amount of off-white/yellow foam. Aroma is sweet and malty with some hops and maybe dark fruit. Taste is more of the same. Good stuff.", "Malty aroma, reddish brown color.  Taste is a complex balance of thick malt sweetness, caramel, burnt wood, and floral/earthy hop bitterness at the end.  Lingering woody aftertaste.  Excellent example of the style.", "355ml bottle (bottled 18/01/21) from Jumbo supermarket in Stein, Nethelands.\nF: medium, tanned, good retention.\nC: brown, hazy.\nA: rich malty, fruity, herbal, berries, caramel, peat, toast, bit chocolate, dried fruits, spicy.\nT: full malty base, caramel, herbal, spicy, peat touch, toast, red berries, dried fruits, dry on the palate, medium carbonation, very good balanced, fully enjoyed.", "Bottle from Dranken Verheyen in Poppel, Belgium. \nThe beer is hazy dark brown colored with a stable creamy head. Carbonation is good. \nThe aroma is malts, caramel, dried fruits, vanilla, chocolate, cacao and spices. \nThe taste is medium to full bodied and sweet malty with caramel, plums, dried fruits, vanilla and goes to bitterness with chocolate, cacao, yeast and spices. \nThe finish is dry, bitter with long staying chocolate.", "Sweet licorice, anis, Sweet licorice, anis, vanilla-bourbon touch. Drying-seert finish on touch. Drying-sweert finish.", "Flesje thuis gedronken. Donker roodbruin bier met matig schuim dat snel weg trekt. Aroma van chocolade en vanille. Smaak van gebrande mout en pruimen. Nasmaak rokerig en bitter.", "Very nice malty and yeast driven been. It’s actually not so chewy or big, yet it has loads of complex estery flavours. Great balance. Sterk ams", "Brown body, thin white head. Whisky, caramel, a bit of fruits and nuts. A bit malty, light bitterness at the end.", "Bottle of 33cl, in a Trappist glass; from the fridge. Drinked @home.\n\nWe're in front of a light brown beer, lightly clear with a beige head. Good carbonation.\nAroma, and first taste, are a mix of milk chocolate and barley. Alcoholic aftertaste, but sweet.\n\nGood.", "Founders Dirty Bastard Scotch Ale 8.5%. Deep ruby, toffee and whisky aroma, full bodied, dark malt, dark fruit, whisky, peat, smoky, complex flavours. Stunning Heavy from Grand Rapids, Michigan 🇺🇸", "Bottle from Hop Shop \nPours with a vast head that hangs around Colour is deep dark ruby. \nAromas: dark fruits, a whiff of whiskey, toffee apple? \nCarbonation is pretty soft, medium body. Nice warmth from the alcohol but blended really well. The resinous sweetness is very nice, without being at all sickly. \nVery enjoyable brew.", "Donkerbruin bier met mooie stevige schuimkraag. Smaak is licht bitterzoet met iets van karamel, wat geroosterd brood en toffee. Heel erg goed.", "En nariz, afrutada y maltosa. Se la ve caer en vaso con un color marrón oscuro, casi negro, con más de medio dedo de espuma uniforme, de tono granate. Es untuosa, sólida, con personalidad.\nEn boca presenta tonos semejantes al licor, poderosa, fuerte y contundente. De trago fácil, pero corto, para no excedernos por la presencia de alcohol y saborear también la probable presencia de frutas oscuras, de hueso.\nNo es mi Scotch favorita, pero es una muy buena opción.", "Pours dark brown with a small tan head. Aroma of caramel, toffee, roasted malt, and dark red fruits. Perhaps some cinnamon. Taste of follows the nose. This is a full bodied brew and is well balanced.", "Opaque copper-mahogany colour .... rich , toasty malt , syrupy aroma ... very bitter  , very tart , rich malt , full bodied ... great sipping beer ... delicious , well balanced , big , bold & sharp : Terrific !", "Clean ruby brown colour. Malty caramel aroma. Caramel and cherry flavour. Hoppy bitterness as aftertaste.", "Belle robe brune accompagnée d'une belle mousse blanche dense et épaisse.\nSenteurs de réglisse, de pruneaux et de kirsch aux notes herbacées et pimentées.\nD'entrée, la première gorgée fait office de coup d'estoc, arômes amples et denses : se mêlent la réglisse, le pruneau, le kirsch, la prune, le caramel pour un final accrocheur, puissant d'alcool fort mais gouleyant.\nDe beaux accents poivrés font leurs apparitions en seconde bouche, l'ensemble est liquoreux et complexe en bouche, c'est fin, caractéristique de la brasserie Founders qui nous gratifie décidemment de bien belles productions à son catalogue.\nOn se plaît à laisser le breuvage macérer en bouche pour notre plus grand plaisir, et on sait que l'on a affaire à une grande réussite et les 8,5 degrés tempèrent toutefois nos ardeurs.\nMerci Founders pour ce petit bijou !!", "Bevuta in bottiglia da 33.\nAroma di cioccolato tostato alle olive.\nSchiuma a pezzettoni, colore rosso scuro quasi brunito o bruno. \nGusto tostato forse troppo ma il giusto. Cioccolato, caffè e forse liquirizia.\nCfgpPr", "I go for this one fairly often. Opaque brown color and creamy head. Dark malts and fruit, burnt bread, cocoa, an effervescent bitterness. Boozy and warming in the winter.", "Perhaps my first scotch ale in ten years and second ever. Smooth, dark, heavy, alcoholic. To retry.", "Well when you’re craving a solid scotch ale, this standard-setting flagship brew from Founders does not disappoint. From the bottle into a snifter, this poured a rich, faintly murky, mohagony brown, par for the style but in a bolder way. The aroma is the only aspect of this beer that struck me as somewhat understated, with notes of burnt caramel / toffee and red fruit. The flavor is an excellent display of malty complexity, and finishes nicely with a touch of smoke and a clean-finishing hop bitterness. Overall very smooth, although the booziness becomes more apparent as this beer warms. Calls to minds alcohol-soaked raisins, not that I’ve ever tried that. Warming, hearty, well-executed. Worthy of its reputation. “Par for the style, but in a bolder way.”", "I poured it from the bottle into a tulip glass.  It pours a mahogany with a beige head and lacing.  The aroma is caramel, nut, alcohol, and earthiness.  The taste is molasses, earthy hops, nut, and alcohol.  I usually don't love this style.  This one might convince me otherwise.  It does pack some punch.  It's very tasty though.  It's another solid offering from Founders.", "Eingetrübte bräunliche Farbe mit beiger Schaumkrone. Malziger, röstmalziger, fruchtiger Geruch. Geschmacklich malzig, röstmalzig mit Kaffee, Toffee und dunklen Früchten, leicht hopfig. Mittlere Süße mit leichter Bitterkeit, mittlerer Körper mit spürbarer Kohlensäure.", "355 ml bottle. Unclear mahogany brown, small beige head. Earthy notes, smoke, toffee, pine, dry grapefruit notes, spicy hops, burnt sugar. Dry hoppy bitterness, malty sweetness. Full bodied, oily texture, soft carbonated, dry bittersweet finish. Really hoppy, malty and very balanced!", "Fantastic ticks all the boxes scotch ale. Great head and mouthfeel. Very malty and fruity. Full of flavour. Fantastic one to try and source again.", "Hazy, copper brown with hint of red. Very little head that dissipates quickly. Plum, dried fruit aroma, slight maple. Chewy malty body with warming alcohol on tongue. Biscuit, plum, slight cherry flavor. Hint of oak and light smoke on finish.\n\n---Rated via Beer Buddy for iPhone", "Poured from 12 oz bottle into tulip glass. A 1\" tan head settles slowly with mild lacing. Color is color. Aroma of coffee, rich roasted malt, yeast rolls, hops. Mouthfeel is heavy with a slowly drying finish. Flavors of smoky, earthy malt, coffee, raisin, strong hop presence in middle and finish. Overall: excellent.", "Thick tan foam. Amber ale. Sweet flavor  of oak, horhound, and scotch. Dates and oak finish.", "Colore rosso rubino; schiuma beige, a grana molto fine, abbondante e abbastanza persistente.\nAl naso prugna.\nIn bocca sapore prima dolciastro poi acidulo, prugna, amarena, caffè.\nCarbonazione leggera, corpo medio.", "Robe brune très intense. Mousse ivoire dense qui reste bien dans le verre . Fines bulles nombreuses. \nNez sur le chocolat au lait, le caramel , le sucre brun , les fruits confits notamment des fruits rouges, des touches d alcool chaud . \nOn retrouve les mêmes touches que au nez , avec principalement une petite amertume qui apporte de la fraîcheur . Des notes d épices , et poivré dans un second temps . Et une fin de bouche plus alcoolisé notamment quand la bière se réchauffe. \nTexture liquoreuse , final sucré .\nTrès complexe , on redécouvre des notes à chaque gorgé et quand la bière se réchauffe.", "355ml bottle brewed in Michigan at 8.5%. As-good-as-black ruby, with a wee off-ivory head, OK duration. Classic aroma, sultanas, raisins, chestnuts, chocolate cake, smoke, black cherry and booze. I do love a Scotch Ale now and again. Low carbonation, slick easy mouthfeel. Chocolate, toffee, toasty malt, very light smoke, sultana, dry slightly sticky finish. Some fruity coffee in the aftertaste. Legendary Scotch Ale, alas not brewed in Scotland, but a flag-bearer for the style. This bottle just shy of two years old, and aged nicely.", "Color marrón oscuro, con reflejos rojizos, casi opaca. Espuma beige claro, amarillenta, de casi dos dedos de espesor y retención media. Aroma medio intenso, licor, madera, maltas tostadas, caramelo, frutas muy maduras como higos, plátano, manzana al horno, bizcocho \"borracho\" y pan tostado. Sabor medio intenso, madera, maltas tostadas, licor, pan negro, frutas desecadas, canela, final medio, dulzor frutal medio y ligero amargor y sequedad que acompaña hasta el posgusto, alcohol notable. Textura semioleosa. Carbonatación baja.\n\nMaravilla que no me canso de oler y encontrar matices. La falta de cuerpo y el ligero exceso de alcohol forman parte del estilo.", "Smoother version of Sam Adams, less hoppy; good drinking, like but not favorite", "30cl van de tap bij De Boterhal, Breda\nAlcoholpercentage van 8,5%\nUitgetapt in Boterhal glas\n\nUiterlijk: koperbruin met goede vaste crèmekleurige schuimkraag \n\nAroma en smaak: aroma zoete mouten, zoet rijp fruit, smaak is karamel, snoepjes, rijp fruit, licht gebrand bittertje", "Brun/röd klar med smutsvit skum. Doftar och smakar russin och torkad frukt. Bra sötma och beska", "Mitja carbonatació, bona retenció. Aromes a prunes, caramel... Maltosa i complexa. Clàssic de Founders, de les primeres cerveses seves...!", "Bottle at home. Deep reddish colour with some beige lacing. Nose is lightly roasted,  dried fruity. Taste is low sweetness some bitterness, surprisigy thin body. Fast finish. Was expecting more.", "Pours brown to copper, large frothy tan head, lacing, sweet-caramel coffee flavor with a lingering semi-bitter finish. Low carbonation.", "Très belle robe brune, avec quelques reflets rougeâtres. Mousse inexistante.\nNez malté et torréfié. \nEn bouche on confirme les arômes du nez avec un superbe soyeux. \nUne scotch parfaitement équilibrée, à recommander  sans hésitation !", "Pours a dark reddish brown with a tan head. Aroma is slightly woody, some spice, raisin, caramel. Taste is a gathering sweetness growing into a sweet caramel middle, changing into a rather bitter finish that lingers for a good while. Medium bodied, medium to low carbonation. Really good.", "Nose is sweet, caramel, butter. Palate is slightly bitter, brown sugar, coffee and caramel. Ok Scotch Ale", "Restrained malt aroma in a deep red brown pour.  Rich preserved fruit body with a perfectly balanced bitter finish.", "Aroma di frutti scuri, malto tostato spezie e caramello.\nIn bocca sentori marcati di frutti scuri caramello e spezie. Retrogusto alcolico e speziato.", "Birra dal colore ambrato carico con riflessi rubino, schiuma  beige presente, abbastanza limpida, aromi di biscotto, caramello, datteri, fichi, pere, legno barrique, al palato tendenzialmente dolce e leggermente acidula, corpo pieno e leggera carbonaziona. Da provare", "color: negro, espuma tostada persistencia media\nolor: alcohol, dulce.\nsabor: alcohol y amargor medio, compleja, cafe.", "Bottle. Pours deep brown. Caramel, biscuit, earth, savory bakery products, dried fruit. Medium body. Decent.", "Bottle from Varsity.  Not a full review - good dark red color and thick head.  Malt and peat - solid if a little heavy-handedly 'Scottish'. But packs a punch with that ABV.", "Bottle, 0.355l. Deep amber pour, thin soapy off-white head, short lasting. Minimal lacing on the glass. Nose is heavy on the malt, strong caramel and sugary notes, quite intense, slightly toasted. Hints of liquor. \n\nMedium to full body, soft carbonation. Creamy texture, thick and chewy, very soft mouthfeel, mild prickly. Sweet taste with subtle alcohol bitterness. Aroma of toasted caramel, toffee, brown sugar, molasses. Syrupy, nutty. Subtle herbal spiciness. Liquory, rum notes, nicely warming, alcohol slowly builds up toward the finish, gentle burn on the tongue. Nicely balanced. Medium lasting finish.\n\nQuite tasty.", "From a bottle to a glass. Pours a clear darker copper color with a massive off white frothy creamy head. Aroma is sweet malts upfront honey brown sugar and slight darker fruits. Taste follows the aroma with hints of spice hops and molasses, mocha, caramel in the sip. Medium mouthfeel. Awesome Ale!", "Nose. caramel, burnt sugar, sweet fruits a little rum.\nTaste. Lusciously sweet, Russian candy \"Barberry\"\nDid not like..", "Bottle 33cl. @home poured into a teku glass. Slightly hazy deep amber brown, small frothy tan head, mostly diminishing, light lacing. Rich and strong aroma, roasted malt, caramel, candy sugar, dried dark fruits, treacle, ripe plum, alcohol. Taste light heavy sweet and light (malty) bitterness, roasty, candy sugar, caramel, treacle, light chocolate, alcohol. Full-bodied, oily to sticking texture, soft carbonation, smooth bittersweet finish with warming-alcohol, certainly not oversweet, good balance, but be careful this is heavy stuff, well-made, a real sipper, excellent.", "Robe brune, trouble, un peu de dépôt. Mousse beige, faible tenue. Arômes biscuits, cassonade, épices, fruits secs, fruits à coques, fruits noirs, un peu d'esters. Goût très sucré, amertume très faible. Texture sirupeuse. Carbonatation très fine, peu abondante. \n\nPour une scotch, ça manque de fumé.", "Ho fatto fatica a finire la bottiglia, estremamente luppolata tanto da risultare stucchevole", "Dark ruby pour. Earthy, bready malty tones as well as in the nose. Sweet yet slightly bitter", "Pours clear reddened brown.  Off-white head with small bubbles.  Mild lacing.  Deeply earthy, almost skunky aroma.  Taste fronts bitterness.  Earthy hops tempered with bready malts.  Dry, caramel finish.  On the whole, too bitter for my taste.", "Аромат немного сладкий как от ликера, намек на женную карамель и патоку, возможно легкие леденцы. Цвет темно красный, очень красивый, при этом пены слабая и тонкая. Вкус крепкого пива хоть и без особого алкоголя. Снова патока на первом плане, немного жжености. При глотке приятная хмелевая горчинка, причем весьма продолжительная. При согревание все таки есть алкоголь, но тоже не сильный. Ликерные нотки тоже на месте вместе со сладостью. В целом отличный скотч эль.", "Liquide brun foncé, petite mousse. Nez alcoolisé, caramel, candi, fruits noirs. Bouche aigre mais aussi aux goûts de mélasse, de fruits noirs (griotte?), porto, sucre/sirop, quelques épices, du caramel. Petite amertume mais présence dominante d'alcool et de sucre qui enlève toutes nuances au produit. Une Founders qui me déçoit !", "Ambrata scura ai limiti della “tonaca di frate” con riflessi rubino, velata e con lievito in sospensione, schiuma beige chiaro,compatta, grana irregolare e dalla buona resistenza. Al naso ricco bouquet di malti, leggera tostatura, caramello, melassa, punta di miele, crosta di pane, uvetta sotto spirito. Al palato l’inizio è dolce, zucchero di canna, malto, biscotto, suggestione di marmellata di frutta scura, datteri, fichi poi leggera affumicatura e note legnose, con finale ben luppolato su territori resinosi. Retrogusto etilico e amaricante al punto giusto e una punta di spezzatura. Corpo e carbonazione media.", "Ruby red color when held to light thick tan foamy head smell of roasted malts chocolate taste is really smooth taste the roasted malts light chocolatey can taste bitterness in aftertaste cant taste alcohol great beer", "Cette Dirty Bastard Scotch Ale est un brin ennuyeuse. Le genre n'est cependant ni le plus facile, ni mon favori. Le cocktail aromatique de caramel, de mélasse, pomme, poire, fraise et épices a du mal à nous faire nous emballer. Car sinon, celle-ci est plutôt bien structurée, et su le sucre est peut-être un peu trop présent, l'amertume, bien dosée (50 d’IBU) confère une bonne fraîcheur et l'alcool, à 8,5% soutient bien des arômes et donne un bon caractère (notamment sur la 3ème bouche). En verre nous sommes sur un cuivré opaque surmonté d'une mousse brune de 5 mm. Le nez se porte principalement sur le caramel, avec en complément de la pomme, fraise, poire et une pointe tourbée. Une texture agréable se laisse découvrir à l'attaque sur une bonne amertume mais des arômes quelque peu ennuyeux de caramel mélasse, pomme, poire, fraise avec une pointe de poivre. Ce cocktail nous suivra pendant toute la dégustation. La deuxième bouche est un peu plus profonde avec des épices se faisant davantage ressentir. Heureusement que l'amertume est toujours présente, permettant de donner de la fraîcheur à une base sucrée. L’arrière-bouche, linéaire est toutefois sur une bonne présence en bouche. En troisième bouche l'alcool se fait davantage ressentir donnant un bon caractère et laissant place à un final d'une bonne longueur mais plus doux. Peu passionnant.", "pite jakiś czas temu. uzupełnienie profilu. Ocena przepisana z utpd. Miłego dnia.", "En copa, cerveza marrón-rojiza muy oscura, con una fina capa de espuma color crema. Aroma dulce a cereales y caramelo, junto con mucho licor, madera de barrica, especias, regaliz, toffee, frutas oscuras, canela y un fondo ahumado. En boca, textura ligera y acuosa, de carbonatación baja y amargor muu suave. Sabor dulce a caramelo y cereales algo tostados, fruta madura, licor, regaliz, especias y canela. Una Scotch Ale intensa, tanto de sabor como de aroma, con una presencia marcada de alcohol. Totalmente recomendable.", "I have drunk this beer, at home, in Prélaz, at september 2018, picking up this beer, at boitlegger, Paris. Personally, I had a great moment with this beer, getting a dark and powerful body, average carbination, white and brown foam. The tasty is really malty, bready with notes of sugar, toffee, cynamon, subtle notes of hop, perfect taste at the mouth.", "Pours brown with beige head. Aroma of malt, bread, caramel, smoke, dark fruits, hint of brown sugar. Taste is big, malty, sweet, caramel, toasted bread, smoke, dark fruits come through in the finish, along with a slightly hoppy note.", "Fles 33cl thuis. Heel licht rooksmaak, droog, noot, flink maltig, donker fruit, framboos, zoetig, bourbontonen, licht stroperig, hoptonen, ergens wat citrus, salmiak?, cinnamon, earthy. Complex. Goed. (17-11-2019).", "Bottle 33cl. Pours deep dark amber. Medium malt, Roast, light dry fruit. Building bitterness, light sweet. The body is too light for the type. I drank better Founder's", "Color marrón oscuro turbio con espuma fina beige de poca retención y residuo nulo. Aroma a madera, canela, pan tostado y caramelo con notas a tierra, bourbon y humo. Sabor a maltas tostadas, pan multicereales, caramelo, caramelo quemado, madera, canela y bourbon con notas a tierra, salsa barbacoa y ligera ceniza. Dulzor medio-alto, amargor medio y regusto largo. Textura semi-oleosa, cuerpo denso y carbonatación baja. Una Scotch Ale densa y dulce con toques ahumados y amaderados. Muy completa y bien redondeada.", "12 oz. bottle.  AROMA:  Very sweet, with scents of brown sugar and caramel.  APPEARANCE:  Pours an opaque, dark brown with a very frothy tan head that dissipates slowly with nice lacing.  TASTE:  It tastes a lot like it smells, sweet with notes of caramel, and a bit of black coffee on the backend.  I don't really get any smoke or peat flavors, as the touted in the description.  MOUTHFEEL:  Has a nice, full body with a creamy-slick texture, and average carbonation.  OVERALL:  I like the style of beer, but this one is just a bit too much on the sweet side for me.  I think if it had more smoke, peat, or coffee flavor to offset the sweetness, then it would be more to my liking.  Having said that, I would never say \"no thanks\" if someone offered one to me.", "Chestnut with light lasting tan head.Nose of toffee & malt. Pleasant sweet malt profile, hints of dark fruit.Medium hops and alcohol heat", "Donker bruin bier met weinig schuim. Het bier smaakt sterk moutig en heeft ergens een licht rokerige smaak. Het bier eindigt hop bloemig en goed droog.", "I expecting little more things and from this \"American\" beer but it's ok and still is a decent beer.. First of all the Aroma remind me some \"Sierra Nevada\" beers and that wasen't good sign to me but the taste was more on \"Belgian\" beers and that satisfied me.\nThe taste is very smooth and little watery in the beginning but the aftertaste is amazing and remind you \"Belgium\" beers like \"Pauwel Kwak\".. The aftertaste is the greatest thing on this beer for sure.. Is very easy drinkable and very smooth beer.. The body is medium and the mouthfeel average.. \nOverall one good bittersweet beer to drink in the winter with very good appearance and aftertaste.. I expecting something more from the good ratings but in the end i enjoy the beer..", "From a bottle. Pours with little head. Very sweet and malty, with no discernible smokiness, despite the description. Quite drinkable and the ABV is well-hidden. A bit sweet for my taste buds. Good overall.", "Weer een heel mooi bier van Founders. Uit een flesje. Diep rood, donkerbruin, mooi stevig schuim. Veel caramel in de geur, ook wat chocolade. Volle romige smaak, caramel. Heerlijk.", "0.33 bottle\nC: murky dirty brown\nN: heavy cream, toffee, caramel\nP: lots of toffee, sweet caramel, malty, mollases, creamy, lightly herbal, light liquorice, clean taste, earthy finish.", "12 ounce bottle.  Pours a hazy, dark copper with   thine darker tan head.  Taste is of malt, caramel, scotch, fruit, toffee and smoke.  Similar aroma.  Has a decent body with a booze finish.  Overall, great.", "Dark brown pour, long lasting, off-white head. Nose is rich malts, dried fruits, nuts, low booze. Taste is sweet notes of booze, malts, fruity touch, basically pretty much the same as the nose. Medium bodied with soft carbonation and long sweet finish. Simple, but pretty tasty.", "Sabor a chcolate y café, cuerpo robusto, color rojo oscuro, espuma baja. No se siente el 8.5% de alcohol, puede acompañarse de un buen postre", "330ml bottle @home. Bruna intensa, limpida, schiuma avorio/senape media, discretamente persistente. Al naso note di caramello, datteri secchi, toffee, liquirizia, leggero affumicato. In bocca è dolce all'attacco, rotonda, calda e corposa, con chiusura amara ad equilibrare. Veramente ottima!", "Dark cloudy amber color with a medium-sized beige head. Toffee and malts aroma. Creamy body texture with a light bitterness in the aftertaste.", "Dark brown colour with nice beige head. Sweet aroma of toffee, banana bread, cinnamon and licorice. Mild sweet taste, flavors of bread, smoked malts and liquor. Medium body, creamy texture, bitter aftertaste, a bit of astringency at the end. Strong malty ale, stunning.", "Aroma:  lots of toffee, caramel, \nAppearance: hazy dark reddish-brown color with a one-finger brown head.\nTaste: lots of toffee and caramel, ripe cherry cake, high sweetness, medium-low bitterness\nPalate: full body, low carbonation, sweet and very low bitter finish, very low alcohol sensation\nOverall: highly malty, great scotch ale. Didn't find the smokiness as it mentioned.", "Best sipping ale I have had. Nice ether and  strong flavor. Let it warm up, you will miss out if you drink this cold.", "Aromas a caramelo y pasas\nAspecto bueno espuma cremosa y persistente\nEn boca cuerpo pleno maltosa y compleja final con regaliz y seco \n\n---Rated via Beer Buddy for iPhone", "The flavour only lasts as long as the sip, but the journey in between is sensational. I feel like Marty McFly coming back from the past; not much time has gone by since I was last here, but so much has happened.", "Bottle. Pours copper with an off white head. Rich caramel malts and toast, mild-moderate sweetness, low bitterness, and a clean malty finish. Good stuff.", "Fluffy light tan head stayed on a hazy reddish brown body.\nMalt, berry, syrup & jam aroma.\nMedium to full bodied, oily, greasy & smooth over the palate with a clean finish.\nBerries, caramel, hoppy, resin, syrup & dried fruit tastes.", "355 ml bootle. Grat elegant beer to experience, and almost perfect except dor the smell, but the first founders i've ever had was not a dissapointment", "Brilliant ruby red color. No bite of alcohol despite the 8.5% ABV. Extremely well balanced with rich malts with caramel, subtle smokiness, some complex fruity notes (plum and strawberry), and ends bittersweet. Lovely beer from Founders!", "Toń mahoniowa. Piana bardzo obfita, szybko opada do atolu.\nAromat starego drewna, bukwi, żołędzi, ciemnego pieczywa.\nCiało półpełne, średnio nasycone.\nSmak ciemnego pieczywa, palonego karmelu, drewna. Goryczka średnio intensywna, chmielowa.\nWolałabym olda z mniejszą ilością razowca, psuje i tak średnie wrażenie.", "Sample from bottle. Clear mahogany color with a thick, lasting beige head. Pretty pour, but… Very strong, alcohol-dominant flavor supported by dark fruit flavors. Very unenjoyable. Drain pour.", "12 oz bottle. Pour is dark walnut in color. Aromas of caramel and toffee. Dried fruits on the palate along with a slight grain/biscuit taste. For a non smoked beer there are hints on the nose. Beer leaves a velvety texture on the palate with a sweet lingering finish. Well done lads. My first, and certainly not my last,", "bottiglia 355 ml, schiuma fine pannosa cremosa beige persistente, color marrone/mogano, al naso intenso caramella mou caramello malto tostato legno, in bocca è vellutata malto caramella mou amaretto uvetta, carbonatazione leggera, corpo rotondo, dolce compensato da una buona luppolatura che gli conferisce un amaro accentuato lungo nel finale. Molto buona 26.04.19", "Sample 12/9/16 (Binny's Montgomery) Pours dark brown with a small tan head. Aroma of caramel, toffee, roasted malt, and dark fruits. Taste of the same. This full bodied brew is well balanced and darn tasty.", "Przyjemny zapach, cukierkowy, karmelowy, bardzo ładna piana, w smaku toffi, opiekany chleb.", "Pours heavily carbonated brown with a very thick and active creme head. Aroma of earthy malt notes. Taste is malty with a nice bitter element on the end. Palate contains evergreen, whiskey, grain head on the nose. Not bad.", "Very peaty, the Scotch in the name is definitely programme. Off white head, full ruby/brown colour. Full body, very mild carbonization. Not your everyday ale!", "0,35l bottle. Pours brown with beige head. Aroma of malt, bread, caramel, smoke, dark fruits, hint of brown sugar. Taste is big, malty, sweet, caramel, toasted bread, smoke, dark fruits come through in the finish, along with a slightly hoppy note. Very good.", "This is quality like all the other from Founders that I tried. Smooth caramel flavor with a good flatter/low carbonation feel.  A medium to darker brown appearance with mocha colored head. Only sampled a couple ounces in a flight, but this will be on my list to grab a 4-pack of.", "Dark brown scotch style ale. Smells sweet, and of scotch, coffee, caramel, dark chocolate and dried fruit. Tastes of dark chocolate, roasted coffee, caramel and slight whisky overtones. A strong bold flavour.", "Ar: caramel, malt Ap: dark brown, creamy head T: med malt sweetness, caramel, med bitterness P: med body", "12 oz. bottle. Poured into a freezing pint glass. Couldn't fully discern the color or head due to the glass, but dark brown or \"deep ruby\" seems accurate.  A malt bomb that assaults the taste buds up front. Heavy malt aroma. Very deep, rich malt character, layered with a variety of smooth and dense flavors. Buttery, toffee and caramel. Faint smokiness. Sweet but not overpoweringly so. The recipe is well done, even balanced, by the 55 IBUs. At 8.5% it's highly sessionable. Very malt-dominant. Hop-heads may want to look elsewhere. Will drink again.", "A 12 fl. oz. bottle, bottled on 4th October 2018. Poured into a snifter glass. It was a clear amber copper orange colour with a one finger tanned head that dissipated fairly quickly but left some nice lacing. Aromas were fruity, sweet artificial cherry, cotton candy, plum, prunes, light roast, chocolate and caramel. Tastes of roasted malts, lightly sweet, caramel, burnt sugar, smoke, light peat with a light lasting bitter finish. Medium bodied with moderate to soft carbonation. Overall wow, this was much better than expected and I enjoyed this even more than Backwoods Bastard, especially the aroma which impressed me.", "Pours dark red, tan head. Aroma is roasted caramel, sweet, malt. Taste is caramel, nuts. Strong and very nice beer overall.", "Overall, above average, but a bit nasty, I can see why some would love this beer!", "12 ounce bottle into a pint glass. Poured dark black. Tan/khaki head. Good lacing. Tastes like chocolate and roasted coffee. My only complaint is the abv. Too strong for my liking at 9.5% Over all a very  good beer.", "Aroma: Fruity sweet with prunes and caramel. \nFlavour: Fruity and malty sweet with fruity bitterness. Aftertaste is sweet and fairly bitter. \nColour: Reddish brown with an offwhite head.", "Birra americana del colosso FOUNDERS BREWING CO @foundersbrewing . Colore tonaca di frate con bei riflessi rossi, cappello di schiuma bello persistente con una grana mista e di un color nocciola chiaro. Al naso si percepisce il caramello su tutto, poi leggere note di inizio torrefazione di caffè, poco miele e note liquorose quasi di cherry. Al palato la birra è abbastanza dolce ma mai squilibrata, si hanno gusti di caramello, frutta secca (nocciole tostate e prugne) una puntina di liquirizia e un leggero amaro di radice che pulisce. Soltanto scaldandosi esce un po' l'alcool. Carbonazione medio bassa. Birra interessante, si lascia bere bene, soprattutto nelle fredde giornate invernali.", "Pours a nice deep dark red. Aroma is malty, toffee. First sip is heavy malt forward, but backed up almost equally strongly with hop flavor and bitterness. The malt flavor is similar to the aroma with a toffee/caramel quality. Body is full, but the palate is bordering crisp, or at least as crisp as a brew this malt forward can seem Smoke lingers in the finish. At 8.5% abv this brew is not solely a sit by the fire sipper. I would refer to this one as a jacked up west coast scotch ale. N", "Can from Systembolaget Sweden. Big and lastning brown head. Clear dark red brown color. Interesting nutty and  and light roasted malt aroma. Nutty caramell taste with a medium bitterness and body.", "bottle. Amber brown, mid-sized off-white head. Dried fruit, raisins, dates, some shy chocolate on a sweetish malty base. Sm,ooth and velvety palate.", "Deep copper red-brown color, golden brown head. Malty nose, toffee, dried fruit, raisins, prunes, hint of burnt sugar and bread. Toffee caramel taste, sweet malty, dried fruit, burnt sugar, well hidden alcohol, balanced. Medium body, soft carbonation. \n\n8, 4, 8, 4, 15", "33 cl. bottle @ home, bought @ Drinkhut, Uithoorn.\nDark brown with an off-white head. Dark caramel with roasted malts, dark fruits and some peaty smoke. Sweet taste with a sweet bitter finish. Reminds me heavily of a really strong doppelbock, which is a good thing.", "12 oz bottle. Smells of malt and caramel. Brown in color. Tastes sweet, notes of caramel, bourbon, and a little warming. Sweet finish. Too sweet for my tastes.", "Bursztynowe, mętne. Karmelowy, wyczuwalne palone słody. Posmak cierpki, mocno orzechowy.", "Bottle. Sweetish, really mostly malty / hints of caramel. Moderate on alcohol feel and bit oily texture. Nice", "Bottle. Malty aroma, caramel, light coke notes, burned sugar. Tastes the same as aroma, light to medium sweet and bitter. Medium to full body, malty bitter finish. Good.", "Candy sugar molasses, and carmelizes fruit. Not my style, but love this beer. Daring and innovative, a scotch that manages to not be a sickly sweet desert, but a complex flavor bomb\n\n---Rated via Beer Buddy for iPhone", "On tap, which a HUGE differrence in this beer. A Scotch ale that saved an entire brewery. Smooth, sweet and with almos a perfect balance. It demonstrates that not always a lot of lupulus is the solution.", "Bought at Supermarket Liquors in Fort Collins. Bottled October 18th 2018.\r\n\r\nPours a dark reddish brown with an off white head of foam, nice lacing. \r\n\r\nSmells of burnt brown sugar, caramel malt, toffee. \r\n\r\nThe taste is burnt brown sugar which gives it some bitterness, caramel malt brings the sweetness, toffee, maybe some vanilla, kind of toasty. \r\n\r\nFairly light bodied with lightish carbonation, finish is decidedly burnt and bitter. \r\n\r\nNot much alcohol interference, still a sipper that I enjoy.", "#1207 lahvová 355ml z pivotéky ve Frýdku-Místku. Můj první Scotch Ale. A mooc dobrý. Budu muset vyzkoušet další na porovnání.", "Found in bottle from Ingles in Waynesville, NC. Appealing dark brown with thin white head. Well mixed throughout. Really good for the style and a great Fall option.", "Excelente cerveja, encorpada forte, cor rubi escura, aroma de malte tostado levemente defumado. Espuma cremosa escuta e persistente. Sabor do malte tostado marcante na boca com bom amargor e retrogosto amadeirado.\nA sensação de álcool na boca faz jus aos seus 8,5%.", "Draught @ Darbys. Amber-brown with a thin head. Toffeeish malt on the nose, and the palate. Nice, mellow bitterness and some toasty malt accents to provide balance. Good stuff.", "15.10.2018\nKolor ciemno bordowo brązowy, klarowny. Piana w konsystencji kremowa, sztywna, koloru beżowego. Bardzo ładnie maluje szkło.\nW aromacie delikatna paloność, nuty owocowe, głównie ciemne owoce, w tle bardzo minimalne akcenty karmelowe.\nSmak to ponownie lekka, tutaj kawowa paloność, dalej ciemne owoce, delikatnie kwaskowe i nuty popiołowe. Na finiszu popiołowa goryczka.\nAlkohol dobrze ukryty, aż chciałoby się tu poczuć delikatne rozgrzewanie. Wysycenie średnie, ciało średnie, pasuje.\nAle mi to piwo smakowało.\n\n07.08.2021\nKolor ciemno brązowy, klarowny. widoczne rubinowo brązowe refleksy. Piękna. wysoka piana w kolorze ecru. Zbudowana z drobnych pęcherzyków tworzy wysoką i niebywale trwałą pianę. Ładnie zdobi szkło znacząc każdy łyk spienionym pierścieniem.\nW aromacie dominują nuty słodowe, słodkie. Jest skórka od chleba, kurz, trochę akcentów przyprawowych. Całość jest bardzo spójna.\nSmak wytrawny z odrobiną słodyczy. Skojarzenia ze świeżym chlebem, ze spieczoną skórka od chleba są tu jak najbardziej na miejscu. \nAlkohol dobrze ukryty. Wysycenie średnie. Ciało pełne. Tekstura gładka. posmak długi, przypomina tosty, spieczony chleb.\nWygląd 4, Aromat 8, Smak 8, Podniebienie 4, Razem 18, Ocena: 4,2/5", "Zapach: słód, miodowy, lekki karmel i ciemny chleb, trochę estrów w tle i przypalonego cukru. Smak: słodowy, trochę szlachetnego alkoholu, herbaciany, ciemne pieczywo, karmel, sprawia trochę wrażenie wodnistego i pustego w smaku, szczególnie przy tym 8,5% alko. Dla mnie średni wypust i moim zdaniem nie ma się tu czym podniecać :)", "Draft - Malty caramel and toffee notes. Deep rich brown with a decent beige head. Rich, malty and some woody notes.", "Smooth and satisfying like freshly brewed coffee on a cold Saturday morning.  More like a liqueur with its heady notes and the complexity of o delivery.  The longer you let it linger in the pallet the hits just never seem to stop coming.  Almost like a marching parade of molasses, coffee, chocolate, and bitterness. Without that bitter zap the drink would certainly be muddled in flavor.  But as it is, it is perfection.", "Van 't vat. Donkerbruin bier met een rode gloed en ecru kleurig schuim. Geur: geroosterde mout, licht zoet, karamel, licht fruitig, gedroogd fruit, ietwat kruidig. Smaak: licht zoet, karamel, wat geroosterde moutbitterheid, wat gedroogd fruit, wat vijg, licht kruidig. Volmondig. Medium koolzuurprikkel. Afdronk: licht bitterzoet met een lichte alcoholische gloed.", "Bottle. Color: Dark ruby, beige head. Aroma: Sweetish, caramel, vanilla, smoky hints. Taste: Malty, burnt caramel, brown sugar notes, some vanilla. Subtle notes of smoke and peat. Hints of raisins and dark fruit like dates. Medium sweet and moderate to medium bitterness, somewhat more bitterness and bittery palate at the long lasting finish. Bit sticky. Above medium body, below average carbonation. Nice one.", "Adding characters so I get submit to ratebeer. Will update with accurate description when possible.\n\n---Rated via Beer Buddy for iPhone", "Draft at The Abbot's Ale House, Cork, Ireland. Pours dark plum with practically no foam. Aroma is liquor-like, dry figs, burnt caramel. Body is fairly dense with moderate carbonation. Taste is intensely sweet with limited bitterness. Finish is fairly long and sweet.", "Brown pour, minimal tan head. Almost citrusy aroma. Tastes like tea with a little bit of malt. Slight hops on the finish. Full mouthfeel.", "355ml bottle, poured into Stone snifter.\r\nA: Dark mahogany, opaque, an initial tanned head made a quick getaway, left a moderate amount lacing.\r\nS: Cherry, caramel , toffee, molasses.\r\nT: Followed the nose, made a good job of hiding the booze.\r\nM: Not much in the way of carbonation, creamy texture, light body for the high abv.\r\nO: Nice beer for the colder weather, a bit like Stone Arrogant Bastard on steroids.", "Что-то расплывчатое фруктовое выпирает во всех стороны, забивая все. Даже уже классическую фаундеровскую спиртягу забило...", "Scotch ale de 8,5 % abv et 50 ebu, qui fait partie du top 50 du style …\r\nselon les votes d'une partie du public ...\r\nRespect et attention .. mais pas de panique !!\r\nBrassage avec 10 malts (!!???), mais il ne fallait pas mon pauvre ...\r\nMon exemplaire était exactement à sa date, comme pour insister !!\r\nCouleur rousse des landes écossaises à l'automne.\r\nMousse beige marqué, crémeuse, stable à 3 mm.\r\nArômes distingué de noix de pécan, bruyère à l'automne, et miel de\r\nbruyère .. comme pour le confirmer !!\r\n1ère bouche très souple, avec cerises confites, miel de lavande.\r\nArrière-bouche très fine, fleurie et liquoreuse à la fois.\r\n2ème avec un kirsch non fini, et une liqueur de cerise en cours de\r\nfermentation.\r\nArrière-bouche peu engageante de cerise rouge un peu aigre.\r\n3ème qui perd de la consistance et de l'à propos …\r\nArrière-bouche qui n'a rien de scotch .. foi de whisky man !!\r\nLongueur qui déçoit plus qu'elle ne convainc .. mais je complique !!\r\nJambes fines, courtes, collantes.\r\nLevure faible, oui, faible.\r\nAlcool qui fait à peine son niveau, et ne casse pas une demi-lune …\r\nFinale assez limite.\r\nCONCLUSION : bastard .. eh oui, dirty … eh oui, donc pas un top 50 !!\r\nSi vous cherchez un vrai scotch, prenez vos bagages et allez en Ecosse !!\r\nNB … très largement surcoté, ma biche .. (6/3/3/2/5)", "12oz bottle. Pours dark-amber-brown with a moderate beige head. Aroma is brown sugar, caramel, light chocolate, light plum, and a little peat. Taste is caramel, toffee, dried fruit, light brown sugar, very light peat, and a hint of wood. Medium body. Soft carbonation. Oily mouthfeel bordering on creamy.", "A really high alcohol beer that comes off sweet It really delivers in what you would expect out of a Scotch ale.", "Le 30/07/2018. Bouteille 35.5cl. Verre Saveur Bière 15cl. DDM : 03/08/2018.\r\n\r\nMousse : Beige, ½ doigt, s’estompe rapidement, bulles moyennes.\r\nRobe : rubis marron foncé, trouble.\r\nNez : Boisé, cerises, malts, épices, caramel, alcool, whisky.\r\nBouche : Fruits rouges, boisé, fin longue sur l’amertume et assez sèche.\r\nPalais : Faible carbonisation, fine bulle, huileux, un peu crémeux.", "Bottle 0.355L.\r\nHazy dark amber-to-brown body with a large, frothy, tan head, mostly diminishing with some nice lacing.\r\nModerate-to-heavy malty (roasted, caramel) aroma with notes of dark fruits (prunes), raisins and light chocolate.\r\nModerate-to-heavy sweet and moderate bitter flavour; long-lasting complex finish with notes of bitter chocolate.\r\nMedium-to-full body with oily texture; soft carbonation.", "SB burk nångång. Fin julöl egentligen inget för denna helvetessommar.  Fin med ost. Fikon dadlar russin och lite choklad både i arom och smak. Founders alltid pålitliga.", "Poured dark brown, almost black, from bottle. To me, it smelled almost barrel aged. Tasted similar, with some sweet malt aftertaste with a balanced amount of hops bite. Overall, a good beer. I’d have it again.\n\n---Rated via Beer Buddy for iPhone", "On bottle.\nScent: Christmas, cloves and anise.\nTaste: Spiced, smoke, a bit alcoholic, sweet ending.\nTexture: Nice co2 level.", "Great tasting \"Brown Ale\" with some punch to it. Pours a clear amber brown color with a thick head. All that comes to mind is caramel and nuts. Deffinately worth a second buy.", "Bouteille 35,5 cL, Saveur Bière, chez moi. Robe ambre/rubis sombre, mousse brune légère. Arômes de whisky et cerise. Texture huileuse (on sent qu'il y a du monde là dedans) et sucrée. Notes riches de caramel, cerise confite, épices, malts, fumé. Fin sèche sur les épices.", "Bottled 0,355L. Dark brown color, hazy aspect, very bubbly and foamy head of long duration. Not much intence nose, notes of caramel, braced sugar, alcohol, soft burned wood. Round and fraught palate, notes of ashed caramel, wood, smoked malt, whiskey, sweet and oiled long final.", "Ale del birrificio Founders. Gradazione 8,5. All'olfatto si presenta tostata, colore marrone scuro con buona schiuma. corposa il giusto lascia retrogusto amaro. Da provare era gli amanti del genere!!!", "Bottle from Gedeelde Vreugde; bottled 17/8/18. Hazy dark brown, big, foamy, beige head. Warm and intense aroma of butterscotch, marmalade, dark honey, fudge, candied plum, date, sugared peanut, milk chocolate, cookie dough, coffee liqueur, triple sec, liquorice. Taste has sweet to very sweet prune, date, fig & pear; caramelly and marmalade-like maltiness with 'buttery' fudge and milk chocolate adding to the sweetness, hint of nuts toning it down a bit as well as a light toasty, herbal bitter edge. Ends herbal hoppy, nutty, very slightly toasty before caramel & candied fruits kick in again along a warming dash of liqueur alcohol. Full body, syrupy texture, soft carbonation. A superior malty Ale still, pure delight.\n\nOriginal rating: 25 June 2018. 9/4/9/5/17=4.4.\nBottle at The Cat's Back, Tilburg. Shared with Anke.", "Piwo wypite jakiś czas temu. Ocena wystawiona na podstawie wspomnień z degustacji, w ramach uzupełnienia profilu.", "6/29/18\nWith A the night before I️ have to head back north. \n\nDeep brown with a big, light brown head. Bottle is pretty cool too. \n\nVery malty nose. Lots of dark roastiness but definitely smells lighter than a big stout. Can maybe get some of the claimed “smoke” if I think about it. \n\nTaste is a malt bomb. Lots of caramel and bread. Some bready sweetness with more bitterness than expected. Similar to a doppelbock/big winter warmer but less spicy. Getting hat weird “blood” flavor again that I taste in some beers. Maybe this bottle is old? Got it from a variety 6 pack stand. \n\nMedium palate. Drinkable but big. \n\nOverall, not a bad beer at all but I’ve had similar tasting things that were better.", "Twelve ounce bottle. Very impressive brew. \"Scotch Ale\" seems to be not efficient to describe this. How about \"Heavy Scotch Ale\". It is on that side of the dial. Like they say, Dark ruby in color and brewed with ten varieties of imported malts. Yes very malty, it bites, not a metallic bite, but almost. Do not make the mistake that I made of drinking one while taking a break from mowing on a very humid day. This is a winter beer.", "Ciemnorubinowa barwa, ładna drobnopęcherzykowa piana redukująca się do obrączki, obfity lacing. Prezentacja pierwsza klasa. Równie wspaniały aromat, na pierwszym planie słodowość, melasa, cukier podpalany, jak w dobrym doppelbocku. Ale momentalnie doznania rozszerzają się o nuty waniliowe, mokrego drewna, trochę wina. Smak jest już mniej wielowarstwowy, raczej słodowy z nieco kwaśnawym finiszem. Bardzo dobre odczucie w ustach, piwo jest gładkie, nie lepkie ani nie wodnite. Dobre to, Founders nie zawodzi.", "Pours a dark reddish brown. Rich taste, with a good, treacle flavour with notes of fruit, Demerara sugar and red fruit. Some hints of chocolate also. Delicious as mouth-filling.  A rich and satisfying Scotch Ale.", "Can. Dark ruby colour, head does not stay long, fair lacing. Aroma is lots of sweets, strawberry, toffee, warming alcohol. High sweetness, slightly bitter. Good, but you need to like sweet beer.", "Almost black with small beige head. Slight roasted aroma. Medium bitterness with roasted sweet-sour notes.", "Poors deep cherrie red dark brown. Frothy, brown head, short lasting. Aroma red currant, distinctly fruity, like grenadine syrup even, light candi sugar, faint chocolate roasted malts, not too powerfull but fruity and clean. Taste candi sugar, some plums, red currant, light fruity hops, astringent hoppy MF. MF: medium thickness and soft. Not too powerfull tasting either but has great depth.", "Aroma of roast biscuity malt; a beautiful dark reddish brown with an off white head. Tastes initially sweet, but with a pleasant bitter finish. What long Scottish (mid Western?) evenings were meant for!", "Prima scotch ale provata. Non male, pur non essendo il mio genere. Odore decisamente piacevole e ricco, al palato e subito dolce e dopo amarognola con sentori vinosi. A fine sorso lo scotch si fa sentire. Buona per il genere, ma dopo mezzo bicchiere non mi ha invogliato molto a finirla.", "Couleur rouge foncée/brune. Mousse correcte et relativement tenace. Nez au taquet sur le raisin sec, et un peu caramel en arrière-plan. En bouche le corps est plutôt moyen, en tout cas moins massif que ce à quoi l'on pourrait s'attendre pour une Scotch Ale. Bien entendu là aussi c'est full malté, mais avec des notes de caramel, de chocolat en dominant, avec une pointe de raisin sec et de noix en fin de bouche. Cette fin de bouche peut s'apparenter à la finale d'un American Barley Wine, ce qui peut laisser sous-entre la présence d'un houblonnage d'un fort beau gabarit. Sympa;", "Rich and nutty dark ale with a big malt profile and a sweetness that is just the right side of overpowering. Chocolate and caramel aroma that comes through in the taste too. Bitter finish that stops it being cloying. Looks appealing too with a dark ruby body and thick off white head. Too strong to sink a few but  tempting as it tastes seriously good.", "Botella de 33 cl adquirida en Gastrópolis, Zaragoza. Servida en copa de Founders a una temperatura de 8 grados aproximadamente. \r\nPrecioso color rojo cobre, algo turbia. Espuma color café, un dedo. Persistencia media y poca retención. \r\nAromas maltosos, algo ahumada, regaliz, ciruelas pasas y frutas negras.\r\nEn boca es equilibrada, apenas se nota el alcohol. Algo amarga. Se nota la malta tostada, cierto dulzor, pan tostado.", "A little bit dark in color. Roasted nut finish. Would go great with 7 layer chocolate cake or a beef stew. Maybe red apples & cheese, not sure. Not an everyday beer for me, but more appealing with the proper pairing. Definitely not a session beer.", "Very tasty ale, it's like a mix between a stout and a Belgian triple brown, like rochefort. Much sweeter and lighter than most stouts, it holds a mild and sweet tone of cinnamon and chocolate and some caramel flavour. Definitely digging this!", "LCI. Uit de fles geschonken. Hele lekkere scotch ale, mooie balans van caramel, mout en bitter, niet te zoet. Prima!", "Shared bottle at Mi2 at Cardinal 07.05.18. Excellent aroma of dried berries, malt, roasted nuts and dates. Fine taste of dates, dried berries, vintage plum jam, roasted almonds and chocolate.", "Beautiful copper colour, almonds, fruitcake, but elegant balanced hops, chocolate. Very complex and rich.", "caramel, bread, roasty, hay, cereal, chocolate, coffee, nuts, toast, pale, golden, amber, orange, red, brown, black, cloudy, sparkling, minimal head, white foam, tan foam, brown foam, rocky head, frothy,", "Aroma plomme, sviske, mørk malt, karamell. Utseende mørk brun med beige skum som varer. Smak plomme, sviske, mørk malt, karamell, sjokolade, alkohol, lakris. Kraftig øl med noe alkoholsmak, saftig, smaksrik, lang og god ettersmak av plomme og lakris.  Boks fra Systembolaget Storheden, 35,5cl 8,5%", "A great example of American Wee Heavy. Aroma is raisins and slightly sweet. Little hops but a great balance. Malt rich but not syrupy. Bitter and sweet are wonderfully balanced. Perfect for a cool night around the fire, haggis is optional!", "Biscuits, caramel, toffee, dried fruits, herbs and toast in aroma. Pours ruby with off-white head. Taste is medium sweet with biscuits, caramel, prunes, raisins, herbs and toast. Medium to high bitter finish, average to lively carbonation, well hidden ABV. Overall pretty good, slightly overcarbonated.", "Usually scotch ales are a little too sweet and syrupy but this one neither. It was surprisingly fantastic. Slight Carmel, toffee candy, with a medium mouthfeel. Anything founders makes is phenomenal.", "Mörk rödbrun vätska med litet gulbeige skum. Doft av honung, söt malt, får lite whiskeyvibbar. Söt fyllig och len, vid smaken tillkommer även lite lakritstoner. Riktigt bra ale!", "Aroma: Cereals and a caramel touch.\r\nAppearance: Dark amber/color with clear liquid and beige head.\r\nTaste: Light sourness with heavy bitter notes.\r\nPalate: Full body with creamy texture and soft-average carbonation. Long bitter caramel finish.\r\nOverall: Leaves a bitter and lightly smoky memory. Goes with fish and cheese.", "Aroma: caramel, grain, dry fruits, balanced, fine, not extremely intensive. Taste: rather sweet, bitter finish too, but not at super-strong level. Carbonation rather at low level, head is very good.", "Robe marron rougeâtre, peu de mousse. Nez boisé, tout comme l’attaque, avec des notes de caramel. Bouche : amertume, fruits noirs secs, abricot. Final sur l’amertume persistante, pointe d’épicé, les fruits secs, et le sucre sur les lèvres.", "Cerveza insignia de los fundadores. Dirty Bastard es una cerveza absolutamente hermosa para la vista. De color rubí oscuro y elaborado con diez variedades de maltas importadas, esta cerveza continuamente hace honor a su reputación de cerveza fuerte y audaz. Dirty Bastard es complejo en el final con toques de humo y turba combinados con una riqueza en malta, finalizado con una buena actitud de salto. Esta cerveza \"no es para los pequeños muchachos\"", "Gran Scotch Ale, probada por última vez de barril en la cervecería Europe de Madrid. Color marrón oscuro con un copa espectacular que con cada agitación vuelve a ser frondosa, muy buen comportamiento. En nariz maltas tostadas y bayas, en boca algo de caramelo, malta, cereza y un toque ahumado. Para nada pretende esconder el alcohol, es una cerveza rocosa.", "This I will be going back to! Rich and full of taste! You can have it alone or with a good stew or why not some hot tacos!\n\n---Rated via Beer Buddy for iPhone", "Niesamowite. Pierwsze zetknięcie z amerykańskim krafcikiem, a naprawdę zwała z nóg. Złożony, słodowy charakter, ale niepodobny do barley wine czy piw belgijskich. Piękna, kremowa piana jak w guinessie. W smaku tak złożone, jak dobra whisky.", "Arômes légers de caramel et vanille. Robe ambrée sombre avec peu de mousse. Attaque sur du caramel et du boisé, avec une langueur sur du fumé léger. Pas mal.", "Słodowe, ale nie słodkie. Owocowe. Dość gęste, nisko wysycone. Przypomina barley wine ale nie jest tak esencjonalne. Dobrze się pije. Smakuje trochę wytrawnymi, gorzkawymi truskawkami.", "Pours SUPER thick and heavy with kind of an oak aroma. Taste a bit bitter at first but has a smooth after taste. A bit to heavy for me.", "Dark brown with lasting head. Aroma and flavour have a load of sweet malts. There's a lot of complex fruit sugars present giving a feel of caramelised strawberries.", "(dark cuivré, > fruité (noir, red), muté, honey-deep, baie red, melon, fraise, amer & sweet (7 malts), end terre-noix)", "Pours rich mahogany with thick, beige head. Aroma is heavy caramel, dried fruit and some earthy tones. Taste is very caramel to start, working to earthy flavor with roast. Finish is very smooth sweet malt. A very enjoyable scotch ale.", "Puissante et à ne pas mettre dans toutes les mains, cette brune aux reflets rouges dégage des arômes caramel et un palais fumé, un peu rêche, faisant penser à un whysky.", "Belle robe ambrée, nez sur le caramel et la mûre qui apporte de la fraîcheur. En bouche, c'est la mélasse qui domine avec une jolie amertume. Très bonne bière.", "Bottle.\r\nRuby red, brown head. Complex. Raisins, dark fruit, caramel, fig, strong malts, molasses, peat. Smooth. Daedal.", "Cloudy red-brown color. Fairly hoppy, but overly so. Good flavor, but nothing to really put it above the rest.", "Partagée avec mon cher Appiantiqua dans nos petits verres \"Saveur bière\".\r\nBelle robe ambrée surmontée d'une mousse beige à grosses bulles peu persistante.\r\nLe nez nous offre des arômes boisés et de whisky.\r\nLe goût nous amène rapidement sur une forte amertume mêlée à une douceur fruitée(fruits jaunes)\r\nle palais est assez long dans le prolongement des saveurs mentionnées.\r\nUn très bon Scotch Ale !16,5/20", "Dégustée avec mon petit Kittenbieer dans un verre \"Saveur bière\". Température de début 10* à 11°\r\nBelle robe ambrée surmontée d'une mousse beige à grosses bulles assez persistante.\r\nLe bouquet aromatique est léger mais plaisant: alcool, whisky, notes boisées.\r\nLe goût nous révèle des saveurs d'abricot, houblons, malt, mandarine et une belle amertume.\r\nLa finale de bonne longueur est dominée par les fruits jaunes.\r\nUne très agréable scotch ale.\r\n16,5/20", "I had my first Dirty Bastard last night. Appearance was good a red appearance a good taste, almost a little bitterness but not overwhelmingly so. Good after taste and I have to rate this one with high marks, I'll enjoy the 6 pack and will venture in to more of Founders offerings for sure. roasty, herbs, earthy, smoke,", "Pours a deep, dark amber coloration with a medium, creamy head. Smells of caramel, bready malts, dark bread and a hint of dark fruit and booze. Taste follows the nose, with a strong malt presence dominated by caramel, bready malt and notes of toffee, dark bread, dark fruit: fig, raisin, with a hint of smoke and chocolate. Some earthy, bittering hop notes in there as well. Finishes with a medium, but kinda harsh, boozy bitterness. Smooth mouthfeel with low carbonation. All in all, this is nicely balanced, albeit maybe just a hint too sweet and boozy.", "Muddy brown with beige head. Cookie dough, gingerbread sweet aroma. Sweet, grainy mouthfeel, gingerbread and some light medicinal bitterness. Smooth long lasting flavor. I'm coming to realize that this Scotch ale style is fucking bomb and something I can always get down with. Good on Founders to brew more than just the usual suspect styles. Thanks Lagzibacsi!!!", "Opalescent brown colour, minimal yellowish-beigeish head; aroma of gingerbread, licorice, caramel, some leather and alcoholic notes; taste of burnt honeycomb, some licorice and alcoholic notes; great one! many thank, kapusil!", "0.355l bottle. Slightly hazy dark orange/body with a thin orangish head. Aroma and taste of gingerbread, raisins, caramel, licorice, toast, orange zest and apples. Very nice.", "35 flesjes. Helder donker amber kleur, fijne romige creme schuimkraag. De geur van karamel en donker fruit. Smaak is zoet, karamel, rozijnen en donker fruit. Medium Lichaam, Veel koolzuur.", "Miły aromat, mało złożony, karmel, trochę wanilii, troszkę alko. W smaku ciut gorzej, karmel, sporo chlebowości, za wysoka goryczka i trochę alkoholu. Spoko", "Flaske. Mørk tynd hvid/brun skum som hurtigt forsvinder. Mørk ristet sødlig duft. Mørk ristet malt, let sødme og en smule bitterhed i eftersmag.", "Tap @ Opalo, Madrid. Pours hazy dark orange with a small off white head. Aromas of prunes, caramel and sweet malt. Flavours of caramel, prunes, chocolate, wood and peat. Oily texture. Alcohol well hidden.", "Backlog. Sample. Caramel, toast, nuts, resin, molasses, some smoke. Medium sweet, moderate bitter.", "Hælder mørkebrun og hazy, uden hoved \r\nAroma er ovre i toffee, dog med noter af røg.\r\nSmagen er sødlig, med en røget eftersmag\r\nfull body, en anelse sticky, soft carbonation, long røget, hoppy ish finish,\r\n\r\nEn skotsk ale, hvor 10 malte, og hops er brugt. Røgen går igen, uden at være dominant.", "Waited till the bottle warmed then poured. Little head, probably due to my preferred light pour, dark in color, enough for no light to pierce. Smells like malty heaven, reminds me of Dead Guy Ale, but +. Good quick hop taste upon tounge then a malty caramel avalance. Mouthfeel is thick, which is nice. I can imagine Vikings drinking beer like this after a conquest lol. Good shit. Very balanced", "Deep ruby-red with a creamy, off-white head. Aroma: Scotch whiskey, caramel, hops, campfire smoke, hints of sweet spices. Sweet but well balanced with a bit of hop bitternes, hints of toastyness and smoke. Smooth mouthfeel. This might be the perfedt scotch ale!", "Can from Hops and Crafts Exeter. Pours deep ruby with a light beige head. Aroma of oak,caramel,pine,baked bread,citrus ,fig,plum,prune & a little liquorice. Taste is rich & full,pine,caramel,fig,plum,prune,baked bread,liquorice,polished leather,orange zest & oak . Medium bodied,silky smooth mouthfeel. The finish is nicely dry,bittersweet with a growing bitterness & more fig ,plum,prune,bread,biscuit,orange,liquorice,oak & leather . A good scotch ale !", "ABV - 8.5 IBU - 50\n\n.Appearance: Dark ruby, head is off white. Looks fantastic. \n\n.Aroma: You can smell it as soon as it is was poured into the glass. Scotch booziness, roasted malt, caramel, cherry, dark fruit, vanilla. Wow. \n\n.Taste: Upfront - roasted malt, well rounded sweet fruitiness. Notes of cherry, vanilla, fig, raisin, caramel coming through. Somewhat alcoholic - scotch barrel booziness.  A very noticeable bitterness towards the end of the sip - balancing out the sweetness. Warming. \n\n.Mouthfeel: Sticky, creamy, rich, medium body, spot on carbonation - giving off a slight \"zing.\" Very easy drinking. \n\n.Overall: A. \n\n.Bottom Line: To start - Beautiful in the glass. Aroma and flavor are just outstanding. Be prepared for a big, powerful, delicious malt bill. Top notch scotch ale.", "Pours a very dark ruby color.  Scotch and oak taste with sight brown sugar and raisin notes. Not too boozy or overpowering for a strong scotch ale. Great standard Scotch ale.", "March 21st, 2015 - Sassily named like San Diego's foundational Stone beers, Founder's Dirty Bastard is a chewy, salty thing. With a black dark body and a deep, malty nose, it offers little hints at first about the flavor profile. But that flavor is lovely and dark, rich with veins of licorice and soy sauce. More impressive than these, though, is the balance between the body and flavor, which are brilliantly engineered to match.", "Drank with Tijs @ Piet Huisman 05-01-2018. Sweet, rich, very good. Nice hints of smoke and herbyness.", "355ml bottle from RusBeerShop in Moscow. Pours hazy brown with a small beige head. Aroma is malt, smoke, dried fruits, notes of alcohol. Taste is medium sweet, malt, caramel, oak, medium bitterness.", "Rozpuszczona landryna, obrzydliwstwo. Mdłości ogarniaja. Nic szlachetnego w tym nie ma, wstrętny ulepek.", "Color marrón oscuro, rojizo si le da la luz, turbio, con capa de espuma de un blanco amarronado de dos dedos de grosor y buena retención. Carbonatación media. Textura oleosa. Aroma a caramelo, melaza, lúpulo herbal y alcohol. En boca hay caramelo, melaza, toques herbales, dark fruits y alcohol. No es abiertamente dulce. Amargor final moderado pero presente. Postgusto alcohólico y a caramelo. No entiendo qué hace en un top 50 de Scotch Ales. A partir del primer trago no tiene nada que decir.", "Pours dark brown with a creamy head which regenerates easily with a good swirl.\r\nAroma of malts, peat, lots of alcohol and something almost disgusting like... Vomit!?\r\nNot too sweet, hoppy long lasting finish, but cloying.\r\nVery nice to the palate, full body, creamy and thick.\r\nI really struggled to finish this though.", "Can\r\nAroma-toffee, caramel\r\nAppearance-copper, clear, beige foam\r\nTaste-medium bitterness, medium sweetness, lightly sour, \r\nPalate-medium body, sticky, average carbonation, long finish, \r\nOverall-very good", "29-12-2017; bottle; at home (bought at Saveur Bière, as part of their December 2017 discovery box).\r\nThe beer looks very nice. The colour of the beer is a very nice coppery brown, with a nice ruby red glow. The beer is quite clear. On top of the beer there is a nice layer of light brown soft foam. Foam retention is average. A nice thick creamy drape and some lacing are left on the glass. Very nice. \r\nThe smell of the beer is also very nice. It is not extremely strong though. There are some nice malt aromas, with some touches of caramel and toffee. I also smell a nice touch of fruity hops, also a bit earthy. They are a nice match for the malts. There is a tiny smoked touch. This gives a nice savoury edge to the smell. Quite nice, and also special. I don't know many beers like this. \r\nThe taste of the beer is very nice. It is a lovely sweet beer. I taste sweet malts, a touch of liquorice, smoke, peat, toffee and caramel, but also loads of red fruits and some tropical fruit. The hops give a nice earthy and slightly zesty bitterness. Yeast gives a nice fruity and slightly creamy note. Typical top fermented yeast flavour, which is nice. The beer is perfectly balanced. Nice.\r\nThe palate of the beer is nice. Medium-full body, smooth and slightly creamy texture, not to heavy, and medium-high carbonation. The finish of the beer is nice. It has a nice alcohol warmth, alcohol flavour, fruits and some lovely hoppy bitters. All in all, a lovely beer. They can be proud to have this as their flagship.", "Lekki zawód. Liczylem, że będzie fajny scotch ale, a jest taki sobie. \r\n\r\nW aromacie czuć głównie rodzynki i, niestety, alkohol. Słabo to rokowało. Piwo jest ciemnobursztynowe, z jasną pianą, prezentuje się całkiem ładnie. \r\n\r\nW smaku jest trochę przegazowane, ma konsystencję prawie, że wody, jest słodko-gorzkie. Można wypić, ale nie jest to ambrozja. Za mocno czuć jednak alkohol, goryczka dość średnia, trochę oblepiająca. Piwo powinno poleżeć, bo za bardzo alkohol w nim dochodzi do głosu.", "W aromacie suszone owoce, nuty biszkoptowe, przypalony chleb, czuć lekko alkohol. W smaki wytrawny, delikatna słodycz w tle. Na finiszu mocna gorycz. Treściw, intensywne, alkohol średnio ukryty, średnio pijalne, zbyt gorzkie dla mnie. Dobre piwo, ale zdecydowanie #teamgoryczka", "inte så knäckig som jag hade förväntat mig. bra fyllighet och ordentligt med smak.", "Schöner Malzcharakter im Aroma. Im Trunk herrlich cremig, Schokode, Nuss, Karamell, super komponiert. Im Abgang dann röstig, Holzfass, hohe Drinkability, extraklasse.", "355 ml. bottle @ Home.\r\nAroma: quite intense aromas of caramel, toasted malts, brown sugar, molasses, dark dried fruits (prunes, raisins), sweet alcohol, overripe fruit. Hints of honey, porto wine, rum. Hints of malts and toasted malts in the background when the beer warmed up.\r\nAppearance: deep ruby to deep brown/mahogany color with reddish-ruby highlights. Beige and very creamy foam. Medium to high head thickness. Medium to high retention. Medium Brussels' lacing. It's too dark to tell for sure, but it seems it has low to medium hazyness.\r\nTaste: medium to high sweetness, low bitterness, no sourness. Flavors of caramel, toasted malts, brown sugar, molasses, overripe fruit, dark dried fruits (mainly prunes and raisins), sweet alcohol. Hints of rum and porto wine, dates. Balance is toward the sweet side.\r\nPalate: medium body, oily-silky texture, low carbonation, very long sweet finish with medium sweetness and flavors of sweet alcohol, caramel, toffee, toasted malts, brown sugar, molasses, dark dried fruits (raisins, prunes, dates). Alcohol is noticeable due to its sweetness and some throat warming. There is no astringency from the dark malts in this beer.\r\nPalate: appearance is very good. Aromas and flavors are very good and sweet but not cloying, with caramel, toffee, toasted malts, brown sugar, molasses, dark dried fruits (prunes and raisins) and sweet alcohol. Not my favourite style, but it's a very good and enjoyable beer. Not much hop aromas nor flavors. Very complex.", "Puszka 355ml. Kolor piękny ciemnobursztynowy z przebłyskami, klarowne, piana kremowa pięknie osiada na szkle. Aromat generalnie suszone owoce, śliwki, rodzynki. W smaku także suszone owoce, słodkie co w połączeniu z goryczką daje wyśmienity efekt. Alkohol ukryty genialnie, bardzo dobre piwo, mocno pijalne.", "Draught. Great looking beer dark ruby with off white head. Light Aroma, malt and smoke. Flavour had a little alcohol burn covered quickly with chocolate and malt. Lekker finish with a hop spike and smoke", "Aromat: intensywność średnia w kierunku dużej, nuty zbożowej, subtelnie suszone i kandyzowane owoce, rodzynki, figi, karmel.\r\nWygląd: wygląda cudnie, piękna czysta czerwona miedź i bardzo wysoka, idealnie równa i regularna warstwa, kremowej, drobnopęcherzykowej piany, która długo się utrzymuje.\r\nSmak: typowy dla stylu, nie jest ani za słodkie, ani za wytrawne. Delikatny karmel, dużo suszonych owoców, rodzynki, daktyle, figi, dużo ciemnych i świeżych owoców, zbozowe posmaki bazy słodowej, wszystko kontrowane całkiem niezłą, ziołową i leciutko paloną goryczką. Bardzo pijalne, pije się lekko i przyjemnie. Dobrze zbalansowane. Złożone.\r\nOdczucie: alkohol ukryty perfekcyjnie, ciała dużo, wysycenie niskie, pełne, finisz gorzkawy.\r\nCałość: bardzo smaczne i stylowe piwo, świetny balans i kompozycja, wysoka pijalność mimo mocy i blg, Goryczka duża, ale tu akurat gra jak trzeba, naprawdę zdradziecko lekkie. Bardzo dobre. 7/5/7/4/15", "Tomada en Cervecer�a GastroTres Gijon.\n\nDe grifo.\nBien. Correcta. Color rojo. Espuma blanca.\nMaltosa y alcohomica.", "Sporo aromatów słodowych, biszkoptowych, lekko opiekanych. W smaku lekkie jak na ekstrakt, ale nie wodniste, wyraźne nuty słodowe, biszkoptowe, opiekane, lekka słodycz, nuty ciemnych owoców, goryczka wyraźna, lekko przypalana. Alkohol zupełnie niewyczuwalny.", "Love this beer. It sits right on the edge of a complex taste but a with a smoothness where I could drink this all day. You can taste the sweetness of the malt, the kick of the hops and even a bit of a smokey flavor infused in it. I even like the amount of alcohol in it, enough to feel relaxed but without overwhelming the flavors.", "Can 355ml (gusher). Reddish-brown, thick fluffy head with plenty of lacing and a light beige tint. Aroma of milk chocolate, raisins, port wine. Taste is heavy on raisin, dates and almost some dry sherry, ending with a dry smoky and surprisingly hoppy bitterness. Enjoyable and complex!", "A bench mark Beer to match for all Scotch Ales. This unique beer is undeniably best in its category and an experience to drink. Great aroma and even better taste!!", "Zapach średnio intensywny, słód, karmel, cukier, orzechy, suszone owoce. Kolor miedziany, klarowne. Piana beżowa, niska, drobna, średnio trwała, zdobi szkło. W smaku słodkie, średnia pełnia, słód, karmel, cukier, suszone owoce, zioła, chleb, dym, alkohol. Goryczka średnia, wysycenie średnie.", "Aroma is honey and caramel. Taste is sweet, with cocoa, and grass. Aftertaste is bittersweet.\n\n---Rated via Beer Buddy for iPhone", "One of the better beers I have ever consumed! Beautiful color and great taste. Highly recommend \n\n---Rated via Beer Buddy for iPhone", "Piwo ma ciemno miedzianą barwę, nalewa się z bujną, beżową i mocno zdobiącą szkło pianą. \r\nAromat jest mało intensywny. Melasa, palony karmel, nuta orzechów, a gdzieś w tle niuanse popiołowe, ogniskowe. Drugi plan to ziołowo-tytoniowa nuta chmielu.\r\nW smaku pełne i raczej słodkie. to co w aromacie, z tymże chmielowa strona jest wyraźniejsza, budująca mocną kontrę dla słodowości. Goryczka jest wysoka, lekko cierpka, ziołowa i ziemista w posmaku.", "Backlog rating. Hazy red brown, low brown head. Orangepeel, piney hops and roast nose. Orangepeel, herbs, pine on the palate as well. Medium body, sparkly mouthfeel.", "bottle @ home\r\nclear dark brown, brown head\r\nbutterscotch, wild honey, manuka honey, cream, light alcohol notes, walnuts, roasted nuts, milk chocolate, heater, light sweet licorice\r\ncream, licorice, coconut, nuts, makadamija,", "From bottle into pint glass. Aroma is a nice, full roasted malt with burnt, molasses, and espresso notes. Tastes sweet and full with a slightly bitter hop kick at the end. Medium-full body with a creamy/oily texture. Delicious!", "UT271117. 12fl oz bottle at home from Burg Bieren, Ermelo. Nose is Roasted malt, dried fruits. Caramel, brownie, old wood. Medium bittersweet. Long roasty hoppy medium to heavy bitter. Full body oily medium carb. 857516", "One of my favorite beers. This is a great strong beer with a full body, excellence. Caramel, bread,  resin, smoke, peat. Malt forward some hops!", "Toffee, raisins, \"julmust\". Quite sweet but with enough background bitterness to make it pleasant. A nice scotch ale", "Burk från SB. Mörk kastanjefärgad med tjusigt, krämigt smutsvitt lock. Maltigt och rostat med toner av knäck, karamell, kola, torkad frukt, mörkt socker, melass. Lite beska från humlen väger upp. Välbalanserat och smarrigt!", "Pours a foggy brown with an amber tint with 1 finger of head with good lacing. Smell is complex caramel, very malty in a good way, toffie, and roast. Taste is rich with a smooth finish malty, smokey, and slightly hoppy. I normally drink Belhaven when I want a scotch ale, not anymore.", "Dark fruits, fruits overall, biscuits, maybe some chocolate notes and long terrible bitterness", "Barwa brązowa, piana spora.\r\nAromat lekki biszkopt, ciasto z bakaliami, wiśnie.\r\nW smaku biszkopty, chleb, karmel, toffi. \r\nCiała trochę mało, alko ukryte.\r\nFajne pifko.", "a great drink; malty complex flavor; full body, creamy, soft carbonation, medium sweetness, long finish", "Where Purchased: 347ml bottle from Meijer in Michigan\r\nConsumed: from a pilsner glass  \r\nAroma: Smells malty and sweet with hoppy note.Seems complex.\r\nAppearance : unfiltered dark gold brown with lots of head that disappears within the first few sips. No lacing, but lots of lively carbonation.\r\nTaste: very sweet and malty with an underlying hop note. Would never guess the IBU was 50 or the ABV was 8.8. Impressive. Lots of complex tastes yet easy to drink. \r\nPalate : full body. Slight bitter with sweet aftertaste. Great carbonation.\r\nOverall: this was a complex beer. Lots of malts. Easy drinking, and would never know it was as boozy as it was. I was glad to try and will buy again. MB. The Beer \"Bear\"on.", ",3 litre Bottle from Total Wine Bocca Park. Brown with medium offwhite head. Roasted malt aroma and taste.", "It pours dark brown and it is fairly clear. It has a tan head with low head retention. A full malt aroma, complex and inviting. It has some caramel and moderate smoky elements. The are also low aromas of alcohol as well. There are flavors of caramel and nuts. There is a low roasted character to it with low smoke. There is moderate bitterness and a very low dried fruit (Plums) element. It has a moderately full body with some alcohol warmth. Overall, a complex malty beer that highlights malts with a bit of light smoke. A great drinking Wee Heavy.", "This is one of Founders best and amongst all other Scotch Ales I feel it superior to most others. I have tried over fifteen scotch ales and this is the one I most frequently purchase when I want an excellent Scotch Ale that wont break the bank.", "Utan motstånd uppstår heller ingen framåtrörelse. Utan brittisk ale hade heller inte resten av världens ölkultur varit på samma ställe som den är i dag. Dirty bastard är något att ta spjärn emot när ölkartor ska revideras och nya smakupplevelser ska kalibreras. Hela skapelsen är otroligt fint avrundad i alla hörn. Kraftig rostad malt bärs upp av alkoholstyrka utan att bli spritig och eftersmaken är långt ihållande smakfull och bränd.", "Bottle. Misty brown with ruby highlights. Moderate ivory-coloured well-lacing head. Aroma: malt symphony. Caramel, toffee, toast. Lots of nicely sourish fruit jam, dried fruit, some oak. Medium body. Moderately dry taste. Rich malts, again. Nuts, oak, fruits. Light bitterness. So good", "Can @ home. Pours a Ruby to brown liquid with a creamy head. Sweet aroma with toffee, caramel, chocolate, licorice, mild smoke, red fruits. Smooth palate with average carbonation. Medium to full body. Taste of deep caramel, toffee, dark bread, licorice, smoke, chocolate, red fruits, some herbs. Lasting taste with an earthy and smoky finish. Lingering licorice. Balanced low to medium bitterness.", "From the bottle. Dark brown with a tan, creamy head. Aroma is earthy with chocolate and Backhaus. Taste is sweet up front, full of chocolate, licorice, smoke and caramel. Finishes warm with a whisp of bitterness. Body is full, rich, creamy. Overall a complex, we’ll balanced brew that betrays absolutely no sign of it’s ABV. I‘m at a loss for words. Excellent!", "35,5cl-fles van bij Bierhalle Deconinck te Vichte. U: Troebel roodbruin met een dunne gebroken witte schuimkraag. G: Veel gedroogd fruit, karamel en wat chocolade. S: Zoet. Chocolade, gedroofd fruit, wat vanille, toffee en kandijsuiker. Lichte nabitterheid. M: Volmondig met medium carbonatie.", "Founders has so many varieties, each excellent for its style. My rating probably says more about my lack of enthusiasm for Scotch Ale, and less about Founders quality. Rate Beer descriptor notes. Aroma: roasty, resin, woody, barnyard. Appearance: amber, red, sparkling, tan foam. Taste: medium bitterness, salty. Palate: medium body, average carbonation, bitter finish.", "Burk från SB. Mörkt brunröd med beige skum. Doft av choklad och karamell. Knäck och lite choklad i smaken.", "One of the best wee-heavy’s I’ve had. Love the smokiness aroma and taste. Dangerous low alcohol taste. Very good beer.\n\n---Rated via Beer Buddy for iPhone", "Burk från SB. Mörkbrun/svart kulör med smutsbrun skumkrona. Doft av pumpernickel, knäck, jenka och pumpa. Halvtorr, lärt söt munkänsla med bitter och alkohol- sträv avslutning. Smak av kaffe, chokladpralin, knäck, körsbär, alkohol, trä och lite salmiak.", "Dark brown with white head. Good lacing. Nuts, caramel and roasted malt. Sweet, some peat and smooth finish. Awesome.", "Dark brown pour with minimal tan head. Caramel malts, dried raisins, speculoos, smoked wood, some booze. Taste is sweet and malty and largely follows the nose. In addition, flavours of nuts, licorice and some peat. Medium bodied, full carbonation, creamy mouthfeel.", "Z: słodki biszkopt, wręcz surowe ciasto, z lekkimi suszonymi owocami. S: słodko biszkoptowe, lekko chlebowo, szybko przechodzi w estry. Finisz suchy.", "Butelka. Ciasteczka, karmel, toffi. Slodycz, która znika po chwili. Alkoholu brak. Brak również ciała.", "W aromacie ciemne suszone owoce, biszkopt, wiśnie. W smaku landrynkowa słodycz, po czym nagle znika i zostaje posmak jakiegoś drewna.", "Bogata karamelno sladko sladna sladica s škotskim naglasom. Crème brûlée brez crème aroma, rahlo cvetlična. Temno bakrena barva. Povsem bistro. Krasna beige pena drobnih mehurčkov. Srednje obstojna. Okus sledi aromi zažgane karamele, ki daje občutek dimljenosti. Grenčina je izrazita in traja v pookusu. Polnega telesa in opazne alkoholnosti kot lepe protiuteži karamelni sladnosti.", "Botella de 99Cervezas.\r\n\r\nVierte en un realmente bonito color miel rojizo, que en la copa resulta bastante opaco. Abundante formación de espuma de café de gran densidad, buena persistencia y notable adherencia.\r\n\r\nDe gran intensidad en nariz, destacan las notas dulces y acarameladas, siempre de un modo contenido y muy equilibrado (en absoluto empalagoso). Prevalecen entre estas las notas de naranja confitada, acompañadas de claras notas terrosas y de turba. También un punto de café con leche y de toffee. Las notas lupuladas están siempre de fondo equilibrando muy bien el dulce. Gran complejidad.\r\n\r\nResulta sorprendente en boca, dando intensas notas de dulce de regaliz y toffee. De entre los sabores básicos destacan el dulce y el amargo, imponiéndose este último conforme la cerveza evoluciona en boca. Es un amargo muy expresivo pero elegante y nada agresivo. La evolución en boca trae también notas intensas de turba. Muy bien equilibrada y muy interesante evolución.\r\n\r\nDe gran cuerpo, textura aterciopelada y algo rasposa, y carácter más bien cálido. Gran persistencia (sin llegar nunca a saturar) y final amargo con un toque dulce. Su graduación alcohólica (8,5% ABV) no se nota en absoluto (ni en nariz ni en boca), lo que demuestra de nuevo el tremendo equilibrio de esta cerveza.\r\n\r\nComplejidad, equilibrio y carácter a raudales, mostrados a través de una estupenda evolución en boca. Si quieres conocer y disfrutar un estilo que es casi de culto, esta Scotch Ale es tu cerveza. Debes probarla.", "@ Basunen 17-9-9: En lite diskret scotch ale med toner av malt och kola, en söt eftersmak. tja", "Degustada en Olut Nomada Brewing Scotch Ale,buen cuerpo ,cerveza acaramelada con ligero amargor  final con aromas a regaliz.", "Tumman mahonkinen lasissa. Tuoksu makea, toffeemainen sekä hieman maltainen. Maku aluksi makeahko, mutta sitä leikkaa humala hyvin pois. Keskitäyteläinen runko, joka on hyvin tasapainossa.", "355 ml can from Systembolaget. APPEARANCE: dark amber with a large off-white head. NOSE: moderately malt aroma of caramel, syrup, grass, pine. TASTE: moderately sweet, moderate bitterness. PALATE: medium body.", "Malty, smoky, creamy, Peaty, a balanced , But noticeable hoppyness. A decent brew but at 255 cal not worth it\n\n---Rated via Beer Buddy for iPhone", "Креплёный пивас темно-коричневого цвета. Аромат типичного жженого солода. Пена скудная. Во вкусе жженый солод, крфе, карамель, крепость. Пиво плотное. Несмотря на неприятную горечь сначала, затем вкус сглаживается и жженки больше не ощущается. Я бы сравнил употребление пивас с употреблением виски с колой, в конце действительно винный вкус. В целом хорошо.", "Can (355 cl) from Systembolaget. Clear dark chestnut, medium beige head. Bready, nutty, fudgy, caramelly malt aroma, a touch of maizena, piney hops. Full bodied, low to medium carbonation. Semi dry, medium to high bitterness.", "Espuma marrón, que permanece como una fina capa, color marrón oscuro casi negro, aoma tostado y dulce en nariz, sabor con notas dulces y final con toques amargos", "Canned from Systembolaget\r\nDark brown with a tan head. \r\nSweet aroma with fudge and brown sugar. \r\nSweet flavour with some tar and dark toffee. \r\nMedium, dry bitterness.", "Mörkt rubinfärgad med beiget medelstort skum. Maltig doft med torkad frukt, röda mörka frukter, pomerans, aningen rök. Komplex smak med söt maltighet, torkad frukt, knäck, pomerans, marmeladtoner, aningen rökighet och en fyllig beska som balanserar upp sötman, aningen alkoholhetta. Fyllig munkänsla. Mycket god att sippa på.", "Big full bodied style but very well executed and never strays from an appropriate stylistic line. I’ve only had the core range from Founders but I get the sense the brewery knows how to make a modern beer AND respect tradition at the same time. Some bourbon and coke, as expected, and rich, but never stupid which is a good effort given the 8.5%. Not sure many Scotch Ales get over this number? Some fizz to finish which takes the edge off the sweetness.", "3 finger beige head.\r\nVery dark brown coloured beer.\n\r\n\nAroma is alcohol drenched raisins, caramel, dates, slight pine and smoked charcuterie. Quite vinous too.\n\r\n\nTaste is dates, soil, caramel, big whisky smokeyness, raisins and a slight metallic note at the back, that doesn't stop it from being good but rather hinders it from being better.\n\r\n\nMouthfeel is rich and a bit dry. Medium bitterness and lightly carbonated. Could definitely use more of a punch though, it feels too gentle, even though that adds to the pleasant smoothness this beer has.\n\r\n\nOverall: Like I have previously mentioned, Founders can do no wrong. Or hasn't yet, in any case. This is not the most exciting beer I have had but it's simply a very pleasing beer to sip. You get a hint of the alcoholic smokeyness but any actual alcohol taste is barely there, which makes this very drinkable. I'm glad this is one of the regulars at the Swedish monopoly now, especially since winter is coming.", "Amazing beer. Great rich and dark malty flavor. Medium to heavy body with a dark chocolate finish. Low carbonation. One of my favorite beers.", "Mahogany color, small brown head. Sweet aromas of malt, caramel, dried fruit, candy sugar, marmalade and plums. Sweet taste with dried figs, caramel, brown sugar, alcohol and plums.", "Burk systembolaget. Svartbrun vätska. Doft av fudge, trä och äpple. Kärv smak av rostad malt, knäck, torkad frukt och lite rök. Krafull beska med lätt avslutning", "Scotch, figs and dates, sweet woody notes. Taste is sweet and slightly bitter, following the nose. Caramel, scotch, stale yellow grass. Somehow stale finish, lacking in this department.", "Rami Rami is drinking a Dirty Bastard by Founders Brewing Co. at Warszawa Ursus\r\n\r\n3.4. Ladny beczkowo-ciastkowo-karmelowy aromat, spoko cialo, slodkie... i bardzo niefajna zalegajaca jakas taka dziegciowa gorycz psuje :(\n\nRami Rami is drinking a Dirty Bastard (2017) by Founders Brewing Co. at Kufle i Kapsle\r\n\r\nNie ma niefajnej goryczki co byla w 2016, ale za to mniej intensywna paleta, mniej ciala... nadal spoko piwko", "Very well crafted American scotch ale. 355ml bottle pours very dark cola brown with foamy tan head. Aromas of roasted malt, brown sugar, molasses and whiskey. Very balanced flavours of dark cocoa, bourbon, oak, roast grains, caramel malt with hoppy undertones. Long finish with very mild espresso bitterness. Silky texture, big body and dark sophisticated flavour profile make this a sensational beer.", "35.5cl can. brown/black color. light brown medium head. roasted malts, caramel, raisoms. medium to high bitterness. medium carbonation.", "Arômes de cacao, merisier, noisettes. Semblable à une stout, mais sans la torréfaction. Robe noire avec reflets bourgogne. Faible mousse beige. En bouche, figues, alcool, torréfaction. Bien rond.", "Poured from its stubby bottle, it appears a clear dark brown topped off with tan froth. The aromas are of boozy dried fruits and caramel, and the taste that follows is coffee, chocolates, roasted malt and smoke. Overall, taste is sweet with very little bitter and a medium bodied mouthfeel.", "355ml bottle. Pours a clear dark ruby with a large, frothy, long lasting, tan head that leaves curtains of lace. Sweet aroma of caramel malt, chocolate, dried fruit, licorice and brown sugar. Sweet flavour of caramel malt, chocolate, overripe fruit, licorice, molasses and a hint of peat in a dry, slightly boozy finish. Medium to full body with a\r\ncreamy, smooth, oily texture and soft carbonation. Tasty, an excellent scotch ale.", "12 oz. can poured into a pint glass.\nCanned on 5/8/17. Enjoyed 8/8/17.\nL. Super dark brown with a big frothy tan head which lasts and laces the glass.\nS. Dark brown sugar, molasses, nutty, slightly smoky, brown bread, clean wood. Smells dang good.\nT. Sweet dark bread like zucchini bread, molasses, rich roasted malt, slight smoke and wood, toffee, a bit of bitter chocolate, finishes with grassy bitterness. Nice.\nF. Leaning toward a full body, subdued carbonation, sticky resinous finish with just a little bit of drying, not boozy at all.\nO. I've passed over this so many times, but boy am I glad I finally grabbed some Dirty Bastards. I am pretty sure this will be in my fridge most days from now on, especially during the cooler months, especially especially at like 20 bucks incl. tax per 12 pack. Well done Founders! Cheers ! ! !\n\n---Rated via Beer Buddy for iPhone", "Filling up a hole in my ratings. Pours a brown with a full, foamy, light tan head. The aroma is earthy, containing heavier amounts of caramel and bread, some raisin, licorice, peat, and a slight chocolate. The taste is dry and a little sweet. Its earthy and peaty, with a slight roasted compliment. Strong caramel, fig, and raisin flavors, lesser smoke, and a very slight whiskey will be found as well. Peaty aftertaste. Medium in body, rather thin in texture, and a little softer in carbonation. Quite a bit going on with this one. Interesting, tasty, and solid.", "Bottle. Copper brown color with tiny creamy head. Aroma - Malt, bread, toffee, nuts, portwine. Taste - Sweet, medium bitterness, nuts, dried fruits, bread, malt, caramel.", "Dulce, acaramelada y maltosa. Nada alcohólica pese a sus 8,5. Entra muy bien", "Had a tough time getting through this one personally. It’s intense, tastes like it should tho. I’m just not a fan of the style. Sorry to hurt the ratings, this one my first wee heavy ever.", "Aroma: melanoidines, roasted dark malts, burnt caramel.\r\nAppearance: deep brown color and creamy head.\r\nTaste: roasted dark malts, burnt crunchy bread skin, caramel, melanoidins, dry.\r\nPalate: medium body and medium carbonation.\r\nOverall: really nice Wee Heavy, intensive and nicely roasted.", "Klar r?dbrunt med off white skum. Herlig duft med mye karamell, noe kaffe og h?y. Smaken er kaffen fremtredende. Litt skuffet over tynn munnf?lelse.", "8 - 4 - 8 - 5 - 16\n\r\nVery deep brown, close to black body, with a head that is a bit smaller than average, it’s creamy, light brown and it leaves some lacing. Strong aroma of dark caramel, roasted malt, and dark dried fruits, with brown sugar and burnt sugar in the back. Also hints of honey and vanilla. Strong flavour of sweet caramel, dark caramel, roasted malt, and dark dried fruits. In the back I get burnt sugar, brown sugar, and fermented apples. Additional hints of leather, vanilla and smoke. Moderate sweet taste that is perfectly backed up by a toasted malty dryness and a nice moderate bitterness in the long-lasting finish. Full body, creamy and smooth texture, soft carbonation. A perfectly balanced scotch ale, lovely! \n\r\n[35.5 cl bottle, enjoyed 5 months before BB date, from Vinmonopolet Lillemarkens, Kristiansand]", "Dirty bastard scotch ale at o'haras pub in New York City. I'll rate a 5 out of 10\n\n---Rated via Beer Buddy for iPhone", "330ml bottle. Pours dark brown with medium tan head. Aroma of dark fruits, caramel, malts, vanilla. Medium body with average carbonation. Taste is well balanced medium sweet, light to medium bitter. Good one.", "Pours unclear dark brown with a red glow. Small white head. Smell is caramelly malts, intense, but with a certain subtile intensity. Taste is full, mild butteryness ( allowed in the style ) bit caramely, dark bread delivered from the malts. Mild walnutty flavors in the back. Creamy mf. Not too much carbo.", "God damn, this beer is so fucking good. Pardon my French but it's worth it. Get it whenever you can \n\n---Rated via Beer Buddy for iPhone", "Poured a solid dark brown with small brown head. Aroma sweet dark malts and dark rum with cola. Taste is rich, strong, sweet malts and dried fruit undertones. Followed by a bold bitter malty finish that turns slightly acrid/burnt on the end. Full bodied, well carbonated, great length to finish. Enjoyed thoroughly.", "Just a even balanced scotch ale that isn't over hopped like so many others. \n\n---Rated via Beer Buddy for iPhone", "12 oz bottle poured. I actually think I picked this one up while traveling, before Founders made it to the PNW. Super excited to have it finally, then it showed up everywhere around here. Oh well, same great beer. Dusty, dark brown pour with a tan cream foam head. Sweet and spicy malt aroma. Toasty malt, a light charred wood note, balanced by the slightest hint of vanilla/cream. A pleasant, easy drinking scotch ale here. Bold almost smokey linger. Exceptional for the style.", "Ambrée sombre, forte mousse beige. Fort nez malté, caramel brun, pain, fruits noirs. Gout malté, foin et fruits noirs secs, caramel cuit, un peu grillé et pain avec bonne amertume, épices et fruits noirs un peu macérés en fin de bouche.", "Sweet aroma, with hints of caramel, tofee, raisins, black \"cocada\" (coconut candy); followed by a little herbal hop. Taste follows; alcohol perfectly balanced. Nice color and head. Complex, smooth, warmy. Excellent beer!\n\n---Rated via Beer Buddy for iPhone", "Draft at Stillwater tavern in St Pete, Fl. Dark brown pour. Minimal aroma. Can taste peat mixed mixed with dirt. Solid beer but not phenomenal. 97 rating seems high", "Obfita, drobna piana, trwała i ładnie zdobiąca szkło - wzorcowo to wygląda. Barwa ciemno miedziana, klarowna. W aromacie głównie karmel, orzech laskowy, toffi, irysy czy krówki, w tle odrobina ziół. W smaku półsłodkie, lekko szorstkie, generalnie to samo co w zapachu, w afterteasie minimalna ogniskowa wędzonka. Goryczka średnia do niskiej, tytoniowo herbaciana. W odbiorze nisko wysycone, gładkie, raczej rzadkie. Zgrabnie ukryty alkohol.\r\n\n\r\nDość zwykłe, nieco wodniste Scotch Ale, całkiem za to pijalne, ot codzienne piwo jako alternatywa do jasnych lub czarnych Ale...", "Bottle, 355mL. Home. A very dark brown sparkling beer with a medium off-white head ; medium retention, average lacing. Caramel, roast, licorice, dried fruits. Medium round sweet warming, light to medium dry bitter. Good body, light to medium oily texture, soft carbonation, sweet caramel warming dry lasting finish. Overall, very good, great !", "Bottle. Pours a luminous ruby brown with a large sticky beige head that dissipates to a clumpy film. Substantial lacing on the glass. Aromas of caramel malt, a bit of toffee and dark fruit. Flavors are toffee, dark fruit, cocoa, toasted bread, earthy hops and bit of smokiness. Rich and full bodied. Noticeable alcohol warmth. Somewhat peppery mouthfeel, but otherwise, creamy. Wonderfully complex. There’s nothing to complain about with this one.", "Unique smokey peat aroma with caramel and malt taste and finishes with a kick of hoppy bitterness. One of the best scotch ales.", "flesje van de Bierkoning Amsterdam, schenkt bruin met zacht bruine lichte kraag, aroma van mout , caramel, rozijn, donker fruit vijg en dadels. Smaken zijn redelijk zoet caramel, vijg/dadels, mout, erg goede zachte donkere fruiten, volle body, erg goed in zijn stijl.", "Bottle. Clear red, copper colour, rocky tan head with great duration and lacing. Aroma of caramel, bread, raisin, with notes of plum. Taste is medium sweet and medium- bitter, caramel, bread, raisin, light smoke, dried fruits, plum. Bitter finish with notes of burnt caramel, dark fruits. Medium+ body, soft to average carbonation. Quite rich and tasty.", "On tap at Hippo Glasgow. Dark red/brown beer, off-white head. Light malty, fruit scent. Taste is rich malt, apple, citrus, dried fruit, toffee. Light, tangy aftertaste that gets a bit sickly as you go through it. The taste of alcohol is more than I’d like but otherwise it’s nice.", "Not many 12 oz bottles can be pleasurably consumed over a one-hour period. Dirty Bastard though was made for such a session. Complex, hearty, delicious & with enough bitterness to keep things interesting. Taste and appearance both have hints of an English Barleywine.  Appreciate the user friendly \"bottled on\" date...and the reasonable price.  Bravo Founders!", "Black with big brownish head; aroma is fruity with chocolate, plums, some spiciness and a sweet malty note; taste is medium to very sweet, chocolate, coffee, herbal and spicy medium bitter finish; texture is big and creamy with medium carbonation", "Tap @ Handgemacht - clear brownred color, beige head. taste is dark malts, chocolate, sherry, raisins, medium dry finish. very round, alcohol perfectly hidden. great one.", "12-ounce bottle pours clear dark amber-ruby with a small light tan whipped cream head. Aroma: molasses, brown sugar, cherries. Flavor: all of the above with figs, chocolate, smoked peat, port wine, brandy. Mouthfeel: full-bodied, very oily, somewhat creamy.", "On tap at \"The Good Life\" Massapequa Park. Dark murky brown color with a boozy and earthy aroma. Taste: plums, apricots, molasses, bourbon vanilla and oak. Pretty much a toned-down version of Backwoods Bastard.", "Bottled 02.24.17. A: Super malty. Lots of brown sugar. A: Fluffy off white head. Nearly opaque dark red body. T: Brown sugar with a bit of smoke and slight bitterness on the back end. P: Silky smooth. O: It’s not the most flavorful, but it’s balanced.", "Brun öl med mörkbeige skum. Doft av russin och mörk kola. Mörkt sött bröd och mörk kola i smaken.", "(bottle, 35.5cl) Hazy, ruby brown colour with a beige medium-sized foamy head. Slightly syrupy nutty malty aroma with notes of caramel, chocolate, dried fruits, vanilla and a touch of alcohol. Sweet-bitter flavour, full bodied with a smooth, well-carbonated mouthfeel. Initially dark and nutty malt with notes of caramel, dried fruits, chocolate and drying herbal-spicy hops kicking in from the middle part, lingering into the balanced dark malty and hop bitter finish with a whiff of smoke, vanilla and a warming alcoholic strength. Pleasant. 25.IV.17", "Bottiglia. Il gusto al naso si spiaggia su orzo tostato. L’intensità olfattiva è elevata e la persistenza olfattiva è apprezzabile. Il cappello di schiuma persistente ha una buona tenuta e appena aperta la bottiglia la schiuma di colore marrone chiaro esce da sola. La grandezza delle poche bollicine è medio-fine. La carbonazione è nella norma. L’aspetto del liquido è velato. Il colore è marrone chiaro. La carbonazione è persistente. Il corpo è strutturato non pesante. La struttura è cremosa. Il dolce è medio in buon equilibrio con l’amaro medio. L’intensità gustativa è elevata e la persistenza gustativa è buona. Il gusto è piacevole. Il finale è lungo, pulito e complesso. Il retrogusto è intenso. L’aroma in bocca riporta sentori di caramello, miele, nocciola, pane tostato e alcol presente.", "Pours a thick ruby brown red with a rich malty bready aroma. The taste is full roasty malts with a smoky aftertaste and that classic syrupy scotch ale mouthfeel. Definitely not a session beer or one I would want on the reg, this one lives up to its name; it is nasty and coarse (in good ways) and effective. Overall, another winner from Founders, even if the style isn’t a favorite of mine. Good for mixing up the tahini in more ways than one before a big Seder party!", "12floz bottle (BOD 02.17.2017) purchased as a single for $1.50 (also have had prior). The label contains a slightly different commercial description (\"seven varieties of imported malts\" not \"ten\"). It is indeed dark ruby in color and possesses a foaming beige head. Notes of raisin and alcohol are noticeable aromas present. Another fine offering by the Founders brewery. Full in body and rich maltiness consists of fig and peat flavors. Good cold and at warmer temperatures. Hops are present to let you know that this is an Americanized Scottish ale.", "It’s pretty good, too much alcohol, great if you want to get drunk but doesn’t taste as good", "Strong, but very drinkable. Dark red color. Aroma of hops and some fruit. Smooth and creamy with the flavor of dark chocolate and a little bit of bitterness. Well balanced beer", "Review based on the BJCP2015 guidelines (style 17C). Bottle 35.5 cl - Batch unknown (bottled on 10/05/16 - BBF unknown). AROMA: moderate malty aroma with notes of toffee, maillard compounds (bread crust), medium-low peppery alcohol backgorund. APPEARANCE: deep ambar color and slightly hazy. medium light brown head with good retention. leg formation. TASTE: similar to the aroma (toffee / caramel) but with a more roasty character. medium bitterness with an almost dry, bitter and roasty finish. PALATE: medium-full body with a velvety texture. medium carbonation. OVERALL: a very nice scotch ale, a bit on the bitter side.", "Very solid, well balanced beer. Strong, but yet so drinkable. Smooth, creamy. Really good one.", "Bottle from Boise Co-op. Dark, ruddy brown, small spotty head. Big earthy, peaty aroma. Taste is malty, peat, chocolate, roast grains,. Lingering bitterness. Nice body too, velvety, rolls over the tongue.", "18/20 Pretty sensational. So rich and chocolatey but still so malty. Balance is excellent. A treat", "Great balanced malty beer with a complex flavor. A little candy but not overly sweet.", "A malty aroma, light alcoholic and sweet. The small beige creamy head has only a short duration. The body is dark red, nearly black. A very malty taste, bitter chocolate. The body is medium strong, very creamy a light oily with a normal carbonation.", "Half in CBC city. Good stuff although taste of apple core comes through on aftertaste. A great example of style", "Bottle 12 ounce, poured to pint glass\t\r\nAppearance: dark brown, reddish when held against the light, light brown foam that disappears slowly, appears to be clear\r\nAroma: scent smell of malt, boozy on the drink, very good\t\r\nTaste: very good to excellent, medium bitterness\t\r\nMouth feel: creamy, good carbonation, long follow through, no sudden drops, a bit sticky, long sweet bitter aftertaste\t\r\nOverall: excellent scotch ale, very good beer repeat: yes look for: yes\t\r\ndrank: February 26, 2017\t5:30 PM", "12 oz single from Lifesource.in Salem OR.\r\n$2.99\r\nVery attractive looking beer..darker brown with a gorgeous thick, creamy tan head.\r\nAromas of chocolate , oats and slight ashyiness, some toast and wood. Nice.\r\nTaste similar with the peaty aspects better defined..\r\nVery nice mouth feel gets to be smokey in the end.\r\nGood Scotch Ale", "10th Feb 2017: Third beer on my first flight at Devilicious, Temecula California. Another highly rated beer new to me and my sweet tooth loved it. Mahogany body, off-white head. Malty, heavy and lovely. Malty molasses rule this semi-sweet Scotch Ale, some fruity notes calm the sweetness down and the hops try to balance the brew out (but fail).", "Of a beer style that I rarely tested but repetié whenever possible. The only thing I miss is the density of water. I like beer with water denser and heavier", "Poured from tap at Tuckaway hazy brown with a thin tan head. Aromas of chocolate rum dar fruit and caramel. Taste is sweet malt brown sugar dark fruit.", "Bottle from Hopt. Aroma is rich malts, caramel, toffee, touch of butterscotch and chocolate. Flavour is medium sweet and moderate bitter. Body is medium to full. Very robust sweet malt-heavy brew with a firm body, well-balanced stuff. Quite satisfactory.", "Nice dark brown/red color. Smells of dark candy, earth, malt, caramel, molasses... not overly sweet, but sweetness is there. complex. Tastes of metallic notes, malt, grain, molasses... but quite neutral, a tad bitter.. a touch of alcohol. It’s not bad, more like a strong brown ale than a scotch ale.", "enticing deep mahogany pour from bottle. i expected more aromatics, but only got faint whiffs of sweet malty goodness. fully, creamy body with soft carbonation. tastes very similar to a barleywine. the finish is a tad on the sweet side. overall, a complex brew with a great malt base and a warming finish.", "355ml bottle into tulip. Smells of rich chocolate, rum and raisins, a little pepper. Mahogany red/brown beer with light only penetrating the edges. Small creamy off-white head. Slightly zingy mouthfeel, full bodied and viscous. Taste is dark bitter chocolate and cocoa. Finish is dry, bitter and malty. Warming alcohol notes at the end. Good dessert beer, really nice.", "Tap at George and dragon. Dark red brown with thick off white head and good lacing. Nice malt nose. Taste is sweet, malt, biscuit, dark sugar. Complex. Good finish. Medium full body.", "Pours hazy ruby-brown with thin beige head. Nice dark fruits, caramel and coconut aroma. Taste is sweet caramel with strong bitterness. Medium-full bodied, soft carbonation, lingering bitterness.", "Pours clear, reddish-amber. Ring of head. Dried fruit and wine aromas. Sweet. Not particularly bitter. Full, almost sliky body. Lively finish, a bit reminiscent of grape soda at that point.", "Opaque and very dark with no head. Not much aroma, but the flavor is a complex profile of varied flavors -- hops, roast, malt, a bit of smoke, a bit of sweet. It is a bit syrupy. Full bodied. Rich and full.", "33cl bottle at Sheepshank, Bangkok. \r\nThin off white head. Hazy amber pour. Molasses in the aftertaste. Nice", "355ml bottle @ hotel room morning beer. Bottled 2016.12.29\n\r\nPours a rich brown colour with a decent creamy tan head. Nose is caramel malts. Flavour is a mix of caramel and light scotch(with no heat), the IBUs become quite apparent with a lasting bitterness. It is rich and very smooth, just the bitterness puts me off... but that’s me.", "King of American Scotch ales--all hail the Bastard. Pours a gloriously rich red with a massive layer of foam and ample lacing. Smells like a sticky bun eaten on a Scottish moor. Starts with a burst of dark caramel and toffee, yet never grows overly sweet, instead rolling around in the peat with a whisky-tinged smoky backbone. Grows surprisingly hoppy for the style, adding a needed balance to the heavy malts, sliding into a lovely bittersweet fade. God, what a great brew.", "On tap at Elizabeth Station. Pours a hazy copper with a tan heae. Aroma is roasted malt, caramel. Taste is pretty the same with. Good.", "Chuck’s 85th, Seattle. Thin small tan head, cloudy malty copper-amber. Malty caramel nose. Heavy clean scotch ale, bitter dark amber. Quite bitter profile, quite nice. Dark toffee caramel, slight metallic, deep bitter roast. Cool body, but some alcohol richness and bite on finish. Nice.", "Pours a dark brown, almost black color with a decent sized, beige head.\r\n\r\nSmells of molasses, caramel malts, burned toffee and earth - rustic and inviting.\r\n\r\nHas a very low carbonation, silk on the tongue, very sweet till mid palate until the finish, in which a pungent dryness mingles together with the initial maltiness.\r\n\r\nToffee malts with a rustic earth wrapping creates the taste foundation in this. Gets a very pleasant roasty touch during mid palate, enriching the malts, with a slowly evolving herbal note. After the swallow hops get way more noteable, producing an almost tongue numbing dryness of dried grass, replacing the sweetness by even more earthen toast in the finish.\r\n\r\nPretty darn wild on the tongue, sweet, roasty, then dry- convincing in every of its aspects with a great balance.", "Bottle @ Morton’s Market. Rich, creamy, sweet maltiness, toffee, nuts, hint of bourbon like aroma & taste. Palate is so smooth and complex - both with rich flavor and a delightful aftertaste of smokey peat and holiday spices. This is now truly my favorite style...and, along with Old Chub, this is my favorite Scotch Ale. A perfect brew. Food-pairing Note: Try it with Large Black Cerignola Olives. Absolutely delicious!", "Can from Sake no Taniguchi. Pours a deep dark ruby with lovely light tan foam. Rich sweet malt aroma, toffee, bourbon-like booze note, some peat smoke. Nice malt flavour, full and rich toffee and caramel, not too sweet, hits the back of the throat quickly with rising warmth, but leaves some sweet residue and smoke on the tongue. Really lovely and smooth to drink, full yet buoyed by hopping. I love this style and these flavours really ooze out and linger over the course of a whole can. Great stuff.", "Sweet scents of malt and caramel. Pours a rich clear mahogany with tight tan head. Excellent lacing. Tastes of caramel malt and leather with a lingering sour hops finish. Viscous mouthfeel with mild carbonation. A substantial ale that I really like.", "Post club cata Olut. Suave , redonda. En boca algo dulce y maltosa, nada alcoholica pese a sus 8,5°.Aroma a regaliz.", "Niezłe scotch ale. Palony karmel, toffi, figi, śliwki suszone, lekka czekolada, nawet ser pleśniowy w tle ;) Lekka wędzonka, alko nie czuć co najwyżej lekko rozgrzewa. Generalnie słodkie piwo, ale nie tak bardzo ulepkowate, z doskonałą lekką wedzoną kontrą. To jest właśnie scotch ale. Sweet, burnt devil.", "Bottle. Nice amber colour, clear with white head. Aroma of candi sugar, figs, berries and toasted malt. In taste sweet, fruity with caramel and dried fruits. Medium body, quite dry and lightly bitter finish. Really nice.", "Une bière brune, avec une bonne carbonatation et une bonne opacité au niveau de la couleur. Au nez, beaucoup d’arômes avec notamment du sucre d’orge, un peu de torréfaction, et des épices. En bouche, on retrouve beaucoup de saveurs de caramel, avec une petite impression d’amertume en fin de bouche. De bonnes impressions d’épices proviennent également du liquide. Le corps est rond, riche, sans être trop lourd non plus, donnant un bel équilibre. Belle bière.", "Bottle. Sweet, lots of residual sugars, red fruit jelly, caramel, dried fruit, lots of walnuts. Thickish though not oily, dry, nutty, astringent finish, fruity but also very malty flavour. I liked everything about it, save for its lingering astringency.", "Bottle (Edeka Gronemann, Castrop-R.): Deep ruby-amber coloured, almost clear, small off-white foamy layer; rich sweet bitter aroma of caramel, port-wine and dried fruits, herbal hops and traces of soy-sauce in the background; solid bitter-sweet flavour, medium to full bodied; lingering drier and hoppier finish with flavours of - again - caramel and dried fruits. Classy and well balanced stuff, the right winter-warmer...", "Dark red color with medium head. Aroma of hops and some fruit. Flavor of hops, alcohol, dark chocolate and some smoke.Medium bitterness, light sweetness, a little spicy. Long bitter finish.", "Trübes dunkelrot mit reichlich Schaum. Malzig, sehr süß, etwas Karamell, nussig, leicht fruchtig, etwas Pflaume, leicht alkoholisch.", "12oz bottle pours amber with tan head decent lacing, dark roasted malt scent, taste of molasses, prunes a little of dates, solid brew", "è la prima scotch ale che bevo! mi ha conquistato. Non vedo l’ora di riprenderla", "Pours a hazy mahogany color with medium beige head. Aroma has notes of caramel, toffee, vanilla, dates, cherries and prunes. Taste follows the nose, brown sugar, caramel/toffee, cherries, prunes, dark riped fruits, vanilla beans, earth and molasses.", "12 fluid oz bottle. Pours a brown tinged burgundy with a light haze and a lovely tan cap. On the nose burnt sugar, dates, toffee, a faint earthy note, and very light smoke. Taste wise, light sweetness well hidden under dark roasty malt, raisin, a decent amount of mineral heavy bitterness, faint molasses, and some woody notes that heads into brown sugar, dry dark malt notes, light ash, faint butterscotch, molasses and bitter dark coffee in the finish. It’s not spectacular but it’s so damn solid, and the 8.5% alcohol is dangerously non-apparent. I would buy it again in a second. It’s kind of the perfect beer for winter.", "23.11.2016 - Aroma of old light smoked leather and alcohol. There are some peaty and smoky notes in this full bodied thick strong ale. Oily (cara) malty palate.\r\nAlcoholic and bitter finish.", "0.355 l bottle from ’CraftBeer-Dealer.com’, apparently best before November 2016 (import label). Very dark red with a thin, frothy, almost stable, beige head. Sweetish-malty, slightly fruity aroma of caramel, molasses, prunes, raisins and candied cherries. Very sweet, malty and slightly fruity taste of molasses, toffee, raisins, prunes, some vanilla, candied cherries and hints of chocolate, followed by a medium long, slightly bitter, slightly warming-alcoholic finish. Medium to full body, slightly oily mouthfeel, soft carbonation. Very nice sipper!", "Pours dark brown, beige and persistent foam on top. Aroma is boozy, yet sweet and caramel-acidic. Ripe prunes in a slightly bitter jam. Taste is also showcasing this beers abundant hopping, bitterness from alcohol and from the hops are blending nicely, thick body, solid flavour profile. For me feels like a very good specimen of its style, bitterness is taking out a lot of excessive sweetness, so I think I like this one more than most Scotch Ales out there.", "Une robe acajou aux étincelants reflets rubis est surmontée d’une mousse brunâtre bien compacte à la durée de vie moyenne. Du caramel écossais légèrement brûlé, des céréales délicatement fumées et de la mélasse constituent le bouquet \"sucré\" de cette célèbre Dirty Bastard. En bouche, c’est la continuité des arômes détectés avec une touche sucrée un peu plus prononcée. Une texture svelte en bouche véhicule bien les saveurs qui se terminent dans une amertume plutôt prononcée pour le style.", "Tap @ Keg & Brew. Murky brown with minimal dirty cream head. Aromas of molasses, vegetation, caramel malts, cherry, oak elements and peaty smoke. Some earthy hop bitterness, which perfectly balances the sweetness. Great beer.", "Aus der Flasche im Alten Mädchen getrunken. Trübes Schwarzbraun mit wenig Schsum im Glas. Markante Malz- und Holzaromen.", "Poured into a pint ale glass at 45-50 degrees, deep ruby with a 1/2 inch head that falls. Aroma is caramel, slight over ripe pear to plum with a hint of alcohol. Taste strong ripe plum dark fruit with slight bitterness. Finish caramel with hay, smoke, earthy - dry hop tones. One of Founders strengths, Dirty Bastard is a complex ale that provides extreme value for the dollar. One to be enjoyed and revisited when the others fail.", "Aroma; caramel, toffee, nut, leaves, mild fruit peel. Look; apricot-beige head, dark hazy caramel brown body. Taste; caramel, roasted malts, hops, nut, yeast - leading to a caramellish yeast-malted finish. Feel; solid body. Overall; tasty sipper. [35.5cl.btl 8.5% BB.28.11.2016 B@Systembolaget]", "Bonito color caoba, muy oscura con buena espuma cremosa ocre. Buen aroma, de predominio dulce y licórico. En boca presenta cuerpo moderado y un excelente tono ricamente malteado, acaramelada, de cierta complejidad: fruto seco, chocolate, notas de madera, licor... que deja rico postgusto", "Bottle from Liquor Barn. Pours dark brown with tan foam. Spicy aroma and taste of molasses and raisins. Finish is bittersweet caramel malt. Beautifully made complex ale.", "Pours ruby brown with caramel head which colapses to a lacing. Looks great. Aroma of burnt caramel and iron. At first I was not a massive fan of the aroma, found it a bit metallic, but it grew on me right up until the end. The taste if sweet burnt caramel, smoke, molasses, spice. Reminded me of a slightly spicier Old Tom by Robinsons Brewery which is also 8.5% abv.", "Bottle @home. Pours brown, tan head. Nose is molasses, toffee, chocolate, caramel. Taste is chocolate, slight smoke, slight fruit.", "L:\r\n-pours a dark brown with ruby tinges and a medium,foamy,beige head\r\nS:\r\n-cooked potatoes,herbal,plums,figs,raisins,caramel,chocolate,licorice,syrup\r\nT:\r\n-herbal,plums,raisins,syrup,caramel,spicy,grassy,pine\r\n-medium to high,lingering bitterniss for the style\r\nF:\r\n-low to medium carbonation\r\n-light to medium body\r\n-alcohol noticeable\r\nO:\r\nThis is pretty great.sweet ale with a strong English Hop Presence.", "Bottle from somewhere. Color is dark copper to brown. Head is medium and beige to brown. Aroma is spicy, pepper, malt, caramel, fruity, malt, nutty. Medium carbonation and body. Sweetness is medium, bitterness is light to medium. Flavour is chocolate, caramel, spices. This is not my kind of style of beer, but it’s great!", "Bottle from SB. Dark brown color with beige head. Aroma is caramel, malt, bread spices, syrup, honey. Sweet spicy tastes, hints of smokiness, dry finish. Medium bodied.", "As braw a Scotch ale as ever crossed this gullet. If the score seems low, it reflects tepid enthusiasm for the style, rather than the beer. Clear ruby with a prodigious, lacing head. Almost Ribena-purple in the twilight. The nose is all molten toffee and fermenting dark malts. Something about it screamed Hallowe’en - must be molasses, conjuring memories of treacle-dipped scones dangling from the ceiling when I was a nipper. Slick body, low carbonation. Strong vanilla notes, caramel, clove, raisins and some woody/herbal hop notes for character. Sweet but saved by the hops. Can imagine drinking a lot of this through the long Michigan winter nights. (355ml bottle from Leura Cellars)", "Dark amber/cider color; Medium slightly creamy body; Aroma of sweet malt, dark fruit, caramel, & some vanilla; Flavor of smoky sweet malt, caramel, molasses, dark fruit, vanilla, and spice; Nicely balanced; Pretty good overall.", "On draft at Sharp Edge Brasserie. Poured dark brown with thin khaki head. Thick lace. Complex flavor with sweet malt, toffee, raisins, figs, cloves. Touch thinner body than I was expecting. Boozy finish.", "Bottle at home. Clear dark amber/ruby. Aroma heavy malty (caramel, raisins, chocolate, toffee). Flavor heavy sweet, caramel, dark fruits, chocolate. Full body, smooth carbonated.", "Pretty nice aroma... hops and a lot of roasted malts. It has a pretty good appearence: solid and uniform dark brown color, with a consistent think head of yellowish foam. Overall, a pretty tasty and bitter ale.", "bitter and also sweet with caramel tasty. full body, caramel, brown, clear,", "Botella 33 cl en el cheers Oviedo. 12..10..2016. (r2466). Fcpref2la..11..2016. Color marrón oscuro turbio con espuma beige Aromas y sabores maltosos algo tostados con toques caramelos y ligeras especias secas. Cuerpo medio algo denso y espumoso con 8.5 vol que se dejan notar en todo momento. Toda una Scotch ale", "Dark ruby appearance with a sustainably light tan head. The aroma is caramel and toffee all the way with a touch of leather inbetween. In the tasting the caramel malt leap forward while complex flavors of smoke, toffee, coffee, chocolate and toast. A real nice beer to cozy up with amidst the fall season setting in.", "the aroma of caramel, red wine, raisin, brown chocolate, toffee and robust... the taste is caramel and fruity with notes of sweet wine, dark fruits, milk chocolate, brown sugar, toffee and some spices... bright hopping... sweet, bitter, dry and warming aftertaste...", "Хороший напиток, сильный приятный винный аромат, мощный вкус с горечью, карамель во вкусе, согревающее продолжительное послевкусие. Срок годности до 06.02.17. (Bottle 0,355/ 8,5%)", "Can from Tanakaya. Pours a deep reddish brown with a finger of foam that dissipates quickly. Lots of toasted caramel, roasted malt and peat on the nose with a touch of vanilla. More roasted malt and peat on the palate with quite a bit of hoppy bitterness. Not my thing, but it accomplishes what it sets out to do. Well-made.", "Bottle at home. Chestnut-ruby colour, hazy, beige foamy head. Really malty with caramel, raisins, herbal, clove, cough syrup, porto/red vinous, nuts, quite alcoholic, bitter finish: complex altogether. Aftertaste?s nice. Firm body, oily to sticky mouthfeel, low carbonation.", "0.355 bottle.  \n A clear, brown color with a crimson tinge to it and a medium, cream-colored head. Aroma of very rich malts, caramel, wood, and butter. Taste is sweet, nutty, very malty, leathery, and a tad fruity. A full body, a creamy texture, and a soft carbonation. Finish is more alcoholic than the rest and introduces some bitter notes but otherwise remains roughly the same. Overall it is a good beer, it struggles to keep its alcohol under control towards the end but that could be expected of a scotch ale.", "Una scotch ale hecha y derecha. De color ámbar cobrizo, corona de espuma color marfil de buena retención, con burbujas compactas. En el aroma el dulzor destaca, notas a caramelo, toffee y algo de nueces. En boca nuevamente el caramelo y toffee destaca, el amargor ligero alto no astringente, con un retrogusto ligeramente dulce.", "Bottle at home. Pours dark amber with medium beige head. Aroma is sweet and malty with dried fruits. Taste is dry honey melon with malts, raisins and bit of booze. Aftertaste is sweet alcohol. Palate is dry, medium bodied with long finish. Not your average ale, but nice and tasty.", "Nice thick mouthfeel. Great malt profile, sweet yet balanced. Very nice and easy to drink.", "Red amber with beige head and a rich malty note. Sweetness in nose and taste with rich round notes. Palate leaves a little short but almost oily and with distinctive malty notes.", "Bottle. Dark brown copper color. Aroma of sweet caramelised malt and spices. Taste of caramelised malt, bitter coffee, leather, spices and mild smoke. Founders is never bad.", "355ml bottle. Dark amber brown colour with a one finger beige head. Aroma: rich malts, dark fruits, caramel. Taste: rich sweet fruity malts, ripe dark fruit, caramel, hint of smoke, some alcohol. Sweet finish with a slight hoppy bitterness in the aftertaste. Medium to full body, sticky mouthfeel.", "On tap at La Tape.\r\nWeak aroma, caramel and fruity.\r\nTaste is prune, ripe dark fruit, some alcohol and some fruity acidity.\r\nMedium creamy palate.", "Bottle - Pours deep amber-brown, white head. Sweet malty, earthy, caramel, raisins, hops, alcohol.", "Tap at Founders. Clear mahogany with beige head. Lots of caramel, light cocoa, brown sugar, toffee and a bit of grassy hops in the finish. Over medium sweet and light bitter. Over medium bodied with soft carbonation and sugary feel.", "Bottle - Clear reddish brown colour, medium beige head with good retention. Sweet malty aromas of caramel, dried red fruits, some leather, cigar and a touch of smoke. Taste is also sweet with a lot of caramel, some dried fruits, honey, toasted nuts and smoke. Full body, soft carbonation, velvety texture, sweet finish. Great scotch ale with complex maltiness and decent smokiness.", "Bottle at home (bottled 04/20/16). Pours a clear red brown with an off-white head. Aroma of sweet malts, caramel, hint of chocolate, dark fruits, smoke. Taste is over moderate sweet, moderate bitter, sweet malts, caramel, dark fruits, hint of chocolate, smoke and peaty towards the end, hoppy bitter peaty aftertaste. Nice.", "Bottle@ home. Pours dark ruby color with light brown head. Aroma has caramel, toffee, ripe fruits and raisins. Taste is malty sweet with long fruity and a bit bitter aftertaste. Flavors of caramel, toffee, raisins, butter and oak.", "12 oz pour from can into tulip. Pours deep brown, opaque, weak off-white head. Nose is sweet and malty, a little earthy. Body is medium to full, creamy. Taste is sweet, nutty, malty. Solid, easy to drink.", "Medium brown with a dense one-finger off-white head and sticky lace. Rich malty aromas - bread, dark fruits, caramel, brown sugar and tobacco. Big bold malt sweetness with hints of smoke, yeast and alcohol and herbal hops. Medium to full body, chewy sticky mouthfeel, medium carbonation and a rich sweetness in the finish.", "Ambar avermelhado/marrom translúcido, espuma marrom claro de boa formação e persistência, linda. Caramelo e maltado intensos e nítidos, vanilla, leve amadeirado. No paladar aparece mais o amargor do lúpulo dividindo espaço com o dulçor caramelado. Corpo e carbonatação de média intensidade, bem dosados. Final tem um pouco de madeira, defumado residual, toffe queimado, licor de cacau. Álcool fica mais nítido com aumento da temperatura, mas bem inserido.", "A very smoky, brisk taste with a small bite. Pine, caramel and the slightest taste of hops. A smooth beer, pleasant to drink!", "12 oz. can at the house. What a wonderful beer. Smoky and caramel are the aromas of this dark deep rich beer. Thin beige head, this thicker beer is complex with malt, caramel and a sweetness to it. Over all just Outstanding! Makings of a great winter warmer.", "From XXXII. In Teku glass. Playing Grim Fandango Remastered. Standard interpretation of the style. Nothing bad in it but there are better, cheaper and more easily accessible interpretations of that style, like the Gordon’s one", "Poured a deep coppery-brown with a slight translucence and an orangey-tan dense foam head that retained very well and laced OK. Carbonation moderate and fine. Aroma of sweet rich malty caramels and alcohol. Taste initially with slightly roasted malts, very sweet toffee/caramel malts and sweet dark fruits; low bitterness; alcohol throughout taste profile masks other flavours. Medium body. Smooth, soft, clean, slightly creamy and a bit syrupy but too much alcohol on the finish.", "W aromacie słodycz, karmel, tostowość, masa rodzynek, szlachetnego utlenienia w stronę sherry. W smaku podobnie, bardziej tostowe niż karmelowe, słodkie suszone owoce przełamane naprawdę potężną, ale krótką goryczką o lekko ziemistym, przypalonym tostowym charakterze. Wzorowo ukryty alkohol, pije się bardzo łatwo. Świetne!", "Bottle. Dark ruby color with light brown head. Aroma has caramel, toffee, ripe fruits and raisins. Taste is malty sweet with long fruity and a bit bitter aftertaste. Flavors of caramel, toffee, raisins, butter and oak.", "Hazy brown color with off-white head. Aroma is smokey, like also the flauvour. Medium sweet. Some warming alcohol, but it fits fine for this beer, so it’s not disturbing. Recommendable beer.", "Dark fruit aroma with a bit of spice, roasty and sweet. Dark brown / ruby color, with some haziness. Visible carbonation. Tall tan creamy head, receding slowly. Nice lacing down the glass. Thick and smooth feel. Initial taste follows the aroma... lots of malty complexity, a little sweet, with dark fruits. The finish has the bittering hops assert themselves into the aftertaste, which seem a bit overdone or overhopped for a scotch ale.", "Kevyempi kuin imperial stout, mutta makua löytyy. Hieman viinainen jälkimaku, ei häiritsevä.", "Keg at Common, Manchester. Hazy brown shade. Thin head. Big candy-ish fruity notes, tobacco and sticky maltiness all the way through. Quite an earthiness to it as well. Good example of the style.", "Hints of caramel, chocolate and smoke. Creamy head. Medium sweet taste. Relatively light body considering ABV. Soft carbonation. Bitter finish.", "Farbe: Dunkles rot-braun, erinnert an Kirschsaft, heller wenig beständiger Schaum.\r\nGeruch: Malz, Holz, leicht säuerlich, etwas Rauch\r\nGeschmack: malzig, säuerlich, leicht holzig und rauchig, zum Abgang dann auch noch hopfen- (und röst-?) bitter. Recht alkoholisch, aber nicht störend.\r\nGut!", "In der Nase viel Holz, Whisky und Vanille. Anschließend im Mund schlank. Erinnerungen an Wein, Fass und Whisky werden geweckt. Erst leicht süß, dann schnell radikal whiskeyscharf. Der Nachhall alkoholisch wärmend und vielfältig. Schwer!!! Honig!!! Wenig Hopfen!!!! On Tap in der CRAFT BEER BAR Hannover.25cl/4,40Euro.", "Bottle 35,5cl\r\n@ XXXII The Great Power of Beer & Wine, Seville, Spain\r\nA: Dark amber\r\nT: Malt, caramel, raisin.", "Bottle from Alko. Aroma has caramel, toffee, malt, dark bread. Taste is very nice and warm and has a lot of dark bread on it. Very good beer.", "Butterscotch, jam, raisins, alcohol, a whiff of wet dog, light coffee, and caramel.\nRuby colour, medium beige head, lacing.\nHeavy sweetness, medium bite, lightly salty. Malt forward, yet it packs a hop punch. More Than usual for the style, ABV well hidden.\nFullbodied, soft carbonation, oily feel, salty, sweet and warming finish.\nGood example of an American take on the style.", "Strong malty aroma, caramel, toffee, bread, raisin, smoke. \nPours a slightly hazy reddish brown color with small off white head\nSmoke more prevelant in flavor, woody, char, raisin, toffee. A bit bitter. \nMedium full body with medium low co2, lingering woody bitterness in finish.\nAroma smells great. The flavor is a bit bitter in my opinion. I like sweeter scotch ales. \n\n---Rated via Beer Buddy for iPhone", "Draught at L’Europe, Madrid. Pours dark ruby, tan head. Intense aroma is blackberry, raspberry, red gummy, sundae caramel. Tasty, sweet-ish, powerful -to be sipped slowly. Long finish with little hop bitterness. Nice.", "Draft. Pours dark brown with a tiny brownish-white head. Sweet malt, chocolate, alcohol. Medium sweet. Aroma and flavour go hand in hand.", "Bottle. Pours a dark brown colour with a thin beige head, aroma is malty with some hints of toast, taste is medium bitterness with fruit with a dry fruit finish.", "Pretty in a glass. Boozey caramel and peat, approaching a scotch flavor. One of my favorites, and the ABV packs a nice punch.", "Bottle from Alko. Reddish brown with some brown head. Nutty, alcohol, some fizzy, sweet. strong with alcohol, need more complexity,\n\n-- rated with beerbasher/winphone", "tap at Taphouse (Copenahgen) hazy brown and amber with a small white head. Roasted caramel malty aroma withfruity hops note. Fruity, light metallic, roasted caramel. Growing bitterness into a fruity flavoured finish.", "355ml bottle from The Perfect Pour, Maryland. Pours a cloudy dark ruby with a yellow head. Aromas of chocolate, red wine, roast malt. Flavors are similar, sweet up front, with a good spicy bitter finish. Very creamy and boozy.", "Очень необычное пиво, раскрывающееся в долгом и сложном карамельно-травяном послевкусии. Довольно питкое. Во вкусе и аромате присутствуют освежающие \"овощные\" нотки", "Beer pours very dark brown almost black, head is on the tan side. Beer tastes really good going down definitely recommend", "Pours a nice dark brown, almost black. Aromas of chocolate, with hints of nut and smoke. Flavor is a nice creamy chocolate with a bittersweet aftertaste. This is one hell of a beer.", "This is a pretty good beer. It’s got a nice medium body with a nice creamy mouth feel. You can taste the malts in the beer, but it balances out for a nice overall taste, and it is a beautifully nice red amber with a nice white head.", "Clear, intensely deep red colour with thick and creamy light brown head. Great aroma, plenty of malty sweetness, syrup, caramel and some toast. Pleasant taste, also has strong malty flavour, ends in a bit of hoppy bitterness. Mouthfeel is slick, oily, low in carbonation. Great tasting beer, very rich in flavour, highly enjoyable.", "355ml bottle. Reddish/brown colour. Minimal carbonation and head in my bottle (BB 02/07/16). Aroma of cocoa, syrup, caramel. Taste very sweet with light bitterness and umami? I think it is present here in the aftertaste. The flavour is excellent, I suspect though that the stated ingredients are not the only ones in this brew.", "Beer has a nice taste and aroma and the after taste is not that bad. Overall an okay beer but nothing special\n\n---Rated via Beer Buddy for iPhone", "From notes: Bottle from Alko. Thick malty body, a bit sweet, alcohol and caramel flavor. Not much hoppiness, just a lot of malts, alcohol. Strong and complex.", "BOTTLE 12 OZ. Clear ruby, beige head. The aroma is quite simple - caramel dominated, some malty and spicy notes. The taste is similar, with lots of caramel (but not at all sticky), a strong peppery bitterness with toasted bread notes. Just a touch of alcohol and a smooth easy drinking body. Nice, even though a bit too simple.", "Malt, karamell, sötma, humle. Mörk röd öl med ett smutsvitt skum som länge lämnar rester i glaset. Riktigt trevlig öl!\n\n---Rated via Beer Buddy for iPhone", "Clear caramel brown, greasy bubbly thin head. Nose is big smoked brown sugar and oddly floral malt. Initial taste is a straightforward latch of tinny molasses, soft pepper and frozen choc. Carbonation is a formality and mouthfeel is clingy. Finishes a cooling gulp of soft roast, caramel brownie and lingers a brazen spicy sweetness. \n\nNever really telling of the ABV but never really gripping enough. Amazed I’ve not rated it before now.", "Dark amber color with ruby hues, tan head. Aroma has sweet roasted malts, some dark fruits and a bit of booze. Taste starts sweet with caramel malt and cherries, a bit of roasted character and some hoppy bitterness on the finish. Medium body and carbonation, slightly boozy. Not bad but it’s a bit boozy for my taste and also the hops don’t really mix well with the sweet malts.", "A dark red full-bodied ale, with a solid malty caramel aroma, and a malt and spicy hop flavour. Somewhat pungent taste, with medium sweetness and bitterness. Overall, a beautiful, smooth and well-balanced ale.", "Aroma: Peanuts, Caramel & Hops\r\nAppearance: Dark Golden Red.\r\nTaste: Similar to the nose: Peanuts, Caramel, a Hops opening & Malt finish.. \r\nPalate: Minimal Carbonation, Silky Smooth.\r\nOverall: Excellent example. A robust introduction and a silky smooth finish.", "22 oz. draft at BW3. Medium dark reddish color, nice head. I could detect almost no aroma. Smooth taste, with a pleasant bitter finish. Good, but not great. Just not doing it for me...\r\n\r\nUpdate: 12/12/2017 - Either my tastes have changed, or something was awry with the draft I originally rated.   This a really good beer.  There is a nice, rich sweet roasted aroma.  Rich malty body, with that roasted caramel present again.  Very little bitterness,and a lot of yum.", "A pearler. Riding the veil between malt sweetness and just being way too sweet. Rich caramel nose with an initial sweetness rounded off my richness and gentle hops. Finishes with beautiful syrup notes. Awesomness!", "DATE: April 15, 2016... OCCASION: a LONG week PARCC testing ends with a good beer to recharge me... GLASSWARE: Brew at the Zoo pint... APPEARANCE: dark velvet body holds a single-finger near-brown head that is creamy and resilient... lacing is spread in smears... love the half-finger head that remains throughout the drinking... AROMA: nice peat, smoke and leathery earthiness, combined with pear, raisin, cinnamon and ... PALATE: dry, bourbon-like draw with a subtly BIG, chewy strength... long, lingering finish... warming and surprisingly crunchy, suggesting hoppiness... TASTE: I just told my wife that this beer is \"sinfully good\"... and that is no lie, with its scotch approximation that brings raisin, grapes, peat and subtle smoke... a rich, complex,., sippable beer that is the pleasant accompaniment to an actual scotch... OVERALL: a fantastic, big, slowly draining beer that resonates with a malt-heavy finish...two bottles in, and the effects are staggering... strong, solid and another feather in Founders’ cap...", "From 19 Mar 2016 -- just awesome malty goodness. The kind of beer you can sit down, relax, sip, and unwind to.", "Look: dark red, clear, with stable beige head.\r\n\r\nAroma: malt, toffee, caramel, light smoky and turf notes.\r\nTaste: moderate sweetness balanced with spicy bitterness.\r\nFlavour: rum, caramel, baked pumpkin with caramel and warming spices.\r\nFinish is less sweet and more bitter and spicy.\r\n\r\nVery good.", "Pours dark brown with light brown head. Aroma is light metallic, caramel, some candies, light grass. Taste is caramel, sourish, strong metal, copper, heavy grass, some ether. Quite nice refreshment, but some grass or medicine taste will leave you in the end. Otherwise, nice beer!", "Draught at NYC Craft beer festival\r\nbrown, off white head.\r\naroma of caramel, \r\ntaste sweet, bitter round feel. Slightly caramel.\r\nnice", "Poured from a bottle. Pours a deep mahogany brown with a thin off white ring. Aroma of toffee and light malts. Flavor is very Blah. Some woody, earthy notes but not much else? Very disappointing.", "Bottle to chalice. Dark reddish amber pour, medium brown head . Caramel, alcohol, roasty, smoked aroma. Sweet burnt caramel, alcohol flavor. Medium-slick body. Sweet - burnt aftertaste.", "Its pretty scotchy. Some traces of doughy barnyard basement aromas soaked in cooked vegetables and resin.", "12oz bottle from The Real Ale Company. Dark orange brown, beige head. Sweet grain malt aroma. Sweet bovril flavour. Sickly sweet malty aftertaste. Not my sort of beer.", "Superbe robe rousse, mousse crémeuse peu abondante. Nez puissant et complexe sur des notes fumées, épicées, lardées sur un fond de malt torréfié et de café au lait. Bouche à l’attaque fraîche, droite, nette, une très belle ampleur, de l’équilibre, une grande longueur et une finale sur une fine amertume. Une très belle bière équilibrée.", "From 12oz bottle to snifter. Pour is a dark amber color, thick tan head. Nose is huge roasted malt, caramel, light booze. Taste is medium-heavy bodied, sweet with touches of sourness as well. Finishes strong on the palate. Nice beer, love the complexity here.", "Pour is dark reddish amber, small tan head. Aroma of caramel, brown sugar, cherry, roasted nuts, spices. Very well balanced and rich yet refreshing. Sweet overall with good hop bitterness to balance. Fruity and malty with slight smoke and peat. Average carb. and med. to full body. Recommended.", "not my personal favorite. strong alcohol taste, caramel aroma. light carbonation. average overall", "Poured bottle into Teku. Dark brownish red with beige head. Aroma: butterscotch, cough drop, licorice, raisin. Flavor: medium sweetness, lightly bitter, like it. Overall good scotch.", "355 ml bottle from our lovely monopoly. Pours hazy brown to dark amber with a tight small off-white head. Roasted caramel malty aroma with a distinct hops note, bit of wood notes. Fruity, light metallic, roasted caramel and prune flavoured. Balanced and tasty in all aspects.", "355ml bottle at home. Dark brown, very small beige head. Aroma is roasted caramel malts, brown sugar... small bit of alcohol but its not disturbing. Full bodied. Taste is medium to heavy sweetness, light to medium bitterness.", "A- pours a translucent ruddy amber with a loose khaki head hat thins quickly. No lacing. S- pungent caramel malts, toffee, peat, apple cider, blueberry juice, bubble gum, wet grass and sour wood. M- medium bitter and tacky body with low carb. T- lots of twigs, brown apples and caramel malts. Sharp grasses, soap and saccharine sugars. Wood and liquid smoke. Lots of zinc, lemon lime, and soda water.", "Bottle@Salling, Aarhus. Pours dark brown with a beige head. Aroma and taste is sweet malts, caramel, toffee, brown sugar, dried fruits and nuts, some spices. Medium body. Soft carbonation. Nice mouthfeel. Good light bitter finish.", "Clear dark amber color with big medium beige head. Aroma is malt, dark fruits. Flavor is malt, roasted.", "Bottle. Pours dark ruby with large beige head. Aroma is burnt caramel, wood, butterscotch and malts. Taste is sweet, burnt malts, char, popcorn, alcohol.", "8.5%ABV. Scotch Ale.\r\n\r\nPoured out dark brown amber. 18° SRM.\r\n\r\nNose. Roasted nuts and caramel. There are also aromas of port, flan, brandied cherries, rum raisin, Christmas cake or rum cake. There is also a rich and very pleasant spiciness to the nose with nutmeg and cinnamon. \r\n\r\nPalate is highly complex with sweet flavors of molasses, brown sugar, maple syrup, manuka honey predominating. There is a nice hop balance to this monster with flavors that are spicy representing Thai basil, cilantro and parsley. \r\n\r\nOverall, this one came onto the palate very much like Mike Myers’ character, brash, obvious, pushy, a little smelly and breathtakingly crude, but dig a little deeper and you find that it’s all just a cover for some very fine, genteel and almost painfully subtle sensory experiences. \r\n\r\nI loved this one so much I almost \"feel a turtle head pokin’ out!\"\r\n\r\nGoes on Favorites List!", "caramel sweetness with a bit of dry hops and alcohol. I was expecting something different. Maybe my nose is clogged up, but this beer isn’t really giving me anything too pleasant. Basic scotch ale with out anything special and a bit too heavy alcohol presence. (or maybe it’s just my faulty nose today).", "Aroma of sweer malt, caramel and bread. Nice aroma. Taste is not very complex and its dominated by alcohol. A nice bitter ending.", "Sweet, bread-like, with a little bitter at the end. I didn’t like it that much at first but the second time around was waaay better! The bitter finish seemed not so bitter and I evened the flavors much more.", "Bottle. Pours dark amber thin tan head. Aroma of biscuit malt and caramel, bread. Medium-heavy sweetness. Medium body, somewhat metallic taste in finish. Good overall.", "Dark reddish-brown with a big tan head, aromas of lightly burnt toffee, a hint of smoke and a touch of yeast. Rich and initially sweet, with a syrupy texture, then a dry bitterness cuts in, along with a toasty edge. Mid-body and finish are still sweet but with the alcohol and bitterness cutting away the cloying edge. More balanced than one might expect!", "0,33 bottle. Pours hazy copper color with small off white head. Aroma of cherries, smoke, carameland roasted malts. Sweet in taste. Medium To full body and medium carbonation.", "Strong sweet malty aroma. Brown and clear with a fine brown-white head. High sweetness and light-medium bitterness. Average soft carbonation. Medium-full body. Fine ale!", "Dark brown color with tan head. Strong and sweet caramel aroma with toffee and alcohol. Taste has malts, herbs, raisins, toffee and alcohol. Full mouthfeel. Average carbonation. Well done and well balanced beer!", "Bottle. Murky copper color, tan head. Chocolaty aroma. Resiny, syrupy flavor with medicinal alcohol and chocolaty notes. Very full body, medium carbonation. Not bad.", "Pours very dark brown, with ample tan head. Aroma of malts. Taste is rich and malty, not too sweet. A good solid scotch ale, thumbs up.", "Bottle. Strangely, I’ve never rated this til now... and it’s even stranger given that the BA version of this is one of my favorite annual treats. Anyhow, deep Amber-brownish pour, medium tan head. Nose is malty, candy sugar, maple, toffee, butterscotch, tobacco, fragrant wood. Mouth is medium bodied, sweetness giving over to bitterness and then to toasted oakiness, caramel, nutty, pumpernickel, raisins. Tasty brew. Sláinte.", "Dark ruby color with light brown head. Aroma is caramel, vanilla and sweet malts. Taste is alcohol, dark fruits and toffee. Medium-full body, semi sweet and slightly bitter finish. Interesting beer.", "Delicious Scotch ale. Looks great in a glass with a nice head that laces beautifully. Has a nice punch with ABV 8.5 yet easy to drink with a nice bit of sweet smoke flavor.", "Bottle. Pours with plenty of short lasting head. Quite boozy with malty caramel toffee. Too much alchohol for my liking", "Earthy and complex. Old world laid down fruits, dark caramel and prunes. A wonderful experience.", "Caramel, roasty, alcohol, notes of chocolate, dark brown with red reflections, minimal and not persistant head, taste of tofee, dark fruits, medium sweetness bitter final with alcohol and warming sensation, medium body, oily feel, soft carbonation...i want to taste another example of this style..maybe skull splitter..but good, i really appreciate.", "Amber / brown color, hazy liquid and small head.\nAroma of caramel and old wood.\nTaste is sweet and bitter.", "Taste in glass from hand pump with almonds. Slight tan head. Dark Amber. No real aroma to me. Smooth tasting\n\n---Rated via Beer Buddy for iPhone", "12 Fl. Oz. Poured reddish brown, with a light brown head and some spotty lacing on the glass. Aroma of smoke, alcohol and caramel. Taste of dark fruit, malts, booze and caramel. Enjoyable, interesting, quite good.", "Bottle 0,355. Dark ruby with a thick tan foam. Malty with aroma of raisin, toffe and wood. Medium full body with taste of caramel, chocolate and prune. Real delight!", "35cl bottle. Clear dark ruby pour with a very small tan lacing. Smells of caramel and bourbon. Super smooth mouthfeel. Tastes like bourbon, caramel, toffee, very well balanced. An excellent scotch ale.", "There’s just something about good Scotch ales...the caramelly toffee flavor, the smooth maltyness that fills your mouth, and the smokey, alcohol-tinged finish. This is definitely a good Scotch ale.", "Massive and lingering light brown head under a extremely dark Amber body. Slick and smooth but not thick. Sweet with some alcohol bite at the end.", "I don’t have too much experience with this style, but I recently enjoyed a few glasses of Orkney Skull Splitter on tap at the Foundry, and found that authentically Scottish Heavy Ale to be much preferable to this one. Poured a bottle of Dirty into a tall thin tulip and got some head. Reddish brown in color and smelling of darker malts, I drank it too cold at first and it was good, but lacking character, so I let it warm up for a while, and as it did, it fell apart into disparate components. It certainly is a complex mix of flavors, which aren’t Scottish and don’t really work well together. Pretty reminiscent of Lagunitas Brown Shugga with a bunch of extra things thrown in, smokiness, hoppiness, bitterness, molasses-ness, dark fruitiness and so on.", "Bottle from Utobeer, London - UK. Color: deep dark brown beer with no carbonation and small brown head. Smell: roasted malt and caramel malt. Toffee, sweet domination, brown sugar. Small alcohol finish. Taste: full body with caramel and roasted caramel malt. Toffee domination. Alcohol taste. Boozy beer... Aftertaste: astringent alcohol taste with peat notes. Caramel and roasted malt. Very nice!"]}