{"reviews": ["Imperial red ale de 11 % abv, dont on voudrait connaître le niveau ebu, \nplutôt que l'immense blabla ou baratin sur…", "650ml bottle split. Pours light murky orange brown with a beige top. Aroma: sweet malts, caramel, orange peel & pith, dried fruits, bourbon barrel, boozy. Taste: moderate sweet & bitter, dry, caramel, toffee, orange citrus, prunes, dates, dried fruits. Boozy bourbon barrel oaky finish. Medium bodied with average carbonation. Definitely a sipper", "A one finger pour from an end-of-the-keg offering at Aces & Ales on Tenaya in LV. 2009 vintage we were told, oh my. Thanks, we will be back. A clear amber in color,  much the appearance of whiskey as a beer. Boozy smell. A cocktail taste, grain, light syrup, boozy taste too. Swell.", "2016\nPours slightly hazy copper, cream head, firm and creamy, excellent lacing. Aroma of caramel, dried fruits, marmalade, pine. Tastes bitter and sweet, well balances. The malty side is thick, caramel, nutty, creamy, hops add citrus, bitterness, licorice. Lovely dried fruity notes to linger for a long and dry finish. Full bodied, very smooth, evilish hidden booze. A great classic ale!", "Really the embodiment of the style. Strong and boozy, hoppy and bitter, yet remains balanced unlike 99% of these kinds of beers. Stone Berlin", "65 cl. bottle, bought at The Situation some years ago. Served at home in a snifter glass. Pours a hazy brown colour, small head with short retention. No lacing.\n Boozy aroma, caramel, dried fruits,licorice, molasses, hops, pine, some citrus.\nMedium to full body, creamy texture, no carbonation. Dry sweet and hoppy finish,\nTaste of caramel, licorice, molasses, chocolate, hops, citrus.\nA beast of a beer.", "A 22 fl. oz. bomber, bottled on 15th October 2015. Poured into a snifter glass. It was a cloudy murky rusty orange brown colour with a thin orangey beige head that disappeared quickly while leaving some nice spotty lacing. Aromas of sweet malt, citrusy orange peel, citrus pith, caramel, orange hard candy, bourbon and dark dried fruit like raisins. Tastes of sweet malt, caramel, toffee, light bitterness, grapefruit peel, citrus pith, dried dark fruit, bourbon, piney hops and some light spice. Full bodied with soft carbonation and a touch boozy. Overall a good balance between sweet, bitter and spice. While not overly boozy, it is a sipper, and a nice one at that.", "Cloudy ruddy brown with tiny white head. Black treacle aroma. Full body, sticky, gentle fine carbonation. Taste starts with black treacle, dark toffee, raisins, port the some bitter notes develop, in part hops and in part burnt sugar. Good", "2015 vintage. 10.5% ABV. On tap at the Stone Brewing Taproom, Berlin on 25-May-2019.  Clear amber in colour with a small off-white head. Aroma of dark fruit, citrus and pine. Full body and soft carbonation. Taste of sweet malt, caramel, dark fruit and floral hops. A healthy hop addition masks the sweetness well. Medium bitterness. Excellent.", "On tap at Stone Brewing Tap Room - Prenzlauer Berg, 27.3.19. 10.5%abv., 2015. Dark brown with a white head. Nutty aroma with some alcohol and caramel, sweet, deep caramel, nutty and alcoholic taste. Full body, nutty and bitter finish.", "Did drink this beer in 2015 from the local supermarket. It is a good beerbut unlike the normal bastard, it is not a special beer (at least for me) If the bottles were not so expensive, I would probably retry but there are so many beers I want to try or retry", "Tasted this at Six Degrees North, Glasgow on the 1st February 2019. Keg dispense, 1/3 pint sampled. Clear garnet in colour with a thin pale buff head. Strong malty aroma with raw Bourbon alcohol burning on the nose. Thin oily mouthfeel and poor lacing. Mixed malt provides Christmas pudding base with sweet caramel, syrupy stewed prunes and dates with notes of blood orange. Difficult to detect powerful hop resins but light orange citrus flavour imparts short bitter intensity. Finish is malty with dry Bourbon burn from the lengthy booze notes, hints of vanilla oak cask and massive prune fruit still driving through. Lethal and proud of it.", "contra pressuss heinar pols erlös polaris andar wiking polster westus klarissis", "02-01-19 // 2015 version on tap at Stone Brewing Tap Room\n\nGlowing dark amber. Heavy bitter. Strong malty body. Different. Real bastard. Like it.", "Color granate oscuro, casi marrón, translúcida. Espuma beige oscuro, amarillenta, de buena retención. Aroma a cereales tostados, madera, licor, caramelo, resina. Complejísima. Sabor igual, más cereales tostados, caramelo y resina que en aroma. Espectacular. Textura casi oleosa. Carbonatación media.", "Flaska 650 ml (buteljerad 15 okt 2016). Klar kopparfärgad med ett smutsvitt skum. Dofter av torkad frukt, läder, karamell och malt. Smakinslag av torkad frukt, karamell, spritinlagda fikon, läder och trä. I smaken döljs alkoholen otroligt väl. Fyllig kropp.", "Color marrón rojizo. Dos dedos de espuma amarillenta con excelente retención. Aroma a pino, malta y resina. Gusto muy potente en tosodos los aspectos, a malta tostada, malta caramelo, pino, abeto, resina y madera, alcohólica en boca. Cuerpo medio. Un trallazo de cerveza, arisca, peligrosa y compleja desde el primer trago, fuera de serie.", "Color marrón rojizo oscuro con espuma baja beige de buena retención y abundante residuo. Aroma a caramelo, frutos secos y malta de todo tipo. Sabor muy intenso a malta quemada, malta caramelizada, madera, bourbon y fuerte amargor terroso con notas resinosas. Regusto largo amargo terroso y a caramelo. Textura cremosa, cuerpo denso y carbonatación muy baja. Si la Arrogant Bastard ya era bruta, esta se lleva la palma, una brutalidad de sabor maltoso con toques de licor, madera y bourbon completamente espectacular.", "Big bottle shared with my brother. Pours dark brown with a fine head. Aroma is very malty with loads of bourbon. Underlying complexity with prunes, dark berries and licorice. Huge body, thick mouthfeel. Flavour profile is complex, boozy and malty. Very rich, intense malt, lot of Bourbon. Heavy but lovely.", "(robe superbe, nez > malt-alcool-hop-bois-miel-épice puissant, charnue, glissante-amère, last végéto-florale)", "Gezapft im Stone in Berlin-Mariendorf. 2013 Version. Dunkles Orange, etwas Schaum. Aroma: Malzig, Rosinen, Leder, Karamell. Geschmack: Schwere Süße, Vanille, Rosinen, dunkle Beeren (leicht), Honig. Volles Mundgefühl. Lange Bitterkeit.", "Draft at beertemple. Aroma of malt, resinous hop, caramel and raisin. Taste has dry raisin, resinous hop, bitter caramelised malt, pine and caramel. Good.", "Brun- mot bärnstensfärgad öl med ett mörkbeige skum. Doft av malt, bitter citrus marmelad och kåda. I smaken tillkommer fattoner. Något obalanserad för högre betyg.", "2 finger beige head.\r\nClear, deep ruby to light mahogany coloured beer.\n\r\n\nAroma is butterscotch, figs, dried dates, leather, slightly metallic, blackcurrant and slight dark chocolate.\n\r\n\nTaste is burnt liquorice, figs, leather, slight red berries, slight butterscotch and charred wood.\n\r\n\nMouthfeel is smooth & soothing. Medium body. Medium bitterness. Medium-low, soft carbonation. Sticky and semi-oily body.\n\r\n\nOverall: Really good Strong Ale. Has a very \"red\" ale feeling about it, with the metallic & caramel notes but I like a lot in this. Delicious and pretty drinkable despite the ABV.", "Flaska Systembolaget. Bärnstensfärgad.  Doft av tall, citrus och marmelad. Tjock humlig smak med tyngd i malten. Citruszest, tall, kåda och spannmål", "Flaska beställd från SB mörkt brunröd med ljusbrunt skum. Tung,söt doft med aprikos och karamell. Samma smaker med värmande alkohol.", "11/20 much to admire, but not that enjoyable. Ultra bitter, very caramel and boozy. It's a beast - a bit too hardcore for me", "Husté, velmi dobré, plné, řízné, hořké, alkoholové. Tomu se říká skvěle udělané pivo od Stone.. :)", "65cl bottle from 2016. dark amber colour. small white head.\r\nSweet malts, caramel, honey, a hint of alcohol, floral notes.\r\nMedium bitteness, low/medium carbonation.", "Aroma is quite sweet, honey, candy, peppermint candycane, and grandma's assortment. Feels good on the palate; good mix of sweetness, spicyness, and bitterness. Taste is spicy, dark bread, and black pepper.", "On tap at Fakin Zagreb. Dark golden/amber coloured, small to medium sized off-white head, dried fruits and caramel in the nose. Heavy sweet malty, caramel, notes of marzipan and quite noticable alcohol with light herbal bitter finish with again notes of alcohol.", "0.3l draught. Cloudy amber red color with white head. Aroma of cough syrup, caramel, malt, honey and floral aroma. Taste is sweet and bitter with alcohol present in taste, but not overwhelming.", "On tap at Fakin bar, Zagreb. Amber color with medium brownish head. Fruity and malt aroma with floral notes. Light bitter floral taste.", "Tap at Fakin, Zagreb. Misty red-amber body, tan head if I remember correctly. Boozy barleywineish malty aroma, choco-caramel, light marzipan, alcohol. Malt-driven dry candish malty taste - quite lovely - edged by some alcohol but also by a nicely distinct hoppy bitterness, very well integrated and a perfect counterpoint to the malt assault. I was never impressed by the regular Arrogant Bastard (there, I said it), somewhat wimpy for all its bluster when I've had it, but its big brother is definitely an excellent beer.", "On tap at Fakin Craft Bar, Zagreb. Shared with Peh. Deep amber, medium off-white head. Malty, biscuit, fruit jam, berries. Thick, sticky. Strong. Alcohol hidden. Sweet. Medium to full body. Low hops but present in the finish.", "Cloudy amber. Full body, smooth texture, very flavorful, hot mouthfeel, lingering aftertaste, flavorful , bitter finish. Bitter, moderately sweet, crisp, good balance. Coffee, caramel, maple, hoppy, blackberries, herbal, milk. Delicious. ---Rated via Beer Buddy for iPhone", "Opaque amber in color with minimal head from the tap. Smell is molasses. Taste has some good caramel flavors. Slightly syrupy in taste, but not feel. Astringent alcohol all the way through. The bitterness from the healthy dosing of hops is welcome, but gets a little comingled with the alcoholic bite that didn't feel well-covered.", "(tap 0,3l @ OP (Brno))\r\n\nAroma: Sweet, malty, melanoiden.\r\n\nAppearance: Dark amber-red. Medium, beige head.\r\n\nTaste: Medium sweet, malty, fruity, light spicy, light alcohol.\r\n\nPalate: Medium-full body. Warm, light bitter finish.\r\n\nOverall: Good warmer.", "no nie jestem masochistą, będę się wedle zaleceń trzymał z daleka od tego piwa. słodowy potwór, ani do jedzenia, ani do picia, w rzeczy samej gorszy brat pojedynczego aroganta, trochę parodia mocnego piwa kraftowego, wierzę że zamierzona.", "2015er version, many thanks to Werckmeister for organising this bottle! Smooth mild floral intense beginning. Fruity, warming and malty grainy. Pine, malt, warming floral. Round and fresh, smooth, sticky but still sessionable! Great stuff!", "2015 Bottle at home, shared with the Beast, 13th January 18. Pours dark mahogany brown, not much head. Aroma is cararmel, dark fruit and malt. Taste is complex, bitter and sweet, loads of malt, caramel and older hops, giving some great bitterness still. Reminded us both of Brewdog Hardcore a little, with more malt. Not overly sweet and a great beer, that drank below the 11.0 ABV.", "Dress garnet speckled by yeast, clear tobacco of East foam. Aromas of roasted malt, caramel and the litany of US hops in all their magnificence. Powerful taste, doesn't exactly have a gentle touch, bitter size above XXL. There is burnt, astringency, cough syrup, candied fruits, overdosed alcohol, pharmaceutical fluid. A little too much, you sait arrogant ..", "Pours a deep, dark amber coloration with a large, creamy head. Smells of caramel malt, toffee, red berries citrus and pine. Taste follows the nose, with a caramel, biscuity malt backbone and some toffee, chocolate and red berries, complemented by hoppy notes of citrus and pine. This really is an Imperial Arrogant Bastard, which really piles on the malt, without losing much of the hops. Depth of flavor seems more intense compared to normal AB, especially when it comes to the malt presence and fruitiness. Hop profile seems a little more mellow, although there still is considerate piney bitterness (this may be due to the 26 months old bottle). The higher ABV is noticeable as a slight, warming presence, but there really is no unpleasant boozyness to this at all. What really needs to be highlighted compared to normal AB is the thick, smooth mouthfeel, which is absolutely sublime.", "2009 vintage, tap at Stone Berlin. Pours clear, deep amber with a small, beige head. A little bit of cardboard, loads of caramel. Still sticky and resinous. Well aged and well hidden ABV.", "AROMA - burnt caramel and malt\r\nAPPEARANCE - solid mahogany with lacing. \r\nTASTE - burnt caramel, toffee, marshmallow, nut, plum, roasted malt, hops, spice, oats. \r\nPALATE - big and bold, boozy in back. \r\nOVERALL - I would buy again", "Amerykańska butelka 650 ml (11% ABV). Srogi bastard! Doskonały wygląd zewnętrzny butelki (cytat z biblii!), ale i znakomity wygląd piwa - biała piana, ciemnomiedziana barwa piwa, bardzo mętne. Wysycenie średnie. Bardzo pełne i treściwe piwo. Goryczka umiarkowanie wysoka, hardkorowo mocny woltaż.", "Tap at Stone Berlin - as 2009 Double Bastard - clear brown color, small white head. taste is caramell, cognac, full malt bomb, sweetish, bitter finish. a very nice sipper. well aged. like a fine spirit. beautiful. alcohol well hidden.", "From Mar 2008\r\n\r\nhis one pours a clear red with a 1 finger head of foam which shrinks during the session to a fine layer with lots of lacing.\r\n\r\nThe smell is very malty with lots of caramel. Nice. There's also a fairly faint, compared to the malt, nose of hops.\r\n\r\nThe taste has notes of caramel malt up front followed by some fruit(black cherry), and citrus and piney hops and a pretty big dose of alcohol.\r\nLots of warming during and after the swallow.\r\n\r\nThe more sips I take, the less I notice the alcohol and now I'm able to really start focusing on the flavours and man, it's so tasty and so well balanced that I don't want the bottle's contents to leave. *Very* nice sipping Strong Ale and with its creamy smooth mouthfeel and nicely done light carbonation, this is certainly a great brew worthy of its reputation. Highly recommended.", "3 liter Bottle at the Aaahhh...øl!!! Julebord 2016. Dark orange body with a small head. Aroma of raisin, ashes, orange. Taste is bitter, grassy, with tangerine, pulp, hay. Very on the grassy side, though an enjoyable beer.", "65 cl bottle, served in a snifter. Poured hazy amber with a light tan three finger head. Aroma: candy, overripe banana, pineapple, caramel. Taste: toffee, butterscotch, cotton candy, overripe banana, pineapple, raisins, ginger, vanilla, spices, christmas cake, raisin bread, roasted nuts, cloves. Thick and quite spicy mouthfeel. Medium to full body with a very nice more bitter than sweet finish. Also a lingering gingery spiciness in the long finish. Alcohol nicely hidden. Tastes like a barley wine, especially 'Bommen en Granaten' by 'De Molen' is almost identical to this. But a really fantastic brew on its own! Really enjoying this...", "Bottle, 650 ml, courtesy of Max. shared with him, Simon and JFK10000. Pours amber with medium off-white head. Fruity, hops, pine, citrus, caramel, bit nutty, bit warming, sweet, bitterness in finish. Medium to full bodied. Very nice, didin't expect it to be this good.", "On tap at Galbraith's. Pours red brown. Caramel, strawberry, brandy cherry, toffee, pepper, apple. Big body. Delicious.", "Soy un amante de la arrogant bastard,pero esta la encuentro algo dulce por el exceso de malta,lo que contradice un poco con el fuerte amargor de su hermana.", "Kolor ciemnobrunatny, opalizujący. W aromacie dużo karmelu, ciastek, toffi, suszonych śliwek. Piwo bardzo pełne. Słodkie, oblepiające, karmelowe. Goryczka wyraźna i nieco przeszkadzająca. Wyczuwalny alkohol", "650ml bottle. Pours a clear copper hue with a one finger with a beige head. On the nose, lots of barley wine like notes, resinous hops up front, heavy caramel malts, tropical fruit underneath, and a note that is almost like vanilla cake. Lighter bodied than expected, but sweet with some alcohol burn, resinous notes, sweet caramel malt, with mineral hopping that heads into bitterness over burnt sugar, a faint floral note, lots of eucalyptus, and the faintest hit of coffee. It definitely seems more barley wine than anything, but I have few complaints. BOOM to the taste buds!", "Un biere bruneâtre, aux reflets roux, avec peu de carbonatation et peu d’effervescence. Ca sent le sucre d’orge, le caramel, bref, c’est sucré et malté. En bouche, ca ressemble beaucoup à un vin d’orge à l’américaine, avec une certaine amertume poignante, ainsi qu’un goût assez malté, assez alcoolisé. L’alcool enlève peut-être un peu de complexité à la bière. Je l’aime pas autant que l’arrogant standard. Manque de profondeur.", "Version 2015 vom Fass im Stone Brewing Berlin 2016-11 getrunken. Ok bei dem schlagen die Bitternoten im Mund nicht gleich die Zähne aus wie ich es von dem einfachen Bastard kenne. Gut gemacht, aber mehr als paar kleine Schlückchen werden es hier lieber nicht.", "On tap at St Augustine’s in Vancouver. A medium amber beer with a bit of white head. Not much nose on this paddle sample. A bit of fruit and plenty of grainy malt. 3.4", "Bottled on 10/14/15. Served from 22oz bottle into glass at home. Pours deep amber red in color, medium high clarity, with a tan colored head. The head quickly diminishes to a a thin ring of bubbles on the glass. Legs visible when agitated. Assertive aroma, sweet caramel malt and lots of alcohol, resulting in a preserved fruit character. Some fruitiness that may be alcoholic esters or hops. Flavor is more malt with lots of alcohol and high hoppy bitterness. The body is full, almost chewy, medium low carbonation with a decidedly dry finish. Even with all the alcohol aroma and flavor there is little heat detectable at the finish. Overall this beer lacks the hop character expected, but that is most likely due to the age of the bottle. It comes off as an aggressively bitter American barleywine and really is an amped-up version of the original.", "Bottle. Pours with perfect head, some sedimentary particles floating in, I forgive. Quintessence of delicate, affordable caramel. Honey, delicate note of baltic porter, vanila, coconut, little alcohol. Mouth and palate: dense, oily, average carbonation, vulgar alcohol. Good, but not worthy these 50-sth zł. in Poland.", "W aromacie karmel ale tak jak w zwyklym bastardzie jest on baza calego piwa, jest fajny. Do tego sok z cytryny. Barwa ciemnobursztynowa, plywaja w nim nieapetyczne paprochy. Piana ladna, drobna, utrzymujaca sie. W smaku geste, jest tez karmelowe. Alkohol lekko wyczuwalny, lekko szczypie w przelyk. Goryczka konkretna, fajnie cytrusowa. Wysycenie srednie. Bardzo fajne piwo, nazwa bastard bardzo do niego pasuje.", "Draught at Bootleggers Craft Beer Bar. Clear, amber colour with a thin off-white head. Sweet aroma with caramel, fruits, grasses, rich greasy malts, citrus, roasted notes, ripe fruits, faint liquorice. Taste is bitter. Full body with an oily texture and a soft carbonation. Finishes lasting bitter with an aggressive hops bite. Big, fat vulgar - American. Maybe even outdated?", "26.05.2017, tap @ Apollon:\n\nNice light amber slightly fizzy-creamy mediumlasting head. Aroma is sweet concentrated grassy, sugar, sap, minerals, grass, caramel malts, leafs, hops, hay, alcohol, moss, citrus peel. Taste is sweet concentrated grassy, leafs, sap, sugar, wet grass, wet hops, minerals, hay, bark, alcohol, \"knekk\", citrus peel, moss. Longlasting bitterness, slightly dry and harsh grassy mouthfeel. Nice enough.", "Bottle at home in front of The Unbreakable Kimmy Schmidt. Pours a very attractive deep Red/Amber with a cream coloured head. Quite intense aroma of toffee with perhaps a little pine on the edges. Flavour is extremely in your face. Caramel and booze. First impression is sweet but thaat quickly subsides to bitter. The booze has an immediate warming effect on your chest. A huge beer with a lot going on. Very enjoyable.", "Big toffee blast on the nose. Caramel, dark fruit (plum; maybe a bit of figgy pudding too), and more toffee. Piney hops, roasted malts. Excellent sipper.", "600ml bottle served in a snifter glass. 2016 Edition. Enjoyed at \"Au Coin Mousse - Geneva\". Pours a dark and cloudy amber color forming a medium tan head with medium retention and some molasses lacings formed and left in the glass. Strong notes of caramel and oak in the nose. Dark dry fruits, honey, hazelnut, apricot and roasted malts. Grassy hops. Taste is slightly sweet in upfront, becoming quickly roasted and bitter. Strong notes of caramel, dark dry fruits, honey, nuts, roasted malts. String hops bitterness kick. Great bittersweet balance. Heavy body. Medium carbonation. Caramel and grassy hops in the aftertaste. Great drinkability. American classic.", "A nice complex beer, while strong is easily approachable. Notes of molasses, honey, cereal, raisin, fig compote, apricot, chocolate, hazelnut, coffee and baking spice. Nice and creamy on the palate a true example of one of the best craft brews out of the USA.", "Tap @ MBCC. The 2006 year. Clear copper. Herbs, caramel, malt body. Herbal with loads of caramel, some nuts. Nice structured body with long herbal finish.", "660ml bottle shared at home. Hazy dark orange with a medium white soapy head. Medium to full body with low to moderate carbonation. Quite some bitterness with subtle fruity sweetness. Pine, malts, caramel, citrus and tropical fruits. Very good.", "Bardzo, wręcz agresywnie nachmielone , bardzo słodowe, sporo karmelu, biszkoptowe, rodzynkowe, pomarańcze, żywica, kandyzowane owoce, dochodza lekkie nuty herbaciane, może ziołowe. Piwo bezkompromisowe i potężne.", "On keg at Hanging Bat (27/04/17). Pours clear deep amber red. Nose of madeira, molasses, toffee cake, raisins, cherries, parmaviolets. Taste is boozy, oak, resin, super hoppy, earthy notes, complex, long finish.", "Pours ruby red with medium head. Aroma: caramel aroma nicely counterbalanced with hops. Taste: caramel, dried fruit and lots of hops. Nice.", "Bottle (2016) - 22oz. Dark copper body with a thick, off-white frothy head. Robust, well-balanced, complex malty/hoppy aroma with cinnamon, fruity, maple syrup, and spicy hints. Alcool is subtle. Its robust malty/hoppy taste carries woody, barley sugar, and cinnamon notes. Ends with a long, strong, warming bittersweet finish. Fantastic winter warmer.", "Bottle. Pours a murky reddish brown with a thin foamy off white head. Aroma is of toffee, treacle, dark fruits, figs, raisins, blackcurrant, plum. Taste is of toffee, plum, currants, raisins, brown sugar, red berries, maple syrup. Sticky oily mouthfeel, medium carbonation.", "clear in the first glass, opalescent with a lot of sediment in the second one, mahogany colour, one inch dense yellowish head; aroma of intensive pine resin, caramel, biscuit notes, raisins soaked in liqueur and alcohol; bittersweet taste with tons of resiny hops, syrupy-caramel notes, raisins, maybe other dried fruits and slome spicy alcohol; great strong ale", "Bottle from LCBO. I remember my first original arrogant bastard. I was drinking with ratebeer scholar Helsdon -- hey man, we should grab a beer! -- at the Indie Ale House in the Junction & he was marvelling at how the beer was swallowing our taste buds, like a greedy black hole. (Every beer we sampled after this was damaged by the liver bile remnants of the bastard). This version adds to that deep, dark taste bud erosion experience. Big suckerpunch of sugared malts to the mouth, with a deep & rich cough syrup hop bitterness beneath the sweetness. The booze is sloppy & heavy & embarrassing, like a drunk step-mother falling down the stairs during a family get together. Hard to love this. Hard to ignore it. Try it once & try not to notice the cough syrup after reading my review.", "2014 bottle, 22oz; Dark grainy amber, minimal head; Got carried away with stuff so forgot to write this part; Fantastic brew, full of intrigue and surprise, charisma and character...all with an aged expression.", "bomber pours dark amber off white head aroma is booze and citrus taste is the same dry finish with a sweet malt flavor added", "Draught @ Fox & Hounds, Sønderborg. Pours slightly hazy ruby with airy but stable off-white head. Clear aroma of malt, fruit, hops and yeast, with booze in the long nose. Bitter flavour of hops and alcohol, with fruity an malty notes and touches of grass. Bitter, boozy and estery aftertaste. Bormally I am not fond of boozy bastards but this one is good :-)", "Pours a beautiful amber color with a boozy floral scent. Extremely hoppy and bitter on the palate at first, followed by a sweet malty aftertaste. \r\nDefinitely not for the novice beer drinker.", "Közepes, tartós hab, barna szín. Karamelles, gyümölcsös illat, picit fűszeres. Karamell, kandis cukor, aszalt gyümölcsök érezhetőek az ízében, némi fűszeres felhanggal. Erősen keserű, nagy testtel, közepes szénsavtartalommal. Intenzív ízvilágú sör, egy picit sok a karamell.", "As I’ve said before, one Bastard’s plenty enough for me. And while I do appreciate a few of the Double Bastard variations I’ve come across, I don’t have much love for the original DB. Just such a wildly aggressive beer, super sweet, monstrously bitter, boozy as all hell, an assault on the palate I’m not that happy to undertake again. (In fact, not sure why I’ve ended up with another bottle o’ Double Bastard, having sworn it off at least twice before. Fuck it. I’ll just blame Trump.) Anyway, the pour’s decent, the nose warns you of the massive malt-hop avalanche to come, but nothing really prepares you for that one-two punch of sweet toffee-caramel mixed with pure pinecone resin hops. Deep dark veins of brown sugar, maybe even a hint of white chocolate, followed by a little dried apricot, then on to the sweet, boozy, IBU-packed finish. I get why people dig this beer. I also understand why I don’t. Never trust a Bastard that comes in pairs.", "650ml bottle from LCBO. Pours a deep reddish-amber colour with one finger of head. Aromas of caramel and dark cherries. Taste matches the aroma with a IPA style dry and hoppy finish. Medium-bodied with moderate carbonation. High alcohol level is concealed well. Interesting brew. Recommended.", "Bottle 650ml @ home\n\r\nPours hazy deep amber with a beige head. Aroma has notes malt, caramel, dried fruits, alcohol, citrus, orange and pine. Taste is medium to heavy sweet and medium to heavy bitter with a long malty, caramel, orange, citrus and piney finish. Body is full, texture is oily, carbonation is soft.", "Couleur ambrée foncée; mousse beige; arômes et goût maltés et fruités; alcool bien présent; finale très amère\n\n---Rated via Beer Buddy for iPhone", "It pours murky ruby with crimson tinges; the head is tan and mousse-like. The aroma has notes of: grapefruit pith, fresh cut grass, pine resin, celery, toffee, alcohol, pepper, and licorice. The taste is lightly sweet that finishes fucking bitter.The palate is full bodied, and slightly sticky; the carbonation is medium; the finish is long and bitter. Overall, this beer is pretty dang American - insert edgy political humour.", "Bottled 10/12/16. Pours hazy, dark brown with a thick, fluffy beige head. Tons of fruits in the aroma (dates, figs, tangerines, & plums); some floral hops in the mix as well. Flavors arrive similarly with dark fruits leading; caramel & hops following behind. Actually finishes with an peppery, chalky bitterness along with booze. And that finish is the part where it falls off. It’s got that medicinal (Theraflu) bitterness. Aftertaste is harsh & uninviting, much like Arrogant Bastard. Warms up with less bitterness but also becomes much more astringent & solvent-like with booze. It ain’t a drain pour but certainly not the best in its price range either.", "Bottle from Elysium. Aroma: Nice caramel, dried fruits and American hops, very intensive and rich. Appearance: Brownish body with low head. Taste: Sweet and bitter, lots of caramel, dried fruit, hoppy notes, very high short biterness. Palate: Semi-dry finish, high body, low carbonation.", "I thought it will be better.. what I remember the most was the taste of alcohol.. I bought it for bitterness but I was disappointed", "650ml bottle from Elizabeth Station at Ilya’s. Bottled on 2016-10-13. Pours an opaque copper with a beige head. Aroma is dark fruits, candied citruses, sweet. Taste is the same. Moderate bitterness, low to moderaye sweetness. Hoppy and boozy bitterness aftertaste. Good stuff.", "Bomber. Delicious malty, hoppy aroma. Beautiful copper color, white head that lingers for a while. Little lacing, but understandable given alcohol content. Smooth hop flavor. Bitter aftertaste but pleasant. Full bodied. Overall a delicious beer, but strong.", "Hazy, deep amber to red colored, medium- beige creamy head, nice lasting. Aroma is of caramel, malt, dried fruits, some hard candy, orange, floral and citrus hops. Taste is medium+ sweet malt, caramel, orange hard candy, dried fruit, light chocolate, floral, citrus and fruity moderate notes, medium+ bitterness, dry finish. Medium to full bodied, soft carbonation, oily-sticky. Probably waited too long to get the most out of it but still very nice!\r\n(bottle, Bierhalle Deconinck, Vichte)", "Tap at brewery in Escondido. 2004 version.  Murky light mahogany with medium white head. Aroma is raisin, alcohol, and sweet feel. Sharp bite of sugar, alcohol, raisin, some tartness. Powerful beer with good complexity.", "Potężne i absorbujące. Nawet nie wiem czy to się przyjemnie pije, ale to piwo robi kolosalne wrażenie. Potęga słodowej bazy, potęga chmielowych aromatów i potęga monstrualnej goryczki. Zupełnie niezbalansowane ale w tym szaleństwie jest metoda - z chęcią skosztowałbym jakiegoś barrel aged’a :)", "Huge malty beer with the hops to back it up. Pine and pepper with malt no roast but a tad breads and toast. Great rich mouthfeel and an everlasting malty finish.", "Brown colour, off white head. Aroma of malts, caramel, nuts, booze, berries. Taste is medium sweet, light to medium bitter. Medium body, creamy texture, soft to acerage carbonation. A bit boozy. Celebrating quiting my job today.", "Botella . @Señor Lúpulo. Despacho de cervezas, Frikicata Gijón 24/01/2015. Color", "Medium dark amber. Massive caramel, grapefruit, candied apples, cherries, mildly sweet. Big fully body tons of hops and tons of malt with great caramel malt backbone. Smooth. Alcohol well hidden. Perfectly balanced and perfect American strong ale. Good bitter finish.", "Bottle @ \"Frikicata Cervezorama\", Sr. Lúpulo, Gijón. 24-01-2015.\n\r\n66cl bottle. 2014.\n\r\nPours hazy amber with nice off white head. Short head retention, some lacing. Malty, caramel, liquor notes. Medium body, soft carbonation, oily texture. Taste is malty, liquor, caramel, fruity. Alcohol noticed, some sweet notes. Very robust, boozy punch. A bit unbalanced,", "Fresh from the tap at Stone Berlin. Dark copper with a imposant white foam head. Great body. Subtile bitterness.", "Tap at Pizza Luce. Deep orange with white head. Caramel, alcohol, orange pulp, grapefruit and pine sap. Medium caramel sweetness quickly overcome with a resiny, citrus bitterness. Medium body with a soapy feel.", "From a 500 ml caged and corked bottle it is a clear Amber color with a slight head the aroma is bourbon and the taste is sweet bourbon flavor with a strong boozey finish", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "Look: clear copper with unstable white head.\r\n\r\nAroma: sweet, malt, light spicy alcohol notes, barberry candies.\r\nTaste: moderate to strong sweetness balanced with strong hoppy bitterness.\r\nFlavour: malt, berries, red currant jam. \r\nHop profile: woody, grassy, earthy.\r\n\r\nVery good.", "The aroma of yeast and raisins. The taste is alcohol, yeast, raisins and honey. Very bitter aftertaste that fills the upper part of the mouth for a long time. It gets better when it gets warmer. Follow me @ Kung av öl @ Facebook for more pictures and ratings.", "Bottle \r\nRed brown, off white head \r\nAroma of caramel and honey \r\nTaste sweet, nice round. Alcoholic raisin.", "Bottle. Pours red with cream head. Aroma has notes of caramel, alcohol and grains. very dry and sweet.", "Fantastic in every way! The color is absolutely brilliant as is aroma and taste. I can’t find anything to not like with this one!", "Pours a dark ruby/red color with lots of sediments floating around and medium tan head with long duration. Aroma has caramel, toffee, resin, citrus and pine. Taste follows the aroma, toffee, caramel, citrus, resin, pine drops, bread and spices. Alcohol is really well hidden. Intense bitterness in the aftertaste. Really nice brew!", "medium aroma – fermented fruits, rum, flowers, a bit of malt, some cereals, belgian yeasts.\r\nstrong taste – spicy, fermented fruits with a lot of alcohol, rum, hop’s bitterness, green herbs, belgian yeasts. good beer!", "BOBMER shared. Rich malty caramel and bread, fruity, smooth spicy alcohol. Big malts, lots of spicy hops, as well as spicy booze. Very good.", "Dark amber, clear (hop haze on the bottom of the bottle), small head. Sweet candy in the aroma. More candies in the taste along with good long lasting hoppy bitterness.", "This beer is one of my friends favorite beers from one of his favorite breweries. I can see why, we are taking a minute to remember his life with a 2007 bottle. Chocolate, toffee, burnt sugars, and fruity alcohols. This is a style that will always remind me of him. Cheers my friend, may you rest in peace.", "22oz bottle. Clear copper with a foamy tan head. Flavors are caramel, resinous hops, earth and alcohol with fruity and grassy notes. Medium to full body, moderate carbonation, oily texture.", "Light amber pour with off-white head. Big spruce and citrus aroma as head falls. Hop bitterness is high, but balances well with caramel malt. Impression was almost like bitter lemon curd. Mouthfeel was slick initially, and the medium body lightened by average carbonation. Alcohol taste is not apparent, despite high ABV. Strong bitterness in finish and tongue dries out slowly between sips. Not a hop head myself, but had to try this one out! Recommend sharing this one, unless, of course, you like to burn out on American hops!", "Tap@Taphouse, Copenhagen (Stone TTO 27/11/2016) - dark amber brown coloured pour with beige head. Medium sweet malty aroma and taste, toasty, caramel, toffee, brown sugar, dried fruity and nutty, some spices on the palate, medium sweet bitter finish", "Sampled from tap at Stone Garden Berlin. Hazy amber color with medium eggshell head. Aroma is toffee, pine, doesn’t smell that old! Taste is toffee, oxidized (but in the nice way), spruce, resinous. Oily mouthfeel, fine-bubbled low carbonation. Held up way better than expected. Nice stuff!", "Tap at Taphouse. 63 taps stone tap takeover. Clear brown smooth brown head. Mild malty aroma. Slightly like walnuts. Flavor is strong and very complex with layers of notes like malts nuts fruits and a good bitterness to balance. Lovely flavor.", "Exorbitant schwer und wollüstig fassograndig. American Strong Ale der Extraklasse. So sollte DAS Kaminbier munden. 2005er Vintage Tap Edition vom Hahn in der STONE BREWERY BERLIN. 0,15/3,30€.2016er:  9/4/10/5/19 Kratziger KaramelRotfruchtGott mit Alphasäurewiderhaken. Kantig,garstig,Outstanding. Citrusfresh. ??? Vintage 2006er : 8/4/9/5/19 Kellermuffler mit abgeschlagenen Kanten. A Vintage ASE Masterpiece mit Dezentoansatz, wenn man das so sagen darf ??  MCBC 2017...Vintage 2015: Fassware. Stone Berlin.... 8/5/9/5/19 Rot, hoppy, phenolkratzig und immer hart boozey. HardRinder mit IRIPA HEADNUTAPPEAL ??? AGAIN: VINTAGE 2010. Tap Stuff. 8/4/9/5/19 Grey, smokey & freakfunky💥...STONE Berlin.", "11 % abv. Bottle. Bronze color, creamy foam. Malty aroma: dried fruit, raisins, figs, caramel and port wine. Taste: malt, candy, fruit, candy, raisins and candied fruit, sweet, good hop bitterness.", "BOTTLE. 2015 (BO10/23/15). Clean amber pour with thick creamy head.. Thick sappy musky resiny nose, Anzac biscuit as well??.. Big malt base, biscuit, caramel/treacle, long sappy hop bitter bite that lingers.. ABV is definitely there Sourced Cellarbrations @ Capel", "Vintage 2015; Pours Orange like copper, slightly clear, but still muddy with yeasts, and stable, off-white yellowish foamy head wtih spotty lace. Aroma: intense hop and malt aroma, pretty well balanced together: malts takes on white bread, toffee. caramel, some hazelnuts, hop aroma takes on citruses, pine, florals...Flavor: very similar to aroma: very malty flavor, with intense caramel, toffee, bread like note, with hint of hazelnuts, candy sugar, supported with huge hop flavor, which takes on fruits mentioned above. Finish is slighty dry, almost sticky, very bitter, bitterness lingers long in aftertaste. Body is medium to full, texture is super smooth, almost creamy, carbonation is medium. Alcohol warmth is noticeable, oaky boozy. Amphibian betwen Barley wine and imperial ipa.", "Bärnstensfärgad åt det röda hållet. Fyllig och tät öl. Sirap och toffee, men spritigheten slår igenom vilket jag inte gillar.\n\n---Rated via Beer Buddy for iPhone", "Sample from a bottle. Hazy dark amber colour with an off-white head. Aroma and flavour of malt, alcohol, hops, spice, dried fruit, caramel and oak.", "Pours a cloudy reddish Amber with a smooth silky head. Aroma is malty. Very malty. Taste is malty and syrupy to the extreme up front and equally bitter on the back end. Smooth like a milkshake. Refined and raw power at the same time. I can't believe I haven't rated this before. \n\n---Rated via Beer Buddy for iPhone", "Bottle 650ml (2015). Served at cellar temperature. Pours a hazy copper. Head is beige; average sized and lasts wonderfully in the glass. Aroma is sweet and hoppy with notes of pine needles, hop resins, overripe nectarines, overripe apricots, sultana’s, lightly toasted malts, sticky caramel, hints of vinous alcohol and a touch of chocolate. Flavour is a strong resinous/grassy hop bitterness with lightly toasted malts, cooked toffee, overripe stone fruits (nectarines/apricots), orange rinds, raisins, spruce, bourbon (light) and strong rusty/resinous notes in the finish notes. Full bodied with light carbonation, an oily texture and a good length finish.", "0,65 l bottle from Biervana Munich \r\nDark Amber, clear, frothy tan-light brown foam head, caramel, bread, cereal, roasty, alcohol, woody, spruce, citrus, heavy cloying sweetness, very bitter, full body, thick feel, sticky, oily feel, soft carbonation, long finish,", "Medium sized tan head. Cloudy reddish amber body. Aroma is surprisingly light considering this is an 11% beer. Fruity on the nose. Very malty flavour, hoppy aftertaste. Quite alcoholic.", "Bottle. Pours a reddish brown. Aroma and taste are caramel, toffee, and dark fruits.", "Nice aroma with caramel, raisins, wood, pipe tobacco, and a little alcohol. I thought the flavor was surprisingly mild--smooth and malty with caramel and dark fruit flavors. Bittersweet finish with a lot of drying alcohol. Another fine effort from Stone.", "Orange color. Heavy sweet aromas, tropical fruits, dried fruits, oranges, caramel. Taste mirrors the aromas with some citrus hops during the finish. Really solid American Strong Ale.", "Another great offering from the dark side of Stone. A rich mahogany red body with a thin off-white head. Taste profile blends some fresh and powerful elements - earthy and fruity hops, rich, sweet caramel malt, dark berries, brandy and a hint of nuttiness. Rich and sustained taste.", "Very nice bottle - perfect!!!!\r\nA red cloudy beer with a beige nice head, malty, light bitter, oily, full body, good balance, long finish, yeast dominated, compared with a Belgian beer very perfect, \r\n(I have 0.65l bottle which is bottled on 10/15/15)", "2014 bottle. Appearance- ruby red, dark brown tinges, a one finger thick beige head which clings. Aroma is loads of malt, caramel, toast, honey, cereal, cherries, sultana, cherry brandy, vinous hints, caramel malt. Smells big. Taste- full and coating in the mouth, bitter hop background, lots of caramel and toffee malt, biscuit, cherry and raisin, quite a boozy finish, red wine, cherry liqueur. Long sticky finish, quite sweet by the end. Very good stuff.", "Poured from a 22 oz bottle a deep, cloudy copper with a small tan head. Nose is caramel and ripe fruit. Medium sweet, slightly boozy.", "Bottle from systembolaget orangy red in color thik like soup 1/2 finger head super god", "Vackert bärnstensfärgad, grumlig med medelstort skum. I doften finns hur många olika torkade frukter som helst, knäck och en massa annat godis\r\nSmak: Fyllig är bara förnamnet! Sanslösa fruktkombinationer och knäck och choklad tillsammans med en beska som får smaklökarna att stå i givakt. Går nästan inte att beskriva. Munkänslan är lite tjock och oljig, minst sagt fyllig.", "On tap at Hourglass Brewery in Longwood , FL. \n\nA = clear, deep brownish-red, almost no head\nS = caramel-molasses-alcohol\nT = west coast barley wine-ish (think SN Bigfoot). Modest malt sweetness, caramel with robust hop bitterness. ETOH presence is apparent. \nM = close to heavy. \nO = really like this. A slow sipper for sure between the ABV and the bitterness. \n\n---Rated via Beer Buddy for iPhone", "Draft at Craft and Draft, Amsterdam. Sweet malts, hops, alcohol. Long sweet malty aftertaste. Not bad.", "Great beer. Aroma is malty, caramel, intense hops, and fruits. Taste is really sweet, mixed with the bitterness of the hops. Medium body, smooth texture, average carbonation. Long alcoholic finish.", "Rica strong ale como un demonio. Maltosa, con frutas rojas, casi confitadas, licorosa y algo cítrica. En boca desde una entrada cítrica a todo el despliegue de las maltas para terminar en un final amargo y con presencia de alcohol", "On tap at Craft & Draft Amsterdam. Dark ruby with a fine-grained off-white head. Caramel, maple syrup, dried fruit (figs, raisins) and a bit of cocoa. Soft mouthfeel, full bodied and with a sticky sweet aftertaste.", "Draft 0.15l at Craft&Draft Amsterdam Netherlands. 03.05.2016.Taste with Zlotta.Pour it hazy red amber color with small white head.Aroma licorice,sweet,interesting.Taste starts with orange juice,smooth texture,sweet red fruits,alcohol kicking on the back.Average catbonation,can imGine this beer from the bottle.Really nice balanced.", "39th Birthday and 200th US beer rating. Keg@brewdog, Birmingham. Dark amber beer with medium head and patchy lacing. Aroma red leaf, caramel and malts. Taste is caramel, red berries, dry hops and malts. Boozy. Very good.", "Rubí oscuro y limpio con espuma marfil. Aromas de malas caramelo, anís, herbáceos y cítricos. Cuerpo denso y maltoso con iniciativa dulce acaramelado y un final de amargor resinoso intenso.", "APPEARANCE: hazy amber with a large head. AROMA: caramel, malt, dried fruits and alcohol. TASTE: reflects the aroma. PALATE: full bodied, low to medium carbonation and medium to high bitterness.", "Flaska från SB. Provning med ölsällskapet. Mörk mahognybrun med oljigt krämbeiget skum. Påminner om vanliga Arrogant Bastard i doften, men sötare. Det är rejält med kola, toffee, kakdeg jämte kåda och granskott. Även apelsin och mango anas. Superstor, oljig kropp med klibbig humlebeska. Lätt, lätt rökig i smaken, tillsammans med det som känns redan i doften. Stor beska som bärs upp och nästan hamnar i bakgrunden för den stora kroppen.", "Jest klasycznie barlejowo, słody, słody, słody. Piwo treściwe, do bardzo powolnego sączenia. W aromacie wybija się konfitura różana (pierwsze piwo z taką nutą), suszone figi, słodki chleb wileński, irysy. Bardzo udany, nie zamulający barlejek.", "Sweet full aroma, raisins, pours slightly hazy. Nice Amber color...very full taste, raisins, figs, leather, blood, sweat..\r\nExtra ordinary..", "Sample at BGM 2016. Dark brown, lots of sweetness, oily and smooth mouthfeel. Full bodied and complex.", "[tap, Jabeerwockie, Warsaw]\n\r\nAppearance small foam, small bubbles, creamy, long lasted. Dark amber, almost brown, a little bit cloudy. Nice.\n\r\nAroma: Nice! Rich palate of malts: grains, biscuits, caramel (raisins, muscavido, roasted sweet bread). Pleasent red fruits: apple and grapes. Some grassy/herbal notes. Alcohol is present, but it’s acceptable.\n\r\nTaste: At the beginning very sweet, malty with hints of fruit. After second appears some strange, grassy, phenolic and taninn note. Herbal, spicy, acrid. It was really strange, but overall rather unpleasent - like beer fermented in too high temperature. Alcohol is present, nicely warms up throat.\n\r\nMouthfeel and bitterness: rather high bitterness. I feel phenols and alcohol present, making it long and sharp. Texture is oily, rich, thick, nicely pours in mouth. \n\r\nOverall\n\r\nAroma was great, I expected some world class beer, but in taste something strange appeared and it ruined the experience. Sincerely, if I paid half of the price, I would be satisfied, but for this money I expect more.", "Tap@ BGM4\rBrown, hazy, small beige foam; lots of caramel, some roasty notes, lots of hops, high bitterness, medium+ sweetness, full body, oily feel, average- carbonation, long and intense bittersweet finish with lota of alcohol warmness\rOverall: Great taste, very good aroma, balanced, noticable but quite well hidden and pleasant alcohol, very good beer\n\n-- rated with beerbasher", "Flaska som lagrats 3 år. Fasen vilken doft. Vänner av öl köp o lagra!!\r\nHär finns hela registret. Torkad frukt o hav med tång. Härligt balanserad med fina toner av torkad frukt. Väl balanserad med en helt underbar efterbeska. Världsöl!!! Blir så imponerad av dessa bryggare från staterna.", "Flarra som lagrats 3 år i ölkällaren i hovshaga. Doftar otroligt balanserat å fylligt av dadlar å fikon och tång. Satan jävlar vad fyllig och sjukt balanserad smak av dadlar , fikon, hav. Fin rejäl efterbeska . Oerhört god Tänk den dröm att svenska bryggare en dag ska kunna tillverka kvalité i denna klassen. Åh hoppas den dagen kommer", "Pours dark brown with a foamy head. Aroma is malty and sea salt. Loads of caramel, toffee. Lovely", "0.15 l on tap at ’Beertemple’. Clear, very dark red with a medium large, frothy, stable, tan head. Sweetish-fruity aroma of caramel, red fruits, some raisins and molasses. Sweetish-malty taste of caramel, raisins, prunes, molasses and red fruits, followed by a medium long, slightly bitter finish with some boozy hints. Full body, oily mouthfeel, soft carbonation. Very sweet, not that complex but very tasty.", "Tap at BrewDog Manchester. Hazy red. Ring of head. Big aroma of piney, resinous hops and strawberry jam. Taste seems exactly like the regular version but bigger and more powerful. Retains good drinkability though. Good stuff.", "Pours a darkish red/brown. Aromas of spice, coriander, yeast, and alcohol. Flavor has an alcohol taste to it, mixed with a nice smoky dark fruit. Also has a strong hint of spice.", "Dark brown tan, cloudy, light tan head. Some alcohol on the nose, dark honey, light spice, coriander. Light bitterness, quite sweet. Upfront alcohol, medium body, oily. Low carbonation. Pretty great.\n\n---Rated via Beer Buddy for iPhone", "0.1 draft. A hazy, dark brown color with a nice, tanned head. Aroma of grapes, vanilla, wine, bourbon, dried fruits, and quite some caramel. Taste is sweet, dark fruits, resembles a barley wine to an extent. A full body, a smooth texture, and a below-average carbonation. Finish is long, wood and caramel are still prominent, and the barley wine comparison is still hard to get rid of. Overall the beer is quite simply pleasing, worth recommending.", "Pompa w Jabeerwocky\r\n\nWYGLĄD: Barwa ciemnobursztynowa, zamglone. Piana niska, drobna.   \r\n\nAROMAT: Intensywny. Miks karmelu, owoców, cytrusów i ziół.\r\n\nSMAK: Półwytrawne. Z początku bardzo gorzkie grejpfrutowe, po chwili do głosu dochodzi przypalony karmel i alkohol. Goryczka wysoka, garbnikowa, zalegająca. Ziołowo-karmowy posmak. Oleiste, ale nie gładkie. Jak na 11% alkohol jest bardzo dobrze wkomponowany w całość.\r\n\nOGÓLNIE: Bardzo dawno nie piłem tak goryczkowego piwa z równie przyjemna karmelowo- ziołową kontrą.", "22oz bottle. Powerful American strong ale. Beautiful color and smooth for 11%. Very nice", "Tap na BGM. Piwo zdecydowanie robi robotę. Ciężkie, gęste, niemal oleiste. Masa charakteru słodowego, spora goryczka w posmaku. Świetna sprawa.", "Clear, dark amber to red color with a one finger high, beige head. Nice lacing on the glass. \n\r\n \n\r\nNose: Hops! Caramel malt, butterscotch, dried fruit, nutmeg, fudge, vanilla, plum and raisin. A bit of orange and citrus there to. \n\r\nTaste: A lot of malt, grape, orange zest, pine, grass, raisin and caramel. \n\r\nMouthfeel: Full body. Oily and smooth. Medium carbonation. Dry and bitter ending.", "Bottle from systembolaget. Dark amber with white head. Aroma is caramell, fruit. Taste is caramell, fruit, fruity sweetness and spices. Great in the beggining, did not grow on me.", "Dark amber / reddish with almost no head. Strong sweet bread aroma. Sweet malty bread taste followed by very strong and spicy bitterness. Strong bitter aftertaste with spicy notes.", "650ml 11% ABV bottle from Rehills, Newcastle. Red–brown in colour with a thin white head of foam. This beer has a spicy red fruity, oak and malty flavour with currant and burnt toffee followed by bitter-sweet pine, dried fruit and gentle leather on the finish. Excellent!", "Clear brown with creamy and lasting head. The aroma is a complex and unusual combination of juicy malts, spices and hops. Toffee and caramel, ginger bread, banana, cocacola like, burned multi cereal bread, raisins and lots of resin, orange peel , cinnamon, chocolate and some smoke.... Rich stuff. The mouth feel is oily and creamy. Quite strong carbonation for this style. Enough sweetness to make my lips sticky but has a huge hop and alcohol bitterness. Alcohol is a bit like cough syrup and not always enjoyable. But the beer is. Huge one.", "On tap at the brewery (Richmond, VA). Aromas of caramel, toffee, resinous hops, some citrus. Hazy ruby with a fully lasting white head. Sweet like burnt sugar, bitter, subtle booze, pretty assertive. Medium-full bodied, sticky.", "0,75 bottle at bottleshare night. - Aroma has an onslaught of caramel aromas. Very complex. Flavor has caramel, butterscotch, toffee and passionfruit. The flavor is slightly more malt-forward with tons of caramel, toffee and slight chocolate/coffee notes. The finish is not overly bitter, and its well balanced.", "Bomber shared with dusty brian and jon...nose is really nice with caramel and toffee notes...the mouth follows with the same flavor and a good dose of hops....solid brew.", "650cl bottle shared in a snifter. Deep red with a beige head which lasts quite well giving some pretty lacing. Aroma is as you would expect hops but not your normal kind. Very powerful but expertly blended to give a pleasantly clean taste with an astringent bitterness which demands respect. Over the top in every respect but the malt is nicely restrained as I had been wary of a syrupy backdrop to go with the extra ABV and hops but no this is better than the standard version (but not by much as that is already excellent).", "Pours beautifully and looks like a calm, fiery sunset with an amazing head. Rich stewed fruits and caramel with hints of vanilla. The toast hits the nose but the taste is an evolving monster of flavour. The beer that keeps on giving....excellent!", "Tap at Aluc Celle Riga. Hazy amber. Nuts, malts, wine, prunes, hopy hops.\r\nQuite bitter, medium sweet. A lot of burnt sugar, caramel, prunes. Nice, good balanced, complex.", "#2000 draught at Craft Hands. 2015 version. Rich dark caramel and figs, raisin and marmalade, big bourbon bite with lingering spices, syrupy body, dry warming finish . A big big brew, definitely a slow sipper, best enjoyed as digestif.", "650ml bottle, 2014 edition. Hazy amber body with a very low brief head. Alcohol, caramel, orange zest, pine, toffee, citrus,", "Poured from a 22 OZ bottle into a pint glass. The appearance is a clear brown color with a large white head. The aroma is full of hops with some toasted malt, very appealing. The taste is simply WOW!!! A world class beer.", "Quite a treat. Big nose, intense maltiness, caramel, lots of dried fruits and berries, some wood touch, quite lovely hop kick, mostly citrus. Moderate sweet with moderate bitterness. Syrupy. Awesome sipper.", "One delightful \"muther of a beer\" indeed. Toffee, caramel, citrus, rye, and bread taste. Spice in the aftertaste. Resiny and sticky. Creamy and smooth. Simply marvellous.", "From a 650ml bottle on 12/2/2106 (ABV listed as 11%). Pours a cloudy dark reddy brown with a small head. The nose features caramel, toffee, rye, spice, honey, stone fruit and a bit of zesty citrus fruit. Flavour wise, this is huge - masses of caramel, butterscotch and toffee, brown sugar, sweet stone and stewed fruit, marmalade, bread, toast, rye and spice, followed by a hint of warming booze. It features a massive sticky, resiny bitterness which hits you like a punch in the face. The palate is syrupy and slick with modest carbonation. Extremely bold, rich and intense. Magnificent.", "Bottle, 660ml. A clear reedish beer with a medium size brown head and minimal sediments. Aroma is of firewood, malt, alcohol and spices. Taste is bitter with a strong malt backbone. Some carbonation and astringency. Aftertaste reminds me of bourbon and it has an alcoholic finish. Well balanced and very smooth. Great beer.", "Bottle, 660ml. Clear maple with a frothy brown head. Sweet caramel and toffee aromas with hints of fruity hops. Robust bodied with moderate carbonation. Smooth and creamy, with rich roasted character and a complex bitter and alcohol finish. Exquisite.", "A big, leathery, raisiny elephant that walks into the room and sits on your chest. Very good beer.", "Dark red Amber pour with very little head. First taste and last tastes are all the same just fantastic. Very balanced malty but just hoppy enough. Really great!\n\n---Rated via Beer Buddy for iPhone", "A big, sweet, boozy nightcap. Very well made, scoring high in almost all departments. If I have any complaint, it’s that the bottle size seems extravagant - a 330ml of this would be near perfect, rather than a pint and a bit. Perfect appearance: caramel brown with a thick head that lasts. Aroma was more restrained than I expected, perhaps due to the serving temperature. Brown sugar, brandied pears, raisins. Perfect palate: creamy smooth. Alcohol is well integrated - it’s the sugars that dominate til that big minty-piney finish. (Pint bottle from Leura Cellars. 2012 version)", "On tap at Brewski, Brisbane. A mahogany brew with caramel malt, ethanol and piney hops on the nose. Complex taste profile with a nice balance between strong bitter and sweet components in the finish. This is one rich beer: a meal in a glass. Looking forward to trying the barrel aged versions.", "22oz bottle pour at home with a bottle date of 10/13/15\r\n\r\nPours a deep copper color. \r\n\r\nPersonally, the best thing about this beer is the mouthfell and the palate. \r\n\r\nTastes like a mouthful of red and black licorice. \r\n\r\nYet another great Stone beer", "The beer pours a dark brownish amber color with a small head. The aroma has roasted malts, licorice and booze. Taste is big with a balance of caramel sugar, molasses and orange. The finish has some mild bitterness and mild alcohol. Good beer.", "650ml bottle. 2015 edition. (11% ABV) Pours a hazy copper with a large, frothy, long lasting, beige head that laces nicely. Sweet, roasted aroma of caramel malt, overripe fruit, alcohol and piney hops. Sweet flavour of roasted malt, caramel, dried fruit, spices, booze, pine resin and grass with a dry, bitter, hoppy finish. Full body with an oily texture and soft carbonation. Excellent, the name delivers as promised.", "Appearance: clear deep amber with one fat finger of fluffy light tan head, medium retention and patchy lacing. (4/5) Aroma: pine, citrus, toffee, dried fruit, coffee & chocolate, alcohol, tobacco & leather, earthy. (9/10) Taste: moderate-high sweet, strong bitter. (9/10) Palate: full slick and oily body, moderate carbonation, lingering boozy bitter finish. (5/5)\r\n\r\nI waffled a little scoring this one. The flavours (particularly the hops) are somewhat overshadowed by the massive maltiness and ABV, so it’s not simply “Arrogant Bastard times two” - the balance and interplay of flavours are completely different. (That’s not to denigrate the value of a boozy big bastard, mind you.) However, the other factor here is that a lot of the complexity and depth of flavour - and there’s a lot - is overshadowed by the big malt and ABV, so to some extent it doesn’t completely succeed, even on its own terms. When I first reviewed this, I opined that it might benefit from a greater hop presence, but even in a relatively fresh example, the hops are massively overshadowed by the the malt and alcohol. Still, for all that, it’s lots of fun and actually a darn sight better than the Depth-Charged version I tried recently. (18/20)", "Large frothy beige head deep brown pour strong medium carbonation aromas citrus pine toffee stone fruit chocolate butter scotch hint brandy woody note earthy the flavours caramel grapefruit medium strong bitter pine resin toffee apricot earthy note brandy buttery good body the finish best aftertastes resin crisp hops malt mix lasting alcohol bitter taste cracking ale", "Pours amber with a large khaki head that moderately dissipates into a nice cap and good lacing. AROMA: malty, hop spice, peppercorn, bitter, phenols, grapefruit, caramel, roasty, spices, herbs, smoke, slight molasses and coriander. TASTE: malty, hop spice, peppercorn, bitter, phenols, grapefruit, leaves, grassy bitterness, boozy, caramel, spices, roasty, herbs, smoke, slight molasses and coriander. AFTER TASTE: malty, hop spice, peppercorn and bittersweet citrus with an oily spiced boozy finish.", "Hazy deep copper pour. Off white head. Aroma of dried fruits, mild oxidation resulting in sherry notes. Full bodied, creamy. Sherry, dried fruits, wet wood, pine bitter finish. Alcohol is well integrated. Nice big one. 2013 edition.", "Mahogany brown color, beige head. Caramel nose, wood, hint of coffee, sharp notes, grass. Sweet taste, caramel, dried fruit, wood, alcohol. Full body, soft carbonation, oily texture. A bit too heavy and powerful.", "From the bottle the pour is cloudy brown with an off white/brown shaded head, the aroma is toffee caramel and dried apricots or maybe pineapple some sort of fruit, the taste deep your caramel notes definitely some coffee on the front and there’s just a little bit of hops to brighten your taste buds and then it finishes roasted and malty Carmel.", "Rating #1456 - 01.02.2015 - Bottle from @beerblast. Pours a copper amber, and exudes hoppiness right from the get go, powerful citrusy, grainy, fruity hops on the nose. Medium heavy carbonation, huge alcohol warmth. ABV not well disguised by hop character - foolishly absurd malty sweetness trainwrecked by aggressive bitterness, and punishing alcohol. Borderline stupid, and doesn’t hold a candle to its true champion little brother.", "Rated from old notes. Very hoppy and in your face. Nothing subtle here. The bottle insults you and the beer follows through. Hops and lots of it with an almost acrid bitterness. Progressively boozy. Gave me a headache. I quit after 80% and went for an ice cream.", "Pours deep mahogany brown with a very nice yellow-tan head. Aroma is potent caramel malts with some citrus hop. Taste is wham-bam thank you ma'am sticky molasses malt with some cotemp bitterness and a very happy aftertaste. Not too boozy despite its ABV. Bold but a bit sweet.", "22 ounce bottle. Bottled on 10/13/15. 11% ABV. Pours a deep cooper color with a large creamy beige head. Rich caramel malt nose has notes of citrus and pine hops. Flavor is sweet caramel with notes of tropical fruits, roasted butternut squash and bourbon. Notes of dark fruit and nuts in midtaste. Woody and buttery finish. Complex and rich with boozy, sweet malt, spicy and resiny hops and subtle chocolate liquor notes.", "deep copper amberwith a fairly frothy light brown head. nose is potent West Coast hopswith a touch of barley sweetness.this beer is aggressive as advertised with tons of hop bitterness balanced against a big sticky barley malt. alcohol is well hidden. A very well made American barleywine", "Bottled. Pours nice dark copper. Has a nice dark Ale taste. The only thing I don’t like is the alcohol aftertaste other then that it is a great beer.", "Pours dark amber and big lasting head. Smell is sweet and boozy. Isn’t as horid as I was expecting. Drinks mild but finishes big and boozy and too sweet.", "Not entirely sure why they sell these in such big bottles. Slightly irresponsible I would suggest . Luckily I’m already on the sofa. Raisiny , pruney, very alcoholic. Slight chocolate. Intense. I can’t argue with this beer, one winner.", "Intense! Holy mother. I wish I had the regular bastard to compare as it feels somehow even stronger. Simple palate but complex taste. Not for anyone but the most ready for extreme beers.\n\n---Rated via Beer Buddy for iPhone", "20-NOV-2015, bottle (best before 2014) @Erik, from Systembolaget somewhere, thx.:-)\r\nMurky, brown’ish, tan head.\r\nAll the American Strong Ale characteristics. Pine, grape fruit, caramel, almost roasted, fruity. Sweet, bitter. Clearly not fresh but still very tasty:-)", "Bottle from Julio’s. A clear deep amber. Tan head that settles to a thin lace. Aroma of earthy sweet fruit. Alcohol is very well masked. Flavor is deep and complex. Well balanced bitterness and very smooth drinking. Notes of chocolate, prune, herbs, pine and coffee. Long lingering bitter finish.", "Bottle @ Dangerous Bottleshares 1 Year Anniversary. Pours hazy reddish amber with a big offwhite head. Aroma is hoppy, sweet, caramel, malt, plums, vanilla, citrus. Taste is hoppy, fruity, bitter, malty, dark fruits.", "Bottle @ Dangerous Bottleshares 1 year anniversary. Pours red amber with a beige head. Aroma has some rather big hoppy notes up front, behind that comes all the sweetness. Caramel, big fat sweet plums, deep malty profile and some weak vinous notes. The taste is hoppy with all of that big fat sweet fruity notes which leads to some vinous associations. Alcohol is quite present and the end is rather bitter from the hops. Yet this beer is a pleasure to sip but is indeed a mother drugger in terms of being intense.", "One of my favorites! A bit pricey but occasionally worth it. Usually only a seasonal bear.", "From the 2015 batch. Bottled 10/15/15. I actually thought I had reviewed this one before now. Reddish-brown pour under a full cream colored, foamy head. Interesting aroma of barley malts, grain, sweetness, but it really feels full all around. The body is medium to full. A bit more alcohol in the taste but everything else reflects the characters I picked up on the nose.", "Strong and rich, I'm sure I'd be happier drinking out of a glass, rather than a cup. Rich and malty, the hops really fade into the background for me on this one. The alcohol is always lurking in the background.", "Growler from Totalwine Tukwila to wine glass \t\t\r\nappearance: dark reddish not a lot of head\t\t\r\nAroma: very fragrant, boozy aroma\t\t\r\nTaste: delicious, medium bitterness, with sweet follow through\t\t\r\nfull body with long finish \t\t\r\nExcellent beer, one of the best, will definitely try again", "I'm in heaven. I've had the Double Bastard but this one is 2 years old ('13). Excellent beer but I'm biased I love good aged beers.\n\n---Rated via Beer Buddy for iPhone", "Bottle. Pours hazy amber with light brown creamy head. Aroma is really malts, caramel, bread, toast, coffee, raisins, plums strawberry but also with an hoppy edge. Taste is first toffee forward, coffee, caramel, toasty malts, raisins, light fruity berries and then turns really hoppy. Light dry alcohol in finish, sugary and sticky. Funny contracts, but it works. Really dry hoppy finish, really bitter.", "Bottle @ Dangerous Bottleshares 1 year anniversary. Pours light hazy amber with a frothy head. Notes of danks hops, medium bitter, sweet malts with some caramel.", "Bottle at Dangerous Bottleshares 1 year anniversary! Pours a reddish, semi clear amber with a small, off white head. Aroma has lots of caramel malts, hops, fudgy sweet notes, banana, dark fruits, slight overripe apple. Taste is sweet and with lots of light caramel up front, but quickly gets very bitter. Lots of similarities with the arrogant bastard beer, just in a stronger version. Really nice.", "Clear, amber colourl; great, beige head. Very strong, malty aroma, caramel, melanoidins, herbs, fruits. Taste is also malty with caramel, bread, pine, fruits and gentle bitterness.", "Bottle bought at fluvian’s bottle shop in st. Andrews. Aromas abundant! Malts, carrot, tobacco, strong hops. Mouthfeel from here to eternity. Spruce, liqourice, citra, grapefruit, grass, prunes. Not really sweet but insanely full. Fantastic, fantastic, fantastic.", "Fra flaske på Cardinal M2 sep-15: rødlig fargetoner med tett offwhite skum som varer. Vinøs aroma og smak i en velproposjonert kropp med overbevisende balanse. Røde bær, vanilje og mango for å nevne noe av smaksinntrykkene. Kompleks. Dæven, utbrøt Sigmund. Mild bitterhet og afterburn, men den varmer helt ned i lilletåa.", "Shared bottle at Mi2 at Cardinal 28.09.15. Reddish brown. Small beige head. Vinous aroma and taste, with malt, mature berries, plums and wood. Complex, interesting and good. Moderate bitterness.", "Shared bottle at Cardinal, Stavanger. Pours almost clear dark golden with a tiny white head. Aroma is heavy sweet and bitter, resiny and piney hops. Taste is llight sweet, like a barley wine with a decent dry hoppy finish, resiny and moreish.", "Shared bottle at Cardinal, Stavanger. Pours hazy light brown with of-white head. Aroma of caramel, dark dried fruits, raisins, medicine. Tastes sweet; however, after a short while a distinct bitterness unfolds.", "650 ml bottle, Cardinal Pub & Bar, Stavanger. ABV is 11%. Hazy reddish brown colour, moderate off-white head. Strong aroma of American hops, piney notes, also caramelized orange marmalade, some alcohol. Very hoppy flavour, medium sweet, caramel and alcohol. Bitter finish, hints of solvent.Warming mouthfeel. There’s plenty of hops in this one (surprise, surprise), but this is probably not where you go when you look for balance.", "1pt 6 fl oz bottle from Brewdog online. Coppery amber colour, thin beige foam head and aroma of malt, orange marmalade, hop resins. Taste is sweet malty, caramel, toffee, raisins, booze, with grapefruit & pine and spicey bitterness. Oily mouthfeel, medium bodied, soft carbonation, dry grassy boozy bitter finish. Aggressive, very drinkable", "Cervesa amb aroma i sobretot gust a caramel, també és bastant licorosa però no pots separar-te d’ella.\r\nCerveza con aroma y sobretodo sabor a caramelo, también es bastante licorosa pero no puedes separarte de ella.", "Big bottle in Amsterdam. Dark reddish body with slight head. Nose is caramel, malts, toffee, fruity. Taste is toasty ad malty and deep oaky. Really nice. Malts and sweets in there. Very alcy and comes in strong.", "Poured from 1 pt 6 fl oz bottle - 2013 release [bottled 10/08/13] (11.2%). Medium amber brown with beige head. Lots of dried fruits, plum, and hops, very barley-winey, mild alcohol.", "A Stone legendás főzetének arrogánsabb verziója hasonlóan tündöklő, réz színű köntösben jelenik meg, s atomerőmű intenzitású illatfergeteget szabadít ránk rögtön, az üveg felnyitását követően. Gyantából gyúrt tészta mázsás súlyú aromája terpeszkedik szét hirtelen, mézes tobozok, juharszirup gazdag aromája festi meg a levegőt. Vehemens illatai nem sok reményt hagynak a visszafogottabb fogyasztók számára ízét illetően, s ahogy sejteni lehetett, szinte szétrobban a szánkban az ízjegyek tűzijátéka. Nehéz zamatai alatt nyögnek az ízlelőbimbók, mézédes, túlcsordulóan telt testben szabadulnak el a szirupban fürdőző aszalványok, tejszínes gyümölcslikőr, komlótobozokkal díszített sárgabarackbefőtt vonalait megidéző komponensek. Hosszan elnyúló, mondanivalóval teli kesernye adja meg az ívét a főzetnek, melyet nem mindennapi jellege igazán emlékezetessé tesz szakavatott komlófetisiszták számára.", "Pours dark amber with a small head.\r\nNose shows sweet malt, spicy and resinous hops, caramel and sultanas.\r\nFlavours are equally spicy and herbal with heaps more malt following through afterwards alongside a bit of booze.", "Keg at Ushers, at 10.5%. Pours clear deep ruby. Nose is sweet burnt toffee, malts, dried fruits. Very nice. Taste is sweet oaky caramel or burnt toffee, more oak and wood, decent bitterness, loads of maltiness. Very nice. Needless to say but this kind of beer out of keg without 30mins warming simply tastes horribly boozy.", "Bottle, 2013. Pours amber, clear, solid head. Aroma is mainly malt and aome druits, quite clean. In taste medium sweet, a bit boozy and fruity with very strong bitterness, which is just fantastic, not harsh, not astringent etc. Medium body, dry finish. Very nice ale, maybe worth longer cellaring for the better aroma.", "Bottle to tulip. Pours copper with an off-white head and a lot of sticky lacing. A lot of malt and dried fruit in the aroma, with some almonds hanging out in the background. Taste is a little sweet - raisins and caramel - with a lot of bitterness and boozy heat. Definitely no hiding the ABV in this one.", "Dark amber, almost red hue with a cream coloured head. Prune, plum nose. Big caramel taste with burnt toffee & added woody, earthy bitterness.\n\nRated by BrewTom", "2013 Bottle - July 4th BBQ tastings. \r\n\r\nRed appearance with thin white lacing. Aroma is oak, caramel, wood, some smoke cheese. Taste is oak, blackcurrants, smoked cheese, some Bamberg malts perhaps? If not I’d like to see some in this.", "How: Bottle.\n\r\nWhere: Systembolaget.\n\r\nAppearance: Dark amber colour with an off-white head.\n\r\nAroma: Dried fruit, caramel, raisin, sweet malt.\n\r\nBody: Full body, low carbonation.\n\r\nFlavour: Malt, hops, dried fruit, a bit vinous, caramel.", "Draft. A hugely malt forward nose, I can smell the diabetes. Moderately to aggressive hop bitterness with a full bodied chewiness. Solid barley wine kind of beer.", "Bottle. Pour is dark amber with a thin head, aroma is fruity, malty, sweet. Taste is fruity, alcohol. Great", "Leicht trübes orange goldenes Bier mit einer geringen leicht beigen Schaumkrone. Geruch sehr malzig, reifes Obst, Karamell, Vanille. Geschmack alkoholisch, sehr malzig, Vanille, leicht holzig.", "Bottle (2014): clear, deep copper red with a light head and good lace. Huge malty lift. Some fruit and huge caramel. Very intense. Very clean. Only really one dimension but a great example. Off dry to slightly sweet, not sour, high bitterness that’s balanced and it is hot. The palate is very fruit and intense. Great balance and flavor. Figs, raisin, fruit cake, caramel and dry spice. \r\nThis is a massive beer but a great drink. I love the style.", "Fantastic molasses and brown sugar sweetness that elevates it above the standard Arrogant Bastard.", "Pours a dark chestnut with red hues, almost clear and with off-white head. Complex aroma with roasted almonds, herbs and big roasted maltiness. There’s a concentrated scent of whipped cream and with some wet wool in the background. Full bodied palate, big bitterness with a medicinal quality like Underberg herb liqueur. The finish is long with that medicinal bitterness on the back of the tongue.", "It’s a beautiful pour, with dark amber color and thick beige head that stays with the brew. Nose is resinous and First sip is surprisingly low key in alcohol. This is a 2014 bottle. Sweet, malty start with a bright hop finish. It’s not as clean on the palate, which I enjoy. After a few sips, it is almost the same affect as chewing on a hop flower. Those flavors linger! Great strong beer. For the alcohol, it is easy to drink. Plan so age a second bottle to test against next couple years.", "650ml bottle enjoyed @ my vacation apartment. Pours cloudy dark ruby with a lasting beige head. Aroma is malt, herbs, raisins, alcohol, caramel and fruits. Flavour is bitter. Full bodied, thick texture, average carbonation. Finish is resinous and bready malt.", "How have I never rated this? Bomber. Deep amber with a beige head. Huge hops and malts in the aroma. Big complex fruit pretty much runs the gamut. The flavor is exactly the same. Complex and big fruit. Huge malts, too. Some spices and caramel. Brown sugar, harshness, alcohol, and big bitterness. My taste buds are being assaulted!", "Pours a dark brown with a thick beige head. Aroma is malt, caramel, fruity with some hops and spices. Taste is high sweet leading to dry bitter finish. Excellent!", "Pours a cloudy orange-brown with an off-white head and nice lace. Sweet aroma, nice citrus, bitterness in the finish. Thick, sweet malt and nice bitter aftertaste. Thick body and good carbonation. Tasty!", "660ml bottle from Drygate. Reddish brown, reasonable head. Grain alcohol malt aroma. Sweet woody alcohol malt flavour. Woody alcohol aftertaste. Love the attitude of this beer. I don’t normally like beer thsi strong but this one is good.", "Bottle purchased at Elevated. Consumed with Saturday Shirt. Pint glass. Deep amber color with an off white head. Aroma has the traditional Stone hop elements but a little bit more malt sweetness than most. Taste has plenty of hops but it’s undercut by sweetness. It’s very drinkable and highly enjoyable. The alcohol is well hidden. Little bit of bitterness at the end. This is a great beer by one of the best hop centric breweries. Definitely worth a try. You bastard.", "650ml bottle. Deep ruby ​​red. The aroma of a whole bag of sweet caramel. The taste is firmly bitter, simultaneously sweet, hard candies, raisins, plums, sawdust. Several complex and deep flavors.", "This mighty brew is really a treat. Aroma is dark fruits, sweet notes of vanilla, plums and caramel. The taste is also on the sweeter side of the spectrum, but with the massive hop profile it manages to keep up a certain attitude as a trouble maker. A true bastard.", "A very big beer. Mouthfeel is almost perfect. Great hops and huge punch with the 11%. You can definitely taste the booze. Overall this is a great beer.", "Bomber to a pint... Hazy copper-amber with thin tan head and lacing. Toffee with floral and pine resin nose. Layered and complex flavors, smooth, balanced, dry bitter finish. Hides the ABV well... Excellent Strong Ale!", "Pours a dark red with a 1 finger off white head. Has the aroma of dark fruit and caramel, Strong flavor that follows nose with lots of malts and a booziness and heat at the end but that is not a complaint, its part of the experience. Next time I go to Illinois I will be picking up a few more bottles.", "This beer is amazing. Deep, rich, complex maltiness. High gravity and residual dissolved sugar content. You might wish to have a glass of ice water to chase each sip. One bomber might put you in a diabetic and alcoholic stupor. This is a big boy beer or one to share if you bought the bomber. I have all but forgotten the regular bastard by Stone brewing after drinking this beer!", "From the bomber, it appears almost black with red highlights, has a nice white collar. At first tastes like sweet malt, then hops and bitter, with an exhale of alcohol. All things considered i would think this is the type of beverage \"The Devil\" would serve you if you were invited to his home to discuss terms of an agreement. The warmth and rapid buzz might loosen one up to sign the paper.", "Amazing beer! First taste is a caramel with a hop finish! Color is a brown reddish. Smell is floral. If you want a beer with lots of character this is it!", "Poured bright reddish amber with a tan head. Aroma of dense, concentrated berries, floral hops and caramel malt. Full body, flavour is sweet berries, toffee, moderately bitter hops.", "When the aroma which makes pear and melon remember is accepted, the sweetness of the malt stands out at the beginning, but mellow sweetness and moist bitterness follow about a tongue after that. Indeed, for rate beer, the beer for which a high score is taken. It's wonderful!", "Aroma: bread, alcohol, raisin, \r\nAppearance: orange-red, clear, slight tan head\r\nTaste: medium sweetness, medium bitterness, \r\nPalate: medium body, creamy, average carbonation, long bitter finish, \r\n\r\nDelicious", "Freshness makes all the difference here and this is a huge improve from my last bottlem. Signature Stone rawness with much delectable twisted rubber hop bitterness throughout the length. Deep glowing hazy reddish brown. Limited head. A glorious blow to the head.", "Bomber, 2013 release. Clear deeper red copper, fine firmer lasting tan foam. Alcohol infused version of the prefered original, more like an intense barley wine. Average carbonation, full bodied, aggressively hopped. DNFL (Definitely Not For Lagerboys)", "Pours a hazy copper creamy white head, aroma is toasted bread and some caramel, low hop aroma. Taste has lots of rich breast malty some pumpernickel and some caramel, medium to low bitterness, alcohol is well hidden. Reminds me a lot of a doppelbock. Medium body medium carbonation.", "My second venture into my Bastard Box. Pours dark copper with a thin off white head. Big sweet caramel malt aroma with pineapple and grapefruit. Starts with citrus hop forward flavor followed by big caramel malt and toffee that balances out the hops. Then the bastard comes out and you are hit in the tongue with huge hops. Big orange and bitter grapefruit finish. Leaves your tongue tingling.", "One of my favorites. Lives up to the billing ten fold, wish I could find more of the bba aged version...", "Massive malt and hop bomb. So much for the palate after this, huge citrus hop aroma and flavor. Big malty aroma as well. Big malty taste, well balanced hugeness. Some alcohol, enjoyable. Only need one 22 oz bomber", "PRELUDE = I am not a hophead... I prefer this over the Arrogant Bastard. Still has a ton of aggressive hops that are up front and in your face. The balance however made this beer beer drinkable while staying true to being a Bastard. Maybe it was the higher abv, I don’t know. Again while not really what i prefer to drink, it was a good experience. Can really see why people who like this type of beer would love this.", "Kopparfärgad klar med ljusbrunt skum. Doftar och smakar mycket karamellmalt, lite humle och ganska mycket beska på slutet med lite alkoholsmak. Som en riktig bra barleywine", "one of the best ive had. very sick appearance... looks like pure camel. yum!", "Karamellfärgad. Doft av karamell & torkad frukt såsom aprikos. Fantastisk sötig karamellhet, torkad frukt, balanserad, fyllig med en fantastisk bitter slät avslutning. \n\n---Rated via Beer Buddy for iPhone", "Glory be to the bastard king. While not a beer in the regular sense of the word, this is pure liquid gold. Fruity without being sweet, heavily bitter without the soap and perfume, pleasantly chest warming without the residual taste of alcohol. If it just looked a wee bit better in the glass this would be close to the perfect beverage.", "Quite cloudy dark red-brown, beige sudsy head. Smells of black treacle, brown/candied sugar, roasted malt, pine needles, musty grassy almost herbal hop bitterness. Tastes of toffee, nuts, resinous hop, pine, finishes with light spice, malt, maple syrup. Body is very smooth, creamy and lightly spicy. Flavours are big and complex but somehow the beer isn't overwhelming or too sweet. Good beer - doesn't taste like much else - though I think I like the original Bastard ever so slightly more.", "Bottle from QClub at home. Deep deep copper brown pour - hazy to the point of opacity. Thin foamy head. Aroma is similar to the others in the bastard series - very dank and hoppy with a pronounced bready maltiness. Taste is similar. Huge flavor of bitter resinous hops balanced by lots of caramel bread malt flavors. Big booziness too, the warmth and bite of which last for quite a while. Really good - maybe the best of the bastard series, though the original is great too. Would definitely get again.", "Wow, un grande bière! L’arôme fort du caramel, sucre brun, et l’alcool. Le goût est des fruits séchés, caramel, sucre brun avec une finition amer bien équilibré pour une bière tellement forte. Très puissante, une excellent bière d’hiver.", "Bottle from Total Wine. Home snifter pour is dark orange brown and murky. Small head and no lacing. The aroma is serious heavy malts, leather, burnt caramel, kind of a swampy aroma as well. Taste is big malt bomb, dark fruits, dark breads, pine, wood, and earth.. Bitter pine finish. Thick oily mouth and an almost sticky finish.", "650ml bottle of 2014 edition. Dark brown with one finger tan white head. Initial deep aroma of dried fruits, raisins and dates, and sweet syrup followed by increasing tones of piny hops. Sweet taste of dried fruits and sweet black bread (sirapslimpa) followed by bitter piny hops and then finishing sweet again with an almost desert wine character as well as some almost burnt roasted flavors. Probably medium thickness to the mouthfeel and medium carbonation with very well hidden alcohol.", "Growler 2L btl.\r\nLooks..Rick dark mahogany, med head.\r\nSmells.. Big sticky boozy stonefruits, thigh rich caramel, sweet.\r\nTastes..chewy thick booze soaked hoppy stonefruits, liqueur-esque caramel.. definite alcohol, some warming heat and real bitterness muscle.", "(650ml 2014 bottle @ Systembolaget) Pours clear copper with a small head of fine off white bubbles that lingers with no lace. Aroma quite malty, toffee and caramel, touch of fig pudding, marmalade hop character, pine, smells like a barley wine. Palate rich, quite sweet at first with a fair bit of bitterness, toffee, marmalade, a little dried fruit. Hops show up a lot more in the middle of the palate, lots of pine needle and resin as the bitterness takes hold. Malt core holds all the way through to the aftertaste but the bitterness is quite high by the finish, astringent, mostly pine/resin with some candied orange. Lots of hops in the aftertaste. Fairly full and oily in the mouth, very soft carb, a bit of alcohol heat. I would definitely call this an American barley wine. It’s a really good one though, nice balance, smooth and malty with enough to hold the big hop character later on in the sip.", "Aroma is roasted malts, honey and caramel. Taste is all sorts of great deep malts, raisins and caramel. Thick almost chewy mouthfeel. Light creaminess and a very well balanced hop profile that is earthy and has slight clove and lemon grass notes. Appearance is a clear copper body with a medium pearl head that retains well.", "2014 version, which is 11%, from Favourite Beer, Cheltenham. Deep amber colour with a beige head. Burnt caramel, malts, marmalade and alcohol aroma. Well balanced bitter sweet start with a bitter finish. Very thick palate. Love it!", "On tap at Nakameguro Taproom. Served in a snifter. Deep amber color with a huge pink soapy head. Slight malt aroma with a bit of sourness present. Sweetness present on the palate from the malts with a hint of bitterness and a strong bit of alcohol present. Oily mouthfeel with a nice long smooth finish. Solid strong ale.", "Medium chocolate brown, moderate foam. Caramel malt aroma with some hops, smells strong, nothing special tbh. Hop characteristic is much stronger in the flavor, spruce, tiny bit of roastiness. Bitterness lingers nicely.", "Draft. Dark amber brown with small tan head. Malty caramel atoms. Big malty version of bastard. Bitterness still shine through the extra malty palette. Delicious as expected.", "Good beer. Slightly more bitter and less floral or citrus than I normally like for an ipa. Worth a try for big beer lovers but won't be a regular purchase for me. \n\n---Rated via Beer Buddy for iPhone", "650ml brown bottle. 2013 release. Orange coloured, hazy, some floaties in later pours. Small cap of creamy beige foam. Nose has toffee malts, mild citrus and alcohol. Taste has caramel and toffee sweetness, late hop bitterness and some alcohol. Full bodied with softer mouthfeel. Strong, rich, boozy, hoppy - all things I enjoy. Seems like a great beer to pull out on a cold winter’s night, one to sip slowly.", "1pt bottle. Pours a lovely ruby red, very little head. Sweet and malty arome with some dark fruit. Flavour has the same, along with some fierce bitterness to balance it out. Definitely more of a barley wine than anything else. Any way, a beast of a beer.", "This is pretty much a barleywine... The fact that they don’t call it a barleywine is just a testimate to just how many f*cks stone does not give. It’s both sweet and deliciously malty and brutally hoppy... It’s pretty much everything all at the same time, but it isn’t all confused tasting..... If it were a barleywine it would be my favorite barleywine, but as it stands it’ll just be my favorite \"strong ale\" whatever in the hell that’s supposed to be...", "Very good. Very malty. Almost like a barely wine. Probably one of my favorite strong ales.", "Bottled 10/16/14. Pours a hazy chestnut color with a thick cream-colored head. Aroma is malt, honey, fig, toffee, and notable hops in the background. Flavor is caramel, toffee, little bit of fig, and a nice long hoppy finish. Drinks a lot like a Barleywine. Wow this is phenomenal. Way better than the regular arrogant bastard.", "Bottle from cellar stash sale at Corvallis Brew & Supply. 2008 vintage.A: Mahogany color with a foamy creme color head. Legs.N: Pine, licorice, star anise, toffee, leather and tobacco, some hop residuals - mostly pineapple, earth and peppercorn. Raisin, fig, woodiness, clove. T: Gigantic bitterness and sweetness. M: Medium body, fuzzy carbonation, alcohol is restrained actually. Much different than the fresh bottles I have had.O: An assertive beer. Fresh, it?s a bit of a hoppy, alcoholic mess, but at 6 years old, it?s like a bigger Bigfoot. Almost an exact comp, actually", "660ml bottle (BierKompass.de) 2012 release, drunk 2015/01\n\r\nVery nice barley wine aroma, sweet caramelly malts. Perfumey, but nice. Full smooth sweet palate. Massive malty palate. Nice bitter hops. Dang, this is a good barleywine. Love the balance of the hops and the malts, both components are very assertive, but not over-the-top. Drying palate makes me thirsty for more, which is a good sign.", "660ml bottle (thanks FatPhil). Hazy dark copper color. Medium size, yellow head, stays. Sweet, malty, citrus, raisins, mild alcohol in aroma. Caramel, raisins, plum stones, chocolate, malts in taste. Slight fizzy carbonation which adds character to that beer. Sweet malty aftertaste. Spicy hops hopping on my tongue in aftertaste. Beautiful. Where is that 11% of alcohol? Nowhere! Fantastic!", "2005 at Monkey Paw. Pours hazy reddish brown with a thin, fizzy off white head. Tastes like rich raisin, booze, and very sweet malt. Medium body and low carbonation. Smells like alcohol, woody, and sugary sweet malt, very faint hops.", "Poured from a 22oz bottle into a snifter. A - Woah! Big aromas in this beer. Smells very floral and boozy. Plenty of hop bitterness present as well A - Deep amber hue--just a tad darker than the standard ABA. The lightly tanned head receded down to a thin layer of bubbles that hung out atop the brew throughout the drink. T - The attack features an array of floral notes and plenty of malty sweetness which continues through the middle of the sip. The finish features that Stone signature blast of bitter which crescendos until it comes full circle and returns to the malty and caramely sweetness. Wow. P - Such a full and rich mouthfeel. I can feel my tongue counting up the calories. The bitter finish cuts right through the richness and gives it a nice balance. O - This is a BIG beer. Very full in maltiness and extremely bitter. But it, no doubt, creates an amazing drinking experience. This beer has such large range of flavors and aromas: malty, floral, bitter, and boozy. It is extraordinarily balanced for such an intense drink. Beers this bitter may not be for everyone, but i couldn’t recommend it more. This is a supreme brew.\n\n\"Never turn your back on your beer.\"", "2014 - 11% ABV. Pours a nice dark reddish amber brown with a weak head. Aroma is fruity, apricot, hoppy, caramel, oak, wood, boozey, spice, malt richness. Taste is caramel, cereal, biscuit, oak, vanilla, malt, spice, boozy, with a bitter finish. Overall a very good beer, not huge considering the 11%, very good.", "Growler from Big Hops. Deep reddish amber color, minimal head. Aroma is a little boozy, malty, not especially hoppy. A bit woody, smooth, good all around strong ale.", "Aroma - a touch of oak along with the malt? A touch of caramel. Hops are staying in the background. Some alcohol though not as prominent as I would expect given the ABV.\r\n\r\nAppearance- a fairly dark copper with very little head. Pretty clear. Mild to moderate carbonation.\r\n\r\nTaste- not as sweet as I would expect given the ABV. Some fairly distinct bitterness.\r\n\r\nPalate - medium to full body, finish has that wood flavor on it.\r\n\r\nOverall a good enjoyable beer. Not quite complex enough to be a great beer.", "Dark malts and caramel for aroma. Pretty bitter bite than increases and then starts to calm on the palate. Leaves a bitter taste in the back of your mouth. I would get it again although, at 11.2%, I wouldn't have too many ;)\n\n---Rated via Beer Buddy for iPhone", "Bitter brew shared by Blake J. at World of Beer in Baltimore, for his 1000th beer club selection. This was an awesome brew. Semi-sweet and hints of herbs with a hoppy element that lingers on the after-taste. The amber colored brew was ok.", "5 years old, from the cellar. Comparable to the Arrogant Bastard, but with more malt and less hops. Could be the cellaring.", "Nice deep red pour. Toffee, caramel, and nice toasted malt notes on the nose and palate.", "12/30/14. 2014 bomber. Not much to add to the other notes. Definitely a bit boozy and warm with deep hop and spice notes. \n\n---Rated via Beer Buddy for iPhone", "The aroma off this double bastard was of strong alcohol with notes of oak, smoke and whiskey barrels. It poured beautifully with an amazing dark red amber. There were strong notes of caramel, leather, whiskey, charred oak, and something sweet that I cannot describe. The finish was just as complex as the start, warm and with strong alcohol fumes.", "Pouring a deep and rich amber colour with a clear, sparkly body and a thin beige head that clings to the glass. The aroma is heavy and rich with loads of toffee and caramel malts atop surprisingly sweet and fruity aromas of orange peel and citrus. A bit of spice and bready malts pervade that aroma. The first sip is overly sweet and sugary with toffee and caramel malts, notes of nuts, pine and citrus hop notes and raisin. Towards the finish the fruit notes peter out leaving more hop emphasis with pine and grapefruit resin notes. Alot of biscuity and bready malts leave a rather heavy mouthfeel that comes across a bit oily and thick. The finish is dry and moderately astringent with a surprising smoothness. The alcohol is well hidden but for a slight warmth on the finish.", "Huge beer for sure, taste better as it warms. Drinks easy for 11+ abv but still get the alcohol. Worth a try but not something for the normal rotation. Take your time drinking this one.", "66cl. Bottle. 2013 Release. Bottled on 2013-10-08 \n\r\nPours dark amber with off white head. \n\r\nAroma caramel, toffee, pine, citrus, orange, brown sugar, roasted malts, dark and red fruits, bit of spice, biscuit. \n\r\nTaste caramel toffee loads of fruits sweet, piney citrus roasty bitter. \n\r\nMouthfeel oily feel, sticky, soft carbonation. \n\r\nThis is awesome, complex aroma and taste. Love it.", "22 FL OZ ($5.99) had the 2014 release, it was damn good. 11% and does not even feel a bit over 6.5%. great beer and will buy again", "Had on tap at the Grog. $6 for the full pint. Pours a murky rust reddish brown. Aromas of wet cardboard, grilled corn, strawberry concentrate, DME, flaked barley, mildew, unripe limes, and sweat. Taste the same with the addition of plastic-flavored hops, cabbage, stale orange juice. Extraordinarily bitter at bitter. Strangely fruit-forward, as well. Meh. Not for me.", "Bottle: 2010 vintage. A little older than four years. Beaming, semi-cloudy copper body with a lovely, frothy beige head. Nice carbonation, good sign. Aroma has a huge, sticky caramel & toffee profile. Some light earthiness, the hops are still alive a bit, it seems. Faint notes of chocolate truffle, toast, & pine oil. Flavor is like caramel coated hops. Still plenty of earthy, leafy bitterness but with the malt backbone of an elephant. Sticky sweet toffee, light cocoa powder, & a hint of metallic saltiness towards the finish. Lasting pine bitterness with some residual, sticky caramel that coats the palate. No signs of oxidation yet. Heavy, sticky body. Enjoyable, clearly it has held up pretty well for the last four years or so.", "Bomber. Wonderful dark fruit and caramel malt aroma with light alcohol notes as well as some grapefruit citrus hops. Pours dark amber with a thin light brown head and minimal lacing. Starts with sweet dark fruit and caramel. Finishes dry but smooth with just a touch of grapefruit citrus hoppiness. Excellent west coast barleywine!", "Poured into tulip a reddy dark Amber with Amber head that receded to sides of glass quickly. Limited lacing. Aroma was complex as was the taste. Grapefruit over malt with dark fruits some spice. Just a lot here, this is amazing. Alcohol is hidden mouthfeel is oily. Wonderful.", "22 ounce bottle into tulip glass; 2013 vintage, bottled on 9/16/2013. Pours slightly hazy deep ruby red color with a 2 finger dense and fluffy light khaki head with good retention, that reduces to a small cap that lingers. Nice spotty soapy lacing clings around the glass. Aromas of big grapefruit, orange zest, pineapple, pine, raisin, plum, caramel, toffee, toast, brown sugar, biscuit, light nuttiness, floral, grass, and floral/toasted earthiness. Damn nice aromas with good balance and complexity of citrus/pine hops and dark/bready malt notes; with great strength. Taste of big grapefruit, orange zest, pineapple, pine, raisin, plum, caramel, toffee, toast, brown sugar, biscuit, light nuttiness, floral, grass, and floral/toasted earthiness. Good amount of pine/grassy bitterness on the finish; with lingering notes of grapefruit, orange zest, pineapple, pine, raisin, plum, caramel, toffee, toast, brown sugar, biscuit, light nuttiness, and floral/toasted earthiness on the finish for a while. Fantastic complexity, robustness, and balance of citrus/pine hops and dark/bready malt flavors; with a great malt/bitterness balance and zero cloying flavors after the finish. Medium carbonation and medium-full bodied; with a smooth and moderately creamy/sticky mouthfeel that is nice. Alcohol is very well hidden with only a slight warming present after the finish. Overall this is an awesome strong ale style. All around great robustness, complexity, and balance of citrus/pine hops and dark/bready malt flavors; and very smooth to sip on for the big ABV. A highly enjoyable offering.", "Aroma of hops and some malty yeastiness. Pours a rich amber with a gorgeous foamy head. Taste of hops, bitter pine, dark fruits, malts, resin, etc. A huge beer with tons of complex flavours. \n\n(And although the Stone Rep in AB refused to disclose the IBUs for this, I’d guess between 80-95)! ;)", "650ml bottle pours black in color with a 2 finger white head that leaves some decent lacing on the glass. Aroma is dark fruits, chocolate and roasted grains. Taste is a dark fruit and chocolate malty sweetness with a grainy and dark fruity sweetness. This brew is much more complicated than I can describe here. Overall, this is an outstanding brew, full bodied with nice carbonation, well balanced and only for serious beer lovers out there.", "Bottle, body the color of new mahogany, skiff of foam, fades pretty quickly. Aroma is malty caramel, raisin, some spruce. Taste is sweet and sharp, malt and spruce and spice, orange/lychee, with citrus rind bitter. Palate is smooth and rich, not overly thick, with fine moderate carbonation.finish is bitter sweet, but leaving an almost astringent bitter taste that lingers too long to be pleasant. Guess I have to keep drinking it.", "A fantastic beer, so complex. The aroma is sweet and malty , the initial taste is a sweet brown ale, but then come a flood of hops to dry the finish, making this a double bastard of an easy drinking 11% beer.", "Draft. Brown with a big white head. Not much nose. Big full flavors of chocolate malts. Alcohol well hidden. Well made.", "Seems I’ve sort of moves away from the arrogant bastard flavor lately. Maybe because it’s cold? Very strong beer. It really tastes like arrogant basyard with more octane , but the base flavors aren’t much stronger to compensate for higher abv. Bitterness is strong though abd it actually is more potent but not better than normal ab", "Great malty aroma. Nice dark brown color. About 2 inch head. You can definitely taste the malt in your mouth. Bitter going doing and strong malt taste afterwards. Very strong. Little sips like drinking scotch. Very nice beer.", "Smells of malt and bubble gum, not bad. Good dark amber copper color with a little beige head and no lacing. Tastes sweet malt and bubble gum. A nice beer.", "Pours a dark copper color with some head retention and lacing. Tastes and smells like a sweet red. Kind of reminds me of fruit stripe gum. Quite a pleasant drink, but one that will knock you on your ass. Quite malty as well.", "This one is very hefty. Good notes of caramel and oak. Definitely a sipper. Was a little disappointed with this one.", "Pretty brown Orange with khaki head. Pine, fruit, wood. Malt, caramel, more wood and pine in taste. Slightly sweet and boozy. Nice bitter and floral finish. Good stuff.", "APPEARANCE - Orange with no head.\r\n\r\nAROMA/SCENT - Hoppy, piney. Not sweet.\r\n\r\nTASTE - Hoppy, dry, bitter. ABV well-hidden.\r\n\r\nMOUTHFEEL/PALATE/TEXTURE - Pleasant, dry, little carbonation.\r\n\r\nVALUE - Reasonable.\r\n\r\nOVERALL/DRINKABILITY - Great beer, almost chuggable.", "Beautiful dark amber hue make this beer look like some I will love. It has a strong malt aroma a big taste upfront which grows into a powerful rich lasting flavor. Not for the timid that is for sure. It leaves a taste on you tongue which won't let you forget about that next sip and near forces you to bring that glass to you lips or open that second bottle. \n\n---Rated via Beer Buddy for iPhone", "Mycket komplex och tät arom som nästan gör det svårt att identifiera komponenterna. Plommon i sherry, lätt citrusartad beska, torkade aprikoser, honungsmelon och över allting en flyktig alkohol.\r\nVacker bärnstensbrun färg och ett bra skum men med kort halveringstid och dåliga lämningar.\r\nÄven smaken är tät och komplex. Kraftig beska som balanserar de söta aromerna. Här finns tall, karamell, övermogen citron. Stor kropp och en trevligt livlig kolsyra.\r\nI eftersmaken finns en fudgeartad maltighet och så hänger en djup beska kvar riktigt länge. \r\nGediget helgjuten produkt.", "22oz bottle. Pours a dark amber color with a two finger off-white head that leaves thick lacing. The aroma is malt forward with sweet and bready malts, raisins, overripe orange, and booze. Taste is very smooth with caramel, bready malts, some alcohol heat, cherries, raisins, and figs, along with burnt toast and roasted malt. The boozy heat hides beneath the hop bitterness up front but slowly intensifies through the middle to the end. Finishes with a soft, slightly dry feel with lingering pine hop bitterness and lots of boozy heat.", "22 oz bottle. Aroma: boozy, woody, and very malty, with hints of toffee. Taste/Palate: thick, crisp, and very sweet; finishes with a long bitterness. Incredible and over-the-top hop/malt balance. Another perfect beer from Stone!", "650 ml bottle  Pours a clear mahogany with moderate head. Aromas of dark sweet fruit, toffee, and sweet malts. Flavors are same with a big dose of bitter dry fruity hops. Good but still over rated.\r\n\r\nThis rating replaces previous tap rating. Bottle is much better...", "On draft poured into a tulip glass..copper pour with fluffy white head..aroma of hops,citrus,caramel,pine..bitter,dry taste with caramel,citrus notes..boozy but top notch.", "Tap from Maltitude. Pours cloudy amber with white head. Aroma of floral hops. Flavor of bitter hops, caramel, and more hops. Bitter hoppy finish. Very tasty.", "Bottled 10/08/13. Pours a cloudy amber with a subtle off-white/tan head. The nose is a bit sour with a hint of ash. If you inhale through your mouth at the lip of the glass before you sip, there is a very hoppy floral nose. The flavor is unexpected .... a hoppy, smoked caramel .... A hop bite that carries through to a smokey, charcoal, caramel finish. Lovely. \n\nI would let this get closer to 55°, the flavors are much more pronounced ....\n\n---Rated via Beer Buddy for iPhone", "66 cl bottle @ home (2013 vintage). Pours clear reddish amber with an off-white head that leaves some lacing. Aroma and flavour are caramel, sweet malt, pine, and resin - with a slightly bitter finish.", "Draught. Malt forward, caramel, hops follow, piney and resiny, lots of alcohol. Mostly clear, reddish brown color, white head. Quite bitter, resinous flavor, some caramel malt character, lingering bitter finish. Bitter overpowers any malt complexity, meh. Good thing it’s high boost.", "650 ml bottle bought from Systembolaget, shared at home. Light hazy orange amber-reddish color with small to medium beige nice head. Aroma is malty, caramel, bready, fruity. Taste is sweet and light bitter, malty caramel and fruity again. Medium oily body with soft carbonation.", "33cl bottle from Bottledog London. Dark gold color. Medium head. Medium to high sweetness. High bitterness. Hoppy and malty aroma.", "Bottle. Color dark amber with medium white head. Aroma malt, caramel, hoppy, fruits. Taste sweet, hoppy, caramel, spicy.", "A bigger version of the little bro Arrogant Bastard....something for a beer wizards...but bigger...bigger malt, bigger hops, bigger aroma, more caramel...", "\"I’m a huge Stone fan, not a big fan of Arrogant Bastard, so I didn’t know what to expect from this one. Stronger, but smoother, than it’s little brother, and significantly better. Big hops and malt all around. Quite hoppy/bitter for a barleywine. thoroughly enjoyed several vintages at Stone.\"", "{retty killer big ass brew...loads of malts hops and so big. Every flavor imaginable. Balance on the big end...couldnt drink a ton...but It is a great brew", "Aroma: intense grain malts, heavy, ripe fruits, caramel, alcohol. Appearance: hazy, dark amber, small, beige head. Taste: light sweet. \r\nPalate: very sweet malts expanding, intense overripe fruit, alcohol, turning very bitter and slightly dry in the finish. Overall: very nice IIPA, excellent aroma. Pint at Stone Brewing, Escondido.", "Eh it’s okay. It’s a strong beer for sure and lives up to its name. All the things about not being worthy etc it’s not that tough. Aroma is syrupy sweetness. Lots and lots of malt. Like a ton. Not bad just don’t expect something else. The taste is alright. I heard from people it has a really subtle alcohol burn and that’s true. For how high ABV it is it definitely doesn’t show which is good. Realllllly bitter, and sweet. Some hopiness but definitely takes a backstage to the sweet malt. It’s not bad just in my opinion kind of average. I couldn’t really pick out something i really liked about it.", "Pours a hazy copper color. Caramel citrusy taste. Hoppy flavor. Thick on the palat. Low carbonation but the head retention is very good. Alcohol warmth is noticable but not overpowering.", "Mikon luona. Really thick, complex, roasted malty taste with well balanced drying aftertaste. Wonderful.", "Very hot in the alcohol, hurt palate a little, and somewhat sweet. other wise great brew great use of hops, so big of a brew so big. I did like it.", "From bomber. Pours a copper red with a big fluffy head and lots of lacing on the glass. Aroma is toffee and caramel and pine. Taste is the same, with a big malty sweetness and an even bigger hoppy pine bite. This is Stone, after all. This is like a big hoppy barleywine. Alcohol is present, but not as obvious as the ABV would lead you to believe. Bitter finish. A delightful BIG beer.", "had the 2012 at a bottle share. even that many years removed, was still too hot for me.", "Bottle at home. Sweet toffee and caramel, not as bitter as expected, juicy pine.", "Look: pours a dark copper color. Light tan/ off white head. Hazy with slightly large pieces floating in it. \nSmell: sweetness. Caramel. Alcohol. Oak. Toffee.\nTaste: slight bitterness on the back. Very sweet up front. Hot alcohol. Oak. Vanilla. Caramel and toffee.\nFeel: leaves a thick film on the mouth like an IPA. \nOverall: ok beer. Very hot alcohol. But still good. \nFirst drank: home 8/23/14", "Bottle from brewdog bar, Sheffield. Misty copper ale with no head. Figs and raisins, sweet treacle aroma. Taste is slightly sour tangy fruit with lingering bitterness. Quite prickly carbonation, lots of oil!", "0.65l bottle from 2d2dspuma. This is a deep red near cola brown looking one with a small beige fading head. On the nose this one has lots of sweet vanillaish wood, thick sticky caramel, lots of beefy smoky nuances - nor overpowering though just really nice. Lots and lots of flavor and it has this extremely smooth velvety feeling in the mouth. It’s not hard to identify the heating alcohol in this, but it’s never disturbing. Really okay and almost barreled. Subtle smoky tones from the start to the finish. Nutty snickers caramel, sweet vanilla and it’s just one of those that’s absolutely loaded with flavors and impressions. Highly enjoyable. 12.08.2014", "Bottle: Thanks Hackobock: Served in a shaker:\r\nMedium sized creamy head. Almost clear amber body.\r\nAroma is a delicious mix of hops, yeast, wood, toast, some fruits, some herbs deliciously balanced.\r\nFlavour has tones of bread, toast, bitters, malts, herbs, some caramel, dried leaves, hay/grass tints and some spice/alcohol.\r\nAftertaste is strong bitter with malts, some caramel, herbal toast, dried leaves and hay/grass.\r\nLow carbo, creamy mouthfeel, full bodied and a creamy sticky texture.\r\nTouch of alcohol, nonetheless great beer and quite an easy drinker for 11.2%ABV.", "I poured a 22oz bottle into a tulip glass. It was dated as a 2010 release and cost $6.99 ($0.32 per ounce).\r\n\n\n\r\nAppearance: An ugly rusty brown/brick red hue over a completely opaque body. Pours to a three-finger, ivory, frothy head which laces and retains very well.\r\n\n\n\r\nSmell: Extremely sweet aroma of confectionery flavors and some alcohol.\r\n\n\n\r\nTaste: I’ve never been a big fan of Stone’s “Bastard” series, as I tend to find them too abrasive for their own good (except Oaked Arrogant Bastard, which is perfectly balanced). Double Bastard tends to be the beefiest of them all, not surprisingly. I set this bottle aside in the basement nearly four years ago and had forgotten about until recently. With some age on it, this beer has become quite different from the hop bomb I remember. It’s very sweet, but not cloying, and is now well-balanced since the hops have faded.\r\n\n\n\r\nIf I were drinking this blind I could confuse it for a strong English-style barleywine. Huge confectionery notes are present right off the rip: toffee, caramel, peanut brittle, and butterscotch. Additional complexity through the middle with notes of red and black cherries. The hops still maintain some bitterness, but are not nearly as dry and astringent as they are fresh. Slight earthy/smoky/piney flavors through the middle with just a touch of bitterness. It finishes as it starts, but with some warming (and complementary) alcohol flavor and sensation. Overall, it’s a delectable beer, though not quite a mind-blower.\r\n\n\n\r\nDrinkability: One of the reasons I’m not a fan of fresh Double Bastard is because it’s difficult to drink it in anything bigger than a tiny sip. With four years of age under its belt, it’s a different world. The mouthfeel is thick, calm, soft and smooth. The alcohol is subtle and leaves a gentle warming sensation. There’s a residual aftertaste of malty sweetness and minor dry bitterness, but it’s easily tolerable. Even at 11.2% ABV, this is no longer a beastly brew and I can handle the entire 22oz bomber myself.", "Glass, 4-ounce, bottle, during the Mondial de la bière, savoured on June 11 2014; eye: mahogany, clear, no effervescence, tiny ring of beige head, light lacing; nose: malt, resinous hops, caramel, fruity, orange; mouth: malt, resinous hops, caramel, astringency, fruity, orange, finale in malt with good presence of hops, full body, below-average carbonation, mildly bitter, lightly sweet, lightly harsh texture; overall: fine\r\n\r\nFRANÇAIS\r\n\r\nVerre, 4 onces, bouteille, lors du Mondial de la bière, savourée le 11 juin 2014; œil : acajou, limpide, pas d’effervescence, petit anneau de mousse beige, légère dentelle; nez : malt, houblon résineux, caramel, fruitée, orange; bouche : malt, houblon résineux, caramel, astringence, fruitée, orange, finale en malt avec bonne présence de houblon, corsée, carbonatation sous la moyenne, moyennement amère, légèrement sucrée, texture légèrement rugueuse; en résumé : bien", "Bottle date 10-06-2013. Craft beer shit talk on the back of the bottle is about as long as the bible, so tldr that either. Clear chestnut brown with a medium sized diminishing beige head. Nuts, caramel, booze, brown sugar, sherry, over ripe banana, grapefruit astringency. Full body, oily texture, medium carbonation, medium/heavy sweet and bitter. Hot finish. Rough and clumsy. Not very pleasant and no sense in paying for this.", "At Justin’s house warming party. Pours murky brown with white lacing. Aroma is cardboard, nice molasis figs, on the complex side. Taste, is as expected. It’s a very nice barleywine, just not my style.", "Bottle from Brewdog, Sheffield. Big, boozy, chewy, sweet, toffee malt. Overripe orange. Light, spicy herb. Taste is orange sweet. Spicy dry. Burnt bitterness. Big, chewy toffee palate. Finishes big. With added bigness.", "Lovely ale - properly layered brilliance best to savour on a sunny afternoon with a BBQ. Rich initial caramel malty texture, not too much alcohol for the strength but it is there hiding, slightly smokey with a with a small hop kick. Just Devine!", "2013 Bottling. Another night, another Rocky Patel Edge Lite and now a Double AB added to the equation. Pour is a thick dark amber with a thin ring of suds that stick to the goblet as I sip. Malt and slight orange peel aroma - nice! Alcohol not as forward as one would expect for an 11.2. Lingering bitter finish. Just reward after an out-n-back overnight backack/camping trip. Will be adding three to cellaring stock for annual reviews. Yum!", "2013 bottling\r\nAroma: Thick dried fruit, plums, raisins, slight caramel.\r\nAppearance: Deep cherry amber. Very little head. Tiny bubbled lacing that’s edging towards brandy.\r\nTaste: Dried fruits, lots of sweetness to go with the alcohol, some piney hops, caramel. Every sip seems to reveal another layer. Cherries slipping into the picture now.\r\nPalate: Medium/full body, carbonation is more lively in the mouth than the glass. Starts off syrupy/stick and then slightly dry finish that bitters.\r\nOverall: This is a world tour of flavor and aroma. It really hides the abv well. I may prefer the oaked version for a more regular occasion, but this really knocks my socks off. Outstanding.", "This is such a badass beer. To me this tastes pretty much the same as Arrogant Bastard, just with more alcohol and perhaps a bit more character. I appreciate its complexity and its brazen character, but I can’t say I really enjoy drinking it. But at the same time hell yeah I’d drink it again.", "Stone’s Bastard releases never fail to blow my mind. For me, Double Bastard proved to be every bit as enjoyable as the other releases that I’ve, well, enjoyed (Arrogant Bastard and Oaked Arrogant Bastard). The malty caramel note that this brew starts off with is sublime. The spicy, herbal hop kick that comes after that is even better. Did I say better than sublime? I suppose that doesn’t make much sense. Yet, I do indeed consider Double Bastard to be twice as good as Arrogant Bastard. Admittedly, that’s a paradox. I consider Arrogant Bastard to be perfect. How can something be two times more perfect? Exactly. Infinity times two still equals infinity. That’s the nature of the Bastard series. Every beer is better than the last... even though the last one was perfect. Shit, maybe I shouldn’t drink so much before I post these reviews... Anyway, Double Bastard has a gorgeous amber-red color with a lovely off-white head. Aroma has boozy sweetness, dark fruits, and pungent hops. My bomber was bottled on 9/01/2013 which meant I was a mere 2 months and 1 day away from a year-old bottle. Oh well. The hops were still plenty aggressive but a bit refined. One thing’s for damn sure: the body was thick and the mouthfeel was warming in the best possible way. Okay, so I guess that was actually two things. Sue me. At the end of my tasting, I couldn’t find any gripes with this beer. I also fully enjoyed reading the bottle notes. Any brewery that uses the word \"masturbatory\" when talking about their ale is okay by me. Double Bastard made my night by giving me balls-out flavor with a healthy dose of class. I wouldn’t expect anything less than that from Stone.", "Bottle at Pikkulintu, Helsinki. Originally rated 30122011. Colour is cloudy brown with small white head. Aromas and flavours: Fruits, sweetness, caramel and malts.", "Pours a deep amber color with off-white head. Caramel malts, floral notes, and some citrus on the nose; follows onto the palate. Finishes with more malt.", "His one is really easy to drink. Not very hoppy and a rad but malty. Pours reddish in cor with a white head. Had at haymarket. \n\n---Rated via Beer Buddy for iPhone", "Bottled. Pours hazy, amber with a small lacing, tan head. Aroma of caramel, citrus, floral notes and wood. Sweet flavor that ends slightly more dry and nice bitter. Full to medium bodied, oily texture and soft carbonation. An excellent brew.", "Transfer from BA reviewed on 6-3-12- \r\nPoured from 22 oz bomber into snifter\r\n\r\nAppearance –Pours a hazy brown mahogany color with a small off white head. The head fades fast to leave a very persistent white foam film on the top of the brew. \r\n\r\nSmell – A bready base aroma is mixed with huge hop aromas. There are big smells of bitter-resinous pine and citrus hop with other aromas of earthy nature. Mixed with all these are lighter fruit aromas and a good bit of alcohol aroma as well; rounding out the aroma profile well.\r\n\r\nTaste – Throughout the taste there is a massive bready malt flavor. There is a light amount of caramel and light fruit sweetness at first mixed with a citrus hop flavor. The hop flavors at the beginning, while average for an IPA, then really start to gain strength. Citrus and pine hops start getting strong and start to bring some bitterness. The caramel sweetness is largely lost, but the citrus is still there. While the pine and citrus get stronger, they get huge and other hop flavors of a resinous earthy taste come to the tongue. All the hop flavors mix quite well and take the taste to the end, where they are greeted with a warming and lightly burning alcohol flavor, which oddly in some ways complements the hop quite well.\r\n\r\nMouthfeel –The body of the beer is creamy and chewy with all those flavors really coating the mouth in all the wonderful flavors. The lower carbonation only accentuates the creaminess with it also accentuating the hop and booze burn as well.\r\n\r\nOverall – Very heavy and tasty. Its mouthfeel is fantastic and it has a nice blend of hop and booze taste. A great brew for sipping nice and slow.", "22 oz. bottle aged two years. Deep amber color with still a nice level of carbonation. Aroma still shows a good hop presence, floral and fruit. Malt is here for sure as well, caramel and thick toffee.\n\n\r\nThe flavor still displays the hop presence as well, the signature Stone pine hop shows in the finish of the beer with the toffee, caramel and hints of dough. The ABV has mellowed out a bit and shows just a slight warming after the sip. With the age, the flavor has the malt taking over with the hops now complimenting the beer with a nice balance. Nice drink.", "Good beer. Very malty. Strong. Thick head with a great brown color. Starts and ends strong. Like a loaf of bead. At 11.2% it gets your attention.\n\n---Rated via Beer Buddy for iPhone", "Pours a dark red/brown body with a medium head. Aroma of barrels and a rich taste.\n\n---Rated via Beer Buddy for iPhone", "10oz draft. Pours very thick with a thick lasting white head. Pours a murky reddish brown color. Aromas of sweet caramel, vanilla, and citrus. Bold flavors of pine, syrup, sticky hops , and raisins. Mouthfeel is very syrupy and thick . Finishes with a dry sweet hopped profile.", "Slightly hazy glowing amber brown with a light ring of head. Very sweet sticky hop smell. A big semi sweet hop bitter syrup taste. With a bitter dry finish. That mild bitter last long after the sip is gone.", "DRY BEER. I had a PBR after drinking just one of these and I couldn’t taste anything at all. Not for the weak.", "Shared 2011 bomber, poured to snifters showing a hazed to cloudy, copper color, with an off white/light tan layer of head foam, and spots & streaks of lacing. The nose was dank, with a bit of earthiness & greenery, dried fruit, and sweet maltiness. The taste was boozy, and quite bitter in it’s earthy & rind-like way, but mellowed just a bit by the complementary malt sweetness. Medium+ bodied, and quite Barleywine-ish.  Recently shared a current 2015 bomber, and showed a little more clarity in the appearance, with similar aroma notes, moderate carbonation, and the same, pleasantly even tempered, earthy & rind-like bitterness that lingered well with the alcohol warmth. +.1", "Draft is 2006 vintage. Pours a hazy copper brown with sponge lacing. Aroma is earthy, with hoppy oxidation. A certain mild aged hop complexity. Flavor is \"brandy sauce\" with a slight note of rust, suggesting faded hops. I will revisit this review with a fresh bottle. From Stone event at Brickskeller 6/1/09.", "The aroma of this is pungent of oak and whiskey barrels the head is beautiful and the ale itself is dark amber red and the taste is strong and a balanced bitterness with its hop blast also it has strong caramel,oak and leather with a strong ale taste and surprisingly sweet by far my favorite brew it?s a very intense ale i feel like i should be wearing medieval knight armor while drinking it. Definitely should have this with bbq/smoked meats maybe some good pretzels definitely awesome with a grilled burger.", "14th March 2014, large bottle at a barbeque in Newport Beach, bought and took the bottle myself and didn’t share it!\r\n\r\nAggressive little bugger isn’t it. Hops full on in the mouth, yet it has a sweeter maltier nose: bitter in flavour with a definite Barley wine undertone. A fine beer in all aspects.", "Bomber:\r\nPours reddish-brown, cloudy with a creamy tan head.\r\nCaramel, coconut aroma.\r\nFlavour is syrupy..bitter fruit...\r\nVery thickly malted, caramel, woody bitter.\r\nProminent alcohol burn at the back of the throat.\r\nA bit rough around the edges.", "pours amber with a thick tan head. aroma is malty sweet. burnt sugars and tropical fruit. flavor is sweet, followed quickly by burst of hops. mouthfeel is syrupy. huge presence of alcohol. finish is very dry. big, bold and beautiful. great beer.", "This brew is for those who thought Stone couldn’t improve on their Arrogant Bastard Ale. They can, and they did.  This is an absolutely superb beer (by any reckoning).", "Got a new TV today. Nothing fancy but when you've eaten ground chuck for almost a decade a flat iron tastes like manna from Heaven.", "Flaska hemma. Bärnstensfärgad och lagom grumligt trögflytande med en maltighet och beska. Mycket angenäm liten sak.\n\n---Rated via Beer Buddy for iPhone", "Hazy dark amber pour on draft at Republic. Thick off white head. Malty nose. Big sweet taste, lots of hops and a big bitterness in the finish. Really nice. Big and kick ass for sure.", "Bottle from systembolaget enjoyed at home. Pours dark ruby red with a nice head that dissapear quickly. Smells heavy. Tastes heavy malty, heavy alcohol balanced bitter.", "Tap. Bold and flavorful malt front with a noticeable hop finish that is not overly bitter. Spicy and strong flavor.", "Almost like an unsweetened barleywine. Strong malt flavor. Some bitterness. Strong alcohol heat. Good.", "2009 Bomber - Maple ruby pour with off white head. Nose and taste are malt bombs with plenty of dark fruit, sweet malt, and raisins. Some residual hop bitterness present. This stuff ages real well as evidenced by this 5 year old bottle. If it were a little sweeter I would have thought it was a BW. Very nice. \n\n---Rated via Beer Buddy for iPhone", "Ah, Stone descriptions: the Steely Dan liner notes of beer.\n\nTap. Orangish amber with a small pale beige head that lasts well. Aroma of very ripe apricots, vanilla, mandarins, grapefruit. Just short of syrupy. Sweet hay and apricot, grapefruit, pine, kumquat, a little pepper. Main finish is brief, then grapefruit and pine linger. Compressed flavours but punchy hops - sweetness doesn’t really get in the way. Unsubtle but good.", "Bottle. Dark clear ruby with a 1 finger off white head. Aroma is melted Jolly Rancher, burnt caramel and slightly plasticky. Taste follows suit but adds some floral hops and slight alcohol burn. Caramel/butterscotch takes center stage. Big sticky mouthfeel. Certainly big.", "Deep red-Brown color with a nice tan head. Aroma is citrus, pine, caramel. You can taste the alcohol from the first sip. Also has a citrusi, hoppy flavor with a sweet hint. Did not like it because Of the alcohol taste.\n\n---Rated via Beer Buddy for iPhone", "Oh! What a knockout. Sturdy body, heaps of malt and hops and flavor, deep steady aroma underlined with enough alcohol to give justice to every nuance. Warming, cherishing, smooth yet harsh, rich. Yes - rich. If there is any flaw it should perhaps have been a tine bit less sweet. One of the best beers I’ve made the aquintance with.", "This is a hell of a beer. It has a great warming effect without being boozy. Wonderful bitter after taste makes you crave more.", "@ Havregatan. Flaska från Systembolaget (94:-).\nFruktig och humlig, ganska söt, karamell, alkoholvärmande, medelfyllig till fyllig.\nAvslutningen är fruktig och ganska torr med en vis alkoholvärme.\n\n@ Havregatan 20210224. Bottle (650 ml) from Systembolaget. [ Vintage 2015 ]\nMalty, fruity and caramely with dried fruits, oak, nuts and toffee, sweet, medium body with an oily texture.\nThe finish is dry and bitter with alcoholic notes.\n9 3 9 4  17", "Pours a ruby color with a off white head. The aroma is sweet and full of fruits, biscuit, earth and sugar. And the flavors really hits me, pine, grapefruit, caramel malts and raisins.", "Kaatuu lasiin mahonginruskeana ja valoa läpäisevänä, vaahdon ollessa keskikokoinen. Hajussa on hyvin vahvasti karamellia, jota tukemassa humaloinnin havuisuus, sitrus ja ruoho. Alla on vielä hieman vohvelimaisuutta. Todella tuhdissa maussa on vahvimmin jälleen karamellista mallasta, jota tukee puu, sitrus ja maamaisuus sekä lievä kukkaisuus. Suutuntuma on täysin katkeroiden hallitsema, taittuen jopa kitkerän puolelle. Olut kuivattaa suuta, kuten odotettuakin, vaikka maku tuntuu alkuun hyvin makealta. En olisi ikinä uskonut, että näin vahvalla mallasrungolla varustetulla oluella humalointia voisi olla liikaa, mutta nyt se tapahtui. Omasta mielestä tämä oli pahasti epätasapainossa ja sellainen nautiskeltavuus hävisi, mitä itse toivon noin 11% oluelta. Huonoin Stonen tuotos toistaiseksi, vaikka saikin ihan OK pisteet.", "Amazing brew. Aroma is surprisingly very sweet. Drinking straight from the deuce-deuce so the bottle looks nice. Flavorful with a very bitter finish. Nice!", "Ap: Quite clear, red/ruby, white/yellow head.\r\nAr: Just amazing. \"Dat malt\"...tons of caramel, toffee, some dark fruit, some pine, some alcohol as it gets warmer.\r\nT; Massive toffee, lovely high bitterness. \r\nO: Really nice brew!", "Bottle 9-16-13\nAmazing raisiny brown sugar aroma. Thick mouthfeel with a hoppy finish. Phenomenal beer that tastes like a well-balanced barleywine\n\n---Rated via Beer Buddy for iPhone", "A slightly hazy ruby color with a small amount of white head that sticks around the rim. Smells of sweet honey, malt, honey biscuit, a little pine. A nice smooth sweet taste, honey biscuit, a mild bitter, good mesh of tastes. A good representation of the style. \n\n---Rated via Beer Buddy for iPhone", "Bottle from drinkstore\n\r\nDark amber with beige fluff head and punch of pine on the nose. Full bodied, heavy, sticky, resinous toffee, warming boozy finish.", "22oz bottle poured into a Stone specialty IPA glass (a hybrid between a flute and snifter). Where to start with the nose on this one ... well, I guess, at the start. The first aromas I picked up were that of vanilla and caramel primarily. After a little bit, some dark berry aromas start coming through followed shortly thereafter by a hint of nuts, figs, and plums. There’s also some licorice tucked away in there. The next round of aromas had a bit of a musty and damp smell to it, but it was also accompanied by a hint of pine, wood, and honey. By the end of the drink, I was also picking up citrus, cuacao, as well as banana & clove notes. It pours a clear honey orange color with a thick, beige, sudsy head that’s in no rush to recede. A healthy, rocky lacing is left behind on the glass. A medium-high bitter (fairly moderate by Stone standards) combines with a medium malty sweetness. This full bodied beer is creamy going down; aided by an abundant, yet mellow and soft carbonation. The malty front end is a toasted caramel and roasted nut flavor with some hints of dark, meaty fruits (figs / plums). Mid mid drink, this also takes on a woodsy quality as well. Notes of pine, resin, and citrus combine for a full, but mellow bitter finish with a nice touch of bourbon-caramel alcohol warmth; it a mildly dry finish  The aftertaste left behind is a balanced blend of smokey caramel, grapefruit, and resin with a touch of licorice.", "From the giant bottle! Poured into a shaker. Ruby colored with a tan head. Aroma is pretty much all malt with a little bit of earthiness. Flavor starts off malt forward with sweeter notes like a red, but finishes with some earthy and piney hop notes. Fairly creamy and smooth for the ABV. Overall this reads like a nicely balanced strong red ale.", "Poured from the 3l 2013 release. Very creamy thick head. Aroma has a nice balance of malty and hoppy. The malt character is biscuit y. It tastes like red malt s were used. The hops are a nice blend of slightly citrus but mostly dank and bitter! It’s bitter and I love it!", "A great beer, considering how high in alcohol it has, still taste lots of hop bitterness and malty. The kind of beer you bring out when you have wine drinkers over, who think they know a lot about wine, except you may not want to share it.", "Aroma is hops, fruits, caramel. Flavour is moderate to heavy sweet, bitter, caramel and sweet. Very nice.", "Appearance: Clear copper/ruby with finger thick ivory head.\r\nAroma: Pine, resinous, liquorice, dried fig, plum, woody, spiritous, musky, grapefruit note and treacle/caramel.\r\nTaste: Medium/high bitterness, medium sweetness and low/medium sourness.\r\nPalate: Thick grainy texture, medium body, average carbonation, astringent lingering bitterness follows an initial sweetness. The finish is fruity, spiritous, liquorice, burnt caramel and has alcohol warmth.\r\nComments: Very tasty and glass lace. 2012 release.", "2011 edition. From notes. Big beer, sweet fruit, plums, cherries, caramel. Lots of hops, but strangely does note destroy my palate, just kidding. Gotta love the DB.", "Backlog, 2011. Caramel, syrup, brown sugar and raisins. The alcohol comes through together with some dried fruits and a long afternote of sweet-soaked hops.", "maltig, karamell och nödig ton och tydlig humlebeska. Alkoholstinn så man får ta det lilla lugna. En alldeles för stor flaska, 25 cl hade räckt!", "A kind of strong alcohol note and warm aroma of dried fruits. Deeply burnt orange/red appearance with off-white lacing.\r\nVery sweet and bitter taste and a very long-lasting hop bite. Noticing the 11.2%. Leaves an oily palate. Great beer but such a bastard!", "Pours a unique reddish brown color with some sediment. Has more head than I was expecting for 11.2% ABV, but it recedes quickly. Great looking beer. Smells strongly of alcohol, more of a sweet stout or barleywine smell than an ale. The aroma and appearance are near opposites of one another. Taste is hops up front, alcohol in the finish - that’s it. Not much of a malt presence that I could detect. Mouthfeel was fairly smooth for such a strong beer, but the aftertaste is way too boozy. You couldn’t eat anything with this beer; it would dominate the taste of any food. I was hoping for something more complex. I’m a big Stone fan, but I would recommend just about any of their IPA’s or stouts over this one. This beer is good for getting drunk (which does have it’s place), not for savoring.", "2011 bottle pour..medium caramel color with decent amount of carbonation..nose is controlled by sweet malt..molasses..brown sugar..mouthfeel starts out fairly medium bodied with just an ok mouthfeel that has traces of teriyaki-spiked soy crossed with maple syrup..kind of a lot going on here..lingering boozy heat comes through at the end..", "650 ml bottle. Copper color with off white head. Aroma sweet, raisins, marmalade, toffeee and caramel. Taste is very boozy, caramel, pepper, dates, dried fruit but the alcohol is overpowering. Way too boozy", "Looks like a beer smells like a beer, tastes like Kestrel. Awful in everyway, and even worse for pretending to be a beer.", "Flaska från @Peter_L. Mörk Bärnstensfärgad med beige-rött skum. Doftar mörk sirap och vörtbröd. Stark smak av malt och mörk(?) humle. Väl dold alkohol. Lite för kraftig för mig.", "Mörk bärnstensfärgad, Krona som ligger kvar länge. Doftar söt blommigt med lite godis i, Smaken har en perfekt blandning av sött och beskt. lång eftersmak,", "0,65l bottle from the flagship Alko. Pours murky dark amber with a low head. Aroma is malts, dark fruits, hops and alcohol. Flavor is malts, fruits, alcohol and plenty of hops. Pretty good stuff.", ".65l bottle from Alko Flag ship\nPours murky amber with medium, stiff off-white head. Aroma is alcohol, sweetish, dark malts, fruits, some nuts, caramel. Flavor is malts, alcohol, nuts, syrup, dry hops. Nice dry and hoppy palate. Swell!", "Bold and flavorful malt front with a smokey and noticeable hop finish that is not overly bitter but just right... Truly great beer!\n\n---Rated via Beer Buddy for iPhone", "Slight retention with good lacing. Smells of molasses and brown sugar. Tastes of brown sugar, vanilla and hops. Medium bitter finish. \n\n---Rated via Beer Buddy for iPhone", "This vicious brew punched me in the mouth and offered no apologies. Appearance is amber in color, bordering on dark brown. Whatever head there was quickly dissipated and left off white lacing on the sides of the glass as it was carefully consumed. It’s significantly more aggressive than say it’s more timid associate (Arrogant Bastard), thanks to the elevated alcohol content. Weighing in at a healthy 11.2 percent it could be used in a pinch to power lawn equipment or remove rust. Though the intense flavor and backdrop does an adequate job disguising the elevated ABV. In my opinion the Double Bastard seems to have ironed out all the perceived shortcomings of Arrogant Bastard Ale however insignificant and delusional as they may be. The taste is well balanced for something as visceral as it is. The taste lies somewhere between being to hoppy and being overly malty. Flavors are reminiscent of roast caramel, heavy malts and rich aged leather, all accompanied by a steady backbeat of bitter and aromatic hops. As far as I’m concerned Stone can do no wrong. This is a tasty beer meant to be enjoyed on a crisp winter evening accompanied by the warm harmony of a fire… or as a sleep aid. All joking aside, it’s a very good beer.", "Appearance: Hazy amber color with a off white head. Ok lacing.\nAroma: Sweet malty, a bit hoppy and fruity.\nPalate: Medium to full body. Ok bitterness and a bit sweet. Soft to average carbonation.\nTaste: Malt and dried fruit syrup.\nOverall impression: Powerful tasty evening sipper.\nPersonal stats: Bottle from Systembolaget in Uddevalla, Sweden.", "Pours a deep amber with a little off-white head and average lacing. Aroma is sweet with hints of dark fruits, toffee, vanilla, oak and a little brown sugar. Taste follows the nose with a mixture of everything from the aroma initially but then the hops try to shine through but it is a futile attempt. The malt is running the show here but that is to be expected with such a high abv. Medium to full bodied with low to moderate carbonation and a somewhat dry finish. Alcohol is noticeable but not in an off putting way. Having said that, be careful because this beer packs one hell of a punch. Next on the agenda is a growler of Stone’s Espresso Imperial Russian Stout so my liver is going to take a beating.", "Pours a clear caramel with a slightly tan head. Aroma is a big sweet malty. Booze, dark fruits. Taste is on the sweet side. Raisins, syrup. Medium-full body and low carbonation. Syrupy texture. Overall a huge beer. Best shared. Cheers!", "A pretty dark amber beer with a foamy white head. Smells of caramel and hops. This is a very intense beer, with an overpowering caramel flavor, almost like burnt caramel, with a syrupy feel. The bitterness starts light, but then quickly grows stronger. Like Stone’s Ruination IPA, I found this a bit too much, but at the same time I really enjoyed sipping this over a two hour period. Not for the faint of heart, that’s for sure.", "rusty amber color with a few tan bubbles; smells like whiskey, raisins, toffee, leather.... Nice alcohol warmth blending with intense caramel, vanilla, dark fruit and toasty bitterness; lively carbonation, full flavored with just a bit of syrupy mouthfeel. Brash bastard.", "640mL bottle bottled on 10/18/13\r\nDeep copper body, holds a dense off-white head.\r\nSerious aroma; substantially woody/piney hop presence, cooked citrus, dried fruits, rich grainy malts and caramels with a spicy alcohol note.\r\nBig thick oily palate, medium carbonation, seriously long palate.\r\nA brutal assault on the palate follows... \r\n\r\nLots of woody hop spice, lots of caramel malts, lots of bitterness, lots of alcohol.\r\nLacks subtlety, alcohol on finish is a bit too obvious and warm, probably the lesser of their big name beers...still good though!", "This beer (2013) doesn’t hide the alcohol but that isn’t a big point. It looks great and tastes even better. The aroma is hard to pin down as the alcohol kinda masks the hops a did and you get thick bready malts. So far so good. The taste is earthy hops and beautiful candied caramelized toffee and a roasty nuttiness. along with a good doses of hops. Delicious beer. well done. (again)", "22oz bottle dated 9-26-2013, just over 4 months old, aged at cellar temp as instructed by the bottle. Pours a clear reddish amber with lasting foamy head and great lacing. Aroma is ripe fruits, candy sweet malts, earthy, cherries, and cheesecake. Taste is very sweet and malt forward for a few seconds until the hops come around and balance it out. Hops and alcohol burn mildly in the end. Ends bitter and dry. I have been burned by over-aged beers that turn into malt bombs and this is leaning towards that side of the taste spectrum. I suspect fresh this would be much better. Alcohol is appropriately evident for the ABV, with a mild burn and taste.", "22 oz bottled over 4 months ago from Evergreen Discount into my NBB globe glass. Dark amber-reddish and hazy appearance with a large, light tan head, slowly diminishing, moderate lacing. Aroma of alcohol, caramel, toffee, pine, earth, bitter hops, toasted malts and light fruit. Similar flavor, strong hop bitterness, medium malt sweetness and lots of alcohol. Pretty full body with a dry feel and a boozy, lingering, bitter finish. Pretty good, a little too much alcohol coming through.", "Bottle shared with a friend. Color: nice clear amber beer with small carbonation and medium white foam. Smell: hoppy explosion and domination. Floral and herbal nose with herbs and grass. Taste: oily sensation on mouth, with hoppy explosion with amazing bitterness. Really tasty beer with good bitterness expression. Aftertaste: strong bitterness with a dry sensation.", "...alright, I’ve drank this beer for years and for some reason I never rated it. Had it on tap in California. pours a dark red to brown nice foamy head. Nose is insanely bitter, almost astringent with huge pine oil bread. Taste is just waves of assault. IBUs to the limits, boozy, bitter, bread, pine, citrus finish.", "A wonderful aroma of caramel malts. It has a deep amber color with a light tan head. The taste of caramel, with cherry notes and a pleasant malt kicker to the palate. It has a special blend on malts that I could drink all day long. It is well balanced.", "Light burgundy with thin head. Pungent malts and spices on the nose. Profusion of flavors, cherries, prunes, candied citrus rind, cinnamon, very boozy followed by very dry and insistent hopping .After taste just keeps on going. Will probably be tasting this in the morning.\n\n---Rated via Beer Buddy for iPhone", "pours an opaqque bright ruby with a medium off white head...nice lacing. aroma has fruity maltiness and earthy hop notes. flavor is very earthy and bitter...almost medicinal...very resinous and piney. mouthfeel is medium and silky with a very dry resinous piney/earthy bitter finish. i can see the allure but i find this too bitter to be enjoyable for an entire glass.", "Truly great. Strong hop aroma and sweet malt background, maybe a little spice. Dark amber color with a medium head that dissipates quickly. Decent weight and the carbonation held up nicely as this was the 2011 edition. Full of flavor as it seems very close to an imperial IPA but with a fuller malt presence. I also detected a fruit essence on the back end, maybe tropical fruit from the hops. A truly fine beer.", "I had this at Global Brew. Pours reddish brown with a white head. Taste sweet, pine, hoppy. I thought this was good. I would drink this again.\n\n---Rated via Beer Buddy for iPhone", "Elite in every way. Straddles that perfect middle ground between a maltier Imperial IPA and a hoppier Barley Wine. Age-worthiness accentuated by a pinch of yeast that grows over the years. Beyond criticism.", "22oz bomber poured into a pint glass. Appearance is clear, dark amber with a modest two-finger cream-colored head that settles to a thin ring. Some lacing, which was surprising considering the ABV. Aroma suggests barleywine with lots of sweet caramel, brown sugar, alcohol, pine, cherries, and orange peel. Taste is a two-pronged all-out assault from sweetness and bitterness. Lots of caramel sweetness with dried fruit and orange. Bitterness features pine and floral notes. Alcohol is prominent, too, but complimentary not derailing. Full body, sticky, chewy texture, softer carbonation, bitter and warming on the finish, plus drier than expected for a high gravity beer.", "On tap at fatheads. Pours a medium copper amber with thin light tan head. Smell is hoppy, with a little caramel. Taste is a lot more hoppy than I thought it would be, some sweet malts on finish. Really drinkable for 11%. On tap is definitely better than bottle. A great hoppy strong ale to judge others by.", "Draft at BrewDog, Shepherd’s Bush on 7 December 2013. Poured a very dark brown with a thin, beige head. Aroma of brown sugar, grassy hop and some iodine. Pine needle hop bitterness hits the tongue with some straw and dry grain. Finish is very dry hop resin balanced with dark fruit sweetness and oaky hints.", "On tap at Special Brews, pours a slightly hazy copper color with a thick tan head that leaves good lacing. Smells of pine, citrus, and dark fruit. Tastes of the same things in the smell. Mouthfeel is slick and oily and well carbonated with a dry finish. This is a great strong ale. Good flavor with a good amount of sweetness. Better on tap then out of the bottle.", "Bottle from 16 Tons Taphouse via Jakeb, 2012 vintage. Pours a cloudy brownish orange. Little to no head, aroma big and broad, full of candi sugar. Body full and thick, still very hot, finishes hoppy and strong, lots of malt.", "I thought this was phenomenal. Aromas are sweet caramel malts, melon, bubblegum, and resin. This beer tastes like someone dipped a pine cone into honey. So good. Lacerative mofo indeed.", "Bottle to tulip\r\nSmells of spruce, pepper, pine, and booziness.\r\nSlightly reddish amber and a tan head.\r\nBitter, orange, grapefruit, and black pepper.\r\nMouthfeel is silky and oily, with an alcohol burn.", "Bottle - Malty caramel sweetness with a bit of earthy hops. Clear copper with a decent white head. Bitter sweet malty notes, more like an american barley wine. Another nice showing.", "Bottle. Red copper pour. Aroma - sweet hoppy american barley wine smell a cross between a double IPA and a barley wine. Taste - hoppy, sweet, lots of caramel malt character with a bitter IPA finish. Good stuff.", "From a bottle. Very strong and very bitter beer. There’s quite an amount of malty sweetness there too. Maybe a bit too much.", "Bomber from world beers. Pours dark amber. Thin white head. Scent of malt and caramel. Smells pretty boozy. Surprisingly hoppy. Would probably be even better if i give it 6 months. Still pretty tasty.", "I am not in love with Stone’s Brew. Often than not they can have too much hop when it would be best to play up the floral aspects. Their smoked porter was too literal and therefore lost me. I did enjoy their Suede. It is an America Strong Ale. Foamy head. Dark amber hue. The spices seem to be lost in the boziness of it. And the dim body does nothing to support the overwhelming taste of alcohol. It seems like with their beers they try way too hard to get a point across with a hammer when a more approachable taste would serve better. Sometimes the overstated brew is, overstated...", "Not sure that this really deserves the 100 rating. It’s very tasty, with big caramel bread malt flavor, but unlike most other Stone brews, there is not much hops in evidence. The high alcohol content is evident in the mouth feel!", "Dark amber color with a nice head. Great bitter flavor of hoppiness from heaven! Love the aftertaste of yellow grapefruit but without the fruitiness of many west coast IPAs. If you're a hop fan this is definitely a must for your list. \n\n---Rated via Beer Buddy for iPhone", "Pours into snifter with reddish brown hue. Sugared candied pineapples, apples and raisins in the nose. Complex flavors and really a lot going on as this opens up. I taste some prunes, pineapples, sour apples, caramel, brown sugar… Slight alcohol burn and oily on the finish. Immensely sweet and bitter. Really a hell of a beer.", "bomber from hyvee, aroma is of dead fruit, and raisen, alcohol, some mocha taste with strong alcohol, awesome beer overall", "This is a very complex beer, it's a beautiful deep mahogany color that has a rich, robust aroma and explodes with flavor.\n\n---Rated via Beer Buddy for iPhone", "Maybe I’m not worthy this beer was perfectly clear excellent aroma but just too oily this goes and oily green grassy hops way too over-the-top.", "I AM worthy ! This is deep rich double malted chewy full beer. The beer is rich and filling. \n\n---Rated via Beer Buddy", "Bomber.  Crystal clear copper appearance.  Aroma is almost like a IPA past its age.  Tastes sweet and moves to a somewhat bitter finish. Hides abv well but I didn’t find it overly enjoyable to drink.\n\n-- rated with beerbasher", "22oz bottle (2012 release) given to me as an anniversary present from my wife last year (11/29/12). Pours a hazy dark amber color with a finger of frothy tan head. Lots of floaties. Aroma of old citrus hops, apricots, grapefruit skins, and lots of caramel malt. Taste of bitter grapefruit, pine, old rotted citrus, burnt caramel, and a nice toffee and roasted malt aftertaste. Solid stuff!", "22oz bottle into tulip. Minneapolis. Bottled 09.06.2013\r\n\r\nAppearance: red/copper in color. mostly clear with a slight haze. Small tan head.\r\n\r\nAroma: Caramel and brown sugar is most present. Citrus and floral hop notes  back it up. Slight alcohol. \r\n\r\nTaste: Sweet at first, but evolves into a bitter, long lasting finish. The bitterness builds as you continue to drink the bottle.\r\n\r\nPalate: A full body and mouthfeel. Light carbonation. Long bitter finish. \r\n\r\nOverall: Strong ale indeed. Nothing subtle about this beer. The flavors are upfront and intense. More bitter than I expected, but still very nice. For me this beer is less about complexity, and more about straight forward, strong flavor.", "Appearance: deep clear amber with a silky, creamy, dense, near white head, poured into a snifter. Aroma: caramel and roasted nuts, toffee, plums in syrup, a hint of woody booze\t.  Taste: brown sugar, raisin, caramel, candied nuts, a big wash of resinous, piney hops toward the back end.  Finish: slowly building boozy warmth grows over a lingering malty caramel and brown sugar thread, balanced by the lingering hoppy dryness. Notes: Definitely a big, strong ale, but it maintained a good semblance of balance and was surprisingly drinkable for an 11.2% beer--the alcohol was reasonably well-hidden.  Beerdvent 2013, day seven.", "Tap at stone brewing, escondido. Clear deep amber color, white head. Aroma is malts, oak, cherry, fruits, hops. Balanced malty body, big hops, some oak, fruits and some berries.", "Pours a murky orangish-red with a decent off-white head. Aroma is slightly boozy, nuts, dark fruits, brown sugar, and some hops. Bold flavor that kicks you right in the taste buds. Roasted nuts, malts, a hint of sweetness, and a surge of hop bitterness to keep you humble. This beer packs a punch at 11.2 percent and they do not hold back with the flavor profile. There really is not mistaking that you are drinking a very strong beer. Sometimes, that’s exactly what you need though.", "2011 bottle, pours a deep murky brown with no head. Aroma big on malt with slight hop bitterness. Taste is caramel, brown sugar, toffee, pine and slight grapefruit. I’m amazed that the hops stuck around this long. Not\r\nBad", "Bottle pour dark amber copper. Nose sweet malt, dank hop. Hint of earthy spice. Taste sweet malt, spicy hop. Bitter starts in mid palate and lasts through a long finish. Reasonable mouth feel. I once drank a 3L of this for New Years.", "Draft at jungle jims: pours a dark, orangish red color with a healthy tan head. Aroma is toffee and pine needles... You know it’ll be bitter before you try it. Taste is a bit of caramel and sweetness, but that gets knocked out by the bracing piney bitterness. Lovely.", "Deep copper, very yeasty, no head, strong lacing, sweet, flowers and alcoholic, candy sugar, intensely sweet on the palate with a long lingering harsh and strong bitterness, almost medical in its bitterness", "A 3rd of a pint in Brewdog Glasgow (£4.25):\n\n\r\nAn alright beer at best and I felt that the beer was only about loading the flavour with a mix of hops and alcohol meaning the balance was poor and the beer was a hard on to drink with everything in your face and to the extreme. I’m glad I got to try this one but I don’t think I’ll be giving it a go again.", "Bottle into snifter. Dark red color, dense small head. Aroma is toasty, resin, earthy, caramel, honey, banana. Flavor is powerful, with plenty of hops, roasted coffee caramel. Full bodied, sticky, lots of carbonation, extra bitter finish. Doesn’t live up to the diatribe on the back of the bottle, but pretty good.", "Keg at Brewdog Brum. Nice lacing. Big, rich flavour, my old beauty. But pointy and glassy, like a posh Christmas tree decoration. Obviously lovely.", "Wunderschöne farbe, bernstein, feine weisse schaumkrone, malzig fruchtig und etwas hopfiges aroma, sehr gehaltvolles mundgefühl, malzig und leicht alkoholisch im geschmack, stark gehopft, bitterer abgang welcher lange anhält\n\n---Rated via Beer Buddy for iPhone", "Good beer. Honestly reminds me a lot of regular arrogant bastard. Another solid creation from stone.", "Keg at Brewdog Edinburgh.Pours dark hazy orange. Nice head. The aroma is rich citrus hoppiness with sweet malts. And yes this is hoppy and bitter. That said, comparing this with many contemporary west coast US style ales, not so unusual these days... actually nae, This is one rich hoppy bastard ! What I particularly like about this is the way that the relatively massive hop bitterness doesn’t in any way derail the wonderful malts and hop flovours. It just works. They got this spot on, as they did with Arrogant. Had this a few times now and certainly will again.", "Pours burnt orange with some red flames amongst it. Large, impressive robust tan head - its like bubble-bath foam on bath water.\r\nHeavy hoppy aroma. Bitterness is invasive even in the aroma. Some toffee malt, heavily piney. Reminiscent of an even more brutal American DIPA. \r\nHeavy and strong mouth-feel. I should have worked out my jaw before chugging. Hop-forward pine strangles the wimpy citrus. Heavy sugary malt. Some caramelised fruit. Consuming, evolving and evolving bitterness. Wow, that has pummeled my taste buds. Does it NEED to be this bitter? No-one enjoys a mouthful of flies, surely?", "HOPS! Fancy meeting you here in such a lovely cold bottle. Every time I drink this beer, my poor taste buds feel like they’re being brutalized, and that is NOT a bad thing.", "Bottle from Binnys. Poured amber with yellowish head that hangs. Aroma of pine and malt. Stings. Quite smooth med body. Slight bitter taste thats pleasant.", "On tap at Prefunk, 2013 version. Dark brown with small foamy beige head. Aroma is nutty, roast grains, some alcohol warmth plays out in the nose. Flavor is strong, sharp hop bitterness, heavy malt, tingly palate and plenty more alcohol warmth. A real winter warmer.", "Vintage 2012, \r\nPours copper, light tan central dome and rim with some confluent etching. Smells of alcohol, hops (weed, resin, grapefruit and some tea) plenty of crystal malts, some more tea some more booze, a bit of nougat and vanilla and banana. Flavor is bitter, boozy and sweet. Lots of malt, lots of bittering hops, plenty of alcohol character. Medium bodied with moderate carb. I don’t think I care for this fresh. Not at all.\r\n\r\nvintage 2010- 15AUG11 - 2/4/3.5/3.5/4-3.63\r\nA: Pours a turbid copper ale with less than a single finger of light peanut foam. This dissipates rather quickly to a mirror surface and a central cap of foam. No lacing. Surprised at how turbid this is.\r\nS: Caramel malts, toffee, richly blended. Really nice smell, and for some reason, when I take a good long hit of this, I get candied and mulled orange smells. I dig it. Reminds me of a well aged barley wine.\r\nT: Sweet and bready with a midline transition highlighting the alpha acid in here. Then an additional mutation to a slightly oxidized and metallic grain bed. Above average for sure.\r\nM: Medium on heavy for the style with moderate to lo carb. Transient slick on the palate falls dry at the end.\r\nO: Good beer. Look foward to reviewing fresh.\r\n\r\nServing type: bottle\r\n\r\n11-11-2012", "on tap at the Provisions market, grapefruit nose with some hops, tasty hoppy beer but nothing too aggressive not the biggest fan of this marketing campaign but whatever floats Stones boat. The alcohol is well hidden tho", "Catch up rating #godknowswhat @Tria, Washington Sq, PHL 30/11/13 - last beer of this particular stateside trip !\r\nKeg - dark amber with a big ole light beige head dress.\r\nNose is candied sugars, red grapefruit, toffee, brown sugars, bitter candied orange peel. hint of liqourice.\r\nTaste comprises bitter citrics, candy sugar, grapefruit peel, rich caramel vein running throughout, orange pith, darker warming fruit notes.\r\nFull end of medium bodied, fine carbonation, sweet finale, slightly drying.\r\nDecent American strong - the alcohol is pretty well integrated for a double digit monster !", "Draft at bistro on bridge. Pours clear amber with a medium sized off white head. The aroma is very hoppy. There is earthiness, grapefruit, and some caramel malt. The taste has a huge bitter hoppy kick followed by an amazing many sweet caramel balance. Terrific balance and alcohol is hidden well.", "2013/12/01 - Pours a clear, dark, burnt amber colour with a thick, fluffy, khaki head. Tons of lacing. Aroma is grapefruit, citrus, pine, hop resin and wood. Taste is citrus hops, malt caramel backbone, pine, wood and alcohol. Thick oily mouthfeel with smooth carbonation and a slight boozy, warming finish. Caramel backbone and alcohol really balance out the citrus and pine hop flavours. A big beer that is amazingly well balanced. ---Rated via Beer Buddy for iPhone", "Clear amber ale with a medium foamy off-white head. The nose is resiny with some grapefruit and floral pine, and a touch of oak. The flavor is amazing with a big malty caramel tone backed with a bit of boozy warmth, some pine and grapefruit resin, and an assertive oak-ed floral hop tone. Very nuanced, deep and lovely. Lots of hop depth but also loads of malt characteristic. Sticky hoppy oak caramel notes. Warming alcohol finish and more hops.", "2013 bottle, pours a dark reddish caramel color with a 1\" white head. Nose is burnt sugar, pine, caramel, leather, spruce. It’s a little hot, but the ABV is pretty high so...to be expected. This is a well balance, very smooth beer.", "Bottle sample at Stone tasting at Beer&Beyond shop. Pours almost clear red-brown with a nice head and good lacing. Aroma - piney hops, malts, caramel and alcohol. Sweet with flavors of fruits, licorice, malts and long lasting strong hoppy bitterness, alcohol is quite noticeable. Medium-full bodied.", "On tap, clear deep orange-brown hue w/ medium beige head. Moderate sweet citrus hop aromas. Initial flavor is moderate sweet w/ a bold bitter finish of long duration. Tastes are pine, caramel, apple, and tangerine. Big bodied, average carbonation, and a dry finish.\n\n---Rated via Beer Buddy for iPhone", "This Ale is so thick and full of flavor, I want to pour it on my pancakes. Tastes of caramel and a lemony hop tartness. A medium off-white head gives to a ruby-orange hued body. Nice lacing. One of my new favorites. \n\n---Rated via Beer Buddy for iPhone", "Pours a burnt amber color with a khaki head and beautiful lacing. . Big hop, caramel, malt and toffee aroma with wood undertones. Big hop, malt, caramel, toffee, raisin, plum, pine and alcohol flavors. Medium full body with a thick, syrup like mouth feel. Bitter but other flavors tone it down. Malt and caramel finish. A very big beer.", "November 25, 2013 - on tap at Town Hall Lanes. Not sure how I have never rated this before, but here goes. It was dark in the bar, but appearance looked to be a light brown with nice head that lasted. Aroma was big malt and hops, with some dark fruit that came out as it warmed. Taste was sticky sweet caramel, dark fruit, alcohol and piney bitter finish. Nice thick body that was smooth.", "Poured from a bomber into a pint glass. Deep reddish brown color, one inch head. Nice soft aroma of fresh hops and citrus. Flavor belies the aroma, however. It is strongly malty with an intense bitter finish. \"Harsh\" might be the most suitable word here. None of the citrus from the aroma makes its way into the flavor. The abv is everywhere and unavoidable. Still, fairly smooth for 11%, and what saves this beer. Drink two arrogant bastards instead. \n\n---Rated via Beer Buddy for iPhone", "Pours a deep reddish brown with a thin whitish head. Sweet aroma. Slightly sweet taste with a bitter finish. Much smoother than expected. \n\n---Rated via Beer Buddy for iPhone", "On tap @ Collins Pub. Pours dark reddish amber with thin creamy white head. Aroma is syrupy sweet malt, with pale molasses and earthy oaky undertones. Taste is big roasty amber malt, thick and syrupy, followed by sharply bitter hop finish with notes of pine and grass. Sizable ABV is obvious and impossible to ignore. One goes a long way. Just a monster beer by any measure.", "Brown with a hint of Amber. White head that dissipates quickly. Strong taste of booze and malt. Citrus including bitter grapefruit. \n\n---Rated via Beer Buddy for iPhone", "Bottle. Pours brown with red hues and an off-white head. Smells caramel, bready, slight spruce. Has a really strong flavor, hot. Borderline barley-wine in my opinion. Sweet malts with a strong, lingering bitterness to it. Good.", "Bottle from Bert’s \r\nPours a brilliantly clear deep copper color with a decent sized off white head that shows moderate retention and lace. Aromas of pine resin and grapefruit pith atop brown sugary caramel and hints of cheery and toffee. The flavor is heavy on the pine, resin and brown sugar. Slight warming alcohol warns of the abv. Caramel, toffee, light plum and prune round out the flavor. Assertive hop bitterness but never harsh. Medium to thick body with a light to moderate level of carbonation and a sweet slick almost syrupy mouthfeel. Very nice strong ale, I enjoyed sipping on this for most of the night.", "Draft, Dark amber color with a nice white head. Aroma is sweet with hints of dark fruit and hops. Sticky sweet bitterness lingers for a while. Great beer. Seems a bit smoother than the regular Bastard.", "On tap @ Tap25. Cloudy, orange with disappearing head. Very, very light smells of fruit and hops. Tastes of malty booziness, sweet, but finishes with a bitter aftertaste. Seems like a complex beer, changing as it warmed up, but I still wonder if Arrogant Bastard is better than this. A little more malt with an alcohol bite. Would love to try them together.", "On tap at the brewery, pours amber with low head, aroma is rich roast and pine hops, taste is bold bitter roast, delisious.", "Pours a dark amber. Thin off white head. Lots of maltiness. Somewhat bitter. Some aroma of dark fruits. Flavor is somewhat bland. Alcoholic.", "Metallic and boozy aromas with a Chinook hop aroma, though muted by the boozy notes on the aroma. Flavor is like a under-aged barley wine but a bit thinner on the palate than the traditional American Barleywine. Finish is slightly bitter and alcoholic. Overrated at 100pts.", "Pours a hazy orange with some sediment. Has a strong malt, butterscotch, and hops. Taste is complex with hints of rum and strong fruity malt and prune juice flavor. Bitter malt and hop aftertaste."]}