{"reviews": ["Can. Murky orange golden. Smells not like fish, even though the can pretends. Wood. Creamy, wood. A beautiful edge; nice drinkability.", "355ml can. Consumed from the can, so I can't comment on the pour. Aromas of tropical fruit, pine and grapefruit. Strong resin and tropical hops up front, caramel malt, grapefruit finish. Very nice IPA.", "A fine balance IPA that offers a nice drinkable session that doesn’t distract you. Slight tannin bitter at the end. Still great to have", "16oz Can. A nice well-balanced IPA. Aroma of grapefruit and slight sweetness. Taste is more grapefruit rind with some bitter. An easy bitter finish. Glad I picked this up for a try", "Can at the Airbnb, first beer of the trip. Why is it this hard to find anything in stores that’s not sold in at least six packs ot not a double IPA in tallboys? Anyway, it pours cooper with an off-white head. Nose and taste are resin, biscuits, citruses and grass with a hint of orange peel. Moderately bitter, somewhat sweet and sticky. Pleasant old school AIPA.", "Bottle from 101 bottles, Kent, OH. Well, the 2nd best IPA in the world, and........I'm not convinced to be honest. Lovely clean hop forward aroma. Copper gold with slight haze. Taste is quite hop forward but not biting. The ending is all rather soapy in its bitterness and booze, I really don't like that ending. Middling IPA imo.", "Pours a clear yellow-orange with a full creamy white head that leaves lacing. Nose is pine and citrus. Mouthfeel is full. Taste is malty, citrus. Bitterness is very low in the aftertaste. It is balanced.  12 oz can", "Hazy golden/amber beer with a slight off-white head. Medium aroma; taste starts medium sweet and ends slightly/medium bitter and dry. Caramel, orange, pine, hops and citrus. 7/3/7/4", "35.5cl blik. Helder goudgeel kleur, fijne romige witte. De geur is ananas en karamel. Smaak is zoet, citrus, ananas en karamel. Medium body en veel koolzuur.", "#17 Beer republic advent calendar. Pours unclear dark amber golden with a creamy head. Lots of caramel and roasted malt, maple syrup and honey, resin, spicy hops, grapefruit zest, toffee, orange juice, herbal notes. Malty sweetness, dry hoppy bitterness. Full bodied, oily texture, soft carbonated, hoppy bittersweet finish. A classic West Coast IPA, rather malty.", "Good but simple. Reliable APA but nothing to be amazed at. Bronze/amber color and I'd guess a low IBU for the bitterness is just simply not there. It has more of a malt flavor imo. I did get this in a can and unfortunately I do taste a hint of metal so I'm letting it sit longer to fully enjoy it. I do like this beer but what I really want to try is the IIPA they came out with but at $18 for a pack...  stay tuned", "From a can. Hop-loaded IPA, but not bitter. A good bit of orange or clementine in addition to the grapefruit. Malt body holds up as well for balance. Really good.", "Una cerveza de color naranja-ámbar con una espuma blanca y buena retención.\n\nOfrece un aroma muy complejo: floral, cítrico, resinoso y un poco de toronja.  Aparecen algunas notas de caramelo. \n\nEn el sabor se nota la malta, sabores de galletas y caramelo combinan bien con los cítricos del lúpulo. El amargor se siente al final y limpia el paladar y lo prepara para el siguiente sorbo.\n\nEl final es seco como cítrico y caramelo, el alcohol está bien enmascarado.", "Can at London Craft Beer Festival.  Clear orange.  Nice and piney nose.  Really bitter and classic.  Very tasty.", "Orange amber color beneath a soap like size bubble white head. Effervescence on the sides clings in lacing. Citrus aroma and agreement with the advertised grapefruit description. Quick bitterness on the palate. Hop taste forcefully expressed onto the tongue. Expect some pushback with your tastebuds. The bitterness units seem countable. Finish is strong but the alcohol subtly creeps up on you to even things out.", "Tastes like somebody marinated a light wheat ale in orange rinds. Probably wouldn’t again", "Clear amber/copper body with a big foamy and persistent white head. Aroma is malty (caramel), melon and citrus notes. Taste is malty with a pleasant hoppy kick made of resinous and citrus notes. Bitter finish. Medium body soft carbonation oily texture.", "Bottle. Copper with a foamy white head that has fair retention and ample lacing. The aroma is light and features grapefruit, pine and mango. The taste has a big grapefruit presence with pine and caramel malts. Palate is full and smooth with lively carbonation. Overall: decent.", "Hoppy aroma, citrus and herb.  Orange body with lasting head. Full taste, citrus herb and evergreen. Long sit on the tongue e-hop finish.", "Can. Hoppy aroma and taste, citrus fruit, light resin notes, medium bitter. Medium body, hoppy bitter finish. Good.", "Straight out of the bottle. Aroma is of huge malts, big hops, piny, citrusy and caramel. Over medium bitter, medium sweet. Medium bodied with the same amount of carbonation. Awesome.", "Orange pour. Thick foam. Sweet wheat flavor paired with lemongrass. Lemongrass palate. Nicely balanced beer.", "Clear copper with an off-white head. Aroma is citrus, pine resin with a grainy backbone. Taste is light/medium sweet and heavy bitter.", "A 22 oz can I got for my birthday. You remember when I cook Melba to go get our teeth. Thick white head on top of a hazy dark golden body. The aroma is complex it's hard to narrow it down smells like a little bit of everything. It's good but not exceptional it doesn't kill my Peloton aftertaste like the average ipas and give a few bonus points but there's nothing to write home about either. But I like it because it's not a typical IPA so your IPA lover probably won't like it as much as I do", "APARÊNCIA\nâmbar, levemente turva.\ncreme branco de boa formação e bastante persistente.\nAROMA\nfloral, pêssego, pinho, tangerina e toranja.\nSABOR\nbase maltada, caramelo, seguido por um perfil bem cítrico com amargo moderado.\nSENSAÇÃO\ncorpo médio e carbonatação moderada.", "12 oz. can. Golden orange pour with hefty white foam head, solid retention. Moderate carbonation. Luscious aroma of citrus, grapefruit, resin and pine. Massive palate on this beer deeply quenched my thirst with thick layers of expertly balanced caramel malt and fantastic, juicy, fruity hops. Bitterness is also well balanced with fruity aromatic notes and malt sweetness.\n\nI applaud the full flavor and perfect balance of this beer. This is more than just another dime-a-dozen, run-of-the-mill IPA (of which there are hundreds). This is a fully fleshed out creation worthy of building a brand name around. Two Hearted Ale also manages to hit a sweet spot in between IPA and Imperial IPA, but more closely aligns with the former. Compares very favorably to DFH60 Minute and Founder's Harvest Ale.\n\nI plan to add a rating for the draft variant upon next tasting.", "I think this beer is horrible.  I think if I added used engine oil to it, it would taste better.  I'm not trying to mean.  It's just that it truly tastes that bad to me.", "Amber with a white head and a caramel, whiskey nose. Well-carbonated with a malty mouthfeel and a caramel finish. Some warming.", "Bell's Brewery Two Hearted Ale: 12oz can. Easy pour into a pint glass with a nice head. Beautiful appearance of hazy golden amber and solid white head. Pleasant aromas of yeast and apricot. Wonderful mouthfeel. Well balanced flavor with clean bitter finish. Really great offering. Impressed.", "Creamy head Lacing all the way to the bottom. Medium bodied with grapefruit hoppy flavor. Very clean from start to finish. My go to beer.", "How: Can.\n\nWhere: Had at home.\n\nAppearance: Dark golden colour with a white head.\n\nAroma: Malt, hops, grapefruit, fruit.\n\nBody: Medium body and carbonation.\n\nFlavour: Malt, fruit, grapefruit, citrus, hops, oranges.", "Draft.  Bright, hoppy aroma and flavor, with a prominent malt base.  Malt:Hop ratio 60:40.  Pours a translucent yellow color.  Citrusy hops, esp. grapefruit.  Slightly sweet, with an appropriately medium bitter finish.  Very smooth and very drinkable, start to finish.  Not overly hoppy or punchy, so it may not win awards at tastings, but a smooth and drinkable IPA with a malty prominence.  Perfect go-to American IPA.", "Fruity, malty, hoppy and a bit bitter with tastes of grapefruit, pineapple, and lemon. Reminds me of traditional IPAs.", "Drinking in Boston with roasted ducks. Nice beer but a desperate night. Seahawk lost by inches to the touchdown line. Heartbreaking.", "Ipa molto buona, dorata con schiuma media, ha una buona base maltata e resinosa, con sentori di agrumi e puntina fruttata. Amaro medio. Carbonazione bassa.", "Bottle in Nachbar Bar, Louisville. Clear golden amber with a medium white foam head. Nose is citrus, orange marmalade, biscuit, orange peel, pine. Taste is is orange and grapefruit peel, pine, biscuit, caramel. More of an old school IPA. Really nice.", "12 fl oz can. Appearance is a dull, hazy copper gold, with a thick one and a half fingers of soapy white froth. Aromas are a range from citrus and grapefruit, to pine and wood. Taste starts with a bittersweet grapefruit note, some bready malts and dough, piney and resin bitter, and a little toffee or caramel. Quite a range of flavours packed into a small can!", "0,473 litre Can from 7-11 Carlsbad, Ca. Golden with white head. Malts, hops, piney, grains.", "Poured from 12 oz bottle into pint glass. A 1\" pillowy off white head drops slowly with moderate lacing. Color is hazy orange. Aroma pine, citrus, white bread dough. Mouthfeel is medium and slightly astringent with a quite dry finish. Flavor is well balanced between the pine/citrus hops and the sweet malts with a hint of honey. Overall: a classic in the style.", "This beer, with all due respect, destroys all others. In the words of Tina Turner \"you're simply the best, better than all the rest\".", "Aroma is some caramel some raisin some nice fruity grapes pineapple and other tropic fruit. Taste is sweet caramel slightly oxidized. Juicy drinkable and fruity. Long malty finish with the fruuty hop flavours above. Nice.", "Bottle Packaged on 06/27/19\nCoppery amber orange with slight haze\nRich thick head with good lacing dissipates slowly\nNose: Cream Caramel orange-vanilla, coriander and nutmeg with a hint of passion fruit and grape. \nFirst Sip: Sweet Malt bread caramel and cream opening to ripe stone fruit passion fruit\nDevelops into dank loam pine and orange peel.\nMouthfeel soft inviting vibrant and smooth.\nFinish Big long Hoppy finish characterized by pine grapefruit and resin, very smooth no astrigency .\nOverall a glorious IPA to drink and savor.", "Bottle from Varsity.  Amber gold with fine head.  Grapefruit and toast aroma.  Med carb.  Really nice IPA without overpowering hops letting some fruity complexity through with a nuttier smooth finish.", "Poured from 12oz bottle. Amber color with nice, thick, white head. Smooth, got, and well-balanced. Superb APA!", "Thick foamy head color looks light orange copper smell of tropical fruits hops caramel taste of fruits bitter finish smooth drinking", "Great piney and grapefruity hop profile with distinct malt backbone. Solid west coast style IPA.", "Deep apricot color with a thinning cottony head. Aromas of light pine and a touch of loam. Delicious on the palette with apricot and lighter hop bite. Almost malty. GREAT!\n\n---Rated via Beer Buddy for iPhone", "Fantastic mild smooth floral beginning. slightly sweetish, refreshing with pine and resin. Moderate bitterness, round and mild in the aftertaste.", "Can @ Friends/Dr Yeast. Appearance: pours slightly hazy golden with good white soapy head and lacing. aroma/taste: barley, bread, light caramel, pine, orange and light tropical fruity notes. palette: strong us hoppy aroma, average carbonation, medium body, medium to notable sweetness, balanced by a medium to notable bitterness, average duration and a watery texture. Overall: Smooth piny IPA", "Earthy indeed. Nice bready base. Great fruity hoppy punch. Pine, grapefruit, passion and such. Full body.", "Najlepsza IPA i AIPA jaką piłem. Aromat świetny - słodki zapach - mango, ananas, papaja, melon. Piana obfita, nietrwała. Barwa pomarańczowo-żółta. Lekko zmętnione, nieprzejrzyste. Jak na 55IBU to goryczka odczuwalna dużo niższa. Przyjemny, fajny chmiel. Mimo iż posiada 7% alk. obj. to nie jest od wyczuwalny w piwie. W smaku czuć Amerykańskie chmiele, lekką słodycz, słodowość. Delikatny finish z lekką goryczką.\n[10, 4, 7, 5, 17] [032819]", "Hoppy IPA, with a delicate finish. Like someone who steals your bike, but leaves an apologetic note.", "Gold with a frothy white head. Aroma of peach cobbler and papaya.  Bittersweet taste, sweeter at the end but finishes with a medium, lingering bitterness. Fruity and nuanced. Good.", "One of the best American IPA’s out there. Poors hazy, but lightens up to produce a piny finish. Gets better each sip.", "This beer is well deserving of the accolades it gets.  Pours a hazy medium orange with aromas of sweet fruits and malts.  Smallish light tan head that dissipates slowly.  Full mouth feel.  Sticky.  Mildly bitter aftertaste is joined with an even milder sweetness.  A good balance of hops and malts makes this beer a refreshing and impressive taste experience.  As a lover of big barrel age RI stouts this American IPA impresses with a similar big feel, perfect for summertime sips from a snifter.  Will have again!", "Pours light amber, a little oily, somewhat hazy too maybe, well developped, light mocha head, good lacing.  Aroma: nice malty base, bitter, oranges, lychee, some grapefruit indeed.  Taste: good bitterness, fine grapefruit finish, distinctly grainy, spicy, resinous, a tad soapy mayb, soft caramelly malts underneath.  Very good, great bitterness, sweetness limited to the lychee and orange fruits underneath the bitter hops.", "Pours up a slightly hazy gold color in the glass, with a off white head that lasted, and left some lace. Aroma has some pine, grapefruit, and malty notes. Taste is some bitter dry hops up front, then a mild fruit like sweetness and malts come in to balance things out. Sticky feel. Not bad.", "Aroma is melty, sweet caramel with fruits. Palate is sweet beginning, peach and apricots, biscuit, and piney, lingering finish with bitter aftertaste. Great", "Ich hab das hier in einem plädderichen Plastikbecher in einem Motel in New Hampshire und muss sagen, das schaut echt gut aus. In der Nase brotig, im Trunk hopfig, grasig, trocken, leicht Zitrus, angenehm bitter, lecker.", "Pours dark golden with moderate foam. Taste full of flavors with wood chips and pine.", "Hat ja perfekte Bewertungen und ist ja auch gut, aber mir etwas too much von allem. Für eine Topbewertung fehlt mir die Rafinesse. In einem Shop in Manhattan gekauft.\nSehr starkes fruchtiges Aroma (Tropenfrüchte). Im Geschmack sehr Bitter, Grapefruit, Malz.", "Good aroma of tropical and grapefruit. A very good up front taste. Slight citrus taste. A typical slightly strong IPA aftertaste . The more you drink it the better it gets. It doesn't age well at all.", "Can from the fabulous shop in Grand Canyon Village - golden color, white head. very round and smooth IPA, low fruityness, more on the resinious, hoppy side. medium bitter. high drinking quality. perfect.", "Draught@Cafe Deluxe, Gergetown, D.C. Slightly murky deep golden, small off-white head. Nose hops, grapefruit, honey. Strongly bitter taste with some soft sweet notes.", "Hop aromas of pine and grapefruit, lovely beer, truly and enjoyable experience", "Bottled at Fire and Hops, Santa Fe, New Mexico, USA. Hazy dark golden colored. Powerful hoppy and fruity aroma. Very bitter, but really nice.", "I’ve had this beer so many times, I’m not sure how I’m just now eating it. It’s been my go-to IPA for a decade. It has the best of everything you want in a beer and IPA. This is the standard by which I judge all other IPAs.", "Amazing. Cream de la cream. The perfect fishing beer. Two hearted is so sophisticated like a wise and goofy grandfather teaching his grandson to fish.  Once again amazing.", "Well balanced and sessionable. Always gets over descibed. The safest bet when the bar you’re at doesn’t have many craft options.", "This IPA is one of the best IPAs of it's kind: average IPA. It is balanced and goes down easy but it doesn't do any overly interesting. Not a bad beer either way.", "Amber color. Piney on the nose. Nice evergreen and grapefruit on the palate. Well balanced! Pretty solid.", "This beer lives up to the accolades. Incredibly well-balanced. Aroma of grapefruit and slight sweetness from the malts. Taste is more grapefruit and overripe tangerines. Minimal bitterness to finish. Easy to see why this is such a legendary beer. My go to IPA.", "16 oz can. Smells piney. Amber colored with an orange tint, clear. Nice blend of sweet and bitter, tastes of grapefruit, malt and pine. Tastes of malts, followed by resinous hops. Slightly bitter but clean finish.", "First American IPA I had 25 years ago. The benchmark by which all American IPAs are measured. I guess, that's all that needs to be said.", "Strong grapefruit flavor with citrus and pine lingering in the background. Very nice smooth tasting beer. Bitter finish. Very well put together. Make sure it is very cold than the crisp flavors come out. Well done!", "On tap at One Mile House. Pours orange gold. Pine, grapefruit, pineapple, touch of papaya, orange peel, nice lingering bitterness. Good body. Very nice.", "11/4/18 (Chicago): Canned 9/25/18, purchased at Bell's General Store earlier in the day, 6 pack cans $11.50 w/ tax. Can poured into pint glass. Slighty dark golden color, puffy head, thick lacing, solid carbonation. Citrus pine aroma, sharp pleasant, sweet. Very well balanced, citrus pine taste, dry hops, bitter nice. Dry creamy mouth feel, solid presence, smooth drinking. Overall excellent IPA, glad I stopped at Bell's Brewery for this one!", "Poured cloudy golden yellow, very heavy grapefruit aroma. Very smooth, little to no bite on the backend. I’d describe it as a malty taste which makes it different. Good beer... for an IPA.\n\n---Rated via Beer Buddy for iPhone", "Draft into tulip. Hard to beat this beer and it’s all it’s hyped up to be. Great aroma of pine. Generous lacing. Very light citrus mouthfeel. Smooth. All IPAs need to live up to this one.", "Pours amber with a hint of cloudiness. Thick head, heavy carbonation. Aroma of hops and pine. Taste includes citrus and the typical IPA elements. Palate has oak, citrus and a complex arrangement of hops. Incredibly drinkable, lives up to the hype.", "Ice Cold from the fridge. Cloudy orange color with thick head. Pungent pine, citrus and floral aroma from the moment you pop the cap. Taste is grapefruit zest/juice, orange, lemon grass and mango. Clean dry hoppy finish. Damn impressive for a single IPA.", "Can share from Beer Cellar.  Great pour. Frothy head and sexy amber cloud. Taste was lacking the punch of bitterness I was expecting.  Overall a good beer.", "My single favorite IPA. Drinkable, but not weak. Citrusy, old school IPA.", "Pours a medium amber coloration with a medium, creamy head. Not very intense, but nice aromas of biscuity malt, grapefruit, orange peel and a hint of pine in the nose. Taste follows suit, with a very nice balance of biscuity, slightly caramelly malt and lightly resinous citrus hops. Notes of grapefruit, orange peel and pine. Finishes with a medium bitterness and some light pine lingering in the aftertaste. Smooth mouthfeel with a medium body and carbonation. Classic old school IPA with a certain West Coast accent to it. Quite nice for what it is and really well-balanced.", "Lys brun med høyt hvitt skum. Lukter søte frukter. Middels fylde. Lett bitter sitrus, karamell og ananas. (Beavertown Beerextravaganza 2018)", "Decent, well-rounded, well-balanced IPA from Bell’s. Totally solid. Thoroughly enjoyed. 100ml glass at Beaverex’18.", "Pint at tavern on main Sarasota. Yeasty but refreshing. Delicious. Also had this at the bar at the top of the holiday inn in mobile....", "355ml Flasche. Klar und dunkelgolden mit minimaler Schaumkrone. Citrathopfen im Antrunk, geschmacklich intensiv und fruchtig. Ordentlicher Körper. Runder Abgang. Leckeres und gut ausbalanciertes Bier.", "Clear pour with nice fluffy head. Aroma is malty, bready, with good pine and citrus. Taste brings the hops forward, but this is a not super hoppy IPA. Very well balanced, smooth, nice textures. Deserving of its reputation. Never disappoints.", "Definitely one of the best IPA’s out there. Has a nice orangey color, and the malt/hop ratio is excellent.  A delicious brew, I am drinking it right now poured from a 16 oz. can.", "From a can to a glass. Pours a crystal clear amber color with a monster frothy creamy head. Aroma is sweet caramel bready malts and citrusy,  slight lemon, mango, orange,  pineapple, guava,earthy herbal piney hops balancing it all out. Taste follows the aroma well with a medium mouthfeel. Thick malt rings all down the glass. Very good Ipa! $11 otd  a six pack is a great deal!", "Very smooth and bizarre tastefully made ipa, it’s the traditional one but with an extra finishing touch, drinkable as hell!", "Grapefruit, malt, and more citrus fruits on the nose. Very big head, lots of carbonation. Dark golden in color. Almost brown. Taste has some nuttiness, like a brown ale, followed by pine, hops, grapefruit and sweet malt. Not what I was expecting but good stuff.", "Found in bottle from hotel in Champaign, Illinois. Good malt forward IPA. I didn't get a lot of hop flavor but was enjoyable. Good early fall beer.", "Fruity  and pine aroma . The body is a hazy golden amber with a frothy head to start. Bold bitterness is balanced well with a sweet fruit grain. It had medium bodied mouthfeel but is super friendly on the palate. Can’t wait to have another.", "My favorite straight up IPA. Pours with an 1.5\" head that sticks around and laces nicely down the glass. Great hops aroma and taste with just enough but not overbearing bite. There is a nice malt in the background which smooths the hoppy bite out just a little and makes it very easy to drink. This is a no brainer to take to a party, give someone to try, or just enjoy yourself when it's time to relax after a long week.", "My reference point for what fresh floral juicy fruit ipa’s should be - and rarely do I find one measure up", "Golden, ever so slightly hazy. Aroma is floral some citrus. Taste grass, pine, some grapefruit, bitter enough. Medium body. Not an extreme or exciting beer but one you could easily drink two or three of, on a warm evening.", "Very very good. A little sweetness that kind of coats the hops but it has a unique taste that is so addictive", "This my go to IPA!!!  Whether on the river or an evening drink on the deck.  Amber coloring and hoppy taste and aroma are consistent and strong!!", "Hazy amber, lasting head. \nMedium body, intense flavor, smooth texture, rich mouthfeel, nice heat and carbonation, great length, tasty finish. \nBitter, dry, crisp. \nHoppy, assertive and beautiful flavor, malty, herbal, grapefruit, caramel. \nDelicious, great balance body/flavor. \n\n---Rated via Beer Buddy for iPhone", "Draft 0.25l at BeerTemple, Amsterdam, The Netherlands. 08.06.2018. Pour it slighty hazy orange color with small white head. Aroma orange candy, not so fresh unfortunately, some pine notes. Taste tangerine, some orange candy, grapefruit, not fresh, quite old actually, but you can see potential, hope I will try this one day fresh.", "The best regular IPA out there. You won’t break the bank buying this either. Great Hops taste with no bitter aftertaste. Bells doesn’t mess around with 2 Hearted. Distinct Palate flavor of citrus/pine mix and extremely drinkable anywhere. So glad I live in Michigan. There’s not many IPAs that come close this unless they are a double. Full flavor on every sip", "Pour from a bottle is hazy thick orange with a thin head. Dry hoppy bread taste. Light mouthfeel with a grassy finish.", "Nice hop aroma and biscuity malt sweetness. Mostly pithy and sweet floral peppery hop flavors. Still so so good.", "From tap at BeerTemple, Amsterdam. Aroma is citrussy hops with orange, tropical fruits, grapefruit, biscuity malt, and some pine. Flavour is sweetish with an above medium bitterness. Body is medium. Classic, a bit sweeter than I expected but it holds up nicely.", "Pint from tap at Hopsmith Tavern (Chicago). Very floral and piney, finish of grapefruit peel. Amberish yellow. Well-rounded IPA- a must!", "Bottled at Bills bar and burger\r\nHazy golden. White head. \r\nFruity, resinous, perfumeish in both aroma and flavour. \r\nMedium bitterness.", "Can 16 fl oz. Foamy white head. Orange color, a bit hazy. Aroma is pineapple, grapefruit peel, rose leaves and american hops. Taste is bitter", "Pours an amber from a bottle. Perfectly fine light pine and fruit syrup aroma and flavor. Good beer.", "I enjoyed this one a lot. Only grabbed a single to try, but will be getting a 6'er in the near future. Fruity aroma, lots of grapefruit and hops going on. Hazy light orange/golden yellow appearance. Smooth mouthfeel for an IPA. Flavor also is grapefruity with pine and lots of hops. I would say this is a hop bomb. Reminds me of a hoppier version of Lagunita's 2009 Correction Ale. This is the 2nd brew from Bell's that I tried (first one being the Java Stout) and I liked this a lot better. I am officially \"hopping\" on the Bell's bandwagon.", "Fluffy white foamy head that stays fluffy, but cannot discern aromas other than malty or cereal. Same thing with the taste, this is a very drinkable beer, but not hoppy like I expected. Alcohol content is not apparent. I cannot explain why I like this beer, no one thing stands out, maybe it's because it's very well balanced.", "Can from Whole Foods. Medium amber/golden with nice fluffy head. Looks great. Aroma is malty, bready, a hint of hops. Taste brings the hops forward, but this is a not big hoppy IPA, so they support the malt bill, working with it. very well rounded, smooth, nice textures. Worthy of its reputation. Been seeking this for a while.", "like drinking a grapefruit peel i cant tell you how much i hate thos beer ugh please kill me now\n\n---Rated via Beer Buddy for iPhone", "Keg in Clubhouse, Philly. Clear, golden with a thin white head. Pine, tropical fruit aroma, flavour is both of those ramped up to 11, but beautifully balanced. I want to drink this all night, but at 7% I can't. Damn you Bell's!", "Always good, always constant!  When someone new to craft beer wants to know what an \"IPA\" tastes like this is what I give them. A perfect example of a can't go wrong IPA.", "Phenomenal beer. One of the best tasting IPA's I've ever tasted. Would definitely buy a case and recommend it to everyone.\n\n---Rated via Beer Buddy for iPhone", "1/22/18\nWith Abby and James and they got back from Lana Del Ray concert. \n\nPoured from can bought back in Chatt. Hazy medium amber with a head that dissipates pretty quick. \n\nSmell is classic IPA. Piney/floral hops. \n\nTaste is juicy hops. Very floral and I’m really tasting the pine. Not super fruity. Significant caramel malt but it’s not that sweet. Supremely well-balanced. Delicious. \n\nPalate is sticky medium-thick. Bitter hops hang around on the finish. \n\nOverall, I had high expectations and this really lived up to it. Pretty much a perfect, balanced IPA that’s bitter and aromatic but also malty.\n\n\n8/27/1\nWith A hanging out in workout room. Wanted to try again as I’ve had a lot of awesome IPA’s since I last had this one and am curious to see how it stands up. \n\nPoured from a 16oz van into a Coca-Cola glass. Effervescent orange with a nice sticky head. Bubbles continually coming up from the bottom of the glass. \n\nNose is quite floral with some citrus and pine behind. \n\nTaste is very flowery and bright but has a nice malt balance. Floral notes far outshine and citrus/pine notes but the herbal/piney flavors come in on the end. Moderately bitter with a nice dose of caramel malt sweetness on the tongue. \n\nMedium palate that finishes with more flowery hops. Nice and long bitter finish. \n\nOverall, trying this agin was as good as I remembered. No wonder it’s consistently so acclaimed!", "On draft at bar Louie CWE. Oh how I reminisce on college days.... \nAroma  6 /10: very faint hoppy, grassy, a tad floral aroma. Can't detect much, but it's pleasant. \nAppearance 4 /5: a classically attractive beer. Clear amber with big frothy white head. \nPalate 4 /5: incredibly smooth with little resinous aftertaste lingering. Weirdly smooth to me, for an IPA. \nTaste 7 /10: heavy on the malt, I taste a  lot of rye and roasted malt. In terms of hops it's minimal, some wood and oakiness is detectable. \nOverall  16 /20: I know that people love this beer, and I don't blame them. This is a classic beer for people who like beers. For me, it doesn't fall into the ipa category. It tastes like a very smooth ale. For that reason, my overall us considerably lower than others. \nFinal: 3.7", "On tap at Bar Louie in STL. \nAroma 8/10: Clean notes of grass and pine. \nAppearance 5/5: Thick white head that is very sticky and resinous. Lovely lacing on my 20 ounce pour. \nPalate 5/5:  Substantial and carbonated. Sticky but not overly sweet. \nTaste 10/10: A very good, easy to drink ale. Some resin flavors with that classic ipa pine. \nOverall 19/20: One of my favorite beers. A classic American ale. \n\n4.7", "New York Jan 2018\nAmber, clear. Small but Persistent head.\nAmazing beer considering it claims to be single hop - centennial. Smell of resin with some freshness. Aroma of resin but lots of grapefruit. Very refreshing while butter, and not too sugary. I can se myself droning it in the forest after a good day of exploration/ kayak, waiting for the food to cook on the fire... good one.\n\n---Rated via Beer Buddy for iPhone", "Caramel colored with decent lacy head. About as close to ideal balance of malt backbone and hops as it gets. You probably will not find a better beer than this—Astonishing complexity for a single hopped beer. Has just enough specialty malts to give the malt bill a bit of caramely complexity. Simultaneously has ample piney and grapefruit notes with a bit of stone fruit, floral, and resiny character.", "16 ounce draft at Winking Lizard. White head, film on glass. Aromas of hops and citrus. Deep hopped in taste and is very smooth. Slight pine after taste that lingers. This is a very nice beer for the style. Cheers!", "Bottle, orange pour with high white head. Hops, grapefruit, pine. Nice finish without being to bitter. ---Rated via Beer Buddy for iPhone", "Greatest beer ever ever ever ever ever ever brewed is that 75 fucking characters yet\n\n\n---Rated via Beer Buddy for iPhone", "Almost like looks a Belgian wheat more than an IPA in a glass. Nice foamy head when poured, and fruity and hoppy taste. Overall just a good beer.", "Has a great mix of centennial hops and other flavors..Definitely a top shelf IPA..Bells strives to make quality craft beer and produces well above most breweries..Pop the top on this ale as often as you can!", "This beer had been hugely hyped but unfortunately it didn't live up to the up for me. It is a good beer, with a very mild hop characteristic and very smooth. But don't expect it to be a knock your socks off IPA. It's very tame but it will be hard to dislike, since there isn't any real standout feature about it.", "Bottle poured in glass, orange cloudy appearance with little head, aroma is delightful, lots of hops, orange peel, grass and pine, taste is hop intense as well, not very complex in my opinion but well balanced, heavy bitter but abrupt, astringent finish, mid body", "Tap at Olde New York at state college in PA. 100 rated and I don’t get it. Ok but many others in category, far preferred. Big IBU for sure.", "cereal, nuts, roasty, grass, spruce, herbs, basement aromas, leaves, woody, orange, cloudy, sparkling, frothy, white foam, medium sweetness, lightly bitter, full body, creamy, lively, bitter, long finish,", "Poured from a bottle to a tulip glass. Aroma is bread, some caramel, with a bit of green hops, but overall it's mild. Taste starts sweet but with the solid malt undertones before a nice, long, bitter finish comes in. Overall the body is solid if just a bit on the thin side.", "Perfect pour of golden brown color with perfect lacing. Great IPA bitter flavor without being overpowering. Love it\n\n---Rated via Beer Buddy for iPhone", "Hop aroma on the nose.  Delicious hop flavor with good malt structure.  Well hidden 7.0% abv.  Great full flavored balanced IPA.", "Incredible balance, if just a bit short on complexity. Lusciously sweet and hoop at once, with citrus and tropical notes strongest. A real go to, though I don’t find it as much of a standout as most do.\n\n---Rated via Beer Buddy for iPhone", "Drinking it at the moment...a really good IPA. Will recommend to anyone that likes IPA. I live in California so it’s not available here in the states. Had to order this online.", "Smells floral. solid ipa. Quite bitter. A lot of C hops. Tasted on pub crawl w henricksons.", "Not much one can say about this gem , that hasn't been said by thousands of other people. This beer is outstanding. Delicious hop flavor that is well balanced out with the malts. This by far is one of the best IPA products offered by any brewery. Bells is an amazing brewery that continues to be a leader in the biz.", "Great beer. Has a great aroma and heady taste. Enjoyed it thoroughly and don't know what else to say \n\n---Rated via Beer Buddy for iPhone", "Clear, golden pour with a creamy, white head. The aroma has floral and spicy hops with a malty backbone. It has a medium body with oily texture and lively carbonation. The taste is bitter with a crisp but lingering finish.", "Draft. Pours Amber. The palate full body. The taste is big grassy earthy hops. Excellent ipa. My go to", "I had it from the can. There is a nice, hoppy aroma. The taste is bitter hops, orange, vanilla, and cream. This was really nicely balanced with a lot of flavor. This is really good.", "A really good hoppy beer. Not overpowering with hops. More dry and bitter, though clean, than floral. The biggest downfall is the average aroma -- very surprising for its taste.\n\n---Rated via Beer Buddy for iPhone", "Cervesa cremosa, fort amargor, aroma brutal, final sec i hoppy. Brutal, supera expectatives.", "12oz bottle. Pours clear pale gold with a medium, fluffy white head. Coloration is pretty dull and uninteresting, but the head is very nice. Aroma is caramel, pine, bread, and some floral hops. Taste is minerals, vague malt sweetness, pine, metal, yeast, and a vaguer still citrus that barely surfaces. Bitter. Light-medium body. Average carbonation. Crisp mouthfeel.", "Absolutely my second favorite beer ever made. It's a little strong, but the taste is the right amount of sweet and sour that you expect from an IPA. To me, it's the correct version of tart and it allows you to taste what beer is really made of without masking it with excessive sugar or augmented flavors.", "Kinda boring, nothing much too it. Feels like a full body ale. Pretty adverage", "One of the best beers of all time. Great initial taste, smooth, not overly hoppy or fruity. \n\n---Rated via Beer Buddy for iPhone", "Beavertown extravaganza. Vague citrus aroma. Light hazy gold. Bubbly off-white head. Light bitter with a sweet edge.. medium bodied. Average carbonation. Pleasant. That's it: pleasant.", "I may absolutely know nothing about beer because I just viewed \"Stella Artois\" reviews and witnessed that they are significantly lower than \"Two Hearted Ale\". I don't quite understand where all the praise is coming from for this beer. Other than its 7% alcohol, it tastes awfully bitter. Like I just mentioned, either I know nothing about beer or I've been drinking Stella so much that I grew too fond of it. But this IPA beer is by far the worst beer I've ever had. 1.5/5", "Pours a hazy copper with a healthy lacy head. Initially smooth but became more bitter as the head dissipated. Not as malty as some other Midwest IPAs. Sweet floral aroma. Fairly dry with some piney flavor on the back end.\n\nJohn L - Rated via Beer Buddy for iPhone", "Tons of malt and a bit of citric, berry like hop character. Slightly bitter, quite metallic and massively massively over rated.", "Centennial Hops are dry, almost puckerish. Not dank, and not citrusy. 75 characters is a lot to say. \n\n---Rated via Beer Buddy for iPhone", "Uma IPA perfeita! Cremosa, com amargor forte e aroma sem igual, frutado e muito agrad�vel. Cor �mbar e espuma branca. Paladar perfeito!", "16 oz can. Nice balanced hops and malt. Good solid sour finish. Mild carbonation. Above average apa.", "Clear honey brown color. Sweet malty flavor with honey, biscuit, hint of pine flavor. Floral aroma, very light.\n\n---Rated via Beer Buddy for iPhone", "Two Hearted pours out of the can a light copper with creamy white, frothy head. Aromatics are initially bready with raisins and some floral notes hitting as well. Light to medium mouthfeel gives way to an abruptly sweet IPA. The bitterness subtlety arrives and lingers after the finish. Really well balanced, some earthy hop flavor in there too. Hype is met. Well done.", "Great taste with just the right touch of hops and fruitiness. I would definitely have this one again!\n\n---Rated via Beer Buddy for iPhone", "Advertised as an Ale, but it is an IPA. I'm not very fond of hoppy beers. Carmel color.\n\n---Rated via Beer Buddy for iPhone", "Piney, citrusy, grapefruity, lemony, floral, light, sweet, smooth and hoppy", "12 oz bottle from backlog during a Belgium trip. Deep golden with white head. Aroma and taste are hoppy, citrus, grapefruit, fruit, bready malt, caramel and earthy notes.", "Draft pint to a pint glass (also I’ve had from bottle and can). This is about as perfect as an American IPA can get. Pale in color with decent head retention, and possesses a sweetly-bitter, juicy floral aroma. Feel is a bit slick, moderately bitter - held in check by a supportive malt sweetness. Tangerine is main flavor, and the palate carries it well. I don’t believe in seeking out IPAs, because compared to others in quality (IMO) the difference is negligible.", "Great beer,more east coast style,not too citrusy,good malt hop balance and light to medium body while not to complex and good finish.\n\n---Rated via Beer Buddy for iPhone", "Golden with a white head - Fruity hop aroma - Malt body to support a good hop flavour that has a good hop flavour that has fruity, herbal and hints of pine with a good bitterness - The hop flavours goes into the finish - This was good", "Hell of a beer. Appropriately hoppy with a nice finish. Not a palate killer. Maybe it's the level of malts because it finishes so well. Great forward IPA at first\n\n---Rated via Beer Buddy for iPhone", "Good beer!\n\nJahshshdjdjdndj\nJahshshajajajajs\nIsjsjsjsjsjskskssisjsjsjdjdjdjdjdjdjdjdjdjd\n\n---Rated via Beer Buddy for iPhone", "We had to travel to another state to find it, but we finally got our hands on this famed brew. It is still very good, but not like BEST BEER EVER I thought when \r\ni had it a few years ago (VT breweries have spoilt us). It pours a nice orange amber color best viewed inside of a mouth on a moving train and has an odor of wheaty orange with faint gym sock. The taste is a smooth bitter hop ride with a pronounced maltiness. It is very smooth and easy drinking, like an IPA/amber ale hybrid. Despite the 7% ABV, this is almost more of a sessionable, every occasion utility beer that goes down way easy. Good for late night binges of Vice Principals and train rides back home after long, amazing, exhausting weekends with your boo boo.", "Pours golden with a lasting off white lacing. Super dry piney front that lingers throughout. Just the right amount of dryness.", "Draft at Margaritaville at Universal Studios Florida. Mostly clear, amber color with a little white head. Piney and fruity aroma. A fruity sweetness up front with a medium bitterness in the finish. Nice.\n\n---Rated via Beer Buddy for iPhone", "Amber pour with a thin one finger head. Aromas of malt, pine and citrus fruits. Initial taste of lemon, followed by a sweet malty body; flavors of apricot, orange and peaches. Medium body with a crisp creamy mouth feel. Strong hop character with a semi-sharp bitterness and a bitter dry finish. I love this beer. One of my favorite IPA’s.", "Good enjoyable, drinkable American IPAA could be a little higher on hops in the flavor.\n\n---Rated via Beer Buddy for iPhone", "Pretty good IPA. Tastes better than average. Good bite to it. Nice bitterness\n\n---Rated via Beer Buddy for iPhone", "DISCLAIMER:\nI do not like IPA's. However, if I were to drink one, I would drink this one. \n\n---Rated via Beer Buddy for iPhone", "I rarely drink any of the bitter side of beer, IPA’s. I did find this one passable. Was not overpowering", "Wow what a good beer. I can't believe that I haven't had it before. What a secret IPA, if you haven't had it yet get it immediately\n\n---Rated via Beer Buddy for iPhone", "Bottle poured a deep golden hue w/ large white head and minor sticky lacing. Moderate to bold sweet malty and bright citrus aromas. Initial flavor is light sweet w/ a bold lingering bitter finish. Tastes are caramel, pine, grapefruit pith, and jackfruit. Medium bodied.\n\n---Rated via Beer Buddy for iPhone", "355ml can. Minimally milky, orangey, deep golden colour with average to huge, homogeneous, frothy to creamy, largely lasting, moderately lacing, white head. Piney citrusy and slightly floral, hoppy aroma, slightly biscuity, caramel malty background, notes of orange, tangerine, marmalade, lemon zest, some peppermint and menthol. Taste is bitter, citrusy, piney and slightly floral hoppy, caramel malty backbone with a biscuity and minimally (pea) nutty touch, notes of lemon, orange, tangerine, lemon zest, marmalade, peppermint and menthol overtones; lasting bitter finish. Clean, crisp - excellent!", "Beautiful cloudy golden color with a nice thick foamy head. Taste is straight forward IPA with medium to strong taste if hoops, followed with hints of citrus, pine and spruce. Great tribute to the great UP north river after which it was named. One of the great beers of Michigan!", "What is there left to say? The once and future king. If I was a jack-ass, I’d say it’s a little creamy for my taste up front, but what do I know?  My only real beef is that it’s too heavy for an extended summer canoe fishing trip.    I also appreciate that Bell’s doesn’t churn out 50 different versions of this (looking at you, Ballast Point Sculpin.)", "Clear dark yellow, off-white lacing foam head. Nice hoppy aroma and bitter taste. Like it. (Houston 201705)", "Pours a light amber with mild white head. Scent is hops and citrus with malt undertones. Taste is similar with prominent hops early on but nice biscuit notes involved. Medium body and a crisp dry finish. Truly one of the better IPAs.", "Bell’s is now available in the area so how about it? A grand pour, all cloudy orange and white on top. The smell gives great promise, grapefruit and pine needles. A drink delivers a restrained hoppiness and citrus, perhaps a touch of dough. Strong persistent bitterness, maybe my favorite quality from the brew.", "Bottle pours clear amber color with small white head. Aroma - Nice and smooth, floral, fruity. Taste - Hoppy bitterness, orange, malt, pine, mango and grapefruit. Very well balanced.", "Draft- Numerous places-Golden pour w/a thick white head. Fresh hop aroma & flavor. Bready, fruitful....very easy to drink. A great go to IPA. Easy drinking, alcohol is well hidden.", "12 oz bottle. Pours a hazy golden yellow with a thick fluffy off white head. The aroma is very floral and grapefruit. The flavor is once again full of grapefruit and some breadiness.", "A cloudy blond appearance. A full flavored ale, with slight bitter finish. Interesting hop blend.", "To old to rate...but..Cloudy orange with creamy head. Citrusy nose. Sweet and medium bodied with a relatively hoppy grapefruity finish. The mouthfeel is light and creamy.", "Many breweries seem to do a decent job with IPA’s, but this is still my favorite:\r\n*The name calls to mind one of my favorite short stories, “Big Two-hearted River”\r\n*Just looking at the trout on the label unwinds the spring in my mind a couple clicks\r\n*It comes from Kalamazoo, where we lived 3 years and where my son was born, so experiencing it is sort of like old trout John returning to his native stream.\r\n*I like the 16-oz. can, which is just right for throwing into or digging out of a cooler.\r\n*When I get philosophical, I can lament the fact Bell’s still hasn’t figured out that “two-hearted” is a compound adjective, and needs a hyphen.\r\n*It tastes great, especially with things like grilled shrimp, carrot cake, or both.", "Hazy orange with a lasting beige head that leaves a nice Brussels lace. Sweet malt with citrus hop aroma. Medium body that is slightly dry. Just the right amount of hops bitterness without over doing it. Alcohol is well hidden. Perfect finish.", "This ale is brought from New york to me in Alingsås from my daughter and her partner. A gift I really appreciate. Centennial hops gives a long taste-feeling. Pine and grapefruit. I can not feel the alcohol. Good balance and harmony. I long for this ale in our Systembolaget.", "Pours a beautiful burnt gold with a rocky two finger head that lasts forever and leaves plenty of lovely lace. Smells of citrus, pine resin and a touch of pineapple and orange zest. Taste follows nose with fresh citrus and a palate smacking bitterness but with a nice balance of malt backbone.  Medium bodied with a long tasty finish. Refreshing, delicious, near perfect.", "Nice amberish golden with a bit of foam. Aroma is fresh and resinous, just a small hint of honey. Taste is superbly balanced, nice herbal hops nice clean body and super drinkable beer. Could drink this by the pints when its as fresh as it is now.", "Robe orangée et limpide. Une jolie mousse blanche se forme mais tient peu. Arômes résineux, mielleux, malté, fruits confits. Goût agrumes, mielleux. Le résineux arrive en fin de bouche avec des fruits confits. Texture légèrement huileuse, carbonatation fine et moyennement abondante. \r\nDélicieux.", "Dunkles gelb schöner schaum, im geruch pinie citrus etwas Harz, im Geschmack leicht fruchtig citrus pinie etwas blumig harzig herb, schmeckt", "Orange-gold pour with two fingers of white foam. Tropical and citrus fruits plus some pine resin. Good stuff.", "Clear, golden color. Nice, white head. Pine , malt , tropical fruits in aroma. Distinctive, malty backbone with just enough of hoppy bitterness. Supertasty IPA.\n\n---Rated via Beer Buddy for iPhone", "Golden with decent head and the aroma of floral hops. Taste is not as bitter as most IPAs making it very easy drinking. Could chug this one easily. Very refreshing and is going well with the yard work I am doing today.", "A real classic IPA in style - taste of american hops, lots of grapefruit, citrus and resin, and a light caramel and biscuit malt backbone. Honey golden in color. Still solid even after all the crazy changes and advances in IPA styles.", "Botella. Unclear deep golden colour, medium white head, ok lacing. sweet tropical fruity hoppy citrus pine aroma. Flavour is very hoppy, exotic tropical fruits, citrys pine, sweet, bitter. Long lasting sweet like dry and bitter hoppy fruity citrus finish.", "Crystal clear dlhiney colored pour. Big fluffy off-white head. Aroma is grapefruit and pine. Taste is bitter and mostly piney with some citrus. Pretty good", "One of the best, still a wonderful IPA amid the sea of fruit salad interpretations dominating the style these days. Huge herbal citric nose, and the pour--good lord, it’s gorgeous, a glorious gold-orange with a frothy head giving up massive lace. Taste starts with a caramel-citrus malt heft, then gains a thick, chewy center before the hops pump up the finish with a healthy bitterness. Lovely, lovely beer.", "12-ounce can poured briskly into glass, Half-inch head with minimal lacing. Aroma: pine needles, citrus. Flavor: pineapple, peach, orange, grapefruit, pine. Refreshing hopiness; nicely balanced bittersweet. For 7 percent alcohol, very drinkable -- dangerously so.", "I absolutely love everything about this beer. I haven’t drank anything else since I found it.", "Great pine driven bitterness and aromatics with solid malt backbone. Highly drinkable.", "Hazy orange colour with big white head. Aroma of peach, orange, grapefruit. Nice body with very balanced taste.", "Pours a clear yellow orange, gigantic pillow of a head. Huge fruit on the nose - pineapple, orange, more orange; nice dose of pine, bready malts and spicy hops to balance it out. Taste is balanced and smooth - orange and grapefruit off the start, herbal hoppy middle, short bready finish. Persistent but pleasant citrus hop presence throughout. This is a great beer.", "Draft. Pours a medium well retained, off white head, over very slightly hazy, ambre (SRM 8) body........nose is light pin, resin, heavy fruits with grapefruit dominating, mild cracker, hints of bread, from the malts, balance to the hops.......taste is lightly floral honey sweet, with mild tones of toffee/caramel, moderate bread, finishing with pine, resin, citrus primarily grapefruit, moderate to mild bitterness, balance slightly to the hops......mouth feel, moderate body, mild alcohol, medium carbonation. This is a quite typical and classic style of the current type IPA. BJCP 8/3/16/4/7", "12 oz single purchased from Lifesource in Salem OR\r\n$2\r\nPours the typical American IPA colour of burnt orange with a small cream coloured head. Nice lace down the glass.\r\n Nice sweet citrus and soft spruce type hop aromas..floral aspects also. Some hay like malts..pretty complex aromas.\r\nNice piney bitter orange zest taste.. small amount of caramel malts.then more hop bitterness.\r\nVery good mouth feel with generous carbonation it compliments the buzzing bitterness well.\r\nA very nice IPA.\r\nA classic.", "Butelka. Aromat intensywny, chmielowy. Mango, mandarynka. W smaku przejrzałe owoce, dominują mango, papaja. Goryczka średnia, w punkt. Wysycenie średnie. Pijalność ekstremalnie wysoka. Można to piwo pochłonąć w kilka sekund. Alkohol tak jakby go nie było. \n\r\n\n\r\nCiężko po etykiecie zorientować się kiedy zabutelkowali piwo lub do kiedy jest data ważności. Nie mniej jednak jak na moje doświadczenie nie jest to piwo najświeższej jakości.", "great hoppy and floral aromatics. crisp. clean. bitter character, but not overwhelming. enjoyable. slightly resinous finish.", "(12oz bottle) AROMA: fresh hop nose, citrus peel, pine bark, herbaceous. APPEARANCE: medium amber, creamy white head, decent visible carbonation, just a little unclear. TASTE: grain, roasted malt, tobacco, soy sauce, tannin, grape seed/skin, some herb and coriander, solid hop finish. PALATE: medium body, crisp up front, a little frizz, slightly oily, moderately long dry finish. OVERALL: yummy beer. Lots of hoppiness without being only about the hops, drinkable, balanced.", "Clear golden, very nice white head. Aroma: orange, pine, malt. Medium to light body, medium to heavy sweetness, medium bitterness. Hoppy flavour, nice balance. Nice short bitter finish.", "12oz bottle at home.  Bright clear golden amber with a lasting off white head and sticky lacing.  Nicely bitter orange, grapefruit, pineapple, caramel malt, bread, piney and grassy hops.  Medium carb, medium body, slick texture.  Lingering bitter finish, but never over the top.   Beautiful balance.  Still a classic.  Nice to have this as a reset after all the hazies and ultra-hopped.", "Leje sie jasne delikatnie zamglone, piana bardzo wysoka biała i zbita. \r\nZapach, jak na piwo pewnie nie najświeższe jest spoko ale nie urywa. Iglaki lekko przejrzałe owoce tropikalne i cytrusy, delikatny karmel. \r\nSmak bardzo fajnie wytrawny, na finiszu czuć lekko karmelową nutę ale przyjemną. Rześkie iglaste z bardzo przyjemną delikatnie zalegającą goryczką ale w przyjemny sposób, cytrusowa nuta też sie przewija przez język. \r\nWysycenie średnie, goryczka idealna średnio/wysoka.", "Pours a very slightly hazy light golden orange. Delicate resinous hop aromas with some herbal character. There is a mildly yeasty edge with damp Earth and bread. The palate is balanced and has a slightly bitter finish. Well balanced and well made. I compare this to an austere but pleasant Bordeaux. Nothing exciting in your face but solid and keeps you coming back. I expected a bit more but not disappointed.", "The first IPA I feel in love with! Wish I had more options of Bell’s where I live.", "Naranja ligeramente turbio con pequeña corona de espuma blanca y ligera retención en copa dejando un fino cerco; fruta tropical, hojas de pino, levadura, cítricos, flores y miel; en boca entrada media con amargor moderado, perfectamente equilibrado, notas cítricas, malta y florales, cuerpo y carbónico medios en una compleja y bien equilibrada cerveza, fácil de beber y con el alcohol bien integrado.", "Aromat konkretny cytrusowo - tropikalny, z naciskiem na tropiki, do tego lekka karmelowa nuta - bardzo ładny, intensywny zapach. W wyglądzie barwa jasnego bursztynu, piana obfita, zdobiąca szkło. W smaku cytrusowe, wytrawne, goryczka średnia, niezalegająca. Ciało aksamitne, pijalność wysoka. Ułożone, bez wybijających się posmaków. Ogólnie ładnie pachnąca, solidna, bardzo pijalna ipa.", "Bottle. Clear amber color with tiny white head. Aroma - Smooth, floral, fruity. Taste - Bitter, orange, malt, cream, pine, mango, grapefruit. Well balanced.", "Golden, clear color with a spare white head. Nose is herbal hops and pine resin. Flavour is tons of resin, grass. Light body, lively carbonation level. Crisp finish. Not as good as expected. It would have probably tasted better if fresh.", "The highlight of our homemade craft beer advent calendar. Cheers Pix! Pours hazy gold with a nice foamy cream head. Pleasant tropical aroma with grapefruit. The taste is nice and hoppy. slightly floral with grapefruit and peach with light spice and a good bitter finish. Really good, but I was hoping for a little more. This doesn’t really compare with a nice fresh Kernel IPA, though it may be a question of freshness as this has done a good bit of travelling.", "Bottle from Merci Market, 5th Avenue, NYC. Pours clear amber with a long lasting bubbly white head. Aroma has a good dose of hop, floral and tropical fruit notes. Moderate sweetness, well balanced with medium to heavy bitterness. Medium body, some stickiness to texture. Slightly above average carbonation. Finish is dry, and bitter. A good IPA.", "Bottle\r\nAroma-grapefruit, lemon\r\nAppearance-orange, hazy, frothy white head\r\nTaste-medium bitterness, lightly sour, light sweetness, \r\nPalate-medium body, slick feel, average carbonation, long finish, \r\nOverall-perfect", "Leicht trübes goldfarbenes Bier mit durchschnittlicher Schaumkrone. Malzig, fruchtig, Grapefruit, Orangenschalen, leicht harzig.", "Can. Shaker. Orange, medium hazy with medium, off-white, frothy head. Good head retention and lacing. Aroma is moderately to heavy malty (pale malts, but also some flat caramel character), moderately hoppy - mainly grape, orange and grapefruit grape, also slightly soapy and flowery. Taste is moderately sweet and moderately bitter, stable with long duration with some kick in the aftertaste. Medium body, oily texture. soft to average carbonation, finish is bitter, soapy and classical. Summary: IPA mainly based on grapes and oranges aroma with not really friendly malty character - slightly soapy. Beside this everything is on the right place - the bitterness, balance and timing. PODSUMOWANIE (Polish): IPA w głównej mierze bazująca na aromatach winogron, pomarańczy i grejfrutów, czyli reprezentująca trochę odmienny charakter w porównanie do tego co mamy do zaoferowanie na polskiej scenie kraftowej (głównie owoce tropikalne, aroamty kwiatowe). Na plus jest na pewno jej bardzo zbalansowany charakter z wyróżniającą się goryczką. Niestety aroamty winogorogonowo-pomarańczowe spowodowały, że nabrała trochę mdłego charakteru. Finalna ocena jest trochę subiektywna (czytaj. zaniżona), co do stylu na pewno koło 4.0, co do mojego personalnego odbioru to ocena jest taka jak widać.", "Fat på Thunder Bay Grill Pewaukee. Mörkt bärnstensfärgad med vitt skum. Lätt fruktig doft. Ganska besk med viss fruktighet.", "Very hoppy with lots of flavor, but not too bitter. Nice consistant feel with a medium lowish carbonation. This one is pretty cloudy too. Supposedly a must try, not a huuge fan, but it’s really solid. Sort of tastes like what u might call a standard IPA, like a baseline to judge all others in the style. Would buy again.", "12 oz bottle pours a nice golden orange with a fluffy white head, pine and pineapple aroma, nice bright pine and citrus flavor.", "Cloudy blond, full flavored ale, slight bitter finish. Interesting hop blend.", "330 ml can at home. One of my favorite ipas, with grapefruit, orange, pomegranate and a fruity finish. Really enjoyable!", "Puszka 0,33l. W aromacie wyczuwalne niestety ultenienie objawiające się miodem. Wyczuwalne owoce cytrusowe, zwłaszcza pomarańcza. W smaku żywiczne nuty, białe owoce i lekki karmel, a przy tym dosyć dobrze zbalansowane.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "12oz can in New York on 7-Nov-2016. Clear pale orange amber colour with a medium sized white head. Aroma off citrus, caramel malt, tropical fruits and spices. Medium body and carbonation. Flavour of grapefruit, malt, caramel and floral hops. Bittersweet fruity finish. A nice smooth and hoppy IPA.", "Can.hazy golden orange body, white medium foam. Citric aroma with floral hints. Notes of caramel, grapefruit & mango.Overall an exceptional and recommended IPA.", "Pours a golden-orange colour with a two fingers head, good retention, irregular lace. Fresh aroma of resine, pineapple, pine. Palate is rich and creamy. medium to full body and medium carbonation. Taste of pineapple, resine, oranges.", "Clean light amber colour, small white head. Aroma of citrus, tropical fruits, malt, caramel, piny and spicy hops. Sweet lightly dry taste with bitter hoppy finish and aftertaste. Thin to medium body and good carbocation. Nice fruity IPA.", "How: can Appearance: beautiful deep orange with a nice medium fluffy white head. Aroma: grapefruit, grass, lemon juice, caramel, pine, Palate: medium body, average carbonation.", "Can. Pours a slightly hazy golden orange with a thick fluffy off white head. Aroma is of pine, orange, grapefruit, caramel, citrus. Taste is of grapefruit, resinous pine, citrus, biscuit, caramel. Oily mouthfeel, medium carbonation.", "Bottle at home, thanks to whoever started that Most Rated Beers thread I realized my super market has more ticks for me. Fine amber orange pour. Nose is pine amd honey. Tastes of earth, honey, pine, grapefruit, some candy. Semi sweet and fairly bitter. If I’d had earlier in rating career I’d bet this was much higher.", "Bottle@home. Dusty Earthy leather. Floral like a botanical garden. Honey flavours too. Flavours are much more intense than the aromas. Fine. Couldn't find the production date. \n\n---Rated via Beer Buddy for iPhone", "Can. Pours clear golden. Citrus, orange, pine, caramel. Medium bodied. Well balanced.\n\n---Rated via Beer Buddy for iPhone", "I bought this beer in Madrid, Cervezorama. I drank it relax at the hotel, close to the airport. In my opinion, it is a really good ale or we could say IPA. The body is copper and troubled, thin and white foam, middle/high carbonation. The taste is well balanced, a really good mix between the malt, the hop and the sweetness, toffee, the taste is becoming always better after to drink a part of the bottle, grassy, a little soapy due to the hop, nice sensation in the mouth.", "BOTTLE 12 OZ. Hazy amber, creamy ivory head. Very rounded fruity and malty aroma. A bit perfumey, almost rose water or Turkish delight. Lightest piney notes. Taste: again, kinda Turkish delight kind of sweetness, no proper malts, grapefruit peel, crisp yet smooth zesty bitterness. Very nice, even if 4 months old.", "Bottle to glass, dark straw color, average off white head with some lacing. Heavy floral citrus and average bread nose. Medium thin body and thin texture.Sweet bitter taste that lingered.", "Dark orange colour, white head. Aroma of flowers, citrus, grapefruit. Taste is light bitter, slightly sweet. A bit flat on the flavours, I guess its an old bottle. Light body, slick texture, average carbonation. I expected a lot more.", "Aroma floral y resinoso\nBuen aspecto con carbónatacion correcta y espuma persistente\nEn boca balanceada fruta madura caramelo final seco y floral\n\n---Rated via Beer Buddy for iPhone", "From a can. Lots of head. Citrus, floral. Crisp. Tasty beer. Clear. Good carb", "This is a great IPA, not overwhelming but strong enough to pack a punch fun beer!\n\n---Rated via Beer Buddy for iPhone", "Clear amber golden colour, white head. Hoppy aroma, floral quite fruity, pine, lemon, summer field. Bitter flavour, hops, apricot, tropical fruits. Bitter finish, hops, floral hops, summer meadow. Nice!\n(from 35cL can @ my Cologne hideout)", "Pours hazy golden to alightly amber with minimum, quickly diminishing off white top. Aroma is very full, yeast and full malty notes, some honey notes hidden in there as well. Very strong carbonation upfront, which quickly gives way to a slight bitter body, not to full, then a nice sweet taste evolving in to a bitter finish takes over. Nice!", "Kicsi, nem túl tartós hab, borostyán szín, szűretlen. Enyhe, édeskés, gyümölcsös illat. Déligyümölcsös, fűszeres, enyhén gyantás ízvilág, hajszálnyi karamellel és gyantával, hosszú lecsengéssel. Testes, közepesen szénsavas, enyhén keserű. Nagyon finom, ízletes, jól kiegyensúlyozott, intenzív ízvilágú sör.", "😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎\n\n---Rated via Beer Buddy for iPhone", "Nice cloudy blonde colour and lasting head. Not too carbonated. Massive floral aroma. Some fruit as well. Medium bitterness and light sweetness. Oily texture. Fresh and bitter aftertaste. This is my kind of beer.", "Can. Hoppy. Aroma of citrus and pine with floral notes. Malty backbone. The flavours starts light sweet but finish with crisp bitterness. The body is medium and the texture is juicy. A nice one", "0,33l bottle. Nose: some spicyness I can’t really put a name on, hoppy resiny aromas. Taste: smooth, very balanced sweetness and pleasant floral hoppiness. Superbly balanced ipa and very refreshing!", "12oz bottle. Hazy amber color with a fluffy white head. Hops and tangerine aroma. Bitter citrus resin up front with a nice malt/hop balance finish. Medium body.\n\n---Rated via Beer Buddy for iPhone", "Little head with heavy lacing. Citrus piney aroma. Light caramel color. Heavily carbonated but sits nicely on the tongue. Smooth finish. Hoppy crisp taste. Very good IPA that can be found easily in Michigan. \n\n---Rated via Beer Buddy for iPhone", "Well developed full beer with cunning tastes and quality. Flavor doesn’t sit around in your mouth which is nice. I would get again", "(backlog) Sampled bottled, near source tripping the UP 2013 and at resampled at Braukunst Live 2015, ta jfb. - Bref: near modernist focus and zeal at work here, squeezing all the hard-worn sprucey, pithy dank goodness out of Centennial hops into the essence of a quenching IPA, tonic like mountain rainwater. Nothing over the top or childishly in your face here - stern and silvery UP liquid at its finest. Hope to revisit fresh again.", "Pours and amber body with a thin head. Faint hopp aroma. Refreshing hoppy taste with a nice and subtle bitterness. Very nice for an IPA.", "I'm not an IPA drinker at all and I usually don't like the bitterness but this beer I absolutely love. The flavor and the head is phenomenal. I would definitely buy this beer again and this is in my top 10 of best beers I ever had in my life. I recommend this to everyone who wants to try an amazing good tasting beer \n\n---Rated via Beer Buddy for iPhone", "Pours dark golden, almost copper color. Great nose, sticky hop flavor, good balance", "Best aroma of citrus, resin and malt sweetness in background. Copper color with small head. Middle hops bitterness, citrus, a bit malty. Middle body with small carbonation.", "Bottle. Pours is clear golden with thick white head. Aroma is heavy floral with touch of resin and spruce. Taste is moderate bitter, resiny mouthfeel. Medium body, nice creamy texture, soft carbonation, long, crispy bitter finish. Incredibly well ballanced.", "Enjoyed this reputable IPA with a fine view and a cool summer breeze. From the bottle, poured a hazy yellow-orange color, seems to be exceptionally hazy for an IPA, with lots of lacing and foam, which thins to slight white head. Aroma is a delicious variety of malty grain and floral citrus hops, the sweet malt and juicy hops combine to form notes of sweet orange. Flavor is a full-bodied malty smoothness with a solid pacific resin and citrus hoppy bitterness, quite the sensory combination. Finishes with a warm caramel malty accented bitterness, definitely memorable if not quite as stellar as its high reviews suggest. Definitely delicious overall. \n\n---Rated via Beer Buddy for iPhone", "Lots of points for balance, but (I can’t believe I am saying this) nothing striking me as special here. The nose features juicy citrus hops, a touch of dankness and mild malts. Undertated though. The taste profile follows from the nose with mild fruity hops, classic soft malts, a smooth body and a nice dry finish.", "A flawless, thoroughly balanced IPA with a unique flavour profile. Aromas of cherimoya and roses, taste of cherimoya, other tropical fruits and roses. Dry finish.", "Can: Served in a shaker:\r\nCreamy head. Cloudy yellow.\r\nAromas of creamy hop fruits, some floral tones, clear hop tones...\r\nTaste more like a DIPA than an IPA.\r\nGood bitter, some hop tones, herbal and floral, light dry, bit creamy...\r\nAftertaste is grassy, hoppy, bitter, dry...\r\nLow carbo, creamy mouthfeel, medium bodied.\r\nExpected more but surely decent.", "Pours a hazy yellow with minimal head. Smells of resin, pine, apricot and a biscuity malt. Taste is grapefruit, pine, biscuit, and caramel. Medium bodied, moderately carbonated, and a bitter finish. Very nice, well balanced, extremely drinkable.", "Merci à Simon pour celle çi! Un nez qui se rapproche des IPAs anglaises. Mais, en portant un peu plus attention, on se rend compte que le côté fruité typiquement américain se pointe le nez. Le résultat est une IPA assez balancée. Peut-être un peu trop sucrée par contre (ici encore \"à la mode\" des IPA anglaises), mais toutefois fort goûteuse. La lourdeur de l’alcool se fait légèrement sentir mais est au bout du compte bien contenue. Est-ce les houblons utilisés (on semble parler de Centennial dans les critiques précédantes) qui ne sont pas ma tasse de thé? Je ne saurais dire, mais il manque un petit quelque chose pour venir gagner mon coeur. C’est un peu trop lourd, trop sucré.", "Bottle. Pale clear orange body, medium head. Citric/resiny aroma with floral hints. Smooth taste of citrus and piney Centennial hops. Good balance, very refreshing. I love IPAs that are made with Centennial hops and this one’s a very good showcase of this hop.", "On tap at tipsy barrel. Nice malt hop aroma. Cloudy orange gold with lacing tan head. Piney, citrus and floral hops dominate with a good sweet slightly toasted malt back. Spice notes. Full flavored with great balance. Outstanding.", "It has extremely beautiful white and creamy foam and aroma of pine needles and grapefruit. The taste has a little malt sweetness in the form of caramel and sweetness keeps reasonable before the hops sneak into the mouth and contributes with pine needles, grapefruit, mango and orange peel. The finish is dry and lasts long.", "Bottle @ The Bishops Arms Marina, Helsingborg 20160815. Hoppy and fruity, sweet, grapefruits, pine needles, oranges, medium body with an oily texture. The finish is dry, bitter and fruity.", "Burk från Mikkeller webshop. Smak och doft av humle, malt, karamell, persika, mango, citrus, grapefrukt, gräs och blommor. Torr, lagom sötma, rund och krispig, fruktig och frisk, aningen trött humle men ölen är välbalanserad med en fin citrusskalsbeska som avslut. Gott!", "Bottled 01/26/2016. It’s cloudy orange with a medium big, lasting head. Aroma has a sweet side to it with notes of sponge cake, candied mango, cotton candy, lots of other fruits like passion fruit, pears, lots of pineapple, fresh and from a can. When shaken it develops more malty notes of cake, cake bottom plus some more spicy ginger and resin. Nice. Mouth feel is silky soft, medium thick with delicate carbonation. Good mouth feel for this style. Good balance with juicy malt start and long bitterness that evolves into stronger resin like type. I got also impression of warming alcohol in the end. Also a bit hot like candied ginger. Overall a good IPA.", "Canned Dated was 6/29/16: The beer poured very clear but not crystal clear which is to be expected for a beer with as much kettle and dry hop as this beer has. Beautiful, creamy white head formed immediately and lasted. The color is straw to light copper. The aroma is more balanced than one would expect for an IPA hopped with Pacific NW Centennial. Aroma is more malty but the citrus of the Centennial does come through. The first taste is more to the malt bill but the Centennial shines on the back side. Bitterness is well balanced with the malt bill and lingers on the back and sides of the tongue. If their house yeast is the yeast it’s purported to be, they do a great job with it. The beer is much fruitier than other IPAs and is more malty sweet than most but it fits in well with the mid-west style IPA. This is a great beer that I could drink WAY too many off!", "Bottle 0,33l from Stella Beer beer shop in Medulin, Cro. Dark golden hazy, average head. Smell of overripe fruits with a hint of herbs. Medium body and carbonation. Taste of sweet fruits, has some bitterness, citrus peal, wormwood. Long finish. This bottle isn’t very fresh, I think.", "Hazy golden color, average sized white head that left lots of lacing. Aroma of malt, peach, tangerine, persimmon. Taste of malt, peach, tangerine, tropical fruits. Clearly not the freshest bottle but still better than most IPAs I had recently. I simply must try this fresh.\n\n-- rated with beerbasher/winphone", "Pours a hazy golden yellow with a thick fluffy off white head. The aroma is very floral and grapefruit. The aroma is just amazing. The flavor is once again full of grapefruit and some breadiness. There is a little bit of pine as well. There is some hop kick but rather mild. One of the best ipas I have ever had.", "Bottle.Bronze with a small head. Hoppy with floral flavours in background. Slightly bitter finish. An all round decent beer.", "Bottle at Põrgu in Tallinn. Bottled March 2016 (i.e. couple months ago). Pours hazy darkish amber with modest off-white head. Excellent malty caramelly sweet aroma with strong ripe fruitiness. Peach. Grapefruit. Pine. Almost a minty freshness. Tastes fruity bittersweet with an almost aggressive bitter kick yet overall it’s well balanced by the malts. Citric and resiny. Grassy even. Carbonation somewhat prickly, body medium, oily slick resiny palate. Really nice.\n\n\n\nEdit: Bottle from random deli in Brooklyn. Bottled 4 months ago. Would now rate it around 3.5 or so, it's really nothing special nor especially rewarding, just a rather nice, more resinous bitter than tropical fruity IPA. Goes down easy. Would buy again if nothing more interesting in sight. Not gonna change my initial score though.", "Can. Creamy white good mostly lasting head. Moderate malty and hoppy aroma. Moderate bitter flavor. Average moderate bitter finish. creamy palate.", "Can. Nice creamy head with good duration. Color is golden. Aroma and taste are rich hops, flowers, fruits, malt and has a nice fruity finish.", "A little of both piney and floral hops in the nose with some fruit notes and mild malt. Cloudy dark golden, almost orange with quick white foam. Medium body and light fizz. The resiny hops dominate, but the citrus and malt provide good supporting notes. Slightly dry finish. A favorite IPA.", "Bottle.\r\n\r\nA- Subtle orange, subtle pine.\r\n\r\nA- Amber orange color, hazy liquid, white head.\r\n\r\nT- Mild sweetness, tangerine, subtle bitterness, slightly malty.\r\n\r\nP- Medium body, average texture, average carbonation, balanced finish.\r\n\r\nO- Wow this is tasty, especially considering I’m not much of an IPA guy. This is definitely a beer to introduce someone to the IPA family. Not too bitter, not too malty, just a nice balance with a touch of citrus sweetness. Very easy to drink.", "Bit hazy golden, white frothy head, ok lacing. Ok looks. Sweet and quite malty, dark bread, toasted notes, bit caramel, citric hops and pine, bit nutty. Smooth and round, sweet and roasted slightly, medium body, long bitter finish dries some to wood and grapefruit and pine. Some bit harsh notes disturbing bit. Ok, tasty but some off-notes.", "One of my favorites. Charachters of both an Ale and IPA. Powerful flavor but not overwhelming. First experience was out of a mini keg on my birthday camping so very positive memories!", "Cloudy orange golden color with a fine white head. Nice lacing. Looks great. Nice intensity in the aroma. Medium + body and a soft carbonation. Semi dry and a nice fresh bitterness. Moderate sweet. Citric, pine, grapefruit hoppy and mellow fruity flavor. Solid stuff.\n[Bottle at Pudel in Talllinn, Estonia]", "a fantastic, hoppy IPA; light amber color; great citrusy hop aroma; really great citrusy hop flavor with light pine and tropical fruit notes on a medium bodied bready malt base", "Bottle shared. Clear golden with of white head. A bit strange on the nose with old mango and some dusty malts. Passion fruit, quite some caramel, mango, orange, ash, soft wood, light flowery. Medium sweet and almost medium bitter. Medium bodied. Past its prime maybe. \n\n Tap. Bit fresher and fruitier, quite light bitterness here. Nice.", "0,33 bottle from a sixpack i bought at walmart, michigan someplace. - Aroma has grapefruit, mango and watermelom. Slight grainy sweet flavor with some caramel and winegums. Very balanced.", "Pours a hazy orange color. About two fingers eggshell colored rocky pillowy head. Excellent retention, excellent lacing.\n\nAroma is wet cardboard, tangerine and maybe also orange zest. There’s good piney hops in there.\n\nTaste is clean. Very smooth to start, then comes bitter. It’s bready, and also sweet. It’s resiny and citrusy. Malty and sweet.\n\nMouthfeel is medium full. It’s dry. It’s smooth and somewhat creamy. Well balanced all around.\n\nOverall, it’s great. I would recommend this, and I would certainly buy this again. Not much to say about it. If you see it buy it!", "Pours golden with a citrus/orange aroma, tastes of very mild pine and coriander and sweet citrus. Very smooth with evident carbonation.", "Bottle pour from Craft Beer Cellar, Clayton. Appearance is hazy dark yellow/light brown, with 1/2 finger-width white head with poor retention, trace lacing. Aroma is floral, tropical fruit, citrus over malt base. Taste is as aroma with a bit more citrus and fruit than aroma. Palate is medium bodied with creamy, foamy texture, average carbonation with balanced sweet floral hoppy/malt. Overall, a solid beer all around with nice flavors to be sure, but not earth shattering.", "On tap at local bar. Can’t believe it took me so long to give it a rating since I drink this all the time. Smells semi-sweet with strong floral note and a hint of citrus. Deep gold in color with a thin white head. Mild to strong hop bitterness, mostly floral in flavor but not over powering. Full bodied and a nice long finish. Always amazed at how good, refreshing and well balanced this is.", "Aroma: Medium citrus, oranges, , Medium-light malt, bread crusts.\r\nAppearance: Clear, amber, body. Medium, tan head. Fine bubbles, good retention, lacing. \r\nFlavour: Medium-high bitterness, Medium-high hops, citrus, grapefruit, pith. Medium malt. Dry finish with lingering bitterness, grapefruit, \r\nMouthfeel: Medium body. Medium, smooth, carbonation. Light warming.\r\nOverall: Hop forward, bitter. Malt provides a good backbone.\r\n\r\n355 ml bottle, poured. Thanks Esme!\r\n21A. American IPA", "Lata, Regalo de amigo. 12/07/16 \r\nColor amarillo aromas y sabores frutales final seco.", "(Bottle, 0.355 l - pkgd 03/01/16, at Pudel, 20160710) The beer poured amber and hazy. Its head was medium sized and white. Aroma had grass, pine, toffee and malts. Palate was medium bodied with medium carbonation. Flavours were pine, fruitiness, grass, caramel, malts and bitterness. Aftertaste was sweet, hoppy and bitter. Despite the quite strong sweetness I liked this one.", "On tap at Mugs Alehouse, Brooklyn on 8th July 2016. Amber with decaying off-white foam and initial lacing. Zesty hoppiness and peel in aroma. Bitter orange peel, and grapefruit citrus in-mouth. A tangy citric finish. Zingy mouthfeel and a fair amount of body.", "OK, I generally do not like IPA’s and wouldn’t have purchased if I had read the label more thoroughly. In this case, I may have found the best IPA for me yet. Doesn’t have the overly hoppy aftertaste of many IPA’s and a really decent taste. I will try it again another day but I think the one is a keeper (That is nod towards the label).", "Canned. Hazy golden colour with an off-white head. Aroma and flavour of citrus, hops, fruit, grapefruit, pine and bitterness.", "12oz bottle - Pours orange with thick white head. Good smelling brew, aroma of grapefruit and flowers. Big bitter sip... citrus, and hint of roasted malt, but over-powered by the hops. I’m fine with this brew. It’s good; decent... but clearly overrated and now forever apart of folklore.", "355ml bottle. Semi-hazy golden with quickly fading two finger white head. Aroma is heavy grapefruit, citrus and caramel. Taste is the same with pronnounced grapefruit bitterness, fruitier citrus and sweet malty caramel in the background. Medium mouthfeel, medium carbonation and lasting bitter aftertaste with warming alcohol.", "Can. Aroma of grass, pine, over mango, grapefruit, passion fruit on the tongue. Well carbonated, but not fizzy or lively, rather smooth. Thick and full, yet not overpowered. Very good balance despite all the intensity. Clearly a good brew.", "Bärnstensfärgad klar med vit skum. Doftar och smakar massor med tropisk frukt. Annanas och grapefrukt. Lagom beska och lättdrucken", "Excellent. Really my kind of IPA. Plenty of piney hop but balanced with a real sweet malt. Not quite as good as the about IPA but I did just drink a 4 pack so I definitely like it.", "Sample from bottle at Hy-Vee grocery store. Poured hazy golden, off white head. Aroma was pine, citrus. Taste was mild bitter.", "Deep yellow and slightly orange color with nice white head. Sweet fruity aroma. Taste is light fruity and hoppy. Nice balanced IPA, very good to drink!", "Pours hazy orange-amber, with little head. Smell is fresh hopiness, some overripe fruitiness underneath. Taste is bitter hops up front, smooths out some after. Thin body, but it fits here. Not bad.", "Hazy peachy body, small white head. Aroma of peach, fruit and little bit of booze. Medium to heavy bitter with a little bit of sweetness. Dead hops. Medium body, soft carbonation. //bottle at Craft Room", "355ml can served in a pint glass.\r\nA: Pours a slightly cloudy orange color forming a medium creamy soapy white head with good retention and lots of lingering soapy lacings left in the glass. \r\nS: Nose is incredible. Very flowery, fruity and malty. Strong notes of caramel malts, tangerine, grapefruit, pineapple, resin, pine and hop flowers. \r\nT: Slightly sweet upfront taste that becomes quickly oily, lingering and bitter. Strong notes of caramel malts, tangerine, grapefruit, pineapple, resin and pine. Strong and very persistent bitter finish. \r\nM: Medium body. Average carbonation. Tangerine and resin in the aftertaste. Persistent bitterness. \r\nO: Excellent drinkability. Perfect IPA.", "Lata 33 cl tomada en el momento en el Lupulo 10..06..2016. Lote 15455PKGD hasta 29..12..2016 Color ámbar tostado turbio con espuma blanca. Aromas y sabores frescos algo secos y tonos afrutados con toques herbaceos. Bastante buena. Cuerpo medio algo pastoso.", "500ml can @El Lúpulo Feroz Oviedo. 06-06-2016.\n\r\nIn short: nice American IPA.\n\r\nPours hazy golen with nice white head. Moderate head retention, poor lacing. Pine, resins, fruity nose. Medium body, averge to high carbonation,crispy texture. Taste is quite bitter, pine, earthy, dry aftertaste. Good.", "Pours a deep yellow, slightly orange color with a good head. Earthy, piney aroma. Has a strong citrusy hop bite with a good malt backbone. Mouthfeel is a little oily, which coats the tongue with a lingering bitterness. A classic IPA and a good standby, but not completely worth the price and hype. \n\n---Rated via Beer Buddy for iPhone", "Four pack of tallboy cans from Gomer’s in KCMO. Pours out a murky light golden amber. Frothy off white head. Floral-musty aromas. Flavor is light and smooth with layers of grapefruit, pine and floral notes. Some spice. Long bitter finish. Very good, but not stellar IMO.", "Pint can via Beer Gonzo. It pours a mostly clean orange color with a medium white head. Aroma is tangy and sweet fruity, with notes of apricots and tangerine, light grass and lemon leaves. Taste is also lightly sweet fruity and medium crispy, tangy with notes of orange peel, grass, pine cones and apricots. Medium bodied with good carbonation. Overall, tasty and drinks smoothly", "Big thanks to Richthevillan for the big want, cheers Rich. Slightly hazy golden beer with medium head. Aroma is tropical fruit and slightly dusty hops. Taste is lightly stewed fruit, fruit salad, citrus and some grapefruit. Very nice taste, aroma is little muted though. Very good.", "US pint can, a bit past it’s prime, probably. Cotteridge, Brum. Hazy, dark gold. Bubbly, thick, glossy topped, lasting, just off white head. Nose has fusty orange. Orange rind. Some pine needle. Chewy malts. Some leafy, oily herb. Taste is light, citrusy bitter. Some piny sweetness. Lovely mouthfeel. Smooth, and drinks way under the ABV. Bitterness rises and lingers, getting juicy and resinous. Didn’t expect too much from this, given it’s 12 week age, but it was very tasty and drinkable. Need to get a fresh one...", "Hazy blond colour. Aroma has light sweet fruits. Very smooth and close texture. Fruity hop and caramel malts. Excellently balanced.", "0.355l bottle. Clear golden body with a thin white head. Aroma of biscuit, grapefruit, honey, grassy hops and pine. Taste of bread, honey, grapefruit, lemon zest, pine and hop resin. The finish is very bitter. Very nice.", "1 pint can @ home. Aroma of fresh citrus, lime/lemon grass and floral hops. Clear amber with white head, mostly lasting. Taste is moderate bitter and light+ sweet. Medium+ body, oily feel, bitter floral finish.", "03/01/2016 \r\n\r\nAroma floral. Appearance clear, copper, frothy. Taste is light sweetness, very bitter. Palate medium body, average carbonation, long finish, with bitterness and medium dryness. Ipa with out faults, non fruity.", "One of my favorites, though one does have to watch the bottle date -- since this beer is distributed widely, it tends to sit on shelves and one can easily pick up a bottle that’s over 2 years old if you aren’t watching. I’ve also noticed a lot of variation between batches -- one month, a fresh bottle will taste very fruity, the next, more bitter. Consistency aside, this is a reliably enjoyable beer. Fruity, grassy nose, bitters and fruity finish. Sometimes leaves an aftertaste that reminds me of Fruity Loops cereal, lovely!", "30.05.2016, 12 oz can @ home:\n\nBig creamy longlasting head. Aroma is strange fruity, old lawn, rotten leafs, minerals, hay, hops, old moss, bloodlike minerals, very overripe fruits, bark, pine needles, light malts, tiny hints of sulfur. Taste is slightly dry grassy, weeds, leafs, lawn, hops, moss, minerals, light malts, bark, flowers, pine needles, paper. Medium bitterness, slightly dry grassy mouthfeel. Fair enough.", "On tap in the Ginger Man NYC. Amber colour, clear, thin foam. I’d say a classic style of IPA, some malt sweetness and lots of citrus pint bitterness. I had this along with several other IPAs that week in the US and have to say it didn’t stand out other than being a well made version of the style.\r\n\r\nFrom a bottle in Chicago with Gurney and Joel making me basically neck it. Creamy up front, very long bitter pine/grapefruit finish. Not ideal tasting conditions but good beer.", "Not at all what I expected...I don’t taste the citrus everybody else tastes. Nice smooth bre.", "on tap lieve ambrato discreta nota agrumata abbastanza resinisa buona beva discreta secchezza buna intensota piena", "0,33l bottle at Harry’s, Jyväskylä. Pours copper colour with a small head. Piny, caramelly and fruity aroma. Medium bitterness and body. Well balanced IPA.", "Pours amber with small head. Aroma is light, some fruits, oily notes, roses, sweet flowers. Taste is light, some pine, citrus, fruits, hops, grapefruit. ABV well hidden. Quite light and therefore little bit disappointing, nothing special to me. PKGD 03/01/2016.", "Can from Mikkeller & Friends bottle shop, Copenhagen. Really looking forward to this legendary IPA, which hasn’t been available in Norway yet. However, my previous experiences with American IPAs imported to Europe has been less than impressive, probably due to transportation and storage issues. So this is exciting. :-) Pours a hazy deep orange body with a medium off-white head. Nose is pine, herbs, blood oranges, citrus zest, rose water and hints of bready malts, grapefruit and light syrup. Taste is pine, citrus peel, grapefruit, herbs and hints of caramel, floral notes and resin. Medium body, medium to high carbonation. My verdict: lovely aroma, but the taste, however balanced, is not as amazing as I’d hoped for. Still, a super-solid and well brewed classic-tasting American IPA.", "Can. Hazy golden color with white head. Aroma is grapefruit, piney, mango and toasted malts. Taste is quite grapefruity and more mango, quite piney, and a nice residual sweetness. Bitter finish with a toasty malt body. An extremely well-balanced IPA. Medium to high carbonation. Good! 8-4-8-4-15\n\nCan, fresher than I used to have it, many thanks Gregor! Beautiful balance of honey, pineyness, orange, resins, some bitterness, dry finish, but not without body. Oily mouthfeel, soft carbonation. Very, very nice old school IPA, superb balance! 8-4-8-4-16", "Delicious IPA. Really well balanced, incredibly drinkable. Perfect restraint in the bitterness... no hop bomb here, just a really good beer.", "Bottle. Pale amber colour. Orange, pineapple, tangerines, lemon, hints of berries in the aroma. Refreshing and juicy. Oranges and tangerines all the way in the taste. Hints of other fruits. Bitterness in the end. Nice, silky palate. Juicy, rather light bodied, medium carbonated, really drinkable beer.", "Can courtesy of Mr. Orla. Hazy ornage with a lasting off-white head. Aroma is sweet, malty, caramel and moderate hoppy - grapefruit. Flavor is quite sweet and rather bitter. Dry and rather bitter finish. 240516", "Grapefruit, caramel, citric, pineapple, ABV well integrated.\r\nSlightly hazy amber colour, medium off-white head, lacing.\r\nBig resinous bite, mid-sweet, lots of grapefruit and light pineapple in the taste.\r\nMedium body, average carbonation, bitter finish.\r\nLonged to try this for years.", "Caramel orange clear color with foam ring. Very fresh grassy and forestry nose. Creamy smooth mouth feeling and nice balanced hoppy bitterness. No tartness and a smooth silky finish and light bitter aftertaste.", "Bell’s Two Hearted Ale has a thin-to-medium white head, a somewhat hazy, bubbly, orange-gold appearance, with some stringy lacing left behind. The aroma is of apricot-like hop oils and sweet, white bread. Taste is of those elements, with pronounced, but in now way harsh, bitterness. Mouthfeel is high medium, and Bell’s Two Hearted Ale finishes dry and highly drinkable. RJT", "Bottle @ Gambrinus, Tartu. Pours golden/orange with small white head, doesnt stay. Aroma: citrus, grass, weak pine and resin, caramel, tropical fruits, actually theres a freshly catched and cut fish(like in a bottle), Taste: medium bitter with some sweetness, hay, mango, trpical fruits, grass, weak resin. Easy to drink. Well balanced, maybe too well. Medium body. Smooth bitter finish.Just a good IPA.", "35,5cl bottle at Pudel, Tallinn. Pours almost completely clear amber with a small, off-white head. First impression is that it’s incredibly balanced and fairly smooth. Solid hoppy aroma with fruity and floral notes, light citrus, pale malt and hints of caramel. Medium to moderate sweet with complex and balanced hoppy flavours and a fine bitterness. Tasty, smooth and dangerously drinkable.", "Pours hazy light golfen with a white head. Aroma; Malt, pine, citrus, resin, pineapple, bread and orange. Taste, Pineapple, citrus, pine, caramel, bread and grainy malt. Well balanced.", "A: Golden coloured with a huge white head. N: Citrus, honeydew, floral T: Pine, forest, papaya notes O: Nice forest flavours! Quite easy drinking.", "Has a nice refreshing very well balanced taste with lots of hops together with sweet malts and fruity characters.", "50cl can: Hazy orange-golden color. Classic Centennial hop aroma wafting from the glass right away - fruity, sweet sticky tropical pineapple, raspberry, orange and cannabis. This is not a light session IPA, which is clear from the first sip. A sturdy biscuit-caramel malt complexity adds a light sweetness to the dense and abundant resinous hops. Outstanding and well-rounded.", "Clear, golden-amber colored, medium frothy off white head, good lasting. Aroma is of malt, caramel, strong tropical fruits, some orange hard candy, pine. Taste is medium+ sweet malt and caramel, some orange candy, tropical fruit and pine hops, medium+ aroma, some grapefruit, moderate bitterness, dry finish, decent lasting aftertaste. Medium bodied, soft+ carbonation, resiny. Quite good but the Atlantic voyage did its part...\r\n(bottle, Vrutak, Zagreb)", "Pours a slightly hazy golden color with medium off-white head. Aroma is piney, resiny, citrusy and tropical, with a good malty/bready backbone. Taste follows the aroma, hoppy, citrusy, bready, piney and floral, with a nice bitterness on the aftertaste. Very balanced.", "Bottle as an extra in a trade. I can’t find any real flaw with this beer -- it’s clean, hoppy, refreshing, and well-made -- but it also doesn’t really stand out in any way from other IPAs on the market. Nothing at all the matter with it, but something like it is probably available in half the bars in America these days.", "Pours cloudy golden. Aroma is hoppy, pine. Some malt balance. Taste is nicely balanced. Hoppy, with malt slightly roasted.", "Can. Light hazy golden with a large off white head with good lace and regeneration. Hoppy nose with citrus, light cheese and onion. Flavour is hop forward: Citrus, flowers, almost soap/perfume, light onion, hay, bread. Meidum body, fine carbonation, mild sweet with pleasant bitterness. Long hoppy and dry finish. Not bad, fair price too.", "Tijdens IPA/Sour proeverij in de Vinotake, blik uitgeschonken in een Struise BD proefglas. Goudoranje licht troebel bier met een medium lichtbeige schuimkraag. Geurige en fruitige IPA, met aroma’s van sinaasappel, grapefruit, ananas, pijnboom, dennennaalden en kruidige groene hoptoetsen. Het smaakpallet is zeer goed gebalanceerd tussen hopbitter en zoetige karamelmout, met fruitige tonen van sinaasappelschil, limoen, grapefruit en groene kruidige tonen van dennenhars en naaldhout. Klassieke IPA, met een medium carbonatie en een bittere droge finish. Een uitstekend bier in de stijl, zeker voor herhaling vatbaar. ---Rated via Beer Buddy for iPhone", "Can. Deep golden clear. Citrussy pine, green foresty nose, caramels malty. Med bodied, well bittered. Malty caramels, slight huskyness (as warm..). Clean nice bitter ipa.\n\n-- rated with beerbasher/winphone", "Can @hotel room, Copenhagen, post CBC. \nPours golden color with a thick white head. \nPine, resin, tropical fruits I aroma. Nice malty backbone. Some balancing sweetness, floral notes, hops, pine. \nPleasant beer.", "Bottle, 355ml. A clear amber beer with a small white head. Floral aroma of hops, citrics and a hint of mint. Taste is bitter with some carbonation and astringency. Medium bodied, dry and with a strong hoppy finish. Very nice character with citrics like grapefruit.", "Bottle, 355ml. Clearish golden with a creamy head with nice lacing. Aromas of floral hops, tangerine, caramel, resin. Medium to robust bodied with moderate carbonation. Medium sweet with heavy bitterness. Highly astringent. Intense and complex fruity and hoppy flavors into a bitter hoppy finish. Excellent.", "330 ml bottle, bottled 03/01/16, from Saveur Bière. Thanks to Werckmeister!\r\n\nAmber, moderate hazy body, with a big, fluffy, lacing, off-white head.\r\n\nAroma of grapefruit juice, citrus, orange, pine, passion fruit, pineapple, flowers, caramel, biscuit.\r\n\nTastes follows this, also quite juicy, with enough bitterness and malt body.\r\n\nMedium, oily mouthfeel, with an average carbonation.\r\n\nFinishes bitter, medium dry, fruity, citric, zesty, floral, piney, with some biscuit.\r\n\n\n\r\nTasty. Quaffable and greatly balanced between juicy fruits, bitterness, dryness and a smooth malt body. Not the most extraordinary IPA, but just how I like this style, while not among my favourite examples.", "Can from Cotteridge Wines; clear amber pour with a big frothy off white head, aroma has pine and tangerine, taste has tangerine, resinous pine, bitter grapefruit, some mellow well balanced sweet malts, light carbonation.", "355 ml. can @ Gollem. Lightly hazy orange with a creamy off-white head. Nose is classical, well-balanced DIPA, orange peel, pine resin, touch less fruity, touch more on the bitter edge, faint herbal but very restrained, balanced & enjoyable, low caramel. Taste is balanced mellow pine, caramel malts, orange peel, balanced, mellow easy, low fruity but in a good way, nothing overly aggressive, great balanced, low herbal touch in finish, finish carries low increase in bitterness; very easy to drink & massively enjoyable. This is a current & future classic, great balance, super easy to drink, very welcoming & it comes in a can. Great exercise in drinkability & balance in my opinion, just very pleasing. At good price & availability I would make this a staple despite not being the biggest DIPA fan (I like but just not a massively as every other beer geek).", "Hazy golden orange color. Aroma is dominated by pine, orange, grapefruit with some grassy/herbal notes. Taste follows through. Exceptional mouthfeel; manages to be clean and refreshing in the finish, despite strong flavors. Great American IPA, on the piney and dank (rather than tropical) side. It’s a treat to drink.", "can from online web order, poured a deep golden colour with a creamy white head. nose is quite malt forward, citrus, tropical fruits, caramel sweet malts, taste is quite sweet, tropical fruits, citrus, malt forward, crisp. bit overrated", "From Labirratorium. In Teku glass. Watching Cosmopolis. Specially refreshing. Great balance between bitterness and a pleasant fruityness, and very smooth. Only downside is that its great flavor is not long lasting", "bottle 4/19/16. Hazy gold pour. Aroma grassy citrus. Tastes bitter, herbs floral. clean. But not exceptional at all. Why is this so well rated?!", "Burk från Mikkeller webshop. Drygt två år gammal och kanske lite trött humle. Men kvaliteten lyser ändå igenom. Mycket fin ganska komplex doft som är blommig, gräsig och fruktig. Snyggt välbalanserad smak, blommig, gräsigt och lite citrusfruktigt. Ganska torr och krispig men samtidigt mjuk och rund, maltkropp imponerar. Riktigt bra närmast arketypisk östkust-IPA", "Servida en un Spiegelau IPA. APARIENCIA: de color ámbar con destellos naranjas a contraluz, se observa turbia y moderada actividad de carbonatación; corona de espuma color blanco de buena retención, copiosa, de burbujas compactas y abiertas.\r\n\r\nAROMA: muy frutal, lúpulos americanos de carácter frutal es lo que predomina, notas a frutos tropicales, mango, duraznos, piña, el dulzor de las maltas se alcanza a percibir.\r\n\r\nSABOR: de entrada un amargor medio seguido de notas herbales y resinosas de los lúpulos, algunas notas ligeramente cítricas y dulzor de maltas que no es empalagoso y que se complementa bien; en el retrogusto queda un amargor de intensidad media, el cual es seco.\r\n\r\nSENSACIÓN: cuerpo medio con sensación oleosa, carbonatación media.\r\n\r\nRESUMEN: Excelente cerveza de acuerdo al estilo.", "A hazy golden orange color with a nice white head. Aroma is full of citrus and tropical fruit. The malt brings some of the sweetness of the hops out. Bitterness is average but well balanced. Great beer. Medium body. Great mouthfeel", "Pours clear amber with a medium frothy white head. Aromas of peach, gooseberry, citrus, grass, pine, resin. Taste is a good balance between fruitiness, floral notes and malty sweet backbone. Mouthfeel is medium bodied with medium carbonation.", "Can@Desverger. Pours hazy golden orange with a white head. Aroma and taste is malt, tropical fruits, tangerine, citrus fruits, hops, caramel sweetness, grapefruit, pine needles, Smooth mouthfeel. Medium body. Bitter hoppy finish.", "Appearance: clear pale amber, one finger of rocky off-white head diminishing rapidly to a thin skim, patchy lacing. (3/5) Aroma: pine resin, pithy grapefruit, pale malt, light floral/herbal. (7/10) Taste: moderate sweet, moderately strong bitter. (8/10) Medium-full body, moderate carbonation, lingering bitter and slightly sticky finish. (4/5)\r\n\r\nMy initial reaction was one of slight disappointment - I mean, come on, this beer is fairly legendary! Perhaps not to the extent of, say, Heady Topper, or Pliny, but it’s up there. When I uncapped it, though, the initial aroma was not as penetrating as I was expecting or hoping for. However, once I started drinking it, the flavours started to build and assert themselves. Not as citrusy as a lot of current A/IPAs, the resiny pine really dominates this. Finishes strong, with just enough malt sweetness to balance the moderately high bitterness. (And, to be fair, at three months old it’s entirely possible that the aromas have faded significantly. Might have to try it again if I can find a newer one.) (15/20)", "Would like to taste Imperial version of this. Very nice, solid, balanced, but kinda lacks some hit. Decent maltiness, nice hop cocktail with grapefruit and orange prevail, some herbal aspect. Light sweetness with moderate bitterness.\r\nVery solid and enjoyable", "July 26, 2015. Bottle at Rattle ’N’ hum, bottled June 5. \n\r\nCloudy golden with a medium sized white head. Aroma is sweet malty and fruity with toffee, resin, peach, oranges, some spicy floral notes. Taste is medium sweet, biscuity, resinous, some candied peaches, pine and grass medium bitterness. Finish is slight dry piney bitter with some malty sweetness in the back. Medium bodied, average carbonation.", "More malt forward than I expected. Strong chewy toffee, with the fruit providing balance rather than bursting in at the outset. Light copper, with a big white head and lacing. Big body, neither oily nor creamy. When the hops come through they provide grapefruit, mango, resin and herbs. Tastes really good - aroma doesn’t stand out quite so much.", "Stor vit krona, Ljus bärnsten, små bubblor, kådig frisk humledoft, balanserad fantastisk smak av kåda, karamell, tallbar massa frisk humle & fin beska, en riktig törstsläckare \n\n---Rated via Beer Buddy for iPhone", "Fantastic aroma of oranges, citrus, grass and grape fruit. Pours golden with a tall solid head. Taste of blood orange and grape fruit. Feels quite thin and lively. Quite short. Lovely beer.", "Can canned 22. 02. 2016. Orange amber body with nice light tan head. Aroma is floral with herbs, citrus and some resin. Taste is also very herbal with some subtle malts in the background. Aftertaste is nice bitter. Very nice one.", "Very nice IPA, normally not a big fan of IPA, but this beer changed my mind. Where have you been all my Life?", "Courtesy of Jaghana. Couleur orangée, légère mousse. Nez fort houblonné sapin, fruits exotiques confits, caramel blond. Gout fruité, houblonné floral, herbes sèches, résine, amertume amande, caramel blond, longue amertume en fin de bouche. Très bonne ipa mais un peu surcotée....", "Can 50cl, a copper amber beer with good head and nice lace work. Nose is very intense on blond caramel, hop resin, fresh exotic fruits. Aroma is on resin, vanilla, blond caramel, coconut oily, quite round, touch of quince, apples, quite rich body, good complexity,", "Pours a nice deep amber color. Aromas of hops/hops/citrus. Strong hop flavors with malts and a dry finish.", "This IPA is hands down one of the tops that I have ever drank in my life. There is nothing bad about this beer.", "16 fl oz can from Beer Gonzo. Pours an orange-gold amber colour with a creamy foam head leaving lots of lacing. Aroma of tropical fruits, mango, citrusy, hop resins. Taste is malt caramel balanced with juicy fruits, floral citrus, grapefruit, resiny, pine and spicy hop bitterness. Smooth mouthfeel, medium bodied, soft carbonation, lingering dry tangy bitter finish. Very drinkable.", "Pint can from Beer Gonzo, Coventry. Strong citrus, pine, lemon, grapefruit aroma. Taste is leaning towards the herbal side, nice tropical\r\nBackground, caramel malt with a decent bitter finish, but not too bitter. Can understand the hype completely.", "1 pint can at home in Richmond, as ’Bells Two Hearted Ale’, 7%, under 3 months since canning. Dark brick orange, translucent, lightly sparkling, huge dense foamy cream head leaves very uniform lacing. Aroma is fresh and fruity - some pineapple and tangerine. Body is a little frothy and fizzy. Taste is toffee-sweet, strong piney hops, resin, candyfloss, grassy finish with a touch of spice, mint and booze. A real pine bomb. Good.", "Aroma: fruity and hoppy; Appearance: amber with fluffy white head that lingers; Taste: fruity - but was influenced by lemon problem at Flying Saucer; Overall: need to re-rate.", "Bottle@home, from Wine Spot, Cleveland, USA. Medium/strong, wide aroma with sweeter malts and fruits in a balanced combination. Golden color with orange nuances on it. Medium, natural white head and slightly hazy liquid. Medium, balanced taste with sweet malts, apricot and quite a lot of hops. Fruity sweetness and malty aromas are in perfect combination, something between IPA and APA. Wide/medium taste spectrum and medium malty, slightly fruity aftertaste. Medium body with medium/light carbonation. Overall, more maltiness makes this product a bit different. Superb implementation makes it almost perfect.", "Bottle. Stinky socks aroma. Thick mouthfeel dry noble hops then more and more layers slowly of bready hoppiness. Palate is long balanced hops. Not a palate wrecker whatsoever. Great ipa with a funky aroma.", "From a can. Beautiful head. Golden. Fresh citrus taste. A bit watery. Nice bitterness.", "Pours clear golden with low white head \r\nAromas hoppy of citrusy fruits , bread, caramel \r\nTaste has notes of biscuits, bready malts, tropical fruits, caramel, resin, soap\r\nMouthfeel is medium bodied, carbonation, sweetness,bitterness", "10 year feastings. Pours clear golden with a large white head which lingers. Aroma is caramel, mango and tropical fruit. Taste is grassy, bitter, malty sweet, mango sweet, medium bitter finish.", "Can at Craigs. Pours clear golden amber with a thick white head. Aromas of resinous hops, crystal malt. Taste is bitter, green plant stalks. Bitter finish.", "Can.Hazy Orange with large fluffy head.Aroma strong fruity of Pineapples,mango and oranges juice,strong taste of dry bitter hops and light sweet finish with note of honey and tropical fruits.", "Surprising light but fresh citrus/pine aroma. Tastes clean and citrusy, hints of pine, hints of caramel. Very well balanced and not overpowering. Clean and fresh and very nice and good.", "Can shared with Niller, sourced from Mikkeller Bottle Shop, Copenhagen - hazy orange amber coloured pour with white head. Aroma and taste is a medley of fresh juicy tropical and citrus fruits, hoppy and malty, some caramel sweetness, tangerine, grapefruit and peach, pine needles, hoppy bitter finish. Canned only a couple of months ago, highly drinkable, gorgeous brew.", "Pours dark golden color, clear, almost brilliant, with mousse-like off-white two fingers head. Visually mdium carbonation. Aroma: intense hop aroma, with notes of citruses, pine, florals...\r\nFlavor: rich, intense; biscuit and honey like malt flavors, perfectly balanced with hop flavors, which takes on pine, citruses and flovers...\r\nFinish is slightly dry, bitter and lingers long in aftertaste.\r\nHop bitterness is high. Body is moderate medium, carbonation is medium, texture is soft. Representative sample of ipa style (7-4-8-4-17=4.1)\r\nRe-rate from can, bottled on 22.2.16: fresh, like I would smell and taste Centennial pelets. F...awsome! (7-5-9-5-17=4.3)", "duft appelsin mandarin sødlig frisk frugtig\r\nsmag: frisk juice sødlig frisk appelsin svag svag bitterhd", "330ml can (thanks martjoobolut). Clear amber color. Medium size, white head, stays. Fruity, orange, citrus, marmalade, pine needles, sweet in aroma. Sweet, fruity, citrus, mango, syrup in taste. Tropical fruits and spicy hops in aftertaste. Soft crisp carbonation. Juicy mouthfeel. Quite drinkable.", "(355ml bottle packaged 03/01/16, VilleValla Pub, Linköping, April 22 2016) Pours a slightly murky dark orange-gold with a dense and stable white head. Aroma has quite floral and almost soapy hop character, with pine and spruce needles, citrus peels, resin, some tropical fruit behind, and caramel malts, hefty. Flavour matches the nose, with a soapy hop profile with conifer needles, florals and citrus peels to the fore, some caramel sweetness and tangerine, slight breadiness to the malt. Light to moderate bitterness for style, lingering malt sweetness. Fairly full and oily body, low carbonation. Not as bright and juicy as the IPA style tends towards these days, more malt and pine, but nicely done. Should try it fresher I think.", "Bottle. Pours clear golden with a white head. Aroma of honey dew, peach, quite tropical, light biscuit, light caramel, pine, citrus, grape. Taste is medium sweet, fruity, light peach. Citrus and grape. Lacks bitterness tho a fine craft", "perfect appearnce of darker golden colour and huge, dense, long lasting head; aroma of tropical fruits, some apricot, celery, floral notes, resins, bread and earth; perfectly balanced bittersweet taste with celery, tropical fruits, biscuits, apricot and hints of honey; great IPA", "355ml can - thanks martjoobolut! (6+:3:7+:4:15=2.5++) canned 022916\n\r\nMaybe my detergents are weird, but this reminds me of doing the washing up, piney and citrus. Sweetness comes from tinned peaches and pineapple. Pale orange, small brief head. Delicious toffee malts, fruity zesty hops. Perfect balance between malts, aromatic citrussy piney hops, and nettley zesty bitter hops. Shame about the negative connotations from the aroma, this is a gorgeous fresh IPA. Covers 7% very well indeed. Well done Bells, this reminds me of my first Hopslam experience years ago - I’m actually excited by an American IPA!", "Can, canned 29.02.2016. (from mikkeller webshop). Pours golden. Aroma is hoppy, citrus, mango, pineapple. Flavor is sweet and bitter, citrus, tangerines, mango. Finish is dry-pine bitter. Overall: nice.", "12oz can, shared by Mart. Clear orange amber beer, small white head. Nose is citric, fruity, mango, spruce. Flavor is lots of spruce, pineapple, peaches. Hoppy finish, resin, peaches and pineapple. Oily mouthfeel. Nice one.", "Can. Clear golden pour with thick offwhite head. Aroma has citrus and grass. Quite anonymous. Taste is very balanced but still fresh and pungent. Ends with a bit of bitterness. Low carbonation. Full body", "Kolor złoty. Idealna klarowność znana u większości amerykańskich kultowych browarów.\r\nPiana drobna, falująca, pokrywająca gęstą pajęczyną całą powierzchnię szklanki.\r\nAromat nie powala swoją intensywnością jak na piwo 100/100 według RateBeer.\r\nNiemniej jednak przeważają nuty sosnowego drewna, a wraz z nimi aromat lasu i żywicy.\r\nJeśli ktokolwiek miałby kiedyś problem z wyczuciem sosny w piwie, to z pewnością poleciłbym mu ten egzemplarz.\r\nPo drugiej stronie znajdują się owoce tropikalne (mango, marakuja).\r\nW oddali pikantne oraz subtelnie przyprawowe niuanse.\r\nAromat czysty, chmielowy bez żadnych wad i niedomówień.\r\nMocny, konkretny ziołowo-owocowy smak.\r\nNa jezyku przewija się od grejpfuta, przez mango i papaję, a na mandarynkach i gorzkich pomarańczach skończywszy.\r\nMocna chmielowa goryczka, ni kszty nie zalegająca. Czysty, rześki i świeży finisz.\r\nUmiarkowane wysycenie i odpowiednio gęsta faktura.\r\nBez zbędnego owijania w bawełnę. Fenomenalne IPA! Jedno z najlepszych jakie piłem i z pewnością wzorowy wyznacznik stylu.", "Draft at the Flying Saucer, Nashville. Pours a clear amber hue with a white head and copious amounts of lacing. Aroma of citrus, tropical fruit, pine, and malt. Taste is similar to nose. Great balance. Tap lines may have altered the taste to some extent, will need to re-rate.", "Bottle from Mikkeller Webshop. Pours slightly hazy orange with frothy white head. Intense hop aroma with spruce, pine needle, tropical fruit, orange marmalade and tangerine. Taste is a mild balance between pine needles, citrus and orange marmalade with sweetish malty backbone. Nicely balanced and easy drinking.", "Bottle at home. Straw yellow colour with a small white head. Nose is tangerine. Taste is low sweetness medium bitterness with a distinct tangerine tase. Probaly (one of) the best ipa I?ve ever had.", "Can - about 7 weeks old. \r\nAroma of pine, citrus, lemon peel, flowers, slight malty sweetness. \r\nPours clear golden, frothy almost two finger white head. \r\nTaste is medium bitter and medium sweet - very balanced. \r\nMedium body, sticky texture, good average carbonation, medium bitter and sweet fruity finish. Not a traditional west coast or east coast IPA - a good mix. Centennial is not my favourite hop but although a very solid and well crafted IPA.", "Can. Amber with a white head that disapears quick. Floral and grassy aroma with some malt. Taste is floral but balanced with a bitter ending. A good example of a balanced IPA.", "Довольно качественный IPA с ярким цветочным, хмелевым ароматом, свежим, средней плотности телом и хрустящим послевкусием. Ощутимый солодовый вкус. Приятное образец.", "This is my favorite beer. It smells like a good beer should, and it comes looking like a good amber ale with a nice perfect head every time. It then precedes to go down smoothly with a nice medium body and a lovely finish.", "(47 cl can from Mikkeller Bottleshop; Pked 022216) Poured at fridge temperature into a Maisel & Friends footed tulip glass reveals a mostly clear amber body with two finger, creamy white head. Decent retention and beautiful lace. Aroma is hopforward and fresh with notes of citrus and pine. Oily texture, medium carbonation, light body and a very well balanced finish. Flavour follows the nose and is only moderately bitter yet crisp and full of hoppy notes. Well composed, interestingly complex yet easily drinkable.", "Bottle at Bishops Folkis.\r\nClear golden with a big fluffy off white head. Nice lace.\r\nGrapefruit, bright caramel and resin with a pinch of melon, cucumber and vanilla in the aroma.\r\nGrapefruit and caramel in a balanced mix with pineneedles and zest in the finish. Medium sweet maltiness.\r\nMedium to bigger body, soft carbonation, soft texture.\r\nNice and balanced. Old school.", "Amber with small white head. Rich fruity aroma with hoppy notes. Rich sweet-sour fruity (citrus, melon, mango) taste followed by strong hoppy bitterness. Strong bitter aftertaste with fruity notes.", "Yum! On tap. Golden honey in the glass. Great white head dies and leads to some great lacing. Nice is citrus and a hint of pine resin. Palate is a great balance of citrus hop notes, piney hop goodness. The balance is perfect. The finish didn’t leave me wanting. Great expression of the IPA style. Yum!", "Canned. Pours clear deep golden with an average off-white head. Aroma of grapefruit, lemon zest, floral hops and caramel notes. Sweet flavor that ends up dry and nice bitter. Medium bodied, oily texture and soft carbonation. A great, crisp IPA. 🌟🌟🌟🌟", "I really really like this IPA. It has everything. Aroma, taste, lacing and overall enjoyment. I can’t stop whiffing it. If you see it buy it. If it’s on tap forgettaboutit...your drinking this all night.", "(Backlog) Can pour at home, thanks Andrew for sharing this one. Amber pour, pine hop aroma, this is a good beer that shows different styles of beer within the same \"style\" and by t that I mean there are a lot of similar taste with this and a west coast style but also a lot of different things,mainly one being the amount of bite you get. Love trying Bells any time I can.", "Huge citrus pine aroma in an amber pour. Brilliantly balanced with laid back bitterness perfectly complimented by a full fruity body. Finish is sustained and massively ’moreish’! Has to be one of the best brews of the style I’ve had - and I’ve had a few. A brilliant beer - no ifs, ands, or buts!", "Golden clear white head \r\nAroma of citrus hops almondy \r\nTaste mild and bitter grapefruit nice texture", "Aroma: resinous, heavy pine, honey, molasses. Appearance: clear, pale gold, small, creamy, white head. Taste: medium bitter. Palate: heavy pine, floral hops, touch of exotic fruits, peaches, tangerine, quite intense resin. Overall: very nice IIPA. great resinous flavours. Bottle at Rattle ’n’ Hum 33rd, Manhattan.", "Ar- stunning floral aroma with hints of perfume and citrus\n\nAp- clear Amber with a string white head\n\nFl- extremely well balanced, hint of malt sweetness is quickly joined by earthy, floral, and hints of citrus and bitterness. Finished dog smooth and dry. \n\nMf- med-full bodied, soft, round, slight carbonation, \n\nOv- such a great beer. A beer can be balanced and a lot are but when a beer really shines is when the components being balanced are standouts by themselves. This is what you get here. I'd like a tad more carbonation on the mouthfeel. \n\n---Rated via Beer Buddy for iPhone", "Appearance: Pours golden cloudy with a small head and lace. Nose: Citrus, Hops and floral. Mouth/Feel: Crisp, Clean and fresh. Taste: Orange Peel, Pine followed by a balanced Hop floral finish. I’ve been putting off drinking this beer and always grabbed “the beer” next to it. Well it was the last solider standing and man what a surprise/treat. A very enjoyable Ale that I will pick up again. Overall: 4.1 out of 5", "16oz can (Courtesy of Headbanger) poured into a Shaker at 42°. Color is a bright golden with good carbonation giving it a fluffy white head. Aroma is faint, giving just a hint of hops and maybe some fruit. It has a medium body with a crisp mouth feel. Flavor is malt and honey with a light hop spice and mild bitterness. In the after taste the malt hangs on with a very light roasted taste coming though. Overall its a little too malty and the hops don’t show much for an IPA.", "Pours copper. Dried apricots come to mind up front with a floral finish. Dense head. Good balance and very drinkable.", "Pours pure gold. Surprising light but fresh citrus/pine aroma. Tastes clean and citrusy, hints of pine, hints of caramel. Very well balanced and not overpowering. Clean and fresh and very nice and good.", "Fourth beer of the five Matt bought back from San Diego. Light brown with sudsy white bubbly head. Smell is fragrant floral hop, light crisp malt. Taste is very resinous hop, moderate malt, faint corn. Body is slick and bitter. Nose is floral and delicate, taste is massive resin. Big and bitter and very nice but don't think it quite lives up to its 4.05 rating.", "Bottle from Bottlecraft in SD at home in HK. Clear-ish amber pour, quickly dissipating head. Aroma is bitter pine tree hops, some peach. Taste is also very pine hop forward, with some more rounded fruitiness underneath. Good amount of malt to balance. Very solid but not as good as I remember.", "16 oz can poured. Huge thanks to my brother for the can. Always wanted to try this, and never got the chance to. Clear golden copper pour with a ton of foam head and lace. Fruity and floral hop aroma. Flavor is delicious and fruity. Such clean flavor. Subtle floral hips with hardly any bitterness. Such an easy drinking, deliciuis, and memorable IPA. Wish this was a regular option for me", "Dark gold color, lively carbonation, white dissipating head. We’ve all had IPAs with a much livelier aroma than this, but not many are this drinkable. Grapefruit and not much else on the aroma. But still, great flavor, not too bitter but still very nice and crisp. I’m loving it.", "Hazy orange gold. Thick off white head. Skunky funky juicy citrus hop aroma. Nice malty backbone. Jammy upfront with gradual bitterness in the mid and strongly bitter to close. Citrus aftertaste. Some grapefruit citrus flavor and a touch of apricot. Cloying mouthfeel.", "One pint can. Nice!!! 1/11/16 date\r\n\r\nclear orange amber color. Bright white head. Leaves a thick and sticky collar. \r\nNose is a bit soft. Citrus, caramel, grain, does smell quite juicy though. \r\nTaste is big juicy fruit, soft caramel, soft bitterness. Makes up for it in the feel, very long lasting. Lots of oil. Lots of orange and other citrus. Amazing body. Very clean.", "Ámbar turbio y espuma blanca compacta. Aromas florales, cítricos, pino. Cuerpo denso y maltoso, sabor cítrico, pino y final de amargor seco.", "Orange-gold pour with a tight white head. Sweet orangey, piney aroma, nice malt underneath. Sweet, juicy citrus and tropical fruit, caramel, very good", "Loads of citrus and a bit of sweetness on the nose. The taste is tropical fruit and caramel. Nicely balanced.", "270116. Bells Brewery is fast becoming one of my favourite breweries and if they keep producing beers like this then it will quickly jump to the top of the list. There is a lot of butterscotch and fresh cut flowers in the aroma of this beer and in the mouth it is smooth and malty with butterscotch and caramel coming through. Awesome beer that I bought from Beer Cartel.", "Rating #1587 - 22.03.2015 - On tap at the Commons ale house in Santa Monica, it figures that live closer to this brewery and they have distribution in Cali. Pours a rich golden amber, small white head, minimal lacing. Aroma is orange zest, tangerine. On the palate, similar tropical flavours, mild resin, mild pine needle. Medium bodied and extraordinarily balanced.", "Amber color with a minimal white head. Aroma is hoppy and slightly malty. Taste is nicely balance with the hops coming through just enough to say this is not your average IPA. Well done!", "Too much bittering hop for me. Nice classic piney aroma with good malt, nice color. But the taste is just too bitter to be a great IPA. This is like an OG style IPA that gained prominence 5-10 years ago. Now things have moved toward more fruit, more pungent aroma, new types of hops. I think it turns out I just never liked this style of IPA.", "16oz can. Pours Golden hazy orange with off-white head. Aroma is sweet floral and citrus. Taste is sweet malty floral happiness with a citrus hoppy finish. Very balanced and delicious.", "Classic daily go to. Beautiful grapefruit,orange aroma and taste. Taste has significant malt sweetness which is nice. Aldo some nice floral notes in the mix. Famously balanced beer. Seems to be better in cans. ** Also, do not follow this beer with another IPA, it will taste &apos;off&apos; after having this one. Maybe it&apos;s the Centenial hops but it&apos;s a palate wrecker. Learned this the hard way.", "The beer has a copper/amber color with a medium head. Aroma has a lot of fruit like mangos and some pears. Taste has a lot of fruit for an IPA. There is a tropical taste up front followed with some malts and a mild bitterness. Great balance and beer.", "I think I broke my palate for IPAs. A \"well balanced\" IPA comes across as overly-malty to me. I like the aroma a little more than the taste. Still a nice beer, just not what I’m looking for in an IPA right now.", "Amber to copper in color with a good light tan head. Intense mandarin/peach aroma. Wonderful lacing in glass. Good carbonation and light mouthfeel. Strong citrus flavor with slight bitterness. More of a refreshing IPA without the drying bitterness of most IPAs. Lasting finish balanced of sweet and bitter. On a personal note I really enjoy this beer on its own or with a meal. Slightly higher ABV, but not overpowering alcohol.", "Hazy Amber foamy Lacy beige head; aroma is wonderful flowery hop spice; flava is hoppy grainy with floral notes; feels medium moderate fizz; finishes dry bitter hoppy", "Bottle. Orange gold with a nice frothy white head. Aroma of floral and citrus with grapefruit and caramel flavor. Medium light bitterness with a smooth finish.. Very nice.", "Pours a very light orange with a small head with moderate lacing. Nose is floral with hints of tangerines. Medium body, heavy carbonation, velvet texture. Palate is dry, floral, and bitter. Bitter afterstaste. B@H", "I’m earmarking this beer as one to get the next time I see it on a menu or something, because at the time I drank it, I hated IPAs. Now, I think any positivity I have toward it wouldn’t be based on its reputation, it’d be because I actually like the style now and think this would be great.", "Bottle; pours clear amber with a khaki head; aroma of citrus fruits, and pine with hints of caramel and grass; taste is citrus and caramel with a little pine grass; bitter finish with a little more citrus; excellent beer", "Slightly hazy, orange colour, medium head. Moderate aroma of citrus fruits, floral and caramel base. Taste is medium sweet, under medium bitter and medium long duration finish. Over medium body. Soft to medium carbonation. Legendary IPA, 100/100, but for me...it’s rather dissapointing beer. Decent, maybe even quite good IPA, but not awesome indeed. Moderate aroma, bitterness could be stronger.", "I hear bells ringing when I drink this! Don’t be afraid to pair this fragrant ale with your main dish... it’s mouth watering.", "Bottle in LA dated 13/10/15. Pours clear pale amber with small fading head. Big juicy hop aroma, what seems like alcohol sweetness there too, smells like an imperial IPA. Tropical fruit and grapefruit in the hop flavour, juicy, some floral hops, a little grassiness. Medium-high carbonation, creamy. Solid bitterness. Terrific IPA.", "Aroma is floral but somewhat weak. But not in a bad way. It's very balanced and very floral. Great beer. When paired against toppling Goliath pseudo sue it falls short. But very close \n\n---Rated via Beer Buddy for iPhone", "Bottle thanks to trade. Hop aroma’s that fade very very quickly (say, 1 minute after opening the bottle it’s gone). Lots of malts, and a good bitter bite, but no fruitiness or tropicalness. It’s ok. Not special.", "Bright orange colour with snow white head. Lacing till the end of glass. Moderate carbonation which brings fruity centennial hop aromas with hint of some spiceness almost like corriander. Great balance between malts and moderate bitternes for an AIPA. Great beer and wish to have one every day. These guys know what a great IPA is and they made it. Thank you Sandra & Thomas H.", "Bottle. Tropical fruit hop aroma with piney and grapefruit citrus hops notes as well. Pours cloudy golden colored with a large, soapy white head with good retention and lacing. Starts with piney hop bitterness and grapefruit citrus. Finishes dry with sweet pineapple fruitiness with a little bit piney hop bitterness remaining as well as a bit of grapefruit acidity. Excellent, well balanced IPA.", "Slightly hazy good carbonation and thick white head. Nice dank citrusy aroma. Malt", "CAN. Poured a hazy straw with small flat white head.. Sweet fruit hops on the nose,thinking tutti fruity chewing gum?.. Sweet fruity hops for sure, passionfruit & pineapple definitely are a strong presence, good hoppy finish.. Sourced RW", "Probably the single best ale I’ve ever had. The aroma is awesome and the finish is strong.", "Pretty good IPA. I couldn’t think of much to write about this one, but I finally had a chance to try some and wanted to get some basic thoughts down. It’s usually not been available in my area and is too expensive at it’s regular price here, but I found some that were available and on sale. It didn’t blow me away, but there were no noticeable deficiencies- good hops profile with the expected amount of hops, not watery, etc.. Definitely a good solid IPA that any IPA drinker should find a reasonable representation of the style, and a lot better than the rush of beers we see getting labeled IPAs for marketing reasons that aren’t true IPAs. This is a true IPA. Having said that, I don’t understand what the hype is about, really- it’s not anything spectacular except in the way that a good IPA is always spectacular to people who like IPAs. I would give a slight edge to the Sierra Nevada Torpedo on taste, and, in my area, I can get 12 of those for $3.50 more than 6 of these cost (with no 12 packs available locally) when both are at the regular prices. On sale, it was a fine value, but I can’t think of a reason to buy this over a Torpedo when it’s not on-sale, and it passes over the 6-pack spending limit I’ve set for myself at it’s regular price. Now, perhaps the regular pricing listed was because it’s new to my area or outside their core midwestern distribution heartland (Brewery is in Michigan) or whatever, and it’s a bit less expensive closer to the brewery relative to it’s national competition- in which case I would totally understand why this is a lot of people’s go-to everyday beer.", "cloudy reddish amber with medium head. lively carbonation hint of citrus smell. Plenty of hops. but not overpowering. A bit of a grapefruit-like after taste. Rather crisp and refreshing India ale.", "Deep orange color with a thick white head. Aroma pine, citrus, malt. Wonderful hop bitterness balanced with a nice malt sweetness. Really good. I could drink this all night. \n\n---Rated via Beer Buddy for iPhone", "Where: Old Line Fine Wine Spirits & Bistro. \r\nHow: 12 ounce bottle.\r\nAppearance: Pours a clear golden amber color, creamy head. \r\nAroma: Lots of citrus fruit, grapefruit and quite a bit of lemon. \r\nTaste: Citrus, grapefruit and lemon, nice bitterness balances it, with a little malt at the end.\r\nPalate: Smooth and light, thin. \r\nOverall: Really nice and worth the price.", "Bottle 35,5cl / Botella 35,5cl.\r\n@ Friendly Greek, Lancaster, PA, USA\r\nA: Hazy golden / Dorado turbio\r\nT/S: Hops, fruity, citrusy / Lupulo, afrutado, citrico.", "Balance. Two hearts combine harmoniously to marry hop and malt. Big hops heavily countered by massive malts constitutes balance, making this very easy to drink. Smells of flowers with a bit of grass. Tastes orangey and light but feels thick and malty with a huge sweetness. Unlike most IPAs, this one finishes sweet with a hint of bitter. It’s like a mandarin orange. Mouthfeel is just right for all day drinking; decent lacing and a mild lingering in the mouth. The flavor that lingers is fruity orange peel, so it’s more thatn pleasant. Great beer, well done Bells.", "Poured form a 16 oz can, canned on 9/9/15, into a glass clear orange yellow with a light tan head. Pine and citrus blossom in they mouth and balanced very nicely, with very mild bitter finish. This is a great gateway beer, to introduce IPA’s to non IPA drinkers.", "16 fl oz can from Firma Bier, canned in January 2015 (eight months old). Clear, golden orange with a huge, frothy, almost stable, tan head. Fruity-resiny aroma of mango, pine and honey. Sweetish, fruity-resiny taste of mango, honey and pine, followed by a smooth, mildly bitter and only covertly grapefruity finish. Medium to full body, very creamy and smooth mouthfeel, soft carbonation. Very sweet IPA, rather fruity but unexpectedly mild. Prominent malt profile, actually screaming for more hops. Still very good but again I assume this beer is already past its prime.", "Poured from a bottle. Pours a nice copper gold with white head. Hoppy, citrus aromas. Full mouth feel. Flavors like the aromas: orangey citrus, hops, some pine. Some lingering bitterness. Very balanced and a great beer overall.", "Pours hazy orange with thin white head. Beautiful aroma of tropical fruit and apricot. Smooth mouthfeel with slightly sweet grapefruit taste transitioning to a bitter finish that lasts for days. Excellent IPA.", "As ales go this is definitely the best I have ever had. Pours hazy sunshine gold, aroma erupts from the bottle with the scent of freshly cut grass and orange blossoms. Taste is just right, bitterness not too heavy not too light, sweetness is just right. Has a medium body with a touch of creaminess. just a touch of carbonation. the taste does not make me go WOW, but it does make me say Hay, this is just right! finishes smoothly with no excessive after taste. Overall this beer it just right.", "This is one of the best beers I have had. Another success from the Bell brewery. It could be a long night.", "Aroma: grass, floral, citrus, pine\r\nAppearance: clear, golden, off-white head\r\nTaste: medium sweetness, medium bitterness, \r\nPalate: medium body, creamy, soft carbonation, long finish, \r\n\r\nExcellent", "Can at home. Nicely cloudy, light golden colour with a creamy white head. Hop profile is orange zesty, grapefruit, citrus and resinous on top of a nicely grainy, moderately sweet malty base. Finish is citrus fruity and bitter, but without any tardness, clean. Good body, low carbonation, soft palate.", "On tap at Archive. Pours light amber with sustained frothy head. Aroma of orange peel from the hops which spice up the taste. It finishes with pleasant light bitterness on the palate. Worth a revisit closer to the source", "Pours a hazy brownish yellow with a foamy white head. Moderate malty aroma. Taste of citrus rind and some malts with a moderate bitterness. Lingering aftertaste like quinine. Too bitter without enough flavor to balance it out.", "33cl bottle thanks to a friend that brought it from the US. Color is light gold to orange. Head is thin to medium and persistent and white. Body is super smooth and finishes dry and a bit sweet. Aroma is malty, hoppy, resin and herby. Flavour is resin, spicy, hoppy, pinneapple, wood, light malt. Best IPA I ever had. Yet :-)", "Bell’s famous and renowned IPA hopped only with Columbus, one of the three great American C-hops and known for its Cascade-like orange aroma combined with more bittering power. Moussy, egg-white, irregularly lacing head forming ’islands’ of foam and retaining very well on the edges, draped over a ’sunny’, warm pale orange coloured, clear beer with strains of fine bubbles here and there, turning into a warm and equal ’orange mist’ with deposit. Dank but elegantly hoppy, enticing aroma of pink grapefruit flesh, fresh orange peel, pine needles, hemp, medium grilled pork, home made caramel, red raspberry, toasted bread and hints of roasted peanuts, field flowers, green olives, minerals, sundried tomato, capers in olive oil, hint of chicken broth. Refinedly fruity, edged onset of soft tropical fruits (pineapple, mango) with already a subtle ’announcement’ of grapefruity hoppiness to come, minerally with a subtle saltiness, soft and lean, slick body built from biscuity, very lightly toasted malts, ending in a splendour of elegant yet powerful, drying, piney, grapefruity, floral hop bitterness, resiny and ’sec’ but still leaving a trace of juicy, caramelly malt sweetishness underneath, while a faint caper-like saltiness keeps lingering as well, without disturbing me. This is indeed almost as good as it gets for a ’regular’ IPA: perfectly in balance, visually attractive, quenching and extremely elegant. The bitterness goes on for a long time, but does not become abrasive or agressive anywhere. I am glad I got the chance to taste this, this is nowhere extreme, but balanced to perfection, like many of Bells’ beers. I fully understand now how this got its reputation, even though it is dark and rainy outside, this beer makes me dream of a brightly sunny afternoon. Would love to taste one fresh from tap, though.", "Ragyogó szépsége bármely IPA becsületére válna, vastag, krémes habja a mulandóság legapróbb jelét sem szolgáltatja. A krémesség illatának is központi összetevője, aszalt sárgabarack, alma, mangó aromái olvadnak elegáns egységbe, majd ugyanezek a komponensek mesteri módon, átmenet nélkül bukkannak fel immár ízlelőbimbóinkon, kiegészülve kerekre szabott, szellősen elszórt buborékokkal óvatosan megkent keretben elhelyezkedő szalmásan malátás, angolosan száraz ízjegyekkel. Kiegyensúlyozott, remekül összeállított, extrákat valóban nélkülöző, ámde kifogástalan és komplex főzet. A tartalmas testhez mondandóval telt utóíz kapcsolódik, a karcosan egyedi kesernye a kortyolás közbeni benyomásoktól elválaszthatatlan módon, magától értetődő természetességgel jelenik meg, majd időzik el hosszasan.", "12 fl oz bottle. Pours light hazy golden with a big white head. Aroma of resinous hops, peach, sweet malt. Taste is medium sweet, medium bitter, peach, average IPA.", "Poured from a 16oz can into a Duvel tulip glass. Packaged date reads \"7/13/2015.\"\r\n\r\nAroma - Sweet, bright citrus (clementine, semi-ripe orange). Faintly floral. Earth\r\n\r\nAppearance - Deep orange-yellow (light amber?). Creamy, white head. Thick lacing rims the top of the glass. \r\n\r\nTaste - Sweet, citrusy hops give-way to earthy, resiny hops. Citrus fruit rind also present. Hops, hops, hops. Orange and hop resin flavors linger on the pallet. \r\n\r\nPalate - Medium bodied, oily/ resiny at times. Dry finish.\r\n\r\nOverall - I short changed this beer when I originally had it. Though the tall boy can is inviting, a glass is much more befitting. Let it breath. There’s too much citrus not to!", "12 oz bottle, thanks Kelly! Bottled 3/13/15--uh oh. Aroma is doughy, perfumy, earthy, citrus--all pretty mild. Pours hazy orange with a medium bone-white head with decent retention; laces a little. Taste has a mild bitterness backed by a light candy sweetness. For the hype this has, this is vey understated. When I saw that bottling date, I was worried, but there are no off-notes, this beer does not taste old one bit. It’s just kind of boring. It tastes really good, no doubt, but I was expecting much more. It is tasty, though.", "Nice balance of hops and malt. This is a definite must try for people that are new to the beer scene. Delicious and dependable.", "Interesting IPA. Maltier than most. Distinctive amongst every other run of the mill IPA out there.", "Poured it into a red cup which didn’t help me fully appreciate the aroma or get a good view of the beer. Does have a nice creamy white head. Piney with light grapefruit and floral notes. Nice malt backbone and bitter finish. Good stuff; wish I could get it at home!", "Bottle. 5 months old, I’ll try to get a fresher one and rerate. Orange colour with white head. Caramel aroma. Sweet, caramel, malt taste, some fruitness and citric taste. Medium body.\r\nAnother bottle, 2 months old. Orange colour with white head. Caramel and malt, floral aroma. Sweet, hoppy, fruity, citric, floral caramel, malt taste,  taste. Medium body.", "This is my favorite IPA! Check it out at Pinocchio’s in Media, PA. They have it in 16 oz cans. Also, Bell Bev in South Philly sometimes has it on sale. If you like IPAs, it will surely make your top five. Cheers!", "Bottle into tulip. Decent white head on hazy Amber beer. Pleasant enticing aroma of resin, yeast, bread that is most pronounced when first poured but goes as the head dissipates. strong sharp hop on the front which is mellowed by malt but finishes w a bitter hop aftertaste. Palate is wrecked a bit by the hop overload. Can't taste much as a result - some pine, floral notes. First few sips were quite nice but it is getting harder to drink the more I try. Will be a struggle to get through it. I can see why all the hop heads give it a good rating but i will not be returning to this one. \n\n---Rated via Beer Buddy for iPhone", "Excellent balance between floral and piney hips and a bready malt backbone. Very clean. One of the best shelf IPAs around.", "The old standby...Piney hop aroma, with a great balance of pine/citrus hops and malt backbone.", "A staple from Michigan. Great hop character and an easy favorite ipa especially given its easy availability.", "Aroma of grass, flowers and spices. Spicy very balanced taste. Nothing sticks out. A little alcohol in the finish. A little boring.", "This is now my favorite brew. Perfect hop/malt balance. Reallt stands out from other IPAs. \n\n---Rated via Beer Buddy for iPhone", "Nice ballance of hop and malt. Slightly hazy golden with light lasting head. Smooth intro perfume hop middle malt ballanced finished.", "A staple in my fridge and in my heart. A perfectly balanced IPA unlike a lot of these newcomers - malt backbone supported by a crisp long lasting finish of citrus/piney hop profile.", "On tap.\r\nClear Golden pour, small White head.\r\nSlightly sour hoppy Nose, hoppy taste with a lightly bitter finish. \r\nMedium body, average carbonation.", "Pours a froth, beautiful bubble durchzogen white head, with a sunny amber, slighty hazy color.\r\n\r\nSmells of grass driven orange, coated up by bitter lemon zest. Citrus peel grows stronger, as the beer warms up with unripe, sour kiwi, as well as apricot skin. Still, the maltiness is very strong on the nose, adding a note of earth and rock sugar to the hops.\r\n\r\nHas a medium carbonation, exhibiting a refreshing, hop forward beer, with lots of exotic fruits to it, as well a prominent malt backbone.\r\n\r\nBegins with sweeter, biscuity malts, revealing toffee infused rye bread, giving the malts a pleasant depth, balancing the well pronounced hops easily. Reveals surprisingly sweet toffee malts, which get joined by far reaching lime juice, which lends the beer a profound, bitter refreshment. The hops get enhanced by dried tangerine peel and apple stones, providing an aggressive dryness, which features a worthy counterpart to the well developed malt backbone, staying on the tongue for a longer while.\r\n\r\nWell balanced, easy drinking ipa which isn’t convincing only for its hoppy part, but also for its eigenständig malty part, adding to the hops, while balancing them, without cutting them short in any way. Old school ipa, with a straight forward, long lasting hoppiness, providing a great fruiti- and dryness, successfully coated up by the malts.", "Poured from the bottle. Nice head, great aroma, mostly citrus. Flavor has a very nice bitterness to it. This beer surprised us in Arizona! Can’t believe we nabbed a 100 ipa. But it’s worth every point", "Bottle to snifter. Rich gold pour with lasting head. Aroma is sharp and bright, juicy lemon, and borderline-parfumy floral. Taste is an abundance of pleasant floral-dominated notes, clean sweet malt\r\non finish with a palatable pine-like linger. Well balanced indeed. Just had a 3F Zombie Dust, would certainly classify under the same vein/caliber. Two Hearted being slightly more lingering and rich. Always good.", "Pours cloudy amber body with a foamy head. Great malt and hop start with a floral hop finish. A magnificent brew! \n\n---Rated via Beer Buddy for iPhone", "By far one of my favorite IPAs I've had. A great go to IPA and one I always purchase when introducing a friend to great beer. \n\n---Rated via Beer Buddy for iPhone", "Poured from a bottle. Nice citrus and grapefruit aroma although not as big as I expected. Clear amber with some slight haze. Medium white head with good lacing. Bread and caramel sweetness and mild dryness. Citrus and pine are in the back of the palate. A solid IPA. Wish I could taste this fresh but is always a couple months old here..always.", "Have had bottles and on tap. No detailed notes here - everyone has said it. Very good, well-balanced IPA."]}