{"reviews": ["This was better than average but not as great as I had hoped. Minor pale malt notes. Yeast finish with a some bitterness.", "Dåse. Orange øl klar med fint skumhoved. Duften er let hvede. Smagen er frisk, men ikke udpræget hvede. Meget deikbar.", "Gold  pour. Sweet flavor of hops.  Medium carbonation. Delicious flavor. Nice beer  refreshing in summer.", "On tap at Intl. Tap House, KC. Pours lightly cloudy gold w/frothy sustained head that gave lacing most of the way. Refreshingly clean w/pillowy soft mouthfeel, light tartness to close", "Fine unfiltered yeasty brew with only four ingredients that delivers on all facets of a great beer! Artful! Balanced with malt edging out hops at finish! Delicious ale! Prosit!", "(Can) Hazy orange body with a medium white head; some lacing. Malty aroma, straw, faint fruit. Medium body, soft mouthfeel. Flavor is malty, orange peel, melon.", "Hazy gold with a dense white head. Aroma is lemon, orange, grassy, slight bubblegum, clove and bread. Taste is medium sweet and light bitter. Medium body, creamy feel with soft carbonation.", "Bottle. Poured into a Weihestephan pilsner swirl glass. Rocky frothy head with sediment. Aroma of biscuit and orange. Smooth texture. A very nice beer for a May afternoon on the deck listening to tunes with a buddy.", "Had at Harry’s Old Kettle, first trip. No appreciable head. Clear tan brew. Has cracker and biscuit and just buttering hops. No significant hip aroma or flavor. Very clean. Good session beer.", "Well, this one could easily become a new favorite. The only thing more perfect was the girl who gave it to me.  Go Michigan!", "Can with commonmac. Light orange with thick white head.  A bit grainy and metallic on the nose. Thin to medium body. Good for summer .", "Can from McCaffery's.  Pours thick golden orange with decent white head.  Fruity warm aroma.  Quite thick mouthfeel with some apricot and round finish.  Nothing startling but a solid session", "Bottle pours yellow slightly opaque, lots of sediment, finger of heavy white head. Fresh wheat aroma with a hint of citrus. Cereal, wheat, crisp tang flavor. Im not usually big on American wheat ales, bit this one rides the wheat train without any off flavor or over the top artificial fruit gimmicks. Really nice.", "Really good on tap or small barrel. A very good summer beer. Very smooth and mellow.", "08Sep2019 Sweet grain and cereal malts, creamy bread, light molasses, wheat. Hazy gold, medium, white head. Light sweet. More creamy grain and cereal malts, caramel, wheat, light bitter wet straw coming up, soft carbonation, medium bodied. Simplistic but fine. Can from City Beer.", "Can from 4-pack. Wheaty and slightly citrus aroma. Smooth wheaty taste, light floral and citrus hops. Nice.", "Tap. Hazy golden, eggshell cream. Lightly hay, sweet, light oxidized, medium light body, light chalk, quick watery finish.", "Starts sensible then gets flamboyant, like the office accountant after a few drinks at the staff Christmas party", "Ar: Light cracker malt; a bit of hay. Ap: Orange and hazy; large white head with excellent retention, sits as a fine, moussey cap;  T: Light orange and lemon; cracker malt; very low sweetness; doughy, a bit of husk; pepper and more lemon; bitterness is medium, slightly leafy; finish is light malt, orange rind, and licorice. M: Medium-light body with high carbonation; dry finish. O: A refreshing, bright summer wheat; quaffable, but with a little edge of complexity on the malt side.", "12 oz. can pours a deep golden hue with a huge head of white foam that lasts quite a while.  The aroma is very typical of a wheat beer with hints of banana, esters, and clove.  The mouthfeel is thinner than I imagined it would be.  The flavors that come through are wheat, banana, spice, and a hint of citrus.  Overall, this is a very typical wheat ale.", "Canned April 24th 2019.\n\nPours a lightly hazed orange yellow with a massive head of foam that shrinks but doesn't dissipate entirely. \n\nThe nose has some wheat, sweetish to earthy malt, and some citrus hoppiness. \n\nI taste wheat, earthy malt, some bread, and a mild citrus hop bite. Very smooth but not lacking in flavour. \n\nJust the right mouthfeel for the style..not too spritzy, not too heavy. \n\nFinally got to try it and I am pleased as punch.", "Smooth, crisp flavor with mild hints of citrus. Bold flavor presented in a mild way", "On tap at the Grange. Pours gold. Spice, bread, dry toast, sulfur, floral orange thing. Medium body. Not for me.", "Bottle. Hazy gold with a nice two fingers white head. The malty aroma has a sense of dough and light citrus fruitiness. The taste is a bit bitter and dry. Ok overall.", "Golden color, decent carbonation. I'm not getting any aroma whatsoever. Grassy on the palate. Finishes smooth, not very dry. It's okay.", "Bottle at Craft Room. Empty aroma, bit buttery. Hazy golden color with no head and white floaters. Malty and spicy sweet taste sized some wheat. Thin body, average to high carbonation.", "Nice smooth tasting beer. It goes down very easy. Pleasant taste. Not very strong a little watery. Does not have strong personality. Good summer beer.", "Oberon American Wheat Ale is reasonable for an American wheat. It doesn't measure up to German.", "Pours golden orange with a white head. Unfiltered. Aroma of wheat and alcohol. Tastes like a typical wheat ale, not a lot of variation throughout the beer. Palate includes subtle hints of coriander and yeast. Very good wheat beer.", "One pint can. Pours a cloudy honey color with a big rocky white head. Smells of wheat and grass. Nice toothsome wit style with mild bitter notes of yeast and wheat. Mild lingering finish. Very nice.", "355ml Dose. Bernsteinfarben mit leichter Trübung und mittelgroßer Schaumkrone. Würzig. Leichte Citrusaromen, vorallem nach Orange. Herb im Antrunk dann mit leichter Süße.", "Pours hazy orange-amber, topped with a medium sized white head, semi-lasting. Gently fruity nose, a bit peachy, with some very gentle spiciness. Medium bitterness, some fruity sweetness. A bit spicy in the finish. Lighter body. Nice.", "From: draft at mission taco\nAroma: smooth bread and citrus \nAppearance: golden yellow with white head. Small bubbly streams. \nTaste: mild fruit - orange with light spice. Bready and mild yeast \nPalate: medium bodied, light carb light fizz, a little watery at times\nOverall: nothing super special", "Can. Cloudy gold with white head. Aroma of mandarins, tropical bubblegum and pepper. Bready, a little heavier than expected. Gently fruity with a dryish finish that's slightly bitter and peppery. Not the most exciting beer but wholesome and characterful.", "355 ML can\r\n\r\nCloudy, light orange amber color. Bright white head that falls to a thin collar. Some spotted lacing. \r\nNose is wheat with a mix of citrus and stonefruit. Bright and zesty with a little spice character. \r\nTaste is wheat, orange and apricot. Little hints of spice. \r\nCreamy in the mouth. Medium carbonation. \r\nRefreshing.", "12oz bottle. Pours an orange-gold with a moderate off-white aroma that disappears fairly quickly. Aroma is wheat/feet and a hint of indistinct citrus. Taste is orange, wheat, light coriander, a little more spice, and some yeast. Spice and yeast linger. Medium body. Moderate carbonation. Thick, creamy-ish mouthfeel. So-so beer with a very nice mouthfeel.", "Nice orange-citrus flavor. Amazing they make this with just 4 ingredients. Perfect amount of carbonation makes it very easy to drink. Smooth!\n\n---Rated via Beer Buddy for iPhone", "Can. Pours hazy orange with white head. Wheat malt, citrus, orange. Nicely fruity. Hint of spices. Light, easy to drink. Made me feel better on this hot summer day.", "Tastes very wheat beer like, some citrus notes, a hint of spice. Very hoppy for a wheat beer, it could do with a little less bittering hops.", "Pours cloudy dark golden with a ruby tint and a full, bone colored head. Aroma is bread, citrus and light hops. Taste is toffee, moving to breadiness, citrus and a tinge of hops. Finish is smooth wheat. A good wheat beer.", "light malt and citrus aromas. gold and lightly hazy in color with great long lasting head. nice balanced flavors of light caramel malts with light citrus notes", "12 oz can.  Very hazy, opaque and creamy orange color.  Short white head.  Aromas of oranges, yeast, white bread, florals, and mild spices.  Tastes are similar with a touch of rind and hop bitterness.", "Bärnstensfärgad öl med vitt skum. Doft och smak av jäst, apelsin och en gräsig beska.", "floral, citrus, amber, cloudy, white foam, frothy, medium bitterness, light sweetness, medium body, creamy, average carbonation, long finish, \r\n\r\nThrow in a couple slices of fresh orange...summer in a bottle. A welcome guest to any patio gathering or bonfire.", "Pours cloudy amber with low white head. Aroma of wheat, citrus, light herbs. Taste is sweet, mildly herbal. Light and smooth body with soft carbonation.", "Bottled from some supermarket, NYC\r\nHazy golden. White head. \r\nLight, cereal, fruity aroma and flavour. \r\nMedium bitterness.", "At 5.8% ABV, a bit punchy for a summer-themed ale, however this does not detract from its overall taste.  Not an all-day drinker, but after cutting the grass, a couple 2-3 goes down very nice! Citrus flavor with no aftertaste. Will buy again!", "I wasn't too thrilled about the aroma, which worried me a bit about what may be coming. Then I reminded myself that this is a wheat beer, which this one was the typical grainy and yeasty smell. Not too much citrus in this one though. Appearance an orange-gold. Was medium hazy, which I'm guessing unfiltered. The taste didn't strike me much at first, like a typical summer brew, but towards the end I was getting it more. Nothing special, but a smooth crisp daytime beer.....or a lighter evening beer.", "For a wheat beer it is very smooth. I like 312 and it has some competition.", "Can pours an extremely hazy golden-orange color with a big fluffy off white head that lingers leaving rings of lace on glass. Smells fruity, with aromas of bread, citrus and spice. Tastes of lemon, bread, grains and pepper. Light body, tingly carbonation, smooth, creamy mouthfeel and a tart, spicy finish. Very refreshing and easy to drink beer. Nice!", "Bottle from Merchants. I can't believe I've never reviewed this. Aroma is wheat, orange peel, some pine, slight spice, a little earthy. Appearance is golden, off white head, unfiltered. Taste is wheat, signature Bell's yeast, citrus, pine, earthy, spice, slightly more bitter than the standard wheat ale. Mouthfeel is light body, light crisp carbonation, bitter wheat and citrus aftertaste. Overall, I've had this beer a million times. It is set apart from the others by that bitterness and citrus, and while not especially complex, it is a perfect summer crusher.", "Medium orange body, creamy white head. Citrus floral nose. A fuller mouthfeel than one would expect from appearances but not cloying. Hops and any associated bitterness are pushed well back.", "Oberon is one of my favorites and a great beer. My only issue is that all the Bell’s beers taste the same as they all employ the same yeast. Citrusy and refreshing. Surpassed by a few like Great Raft’s Southern Drawl but very good drinker.", "Oberon is an epic beer! (Bell's house yeast must be the secret ingredient?) All I know, is I have never tasted another beer quite like Oberon. When it releases each year at the end of March - our group drinks nothing else until it runs out in September. Oberon bottles, cans and mini kegs go with us on our boat, at the pool, picnics, hiking, weddings, etc. One of the few beers worthy of a Shakespeare reference.", "The description definitely makes it sound hoppy. But I thought it needed more hops to balance it out. Citrus notes. A decent beer if nothing is better is on tap\n\n---Rated via Beer Buddy for iPhone", "Bottle from BeerShop.gr, enjoyed at Gunnarsbu. Pours hazy deep golden with a small fast fading white head. Aroma of wheat, spicy hops. Taste is light sweet, soft creamy malts with a light spicy finish.", "12oz bottle. Hazy golden orange with a thick white head. Wheat, yeast, citrus, bread, grassy hops. Medium carbonation. Peppery wheat finish. Good stuff.", "Very good taste, refreshing with fruity undertones. Served with an orange slice. \n\n---Rated via Beer Buddy for iPhone", "Pleasant looking. Nice lacing, creamy head. Strange aftertaste, but you get used too it. Not my favorite whet, had worse, had better.", "on tap at Bridesburg Bottle Shop (which unfortunately just closed down) - cloudy yellow color. Slight malt aroma and flavor. Just ok.", "Poured with a great 2-inch head that stood up over the top of the glass and laced down the glass. Very hazy orange-color, which I liked, with medium carbonation. Aroma was typical bready, not much hops. Taste is that same bready, not sweet with just a little spice and hops. Medium, kind of creamy body. I enjoyed it and would drink it again -- but -- if Two Hearted Ale was on the menu, I would rather have Two-Hearted.", "Not my favorite by far. The smell ruins it. Don't know why it has such high ratings. \n\n---Rated via Beer Buddy for iPhone", "Not super wheaty, hint of floral notes. Light and refreshing with light kick at the end", "DOC: 5/24/17\n\n2015 BJCP Category: 1D American Wheat Beer\n\n\r\nAROMA: General wheat/sourdough bread scent but with no distinctive character. Not sweet. Not much hop presence. Slight tang. 8/12\n\nAPPEARANCE: Extremely hazy orange body (7-9 SRM). Fairly large off-white foam retains and laces well enough. 2/3\n\nFLAVOR: First half is mostly malty-bready flavor. Not especially sweet, or even robust for that matter. Some orange citrus flavor emerges as the apex akin to sweet orangepeel (though likely due to American hops). Low bitterness with minor spicy bite. Brief starchy aftertaste but otherwise clean. Palette is a bit mild even for this style. 16/20\n\nMOUTHFEEL: Medium body; medium-high carbonation. Texture is very soft and creamy with smooth finish. Refreshing. A bit too potent for the style (and consumer expectations) at 5.8% ABV. Should be more sessionable. 4/5\n\nOVERALL IMPRESSION: Probably the Godfather of the style, though not exactly the best example of it anymore. 7/10\n\nTOTAL SCORE: 37/50", "Unexpectedly good! Refreshing and smooth the way a good ale should be like. Solid all the way\n\n---Rated via Beer Buddy for iPhone", "Pint in Barcade NY. Hazy Amber, thin white head. Nose is toasted grains, musty, biscuit malt, clove, lemon. Condition not great. Watery, minerals, not much else.", "Pours opaque golden orange with a fat and foamy white head. Aroma is mildly fruity + wheat grain. Taste is grain malts with a touch of mildly spicy hops. Very drinkable and well suited to repeat business on a warm day. Fantastic gateway beer for budding craft beer enthusiasts. Not memorable but a high quality product. \n\n---Rated via Beer Buddy for iPhone", "Bottle at Burrito Gallery, Jacksonville. Sweet base malt and zesty wheat aroma with a touch of lemon and no yeast character. Hazy dark gold under a white collar. Sweet base malt flavor with little bitterness and low zesty hops. Full body and almost sticky sweet. Moderate carbonation.", "This was tasted out hot a 16oz beer can by Cannery Row Beer Club. This was the most enjoyable beer of the night. Cheers!\n\n---Rated via Beer Buddy for iPhone", "First beer on ratebeer. Wasn’t really prepared to leave comments, but I do feel subtle spiciness as described by other reviewers.", "Smell of sweet, mild floral. Pale orange color with medium cream foam. Taste of refreshing hop with note of wheat and citrus. Somewhat bitter but with just right texture, not overly slimy. Good beer for summer.", "Thanks to my fellow SC beer scout Michael for sharing this nice wheat ale from Oberon! From a fresh bottle, pours a nice amber-orange haze with a long-lasting white foamy head. Aroma is a flavorful sweet and estery wheat, with a subtle hoppiness in the background, one of the more noticeably hopped wheat beers I have ever had. Taste is a mildly spicy and estery wheat with some sweet malt and a fruity hop aftertaste. The estery notes from the yeast are particularly fresh and complement the standard wheat baseline well. A highly recommended rendition of this style!", "For being called a wheat beer, it's not nearly as wheaty as I expected. Tasty beer, rated high for it's surprising flavor. I would love it on tap.\n\n---Rated via Beer Buddy for iPhone", "Golden with a fluffy, white head and a citrus nose. Mild and lightly-carbonated, with a sticky mouthfeel and a bittersweet, lemonhead finish.", "Mid yellow hazy body with plenty of chunky yeast floaters. The head is settling but is still frothy. Aroma and flavor are spicy, grassy with faint fruits with a hint of booze on the backside. Definitely big for a wheat, but I like it.", "Bottle from Harris Teeter, Hampstead, North Carolina. Cloudy paler golden coloured with a small head. Has a very light wheat ale character, and not really much taste in that respect. It is crisp.", "Can't stand this Ale. It's my personal palate. I much prefer IPAs. Probably on ok Ale if you like those types\n\n---Rated via Beer Buddy for iPhone", "Beer has a pure wheat aroma-- just like it should. Taste is of course, wheat, but also I detect coriander, maybe orange peel too. it finishes clean, and is not dry at all. Very refreshing.", "Cloudy amber yellow with a full white head that lasts and lasts. Typical wheat beer aroma...not my favorite. Taste does make up for it though. Smooth, a little creamy going down. It’s difficult to describe, but despite this creamy feel, it’s very light and refreshing. The meh smell almost does it in, but in the end the solid, refreshing taste and smooth mouth feel saves the day.", "Pale golden color, hazy, lots of floaties some of which gradually sink and create a layer on the bottom of the glass. Tall head, creamy white, that recedes slowly leaving some lacing. Wheat odor, with perhaps a bit of orange or lemon. Lemon / orange taste, like the aroma. Mildly bitter aftertaste. Nicely balanced. A light-drinking summer beer, with a pleasant lemon flavor, but not my favorite summer beer.", "A great wheat ale, with light citrus notes, if I had to describe it to someone who has never had it, I would say that it is similar to Blue Moon; like Blue Moon, if you get it out of the tap at a bar, they serve it with an orange slice.", "Crisp with great smooth Summer drinkability. Just a slight lime taste. No wheat after taste. Great. \n\n---Rated via Beer Buddy for iPhone", "Can. Aroma of wheat, grass, hay, spicy and light fruity. Notes of yeasty esters. Light sweet and bitter. Smooth.", "Can. It pours hazy golden with a creamy white head. The aroma is wheaty and light fruity. Some estery notes. Citrus. Smooth texture. The flavor is wheaty and light hoppy. Some crisp notes.", "12floz bottle ($2, BOD: 04.06.2017) poured into a pint glass. This is for me the best American wheat beer. Standard hazy pale-yellow appearance , and has a hay aroma. The peppery, white flavor flows over a smooth, refined palate. It provides for a good drinking experience in the top tier for the style.", "Hazy , golden color. Medium-sized. White head. Wheat malt , citrus , bread and spices in aroma. Sweet, malty taste with moderate bitterness for balance. Wheat malt , citrus and hint of yeasts on palate. Light and easy to drink. \n\n---Rated via Beer Buddy for iPhone", "The beer poured hazy golden. Its head was small and white, with sweet aroma. Palate was medium bodied. Flavors were sweetness, and sweet, creamy malt", "pours hazy golden with a white head. Aroma of wheat, yeast and some fruit. Taste is citrus and yeast.", "Part of a 4 beer flight at TJ Stone , Washington DC in May 2017. A nice clean light beer. V good \n\n---Rated via Beer Buddy for iPhone", "Draft @ Bagger Dave’s GRR. Not much aroma. Hazy yellow orange color with thin white head. Smooth flavor, with gentle bitterness. Med body. Very tasty beer!", "on tap pours bright orang white cap aroma and taste is orange and slight malt ok", "On tap at New Bohemia. Pours hazy straw color. Minimal white head. Nose is wheat and floral. Taste blends sweet wheat and minor hop finish. A bit of grassiness as well. A unique and drinkable beer.", "Honey. Dough. A little spice. Very cloudy honey gold. Bright white head. Tons of lacing. Easy. Hint of hops. Honey. Bread. Grain. Nice. \n\n---Rated via Beer Buddy for iPhone", "On draft at Pinthouse Pizza. Pours orange with a thick white head that lasts. Sweet clementines, sweet tart candies. Average carbonation, light mouthfeel.", "(Bell’s Oberon Ale) Yeap, I found this in Greece! \r\n\r\n\r\nBottle 355 ml bottle at my home in Parga\r\n. ABV 5.8% Deep orange colour on the body, \r\nmostly clear. \r\nGood sized, thick white head, with \r\naverage retention. \r\n\r\nAroma has wheat, oranges, apricots. \r\n\r\n\r\nTaste is mildly sweet, with oranges, apricots, old hops. \r\n\r\n\r\nMedium body, good carbonation. Definitely past its prime but still good.", "B+. Pours a hazy golden color with white head. Good flavor and very drinkable", "Cloudy, misty gold pour with a very quick slightly off white head. Nose is fruity yeast. Middle is citrus and wheat. Finish has a little zest to it. Refreshing.", "1/16/17 - (Can, home) Pint glass pour from 12 ounce can. Golden blond pour, heavy carbonation, generous white puffy head. Aroma sweet, pleasant citrus, hops, and wheat. Sweat taste of citrus, wheat and a touch of hops. Easy and smooth drinking, carbonation mild after pour, refreshing going down. Overall solid offering by Bell’s.", "Pours a hazy light orange that’s pleasant and cheerful. Foamy white head that leaves plenty of lacing. Smells of fresh baked bread and a bit of orange and spice. Taste follows the nose. Delightful and refreshing. Full bodied and not too fizzy. Long sweet but astringent finish. Oberon is an excellent summer beer. Think hefeweizen but with a clean yeast. Delicious.", "Draught at Bailey’s. Golden color, white head. Bitter taste with citrus, wheat, a bit o hops, yeast, grass and a bit of ripe fruits. Bitter finish with citrus, wheat, a bit of hops, ripe fruits and grass. Good wheat ale.", "Growler from Growler Exchange. Deep golden with white head. Wheaty, bready aroma. Smooth, malty. Not bad.", "Very thick lacing and medium head. Cloudy unfiltered straw orange/straw color. Citrus with grain aroma. Mildly carbonated. Citrus start with standard wheat beer finish. \n\n---Rated via Beer Buddy for iPhone", "6 oz draft pours hazy golden with a white head. Aroma of wheat, yeast and some fruit. Taste is citrus and yeast.", "Thick golden unfiltered pour. Mild wheat and grassy taste.  Toast and bicuit vibe going on. A bit of fruity spice at the end. Mild and refreshing.", "Hazy gold with decent head an the aroma of wheat and spice. Taste is wheat malts with some spices added. Honestly I thought it had some spices in it till I read the label on the bottle and realized it was just the hops. Really like the hops they used. Yep will be buying more of this for the summer.", "From 2d2despuma. 6 months+ after bb date. In Teku glass. Playing Darksiders 2. To repeat fresher. A bit flat, with just some notes to orange but not unpleasant. Some sediments at the bottom", "Botella 33 cl en el lupulo 08..03..2017. (r2330). Lote 15438 PKGD embotellado 03..02..2016. Color ámbar velado con espuma blanca aromas y sabores maltas y cereales con toques dulces ligeros de caramelos y ligeros herbaceos. Citricos suaves. Cuerpo ligero fácil de beber. Normal.", "Nice unpasteurized beer. Decent mouthfeel and makes you want to drink another and another. At 5.8 you can have more than a few of these.", "Nice yellow colour with big white head and seddiment on the botom. Aroma of citrus, lemmon, yeast. Fresh taste with nice aftertaste", "This beer pours a hazy golden yellow color with a creamy two-finger white head that left some nice lacing around the glass. There is large chunks of sediment floating all throughout the beer. In the aroma i pick up some orange peel and yeast. The mouth feel is creamy and there is some breadiness and orange in the flavor.", "Pours a straw yellow, particulate color with a medium white head that recedes quickly. Aroma is floral hops, yeast, wheat, orange and wheat. Flavour is floral hops, wheat and grass. Light body, mediu carbonated. Mild bitter finish.", "Can @ fillepolo 10/12-16. Fruity and yeasty with citrus, orange and spices. Body is medium, the finish is dry and spicy.", "Bottle from mikkeller bottleshop copenhagen. Pours a golden colour beer with a medium head. Fruity and yeasty with dried fruits and malt. Dry finish", "Can @ Home. Pours hazy dark yellow with a white head. Aroma of wheat, light yeast, little spice, light sweet fruit, canned peach. Flavor is light sweet, wheat, sweet fruity. Thin to medium body, average to lively carbonation, light sweet finish. 281116", "0,5 boks fra Kihoskh, delt med Kitty på hytta: uklar oransje med ok akum. Fantastisk frisk, fruktig og citronsyrlig aroma, og smaken følger opp med mandariner/clementiner og ananas i tillegg. Hint av krydder. Fyldig og meget myk munnfølelse, lekker ettersmak.", "This one seems to be an amalgam of Wit/hefe, pilsner, and maybe a bit of saison. It is citrusy, spicy, and refreshing. I didn’t ever find it too sweet or too heavy. I can’t wait to find this one again.", "Can shared ny Vestergaard. Pours clear golden with a small white head. Aromas of citrus, sweet wheaty notes, corn, macaroons. Taste is wheaty, citrussy, orange, sweet, malty.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer.", "Bottle @ home. Aroma of wheat, some spicy hoppy character. Hazy golden amber white head, mostly diminishing. Taste is light+ sweet and moderate- bitter. Medium body, oily feel, wheat spicy hop finish.", "Nice enough. Cloudy blonde colour with some wispy white head. Orange and lemon first on the nose, then crackers and a hint of spice. Body smooth and wheaty, well carbonated. Bit of spice in the taste too.", "Botella de @El Lúpulo Feroz, Oviedo 08/10/2016. BBD:03/02/16\r\nColor amarillo, sabor levadura, citrica, cuerpo ligero.", "Pours cloudy golden. Aroma is banana, spice. Taste is sweet, banana, full body. Nice.", "Can. Cloudy orange, small white head. Wheaty aroma, floral notes, yeast and citrus. Wheat maltu flavour, hoppy, slightly citrusy bitterness. Some spice too. Has a nice, lasting bitter bite.", "Bottle. Pours is golden with thick white head. Aroma of barley and wheat malts, grassy and fruity touch. Taste is light sweet, light bitter. Medium body, slick texture.", "5 liter can. Slight yeasty aroma, with a cloudy, hazy appearance. A little carbonation. You can feel the tiny little bubbles. Mildly astringent mouth feel . Faint black pepper taste with some wheat. Crisp thin body This would be a great beer for summer parties!", "Draught at Bell's Eccentric Cafe, Kalamazoo, MI. \nSlightly cloudy golden color with a small white head.\nMild floral hops, citrus and wheaty maltiness in the aroma. Not that strong aroma.\nThe flavor is citrusy hops, hints of bitterness and malt. Easy. \n\n---Rated via Beer Buddy for iPhone", "Poured from a bottle, San Diego. Exceptional wheat beer aroma, citrusy and refreshing. Crisp bite with excellent flavor. Not too powerful, the taste of this beer has nothing in excess but is a perfect cold summer beer. If a 15th century landsknecht marched twenty miles through Bavaria in the heat of the summer and came upon an ancient village brewery with a wheat ale recipe passed down through generations and filled a goblet with a cold bite from the cellar, this is what I imagine it would taste like. So satisfying!", "From notes. Sweet, and wheaty, like Michael Jordan. \nIt didn’t leave a big impression on me, but it was light, lightly hopped, and a little fruity.", "Bottle at home. Pours orange color, white head. Aroma of orange, malt, caramel. Taste is medium sweet, medium bitter, orange, caramel, malty backbone.", "Out of the bottle, poured a deep yellow, hazy, with a tall persistent white head. Aromas of lemon, lemon cough drops, wheat malt, biscuit. On the palate, spicy hop character cuts through the fruit/sweet wheat malt, leaving a lingering bitterness. Like a cross between a German Pils and a wheat ale.", "Can at Cafe Sara, june 9th 2016. Cloudy orange body with a white head. Aroma is spicy with mild fruity hops. Taste is malty of bread and dough with a grassy bitterness, wheat. Bitter and spicy finish.", "Aroma of sweet clove, hay, wheat, spice. \r\nPours a hazy straw colour with a one finger white head. \r\nTaste is spicy, light hoppy, sweet clove and hay. \r\nMedium light body, soft and smooth mouthfeel, average carbonation, finishes a bit spicy. Leaves sticking on the lips. \r\nGood summer beer.", "Nice American wheat ale. Clean and refreshing. Good beer for hot summer days \n\n ---Rated via Beer Buddy for Android", "Can at home. Clear golden colour with a white head. Hoppy wheat beer. Floral, fruity and refreshing. Easy to drink. Not bad at all.", "Bottle from Beer Gonzo, Earlsdon, Coventry, consumed at End of the Road Festival, Larmer Tree Gardens, Thursday 1st September 2016   Hazy orange colour with a murkiness (yeasty sediment) sweet, wheaty but with a good bit of body. Spicy, tasty beer, bit too sweet perhaps but like it, a bit of stray orange showing. A6 A3 T7 P4 Ov14 3.4", "Bottle at 100 piv. Hazy yellow golden colour. Almost no head. Aroma is not very significant, some hops, citrus, lemon, tangerine. Taste is hops, wheat, not very fresh. Nothing special.", "Bottle from 100 piv. Pale golden color with small white head. Aroma of oranges, wheat. Taste, oranges, tangerines, wheat, yeast, grain. Medium long hoppy bitter finish. OK.", "Bottle at a tasting. Feeling rather stale, oxidized. Almost none of the hoppy goodness remains. Really not much joy in drinking this.", "From an icecold bottle. Pours a hazy golden with a small white head. Aroma has spicy yeast notes, spicy hops, macaroons light wheat, fruity hops. Taste is medium sweet, wheaty, spicy, coriander seeds, white pepper, light lavender. Very low bitterness. Average carbonation and a light body.", "Pours a cloudy, murky orange color. Lots of little flecks floating in there. Nicely carbonated, the flecks are swirling around nicely. About two finger thick, firm white head. Light retention, okay lacing.\n\nAroma is wheat, yeast. Maybe a little coriander. Orange juice.\n\nTaste is bright, light orange and orange zest. Yeasty and wheaty. Maybe some light earthy hops. It’s leaning sweet, not bitter. A little spicy from coriander. It’s not super flavorful, but pleasant tasting.\n\nMouthfeel is medium bodied. It has a creamy and smooth taste. This is 5.8%, no way....There is some spiciness in the finish, I’m thinking it may be from hops, not sure.\n\nOverall, it’s pretty good. Keeps you guessing, sweet, mildly spicy. I don’t know if I’d call it a session beer, because of the ABV, but man, it’s good. Yeah, I would buy this again. I would also recommend this one.", "Can from Kihoskh in Copenhagen. Fruity smell. Fruity smell with some bready malts. Feels like the hops has faded in this one, still drinkable though.", "Can from Mikkeller Webshop. Light hazy golden with a white head. Aroma is sweet, malty, wheaty, light fruity and light hoppy - grass. Flavor is medium sweet and moderate bitter. Sweet and moderate bitter finish. 250816", "Color amarillo plátano con capa de espuma blanca de menos de un dedo de grosor. Carbonatación media tirando a alta. Restos de levadura/sedimentos/especias (diría lo último), altamente concentrados en el poso de la lata. Tan concentrados que cuando eché las últimas gotas el color amarillo pasó a ser blanco. Más bien parecía leche. No es algo que me eche para atrás, solo lo comento de pasada, para navegantes. El aroma es, en cierto modo, distinto al sabor y más pronunciado: trigo, especias. No capto malta y no capto lúpulo. El sabor es una variación del aroma, sin arriesgar. Sabe a trigo, de nuevo, a especias (no sé si cilantro), pero no capto lúpulo alguno. Unidimensional, refrescante y para de contar. No suelo hablar de precios, pero en este caso haber pagado 5 euros por algo tan plano (y viniendo de Bells) me hace recapacitar por enésima vez sobre mis gustos y los gustos de los demás. No voy a mentir, me la bebí entera porque costó lo que costó, pero es una total decepción.", "Bottle. Orange color with medium white head, sediment in bottle. Aroma is malty, yeasty, wheaty with coriander, lemon peel and some citrus notes. Taste is malty, yeasty, medium bittery, lemony.", "Burk från Mikkellers webbshop. Smak och doft av humle, jäst, vete, citrus, apelsin ohc persika. Lätt kropp och beska, fin sötma, mjuk och juiceig känsla, beska med smak av citrus- och apelsinskal. Gott!", "From the bottle, pour is cloudy with sediment floating in the beer, the color is orange with a thick slightly off white head that lingures. The aroma is yeast, a little coriander and bread. The taste is malty, bread and raw wheat. There is a citrus note present reminiscent of lemon peal, but not very strong. The mouthfeel is thin, and the finish is malt.", "Tap at Macs bar. Almost clear golden with fluffy white head. Mango, pineapple, sweet malts, apricot and orange. Quite fruity, with milky grain, almost like sweet bread. Medium sweet and almost medium bitter. Medium bodied.", "Cloudy light orange with little head and minimal carbonation. Very sweet with some orange sherbet. Ok for a wheat beer.\n\n---Rated via Beer Buddy for iPhone", "Can:\nPours muddy orange with a small, rocky head. Aroma is grains, yeast and orange peels. Somewhat sharp mouth feel. Dry, yeasty and wheaty flavour with notes of citrus and grass.\nNot exactly exciting, but quite refreshing.", "Can. \r\nHazy pale Golden pour, small White head. \r\nNose is mild. Taste crisp, less wheaty than expected. \r\nMedium body, soft carbonation.", "355 ml bottle at the Hoppy Pub, Thessaloniki. Light hazy yellow golden color with off white head. Malty aroma, light yeast, citrusy fruity, wheat, grain. Sweet and light bitter taste. Light to medium oily body with soft carbonation.", "Draft pour at tomato pizza, cloudy golden pour, wheat aroma, flavor is smoth and small hops.", "Pours a hazy golden color with medium white head. Yeasty aroma, quite lagerish to be honest, citrusy, with lemon and cerealy. Taste follows it, lemony, yeasty and cerealy, some orange and slightly grapefruit.", "Bottle share. Pours an opaque straw golden colour with minimal head. Nose of mango and a bit of lemon, with a juicy flavour of orange and maybe a bit of grapefruit as well. Pleasant!", "cloudy, quickly dissipating head.straw golden. can share. summery fruit. orange, juicy, fresh.", "Bottle 35,5cl\r\n@ LaBIRRAtorium, Madrid, Spain.\r\nA: Hazy golden.\r\nT: Malt, wheat, citrus, yeast.", "Tap at Five Points Pizza, Nashville, 13th July 16. Yeast in the aroma,. Taste is clean. yeast. pilsner, wheat, some bitterness, and citrus. Nice stuff", "500ml can from Beer Gonzo. Drunk while watching Flight of the Navigator. Pours hazy gold, good white head. Smooth with a good yeasty fruity character. Nice.", "Can. Yellow cloudy body with white head. Aroma is yeast with some fruits some phenol. Taste is also very yeasty with ripe fruits, malts and hints of alcohol. Aftertaste is yeasty and malty slightly balanced by some hoppy bitterness. Was expecting much more.", "Can. Pours light hazy golden with a rather small, white head. Malty aroma with notes of lemon. Feels quite thin, average carbonation. Very bland, almost like a mass produced pilsner. Abrupt. Very meh.", "Can. Creamy white good mostly lasting head. Yellow very cloudy colour. Moderate malty and hopy and light yeasty aroma. Light bitter flavor. Average lioght bitter finish. Oily palate. boring beer.", "On tap @ Mudville 9. Oh, I got an slice of orange in this one.. The beer itself is quite cloudy and, yeah I’m gonna say it, orange in color. A nice big bright white head placed on the top leaving some lacings. It smells nice and mild wheaty. Straws, some orange indeed. Hopefully not only from the slice.. It has a really standard taste this. It’s light oily in the mouth and has those big hard almost aggressive bubbles. Soft wheat sweet but really orange sweet. Mild cardboardy and dry in the finish. Nothing to memorable about this one really - except the look on my face when they jammed the orange slice on to it. 10.06.2015", "Bottle. Wheat malt aroma with bright citrus fruitiness and spicy yeast notes. Pours cloudy golden colored with a thin white head that has decent retention and lacing. Starts with wheat malt flavor with citrus fruitiness. Finishes a bit dry, but quite refreshing with spicy yeast flavors joining the others. Nice wheat ale, good for warm summer days.", "Decent beach beer but there are better out there. Aroma and taste of wheat, fruitiness, and hints of a Belgium beer. Clean finish. Just ok. Didn't find this that refreshing due to the Belgium like yeast influence. Not a repeat purchase. \n\n---Rated via Beer Buddy for iPhone", "Bottle poured into a shaker. Cloudy straw yellow with a thick white head and a lot of visible carbonation. Lots of wheat and a little yeast to the nose. A lot of wheat but mostly grass and light pine hops. A lightly hoppy aftertaste. Medium body and carbonation that stings a little. Not really what I expected and not in a good way. I must have gotten a bad batch because it is only slightly like what anyone else has described.", "Growler pour at trailer. Murky gold/amber color with ivory foam. Light pit fruit, mild sulfer, wheat bread, earthy aromas. Tart, tangy, citrusy tangerine, bready, herbal flavors---nice tangy drying finish___good.", "Crisp fizzy and dry, with a lovely puffy body. A mellow sweetness, through a predominantly bready flavor. A nice bitter tingle in the center of the tongue too. Summer swiggin’", "Can. Pours hazy orange/golden with off-white head. Aroma is sweet fruity wheat. Taste is sweet hoppy fruitless with a hoppy finish. Pretty good.", "Bottle at Gollem in Antwerp (along with 77ships), first time for me, though this is a classic among American wheat ales. Cobweb-lacing, off-white, moussy head over a hazy yellow golden beer with slight peachy hue. Aroma is unfortunately ruined by a lot of DMS (cooked cauliflower), which I am very sensitive to and which I did not in the least expect in a Bell’s; after this sulfuric odor fades a bit, I get green banana, soap, white bread, sugared pineapple, peach, mango, yeast. Fruity onset, bit estery with peach, pineapple and gooseberry impressions, medium carbo, supple malt sweet body with soapy and light sourish wheat, light hoppy finish with a somewhat herbal character but not as aromatic (let alone bittering) as it could have been - though like all wheat beer styles, American wheat is not characterized by huge hop quantities anyway, of course. And thus this beer ends mostly with malt sweetness, a bit grainy even, and on the thin side. I expected a whole lot more considering how great Bell’s other beers are and the DMS largely ruined this for me so this was the big disappointment of the day, I’m afraid...", "355 ml. bottle @ Gollem. Date says 03/02/16. Hazy golden, little white patchy head. Nose is big paper, some cardboard, there is low orange peel, mango, apricot, low grain,… Taste is bitter insecticide, herbal, paper, apricot, lots of paper, low cardboard, low esters & orange peel, tad bitter herbs. Body is bit dull, oily, paper. Not really getting the high score here, it doesn’t have a pleasant wheat base, hop presence is far too low, most bitterness and taste is paper and mothballs, meh at best this one.", "Yellow color with white foam ring. Light hoppy nose. Sweet, yet light bitter taste with a little weird hop mixture. Dry bitter finish with some tartness in the aftertaste.", "Sample while checking out the expo at HomeBrewCon.\r\nSlightly hazy light yellow with a decent white head. spicy earthy sweet bready with a cereal quality to it. Easy to drink, glad to have tried it.", "Sample from bottle at Hy-Vee grocery store. Poured hazy, white head. Aroma was citrus, fruit, wheat. Taste is sweeter, wheat, lemony.", "Bottle, clean pour little head and a bit of sediment. Light hazy gold, definite wheat/biscuit scent with a trace of fruit. Clean crisp malt, orange, straw, corn. Refreshing yes but not big enough for my typical taste.", "Perfect beer for those looking to avoid a hoppy PA, or someone who \"doesn't normally\" care for beer. Smooth, easy drinking, great hot day treat. Not a lot of character for the snooty beer expert, but perfect for anyone looking for refreshment. Has a fine body, decent carbonation, good, if not \"neutral\", taste, nothing offensive, yet not a Budweiser or Miller sort of vibe/taste.\n\nNice beer.", "09.10.2016, 16 oz can @ home:\n\nBig creamy longlasting head, slightly hazy. Aroma is slightly sweet grainy, leafs, light malts, wet hay, grass, minerals, overripe tropical fruits, sap, paper. Taste is slightly dry mineraly, weeds, leafs, minerals, bark, paper, hay, flowers, old lawn, medicine, chlorine. Medium bitterness, dry medical mouthfeel. Meh!", "BOD 3/3/16. Almost clear golden pour with suspended matter. Add the bottom of the bottle and it becomes quite full of suspended matter. Very good head volume, average retention and outstanding lacing.\r\n\r\nGood nose of light lemon and wheat cracker.\r\n\r\nLight body that is smooth. Outstanding carbonation / body balance. A light effervescence at the beginning that gains strength and closes with a nice prickly finish.\r\n\r\nThe flavor profile is very good but lacks a bit of complexity. Intensity and balance are outstanding. Light lemon and wheat cracker arrive initially. Mid palate delivers a subtle bitterness and an equally subtle biscuit sweetness. Clove becomes the main component from the middle on riding over the wheat. The finish is somewhat crisp and light clove lingers.", "Bottle. Cloudy with an orange appearance. Small head with some spices floating around. Pleasant but average.", "Easy drinking wheat with a slight spice to the taste.  \n\n---Rated via Beer Buddy for iPhone", "Two 12 oz bottles at The Beechwood Lounge. Bready malt characteristics with light spicy hop bitterness and hints of fruity esters. Light and pretty easy drinking overall.", "Okay ale. Unfiltered might be throwing me off but a bit flat on the wheat side though I get the pale ale part\n\n---Rated via Beer Buddy for iPhone", "(Bottle, 0.355 l - bottled 03/02/16, at Bar Bronco 2, 20160601) The beer poured golden and hazy. Its head was small and white. Aro ma had fruitiness and sweetness. Palate was medium bodied with medium carbonation. Flavours were fruitiness, sweetness, malts, citricness and bitterness. Aftertaste was hoppy and bitter. A nice hoppy pale ale.", "Bottle; hazy orange with a white head; aroma of wheat, lemon, hay, and bread; taste is wheat, lemon, bread, and a hint of hay; finish is slightly bitter; okay but was below expectations", "on tap dorata velata non molta schiuma lieve citrico un po di cereale piuttosto amara non incisica ma senza difetti", "Bell’s Oberon has a medium, off-white head, an initially clear, yellow appearance, some streaming bubbles, and stringy lacing left behind. The beer clouds up, after the \"swish & pour\". Aroma is of spices (alligator pepper?), sweet, white bread, and maybe sourdough. Taste is of slight banana, alligator pepper, white pepper, coriander, a shade of banana, white wheat bread, possible bubble gum, and practically no bitterness. Mouthfeel is medium and fluffy, and Oberon finishes drinkable and semi-dry. RJT", "Bottle from Cotteridge Wines; hazy golden yellow pour with a thin beige head, aroma has lemon along with some grain action, taste has citrus, grainy hob nob biscuit, OK.", "Pale golden hazy, big white head. Pretty standard, yet tasty wheat beer. Mild spicey, coriander, orange, low bitterness... smooth mouthfeel, easy drinking. Nice.", "12oz bottle to tulip. Pours clouded orange, small white head, lots of sediment. Aroma of orange and coriander. Taste of same with decent wheat backbone. Spices are good and a slight bitter orange rind finish is welcome. Think I might have an old bottle.", "1pt can from Beer Gonzo. It pours a cloudy light apricot color with a medium white head. Aroma is grainy, crispy and lightly sweet with light notes of apricots and strawberries, alongside wheat, grass and lemon peel. Taste is also crisp and grainy ufront, then lightly fruity sweet and then finishes more grassy leafy bitter. More notes of apricots, strawberries, grass, wheat and light lemon peel. Medium bodied with good carbonation. Overall, tasty and refreshing", "Very good beer but I find from bottle to bottle there is too much variation. I like the orange zest but have found similar beers including a local competitor; Arcadia which seems to have a better use of the orange zest in their competitor to Oberon. The lack of bottle consistency is only negative.", "Can from Kihoskh during CBC 2016.\r\nCloudy orange/yellow with a thick medium sized off white head.\r\nRefreshing aroma of orange juice, wheat, zest and some spice. Maybe a weak hint of banana. Thick and refreshing at the same time.\r\nSweet and soft wheaty orange juice flavour with a zesty bitter finish and a creamy thickness in the back of the throat.\r\nMedium bodied, soft crabonation, creamy mouthfeel.\r\nCreamy and full with orange flavour. Maybe a tad sweet. Or it’s just a bit too old.", "Nice hazy yellow-orange color, Nice smooth taste with a hint of orange zest in there.", "Can from Mikkeller Bottle shop. \r\nPours hazy yellow.\r\nQuite sweet malty brew with some herbs and orange zest.", "Can\r\nHazy yellow white head \r\nAroma of summer, slight banana, wheat and citrus \r\nTaste mild round sweet and nice. Full texture. \r\nSlight alcoholic feel.", "Hazy, yellow-orange colored, small+ white head. Aroma is of some wheat, quite fruity, peachy, some spicy yeasty, bit phenolic notes. Taste is medium sweet wheat, fruity, peach, spicy yeasty, medium- bitterness, dryish finish, bready. Light+ bodied, soft carbonation. Nothing special really...\r\n(bottle, Vrutak, Zagreb)", "can from online web order, poured a yellow to golden colour with a white head. nose is quite light, small hints of citrus, grains, light wheat, banana, cloves, peel. taste is light bodied, some fainted wheat, citrus, and banana. expected a lot more from bell’s", "Burk från Mikkellers webbshop. Fin apelsinzestdoft, med lite persikagodistouch. Juicig smak, lite veterlig, mjuk lite krämig munkänsla, fina apelsinsmaker, lite smågodis, persika, måttlig beska. Riktigt trevlig.", "I’ll try this one again, it is a fine summer ale. Nothing really special to brag on.", "Can@Desverger. Pours golden yellow with a small white head. Aroma and taste is malt, fruits, lemon, hay, crisp on the palate, hops. Medium body. Soft carbonation. Light bitter finish.", "Kinda disappointment. Nothing bad or off, but seemed too plain even for first beers as thirst quencher. Overall well balancedm but bit watery. Some wheat character, kinda weird honeish, bananaish, some hops floating around. Drinkable, but nothing to repeat", "A light yellow beer, a head is dense, big and blond. Aroma has fruitness, lemon, some spicyness and sourness of wheat. Taste has lemon, wheat and spicyness. Very smooth and fluffy palate. Medium bodied. Refreshning summer beer.", "Pours a hazy golden yellow color. Aromas of bread/lemon/and some fruit. Had a taste of yeasty bread with some spice.", "Can from Beer Gonzo, Coventry. Spicy, clove aroma. Taste is doughy, clove, bready, spicy, slightly tart. Mild finish. Refreshing", "Pours a very attractive cloudy maize with loads of thick pure white lacing. A mild citrus fruitiness and earthy yeast plays skillfully with the wheat base. A very understated, but well crafted wheat ale with a lot of subtlety. Finishes with a refreshing fruit and spice fade.", "Bells Oberon Wheat ale 5.8%\n\nI heard a lot about this beer and finally had the chance to try it. A crazy cloudy gold-orange with a big fruity with some malty biscuit. \n\nMedium bodied, chewy honeyed malt and the flavor is surprisingly malt forward putting me in mind of an English ale. Interesting but may not be at it's freshest.\n\n---Rated via Beer Buddy for iPhone", "Tap@Jolly Scholar, Cleveland, USA. Light aroma with wheat and some sweeter malts. Light yellow color with small white head and hazy liquid. Medium taste with dry peach and some citrus. Narrow taste spectrum with medium aftertaste with wheat. Medium/light body with medium carbonation. Overall, artificial bland product, but refreshing.", "Yellow hazy with small white head. Hopy and spicy aroma. Medium dry bitterness on slightly sweet malty background with spicy coriander notes. Slightly bitter aftertaste with spicy touch.", "pour pale / yellow with a slight cloudy collor. light metallic, light lemon aroma taste light bitter, light sweet. slight creamy texture, average carbonation and soft bitterness.", "Can shared with Niller, sourced from Mikkeller Bottle Shop, Copenhagen - golden orange coloured pour with medium white head. Aroma and taste is fruity, light lemon zesty, with notes of straw, hay, light pale malts, crisp on the palate, refreshing wheat ale.", "Pours hazy golden with minimal white head \r\nAromas of citrusy fruits, wheaty bread, hints of spices \r\nTaste has notes of wheat bread, citrusy fruits, spices, hints of caramel sweetness", "33cl bottle. Pale yellow, hazy, with a thin off-white head. Yeast, bread dough and some white bread, bananas and pears and a mild citrus component. Bitter-sweet, hearty, with a medium body and carbonation.", "Golden pour from bottle. Taste is fruit, citrus, malt, pine and hay. Smooth, balanced and nice.", "This is one of my favorite beers. It has a fruity aroma and a smooth malt taste with a nice amount of citrus spice. The taste of this beer is unparalleled.", "Can from Mikkeller webshop. Pours slightly hazy golden with white head. Zesty lemon aroma with floral notes, slightly perfumy and some grains. Dry wheat and lemon taste with some floral hops. Nicely balanced but not too exciting.", "Spicy floral aroma in a yellow gold pour. Nicely balanced brew with a fruity body and a crisp clean finish.", "Draft. Pours clear copper. Thick foamy head. Has alight palate with a spicy hop taste. Spicy and dry with a gratefruit after taste. Good beer.", "Can (16 oz). Citrus and wheat malt aroma. Wheat and pine hops with pineapple notes.\n\n---Rated via Beer Buddy for iPhone", "Poured from a bottle. Pours a cloudy light amber with a thin white head. Medium carbonation with some lacing. Faint aroma of fruit, biscuit, and some spices. Flavor of wheat with a slightly bitter taste on the roof of the mouth and a peppery finish. Fairly crisp but not a refreshing as I had expected. OK but not that great.", "Bought this bottle @ Kroger-Swift Creek Midlothian,Virginia - Date on Back of label is 3/17/16! Lemons up front then the malt wheat comes through! Very Refreshing Beer - I think I would love this beer in the middle of summer watching a baseball game or at a barbeque! Very Good wheat beer! I heard it also now comes in Cans! Solid Solid Session Ale!", "Poured from bottle. \r\nAroma of citrus and spice.  \r\nAppearance is good lookin cloudy gold with lacing. \r\nTasting is dry wheat, lemon, yeast\r\nPalate is dry and refreshing. \r\nOverall, very good wheat ale.", "I can't understand what the hype is over this beer every year. Oberon is a good beer but the all the pomp and circumstance has turned me off to it.\n\n---Rated via Beer Buddy for iPhone", "................................................................................", "Draught at Top Hops, NYC. Cloudy pale golden/yellow beer with a decent offwhite head. Hoppy wheat aroma, caramel, citrus, bready notes. Hoppy citrus flavor, caramel, grapes, floral, wheat, bread, some hay. Decent beer.", "On tap at top hops NYC. Pours hazy yellow with a small white head. Smells citrus, fruity hoppy. Tastes boiled vegetables, fruity hoppy with similar finish.", "Review based on the BJCP2015 guidelines (style 1D). Bottle 35.5 cl - Batch 0851238. AROMA: prominent hop aroma with traditional american character (slightly citric / pine / rustic), with a moderate to low malt character (faint wheat). APPEARANCE: pale gold and hazy. average white noussey head with moderate retention. TASTE: initial hop flavor similar to aroma (slight citric and rustic), followed by a moderate-low sweet malty character (faint wheat). moderate bitterness that slightly lingers beyond a semi-dry finish. PALATE: medium to medium-low body with moderate-high carbonation. OVERALL: an american wheat ale with all aspects within the style (clean yeast, etc), and with a prominent hop presence but not overwhelming. it would benefit with a more wheat presence.", "33cl bottle from firma bier. Light hazy dark gold to orange color. Thin white head. Body is thin, quite crispy. Taste is medium bitter, low sweet. Aroma is orange, lemon, malt, light yeast.", "Straw color, total clarity, very slight haze. Actively rising carbonation but a sliver of a white head that doesn’t look very promising. Nice touch of spices on the nose such as coriander complemented by a lemon/lime citric aroma. I feel like the percentage of wheat in the grist is not much more than 20%, but I could be wrong. On the entry it feels a little too spritzy and stripped of flavor, but it is still far better than most American wheat ales I’ve tasted. More than decent mouthfeel and a great summer drinker for anyone.", "1 pint can @ Timo A. Could not interpret the date.\n\r\nPours clear pale golden color with a small head. Aroma is sweet peachy, orange and hay, some pale malts. Flavor is also sweet orange and wheat, some apricot. Feels a bit old sadly.\n\r\n4424", "Bottle at home. Aroma is sweetish biscuity malt, floral, wheat, bubblegum, fruits, dough, yeast, spices, apricots. Flavour is over moderate sweet with a little bitterness in the finish. Body is medium. While this is certainly a decent and drinkable beer, I fail to see why this is so highly regarded.", "Thanks Greg for sharing the bottle! A bottle about 6 months old or so.\r\n\r\nPoured into a wine glass showing neon yellow with sparse white foam. \r\n\r\nThe nose shows round malts and light orange peel. \r\n\r\nThe palate is light bodied and moderately carbonated. Flavors of round lagery malts, slight citric notes, and a comparably strong bitterness.", "A delicious wheaty-easy-to-drink beer. I know people go crazy when this hits shelves again each summer, and I only had it a couple of times a couple of years ago, but I remember it being the quintessential summer beer: light in body, light in color, and kind of sweet.", "Finally a wheat beer without wheat in taste. I like it! Well balanced in different styles (?), anyhow a good stuff. B@H", "Spicy, sour, yeasty wheat beer aroma from a murky medium yellow body with a foamy white head. Lots of good wheat taste here with a full body that makes this more substantial than a lot of wheat beer. Some cloves in the middle but not strong and a nice alcohol bite for a wheat beer. Finishes slightly sweet and yeasty. Very refreshing and very good.", "Can to goblet. Aroma is corn, wheat, grass, hay. A bit musty. Touch of fruit, maybe orange, deeper down. Appearance is Light yellow, mildly cloudy...medium white head. Taste is grass and light citrus. A shy aftertaste. Feel is a touch pasty, but smooth. A bit underwhelmed.", "5.8%ABV. Wheat Ale.\r\n\r\nPoured out of the bottle a light amber.  8ºSRM.\r\n\r\nNose is beery and wheaty.  There is some fruity herbaceousness to the nose.  Some residual dusty floury aromas.\r\n\r\nMouthfeel is watery.  There are some light toasty flavors with wheat toast coming up most prominently.    \r\n\r\nLight hop finish.\r\n\r\nOverall, a light drinking adequately put together ale", "Gold with thin beige head; aroma is mild slightly fruity raspberries; flava is sweet raspberry and subtle grain; feels medium creamy soft but lively fizz; finishes dry tangy", "Nothing bad or special here. Pretty typical wheat ale. Heavy wheat flavor, low malt flavor and some hop in the background. Middle of the road well made wheat ale.", "The aroma is pretty good, you can feel a strong floral notes, but for a wheat beer I would have expected the nice banana or cloves aromas but actually they are not in there. Regarding to the color is a blond beer with a standard white head. When is tasted is medium bodied, but the alcohol flavor prevail over the others, so there are not malt flavors or hop flavors an at the end just a earthy flavor. I seriously do not understand why everyone gave it such a high score.", "Floral hop with pleasing citrus note. This can be hard to find by its strong following is putting it on more and more shelves. Even saw it at a wedding!! Great breakfast beer!", "Bottle. Pours golden, clear, small head, some lacing. Aroma of yeast. Taste of yeast, wheat malts, some spices.", "Bottle from Beer Cartel 240915. You don’t see many of Bell’s beers in this part of the world so I snap them up when I can. Weighty number this one with solid colour and a head that fades. Good strong body and a fair bit or fruitiness happening.", "Poured from a 16oz can into a pub glass. Packaged 5/15/15.\r\n\r\nAroma - Bubblegum sweetness, cereal (Captain Crunch?), dare I say orange creamsicle? \r\n\r\nAppearance - Hazy, deep orange.\r\n\r\nTaste - Matches the nose completely with a balancing bitterness. Hops, in their own right, bring out bright orange-like flavors. Incredibly unique. If I were a kid again, wondering what a beer smells like, I’d assume it’d be something like this. \r\n\r\nPalate - Creamy (emphasis), medium bodied.\r\n\r\nOverall - Lives up to the hype and more. In a style that typically lacks any real oomph, and often leaves me wondering why I just didn’t have a hefeweizen instead, this one is a no-brainer.", "12 fl oz bottle. Pours murky golden with a medium white head. Aroma of some yeast, pale malt, orange. Taste is slightly yeasty, pale malt, orange, spices.", "Bottle. Light wheat nose, floral hop, grain, and a twist of citrus. Very pale straw, thin fine head. Mild wheat, gentle toasty malt note, and a touch of honey. Thin-medium body. Well-blended flavors. Pleasant stuff.", "An excellent wheat! Lovely gold pour w/ a white head that leaves good lscing. The aroma is bready, softly sweet, & rather enticing! The taste is clean, crisp, & refreshing! Quite complex for a wheat & certainly perfect for summer! Nicely done!", "16oz can. Packaged 6/30/15. Appearance: Light golden and mostly clear with a slight haze. Thick white foam cap with nice lacing. \r\nAroma: Grainy, bready, wheat aromas. Slight orange peel. \r\nTaste: Light malt sweetness, grainy, with some tart peel flavor and a sharp, spicy bitterness. \r\nMouthfeel: Light to medium body either some creaminess. High carbonation. \r\nFinish: Dry with a spicy lingering bitterness. \r\nOverall: Well made, very refreshing American wheat with spicy bitterness and slight fruitiness", "Hazy pale amber with a small white head leaving sparse lace. Nose of wheat and light spice. Light toffee with a spice dominance. Medium light creamy body and soft carbonation. Interesting wheat.", "On tap at Justin’s, Navy Yard, DC. Appearance is cloudy, golden yellow-orange body with 1 finger head. Aroma is fresh and fruity wheat aromas, fruit, hops. Taste is lightly spicy, bitter and citrusy. Palate is moderate carbonation with a medium body. Overall pretty good, while not my favorite style of beer.", "[7322-20150703] Tap. Mild fruity grains aroma. Hazy, orange body with a quick foamy white head. Toasted light fruity grains flavour. Medium body. Average. (7/3/7/3/14) 3.4\r\n\n(Blue Jays vs. Tigers @ Comerica Park, Detroit, MI)", "Draught. Rich golden yellow color, cloudy appearance, small frothy white head, doughy aroma, low carbonation, toasted malt taste, long finish. Very nice brew.", "I was expecting more from this \"hoppy wheat\"...from the style and the brewer. not deserving of a 98 in style imho. not bad, but nothing stands out - was expecting more bright sunshiny hops, and got a decent American wheat.", "A completely acceptable and slightly flavorful American wheat. Slightly fruity, sour and bitter. Notes of orange zest, wheat and grass. This is a great representation of the style: light and refreshing but still complex enough to appreciate.", "12 Fl. Oz. Bottle. Poured hazy orange, nice white head but no retention and n o real lacing. Aroma of citrus and wheat. Taste is a little acidic, some alcohol, some floral notes, wheat and yeast. While I’m not that impressed I’m not really disappointed either, nice drinkable beer.", "Pleasant mild bread aromas. Hops contribute some citrus flavors. Slight touch of spice - some mild clove.\r\n\r\nHazy light to medium amber color; sparse off white head.\r\n\r\nMildly sweet; mild bitterness.\r\n\r\nLight to medium body; slick texture; average carbonation; medium finish with bread, citrus.\r\n\r\nOverall a pleasant summer brew (a wedge of orange does work well with it), but nothing especially complex or too distinguished.", "Served on tap at the holiday inn express without an orange. Orange hazy color with a white head. Grain and citrus aroma. Light body. Grainy with some citrus.\n\n---Rated via Beer Buddy for iPhone", "Bottle. Cloudy, straw-yellow pour with a small frothy head. Leaves some film. Mostly orange peel and hay in the aroma. Flavor is a little sour, mostly citrus and wheat. Good example of the style.", "Had this brew at Comerica Park in Detroit.\r\n\r\nI had heard good things about this brew, and having the Two Hearted Ale in the past, I knew this brewery was quality.\r\n\r\nVery good refreshing Ale, with a bit of a Hop bite to it. \r\n\r\nPurchase and you won’t be disappointed.\r\n\r\nMB", "Bottle 12fl.oz.\n\n [ As Bells Oberon Ale ].\nClear medium yellow color with a average to large, frothy, good lacing, mostly lasting, off-white to white head. Aroma is moderate malty, pale malt, moderate hoppy, grass, straw, pine. Flavor is moderate sweet and light bitter with a average duration, old hops, pale malt - wheat. Body is medium, texture is oily to watery, carbonation is soft. [20140813]", "poured out of the bottle. Hay and hints of oranges in the nose. Rich yellow with a slight copper hue, decent haze and frothy white head that retains health for quite a while. Medium mouth feel for a wheat with fair carbonation. Was expecting a little richer texture to match the haze visually. Nice crisp grain flavors with slight hay and good amount of fruitiness. Good wheat ale for the summer season.", "Like a much better version of Blue Moon White Belgian. This is a bit more sour and yeasty, but also smooth and mildly sweet.", "Wow, look at all those ratings!! While this isn’t a knock your socks off or anything brew, it’s one of very few American Wheats that is AWEOME.", "Hazy golden yellow. Spicy yeasty aroma. Bitter, wheaty, yeasty fruity aroma.", "Pours murky orange with a thick head. Initial yeasty bread taste with a hint of citrus lemon and mild spice. \n\n---Rated via Beer Buddy", "Lots of sediment, orange hazy wheat. Do get the spicy hops and citrus while not losing the wheat.", "Beer pours hazy amber to honey colored, with a nice bit of continued bubbling. Pours with about 3/4\" of dense white foam, beer smells of pepper, citrus and an off putting smell that is hard to place if drank cold. Once past this particular aroma and letting the beer warm it comes across the palate smooth, and silky tastes of wheat, pepper, and has a bitter hop finish with a warming aftertaste. Beer is complex enough to appease most but still an easy drinker.", "On tap at the Federal Taphouse in Harrisburg, Penn. Olive-yellow pour with a little wheat haze. Loads of toast, wheat, coriander, and fruity notes on the nose. Medium body. Great spicy toast with a nice bitter finale. The wheat is a big part of this but the fruity spice makes it.", "Pours a cloudy orange color; billowy, white head. Aromas of orange, wheat, lemon, some spice (coriander?). Taste is more mellow and smooth than the aroma would indicate, and that's a good thing, mostly mild wheat and a little hint of the orange/lemon combo. Nice offering.\n\n---Rated via Beer Buddy for iPhone", "Inn at Bay Harbor, poolside, draft. Looks like summer. Slightly fizzy. Smells orangey. Doesn't taste as organgey. Pretty bitter, hoppy, dishwater-soapy. \n\n---Rated via Beer Buddy for iPhone", "Smells like a wheat ale and maybe a little citrus. Medium carbonation, slight foam, and semi watery. Taste is all wheat and orange citrus bite. Aftertaste is 10-20 seconds and the same. Has a bit of orange peel bitterness that lingers.", "Bottle. hazy yellow orange pour with a big white head. Orange, wheat, fruit, spice. Nice carbonation. Medium body with nice citrus, spice and wheat flavor throughout. Really nice", "Pours cloudy golden color with a white head. Aroma is light malt with orange, and earthy hops. Flavor is a sweet light malt with citrus flavors of orange and lemon. Earthy hops flavors with spicy yeastiness. One of the better wheat beers I’ve had. Nice summertime beer.", "Decent for a summer beer. Smooth taste and light/medium body. No flavors that stick out too much.", "Love wheat beer. This one fell short for me. Tasted more like flat beer than wheat beer.", "I can’t believe I haven’t rated this yet. Smells of faint wheat, lemon, orange rind and has some spice in the background. Hazy orange color,not dark, but you can’t see through it. Tastes like lemon zest and wheat with a clean wheat background. Not complex, not supposed to be. Excellent palate, because I want more carbonation in a beer like this and it does so without being overwhelming. Good summer beer; a good choice when you want something drinkable, not all that strong that still has a taste.", "If you ever brewed beer you will know the aroma of this beer. It reminds of of being at a brewery. The appearance is slightly cloudy, but not as much as most wheat beers. Taste is a little lacking I would like a little more hops but overall all a very good beer.", "Not sure how I haven’t rated this yet, living in Michigan. Solid wheat that always brings nice citrus notes of orange and lemon. I’ve seen some years put out an opaque orange, others a crisp straw yellow.", "29 May 2015. Draft. Cloudy, milky, pale yellow. Ring lacing. Faint grassy aroma. Nice hop bite; some spice. Otherwise rather bland.", "Real solid for the style, brought me the world of craft beer, so huge thanks, nice flavors for a summer day\n\n---Rated via Beer Buddy for iPhone", "16 ounce can.....how have I not rated this? Pours a clear golden color with a medium white head. A big sweet fruity nose, banana, lemons. Very smooth, fresh lemons, dry biscuit malty base. A crisp tea like focus, like dusty wheat. Really quite nice. Super smooth. I could drink 6 of these easy. Finishes hoppy and citrusy.", "12 oz bottle. One of the better wheat beers around without the usual dryness or yeast residue you;d expect from this type. Give it a try.", "Aroma is lite and malty, a hint of hops. Taste is lite bread, with a bit of lemon. Perhaps I should try this again on a hot day - not used to being disappointed by Bells. (  note I was coming down with a cold when I rated this. Need to re-rate)", "22nd May 2015: bright sunshine on the patio but surrounded my dark thunder clouds here in California (at my daughters). 12oz bottle poured into a Corsendonk badged stemmed tulip glass. Cloudy body with an orange hue to the lemon colour, on top a snow white crown of tight bubbles. highly carbonated, like most beers in this style. Yeasty, citrusy and too cold initially. The wheat comes through very heavily in the flavours and dominated the taste. Refreshing and crisp in nature, but not really my thing. Scored objectively.", "Drinking from the bottle. Not keen on the spicy aspect. without the spice i would like this more.", "Niezbyt przyjemny słowdowy aromat z lekka siarka. Piwo niemal klarowne, złote, kiepska piana, niezły lacing. W smaku lekkie fenole i guma balonowa z przodu. W środku słodowość. Końcówka pusta. Brak posmaku, brak goryczki. Ogólnie mocno średnie.", "4 oz pour on draft at Spacebar. Hazy orangish yellow with off-white head. Aromas of light citrus, wheat, malt. Tastes of citrus, orange peel, light wheat. Medium-light body with a dry finish. Nice easy drinking summer beer.", "Beautiful sunny pour with a nice cloudy body. Aromas lacked a bit of the advertised fruitiness but the hoppy flavors on top of the wheat is a great balance.", "This a great summer ale - this wheat beer is beautifully balanced and a real pleasure", "Light golden color that is cloudy. Very little aroma and very little carbonation where I had it on tap. More of an American style wheat. No banana or clove flavors like a German Wheat. Slight spicy flavor with a bitter finish, though no hop aroma is present.", "floral, golden, medium sweetness, light body, lively, A very refreshing beer for the summer time, goes with about anything", "Draft. Cloudy yellow with short white head and lots of lacing. Aroma is yeast and citrus. Mildly sweet with crisp, bitter finish. Taste of lemon and orange rind. Very nice overall.", "Presentation: It was poured from a brown 12 oz bottle into a mug.\nAppearance: The body has a light haze and a nice yellow color. It’s head is bright white, tall and long lasting. It also make some nice lacing on the glass. \nSmell: I get ligjt notes of sour dough bread, light grain and light grassy hops with a slight citrusy lemon. \nTaste/Palate: Up front it’s bready with mild citrusy notes moving in. As it finishes more grassy hop bitterness comes out. Overall it’s refreshing and we’ll carbonated.", "Spicy and crisp, golden color with a small white head. Definitely a summer brew. Smooth drinking.", "Very spicy aroma, coriander wheat and dried fruits. Flavor is wheat and some Belgian yeast character. Very carbonated full glass lacing. Finishes very dry and crisp with lingering wheat.", "Bottle. Pours a medium gold with a high, fine-grained, off-white head. Nose is spice, stone fruit, wheat, and yeast -- nicely balanced. Very tasty; nothing predominates, but the sweetness, fruitiness, and grain balances perfectly. There’s none of the slightly hollow notes that wheat ales can develop. Long, smooth finish. A classic.", "Aroma of lemons and oranges. Color is hazy yellow with a thin rim of white foam on top. Taste is of navel oranges, coriander, black pepper, and biscuits on the middle of the mouth. Fizzy mouth feel on the palate. Very sweet and jucicey Orange follows.", "Tasted from draft. Pours a pale cloudy yellow with white head. Good lacing. Citrusy aroma with some orange. Taste is mild bitterness with moderate sweetness. Flavor is light and citrusy a little bit of biscuity sweetness. Excellent summer beer. \n\n---Rated via Beer Buddy for iPhone", "Every time i see it on a shelf i feel like i need it. Great summer patio pounder. Probably the best summer seasonal available", "A great summer wheat beer. Mild fruit finish with just the right hop finish. Always look forward to springtime when this is available.", "Pours cloudy light yellow from bottle with thin white head. Minimal aroma. Tastes a bit sweet, with mild bitter aftertaste. Nice full bodied mouthfeel. Very drinkable beer, no complaints.\n\n---Rated via Beer Buddy for iPhone", "Bottle from Wegman’s Fayetteville. Yeasty bread and hay aroma. Minimal head on top of a cloudy golden body. Usual whaet beer taste, mildly bitter. Nice medium mouthfeel. Finish is short and bready. Good summertime wheat beer.", "Bottle pour. I didn’t enjoy this beer at all. Typical American wheat taste, but it left a bad aftertaste. Will not drink again.", "One of my favs from my home state. Can?t go wrong especially on a hot summer day. Crack open enjoy with friends. Tap & bottle", "I don’t think there is a better spring/summer beer. Light, refreshing and slightly spicy. Just enough fruit and wheat flavor to balance perfectly in your mouth. Every year when I see this on the shelf my mouth waters just a little bit.", "Orangey in color. Citrus and malty flavor. Pretty good beer. Will have this again.", "31 Mar 2015, bottle. hazy light orange. nose is sweet orange juice and yeasty malt. thin body and moderately fizzy. orange rind, some coriander, mildly spicy yeast. decent.", "Poured from a bottle. Hazy orangish gold color. Nonexistent head. Wheaty smell. Typical wheat beer with a lemon zest. Ok.\n\n---Rated via Beer Buddy for iPhone", "Soft fruity, floral aroma. Flavor is doughy/grainy sweetness, pineapple/ lemon/orange accents, mild spicy hops. Simple, refreshing and well balanced.", "Citrus aroma cloudy yellow look fresh crisp on the way down very smooth 10 white head, very delicious!", "Bottle, last of a sixer I enjoyed. Pours a murky gold, not much to look at. Wheat, zesty hops, slight yeast notes hit the nose. Taste gives you grass and grains with a touch of citrus. Full-ish wheat-y mouthfeel. Nicely balanced and very sessionable.", "Cloudy yellow white, thin head and minimal lace. Aromas of wheat, lemon, mild yeast and grassy hops.Sweetness of ehat malt up front, with lemon notes and slight hop bitterness. Light body, effervescent, prickly mouthfeel and a grainy finish.", "2017 re-rerate: Tap at J’s. Pours a clearish gold with a small bit of foam on top. Grainy nose with faint orange zest. Dry and malty nose with some faint orange as it warms up. Pretty simple and straightforward beer.", "On tap at DuMont Burger, Brooklyn. Pours cloudy yellow with white head. Citrus and wheat aroma. Sweetish, fruity bit spicy. Nothing special.", "My gateway to the craft beer scene. Pours golden yellow orange. Aroma citrusy and summer air. Taste is smooth and warm. Some spiciness. I cannot begin to explain the anticipation of this beers release in spring. It’s a long winter up here...", "Pours a cloudy golden orange with thin off white head. There’s a citrus, grassy, lemon, and grain aroma. Light body that was slick and oily on the palate. Flavor’s of lemon, orange, and earthy notes.", "Pours an unfiltered golden orange with little bits of sediment. Fizzy white head settles into a sticky cap that leaves nice lacing on the glass. Aroma is boiled peanuts, citrus rind, fresh cut grass, lemon zest, and some herbal notes. Flavor is lighter than the nose would suggest. Orange peel, coriander, slight hop bitterness on the back end rounded out by some sweet malts. \n\n---Rated via Beer Buddy for iPhone", "Presentation: 16 oz. can, served in a pint glass.\r\n\r\nAppearance: Cloudy yellow color with a white, two finger head. Leaves some good lacing.\r\n\r\nSmell: It has a strong aroma of grains and a hint of lemon peel.\r\n\r\nTaste: It has a grainy, citrus taste. Nothing spectacular.\r\n\r\nMouthfeel: Light, refreshing and easy easy to drink, your typical summer beer. Average carbonation.\r\n\r\nOverall: Nothing to write home about. It doesn’t stand out in any way, but I guess that’s fine for some beers. It’s still nice and refreshing like all the other craft offerings that flood \r\nthe market during the summer months.", "For a summer sipper, you can’t beat Bell’s Oberon. Some citrus in the aroma. Nice head. Sublime.", "Bottle, 6 months old. Someone left at my party. Don’t think I ever had this. Possibly before I started on this site while vacationing in michigan. Either way, never reviewed. Golden orange pour. Aroma is meh american wheat. At least doesn’t have the Weiss banana going on. Touch of citrus. Not impressed but wasn’t expecting to be.", "Bottle from Whole Foods Market, Bowery, New York, NY. A hazy straw coloured pour with a thin white head on top. Wheaty, malty aroma. Tastes similar, wheaty, malty, orange, hint of lemon. Would be quite nice on a hot summers day instead of a cool autumn day.", "One of my favorite beers. So smooth and crisp. Great taste and appearance. Nice palate and nice aroma. Great summer drink.", "A wheat ale that’s smooth, but with a slight bitter aftertaste... Not my favorite, but it’s okay", "Can, BBOTMC. Pours yellow with a nice head, aroma of fruits and yeast with apricot and guava, flavor of malt and yeast with herbal hops, medium bodied", "Love this one favorite of mine tastes a little different then original solsun in 22oz. bottle but still one of my favorites.", "On tap at Williston Brewing Company. Appearance: 1 finger white head, straw color, lightly cloudy, Aroma: light wheat, light funky fruit, light biscuity malt, all very subtle aromas. Palate: light body, average carbonation, slight dry finish, light bitter finish. Taste: sweet wheat and biscuits into light funk fruit overtones that come in halfway through the taste, and finishing with a light floral bitter. Overall, very complex, super unique, very good balance for the complexity, and not overly complex or forward for the style.", "Bottle to tulip\r\nOrange rind, caramel, cream, and wheat. It pours a cloudy amber with loads of small, medium, and large particulates and a 2 cm long lasting creamy head. Taste is orange, malt, pepper, and hops. Not surprisingly, very chalky and very creamy too.", "My favorite Bells offering to date. It is a home run. I like everything about this beer. No complaints. Drink it and you'll see why. \n\n---Rated via Beer Buddy for iPhone", "Pours with relatively little head and the head is short-lived. \r\n\r\nS - quite fruity: aromas of apricot and citrus.\r\n\r\nT - fruity but a little more sour than sweet. Not a big fan of wheat beers but this one’s not bad. Still, not a great finish. \r\n\r\nM - thin; near watery\r\n\r\nO - pleasant; has, in my experience, a unique character.\r\n{From April 2011 notes}", "Can’t believe I have never entered a rating for this one. Bottle (recently shared by goodbyeohio)... Poured hazy, straw yellow with a mild forming head. Lovely wheat tone, with a hint of vanilla, malt sweetness & husky-ness along with fruity esters and some noticeable grassy hopping.", "Bottle, pours hazy gold with cream head. Always a signal spring is here in our area as the store signs announce \"Oberon is Here\". One of my go to summer beers. \n\n---Rated via Beer Buddy for iPhone", "Bottle from GBBF 2014. Poured a hazy orange, with a halo of white head and visible floating yeast. Aroma of grass, peal and wheat. Oranges and tinned fruit in the flavour, with a little straw. Rich finish, with some grain apricot and mango.", "Transfer from BA review on 5-5-13-\r\n\r\n Served on tap in a pint glass\r\n\r\n Appearance – The beer pours a very hazy golden amber color with a one half finger white head. The head has a moderate level of retention, fading over about a 5 min time period to leave a lighter level of lace on the sides of the glass.\r\n\r\n Smell – The nose is quite heavy of an orange citrus mixed with lots of grainy wheat. Along with these smells is a yeasty nature as well as a little bit of cardamom and clove spice. Rounding these smells out are some grassy and more herbal hop aromas giving a rather nice mellow smell overall.\r\n\r\n Taste – The taste begins, as the nose would have suggested, with a wheaty and orange citrus flavor. As the flavor advances, the yeasty flavors come along and bring with them flavors of a light corriander spice and some banana. A grassy flavor comes to the tongue more toward the middle of the taste and gets slightly stronger as the taste advances to the end. Along with the grassy flavor, the wheaty flavor grows in strength and becomes more grainy with more yeasty flavors coming to the tongue as well. With the mix of flavors that reside at the end, a rather grainy wheat and yeasty citrus flavor is left to linger on the tongue.\r\n\r\n Mouthfeel- The body of the beer is on the average to slightly creamier side for a brew of 5.8% abv with a carbonation level that is rather average to slightly above average. The creamier body is very nice for the wheaty and grainy flavors of the brew while the citrus is nicely accentuated by the moderate to slightly higher carbonation. \r\n\r\n Overall – A nice drinking American Pale ale with a good blend of wheat, yeast, citrus and grassy flavors. Rather tasty.", "Wheat beer isn't my favorite, but on a warm sunny day I sure do like 3-5 bottles of Oberon.\n\n---Rated via Beer Buddy", "Bell’s Oberon Ale is the classic American Pale Ale in my opinion. Bought at a Kroger Supermarket in Douglasville, GA. This beer blew me away with its complex flavor and awesome appearance.", "Very hazy golden with white head. Aroma is citrus and wheat. Refreshing, caramel malt, quite a bit of CO2, cereal almost chocolaty. Slightly grassy hops in the finish. This is one of my least favorite styles of beer, but I enjoyed this one very much.", "pours cloudy yellow with a nice creamy white head, some retention and lacing. gentle citrus-grapefruit and crackling wheat, lean and fresh pale cereals, yellow skinned fruitiness, spicy peppercorns, lemon peel, dry wheatiness, hint of melons and pineapple, sulfur traces. average carboantion, light body - just a tad watery, dry and almost crisp and astringent herbal-grassy-spicy-citrusy finish. enjoyed!", "DATE REVIEWED: August 10, 2014... GLASSWARE: Rare Vos shaker... OCCASION: Shark Week 2014 kicks off...with another mockumentary?!...APPEARANCE: hazy to the point of opaqueness; burnt yellow body; simple white head; little effervescence... AROMA: some pitchy yeast and bubblegum is planted in a malty base; gentle hops round out the profile ... PALATE: light body, slightly active; soft from tart to finish, barely suggesting an ale in the wheat; highly drinkable... TASTE: bright,slightly sou lemon and light malts; some pepper and clove arrive late;remarkably flavorful for a refresher...OVERALL: much better than Shark of Darkness, much to my disappointment of the latter; Oberon is crisp, remarkably balanced, and on par with Victory’s Whirlwind--a worthy case mate for Bell’s Two Hearted...", "Exactly like the description by the brewery- spicy hop profile with some fruitiness, mostly bitter orange. Wheaty/yeasty. Decent, especially in the heat.", "Tap. Pours clear gold with creamy white head. Aroma is cereal malts, floral notes, light tropical fruits, and faint cream. Flavor is dry malt base, faint floral hops, light fruit esters, and faint spice. Light body and medium carbonation.", "Draft at Lock 27. Pours clear bright am et with a fizzy white head. Tastes like sweet doughy malt, light banana, musky citrus. Light/medium body and low carbonation. Smells like sweet doughy malt, light pretzel, sweet fruit, dry citrus, caramel.", "Sampled @ ChrisO after GBBF day 2. Clear golden color, small white to off-white head. Smell and taste malts, slightly cardboard, lightly vegetables, a hint of fruit peel, bitter. Average body, fizzy carbonation. Quite bad.", "On tap at the Tilted Kilt Indianapolis. Pours a fairly clear, golden yellow with a thin, near white head that coats the glass. Aroma is slight traditional hops, and a bit of grain. Taste is balanced. Mild wheat flavours with a very balanced hop flavour. Medium body with a medium-high carbonation. Pretty clean and refreshing in the mouth. Overall not really my thing. Faint aroma with a mild wheat taste.", "Bottle from GBBF. Pours a hazy straw/gold with a white head. Light corn, light lemon, white bread aroma. Light body, medium to full carbonation. Lemon, light corn, light bread, light metal, grass... It’s fine. Solid, refreshing light bodied beer.", "Yellow-orange. Spicy, hoppy, fruity. Citrus. Very drinkable. Great beer for summertime.", "Oberon means summer. This beer is best enjoyed on a hot summer day. Thanks to the brewers at Bells for bringing summer in a glass.", "A fantastic summer beer. Great smell with a hint orange in the glass. Great wheat taste. \n\n---Rated via Beer Buddy for iPhone", "Golden orange with a big foamy head. Aroma spicy, yeasty and slightly hoppy. Taste fruity and spicy. Fairly sweet, good summer drink if you like your beers smooth and not bitter.", "Good summer beer but too sweet for me. Drank a bottle, so draft might be better. .....", "Hazy light golden colour. Citrus, grapefruit aroma. Medium bodied, wheat, spicy flavour", "12oz bottle from The Beer Shoppe in Ardmore PA. Pours a hazy light golden color with a small foamy white head. Aroma of lemon, orange, wheat, and herbal hops. Taste of coriander, wheat, and lemon and orange zest.", "Can, bbotmc. Hazy golden blond. Faint banana, apricot and a little vanilla in the nose, bitter and somewhat soapy in the mouth. Medium body, fairly carbonated and slightly soapy finish. Ok.", "Drank on tap at The Bog in Scranton, Pa. A solid wheat ale, not too overpowering in the wheat qualities.", "Bottle. Better Beer Of The Month Club. Cloudy orange with a white head. Aroma of floral hops, slightly citric, yeast, wheat, some fruitiness and a spicy hint. Flavor is sweetish, wheaty, with a light tart hint, pleasant fruitiness, yeast and a bitterish finish with a mild spicy touch. Medium-bodied. Refreshing.", "16oz can poured into a shaker glass.\r\nCloudy light orange color with a small white head.\r\nCitrus nose (grapefruit), light phenolics, sweetish malt and faint spiciness.\r\nWheat, low bitterness, dominant spices, some alcohol, faint banana notes.\r\nMedium bodied, not crisp enough but OK.", "Aluminum can from Sprout’s: Poured a vibrant glowing yellow hue liquid that was completely opaque with hazy sediment while a fat white pillow of foam head rested on top. Aroma was bland with only hint of grassy hops with a whiff of wheat like malts. The beer is smooth and reminds me a lot of Shocktop wheat. Not exactly what I was expecting from Bells Brewery but then again it had a long hard travel to reach me in Mexico. Very forgettable.", "12oz to clear coffee mug. Slightly hazy orange yellow. . Soapy head. Bitter orange and citrusy hop. Mild wheat feel. My refreshing go to summer garage beer.", "Pairs perfectly with your \"Summer’s No Bummer\" mix-tape unless of course you’ve included Sugar Ray, Sublime or 311. Actually I take that back...you’re as good as gold.", "A well crafted wheat beer; albeit one with flaws. I'm not a wheat beer fan, but this is in my top 5. Although I drink less of this every year, it still is a readily available and tasty summer beer.\n\n---Rated via Beer Buddy for iPhone", "12 oz. bottle poured into sensory glass. Appearance is a hazy medium gold color with a small white head that dissipates fairly quickly with minimal lacing.\r\n\r\nSmell is of citrus, light fruits, hops, and wheat.\r\n\r\nTastes heavy on citrus and sweet malt up front, followed by some wheat bread taste and finished with some dry hops for a nice amount of bitterness. Mouthfeel is light, tangy, and highly carbonated.\r\n\r\nOverall, a good summer beer that is worth a go every year.", "Draft. Pours cloudy gold with thin white head. Nose is citrus and wheat. Taste is nice citrus with a good aftertaste.", "Can from mtomlins. Hazy light orange with a light off white head. Light wheat, citrus, Belgian yeast, orange rind with a bit of pulp. High carbonation, mild body, but sweet at first then bitter and dry, smooth and mild. Easy to drink.", "Pours a very cloudy light orange with sediment and no head - not all that attractive. Wheat and light fruit aroma. Taste has a little more hoppy bite than typical wheat ale. Bready. Pretty good.\n\n---Rated via Beer Buddy for iPhone", "4-pack on large cans. A white/wheat beer that has a bit more hops than is traditional. Not that it’s an IPA or anything, but the hops add spice and dry out the finish. In fact, the aftertaste is slightly unpleasant to me. The yeast doesn’t seem neutral, but some esters are sacrificed for the sake of hops. I still prefer a well made witbier.", "A beautiful hazy gold with plenty of carbonation. Strong toasty smell with a hint of spice. Tastes like fresh bread with hints of orange and Christmas spices. Dry on the finish.", "I could wax all poetic about fruity scent and crisp, clean taste. Its appearance is perfect because it is in bottle and sitting on a deck overlooking a marina. Let’s just leave it at this: it’s an exceptional beer for a day at the beach.", "Pours a slightly hazy gold with a hint of orange hue, 3 finger white head. Aroma - a hint of orange and spiciness. Taste - mild wheat with orange/citrus, nice spiciness to balance the sweetness from the wheat. This is very refreshing and nice after a hot day of working in the yard. Crisp and refreshing with a medium long finish that makes you want another drink.", "Pours a hazy yellow/orange/golden color. Really looks very good. Aroma is ok, some orange and mild hops come through. Flavor is pretty awesome. Very light, very refreshing, almost like drinking a wheat beer orange juice with a hoppy finish. Very refreshing. I wouldn’t call this a go-to beer for any season, but on a hot day, this is awesome, and very refreshing. The small (and somewhat unexpected) hop finish adds a very nice element to this beer that other summertime beers definitely lack.", "16oz can. Pours a bright hazy golden color with a foamy white head. Aroma is wheat with some fruitiness. Mildly sweet and fruity with some hoppiness in the finish. Smooth and drinkable. Great for summer.", "A nice wheat ale. Aroma of spice citrus and grass. Taste is pretty hoppy but still smooth with wheat mouthfeel. Finish a tad oversweet. \n\n---Rated via Beer Buddy for iPhone", "Tap. Pours light yellow with white head. Aroma Is strong lemon, citrus, fruity, hop forward. Taste is crisp, fruity, lots of virus...okay.", "I’m not a huge wheat beer fan but Oberon is excellent. Perfect for a hot day. Fruity aroma and nice sweet taste. It’s very straightforward as far as wheat beers good. I like the balance of oberon because a lot of wheat beers get weird and sweet but this one still keeps a hoppy presence but maintains that wheat beer sweetness. Excellent stuff.", "Bottle. Pours a hazy yellow with frothy white head. Aroma is citrusy and peppery hops with light barnyard from the fermented wheat. Taste is lemony hops, light fruity sweetness. Very refreshing beer, just the right amount of tartness and bitterness. Wheat presence gives a smooth mouthfeel.", "Wheat ale, poured less carbonated than expected. On draft. Good wheat and citrus notes. Good for a summer beer.", "Pours a hazy, golden color with beige head. Smells slightly citrusy with a clean smell of wheat. Tastes of citrus, wheat, and a slight spice note. Smooth, light-medium palate. Very refreshing!\n\n---Rated via Beer Buddy for iPhone", "Solid fruity summer beer! Delicious flavor that reminds me of citrus and very light hops. Pour is a nice cloudy golden yellow.", "Love this as a summer wheat ale. Poured cloudy from a 16 oz can. Sweet fruity aroma, taste is complex malt and fruit flavor. Love it!", "Bottle. Golden color. Not much aroma. Some spice and a bit fruity. Nothing special. Ok.", "Pours a hazy orange with a bright white head and lots of solids swirling around the bottom of the glass. Aroma is citrus, grass and light sugar. Taste is biscuit, grass and grapefruit. Light carbonation, smooth and light on the palate. Eh", "OK, so I had this on a very hot night after cutting lawn and then running 5K. I also added a drop of real lemon in glass. Pours a bright orange, slightly hazy. Aroma is wheat, grain, grass, lemon and other citrus. Taste is wheat, grain, lemon with orange and spice. Light sweetness. Palate is thin, medium carbination. Enjoyable beer.", "Draft. Hazy cloudy gold color with a white head. Aroma is mostly yeast with some malt in the background. Medium body, the yeast-malt combo stays in the taste with some yeast in the finish. Love this one...excellent!!!!\n\n---Rated via Beer Buddy for iPhone", "One of the first craft brews I ever got into, as with many other people! This is a solid wheat beer - golden hazy hue, lemony, spicy touch. Refreshing on a hot summer’s day when the A/C is cranked up to the max and you are winding down after a day in the sun. Now in cans, which is a great change!", "Pours a hazy gold. Has a malt, yeast and wheat aroma. Taste is also very yeasty to start with wheat, grain and citrus. A light yeast aftertaste.", "Pours a hazy yellow with a thick white head. Taste is not hoppy at all, as I expected. Taste is kind of like a commercial lager...ok, no it isn?t but there?s very little going on with this beer. Good summer beer but no bitterness at all. Taste was non-existent.", "Pours hazy golden color. Aroma is typical of wheat beer with touch of citrus. First taste is a little hops bite then finish clean with sweet citrus flavor. Good summer ale. \n\n---Rated via Beer Buddy for iPhone", "Had it tapped in a big glass with an orange wedge, as well as poured from a bottle and drank from the bottle. \nIts nice and citrusy without being too lemony like other summer wheat beers.\nBeauty of a golden color, not a huge aroma, easy to drink.", "Hazy gold under a thin foamy white head. Citrusy wheaty nose. Not much there. And the flavor is the same, kinda wheaty and bready with a kiss of citrus. Not really remarkable.", "This is my go to beer and a hot day the flavors are just right its not heavy and it goes down great! Try the new cans way better then the bottles no light hits the can at all! Must try!", "Bottle from trade, thanks Sloth! Pours champagne gold with a fine white head. Aroma is bread, yeast, honey and a touch of peppery spice. Flavor follows nose, there’s a nice wheat backbone with hints of honey sweet and clove spice. There’s just a touch of acidity as well.", "Tap. Hazy yellow with a white head. Aromas of citrus, lemon, wheat. Yeast and spice. Flavor is citrus, bread, wheat and light spicing. Light bodied.", "Nice, easy drinking straight from the can. Juicy, a little orange rind with a crisp dry finish. Could put down more than one of these. \n\n---Rated via Beer Buddy for iPhone", "Pours deep golden with a small and quickly disappearing head. Aroma is honey, wheat and citrus. Sweet and peasant head. A little spice but mostly a very pleasant and easy to drink beer.", "Pour is a hazy sunset gold with medium soapy head. Aroma is full of citrus hops, orange peel, lemon peel, earthy yeast, and wheat. There’s also a faint hint of Taste is very pleasant sweet and sour with a touch of bitterness. You definitely get that spiciness they mention in the taste, not so much the aroma. Palate is medium bodied with fizzy carbonation and a creamy mouthfeel. The finish is lengthy with a spicy, sour/bitter finish. I have always enjoyed this beer and it is consistently good. Not the most complex of beers, but it definitely has a satisfying amount of flavor. Always a favorite of mine.", "This beer tastes like family, friends, and great American ale. Starts smooth, gets big, finishes clean. \n\n---Rated via Beer Buddy for iPhone", "Poured from 12 oz. Bottle, over 1/2 inch head, slight lacing. Bread and yeast smell. Very light orange color. Wheat, refreshing citrus lemon orange taste. A little bitterness on the tail end, but not overpowering. Leaves a nice bready taste deep in the throat. A good summer brew.", "Realize this beer is extremely hype up, but being from Michigan I’m partial to it. Especially some it was a gateway craft beer for me 11 years ago. Had the pleasure of enjoying this year’s release in the new 16 oz can. Aroma of orange, coriander, and malts. Flavors of orange, wheat, clove, and lemon. Medium-High carbonation, light in body, with a crisp finish. Great summer beer, extremely refreshing.", "Bottled from BevMo. Tastes like a very average American style wheat brew to me. I was surprised at it’s lack of character considering it;s ratings.", "Pours cloudy orange with medium white Head. Aromas are cereals, citrus and herbs. Medium body and average carbonation. Not fond of white beers usually, but this one is not too much spicy as are European ones. Refreshing and pleasant. \r\n\r\n---Rated via Beer Buddy for iPhone", "Yellow, slight hops. Kind of disappointed with this one. Mediocre at best I would say.", "12 oz van shared with Steve\nNot sure why this is rated so high\nVery bland lots of better what’s out there", "Poured light orange with a thick white head. Aroma of wheat, some sweet malts, bread crust, yeast. Something in there I don’t like. I don’t get the mass appeal with this one.", "Look: pours a golden straw color with a thick head that disappears quickly. Slight haze to it, not filtered.\nSmell: some sweetness to it. Has a biscuit smell. \nTaste: sweetness reminds me of honey. Not very bitter at all. Definitely strong wheat flavor. Hint of lemons and peaches as it warms.\nFeel: very carbonated. Light in the palate. Refreshing to drink, leaves no film on the mouth. Smooth after taste.\nOverall: not a bad beer. I could use some more hops with this beer.\nFirst drank: home 5/14/14", "12 oz bottle poured into a tumbler..rusty orange with thin white head..aroma of bread,hops..crisp taste..with a little bitterness..not a big wheat beer fan but this one is pretty good.", "Very nice for the style. Fresh, sweet wheat aroma. Taste is decent wheat as well, but a bit thin and one dimensional. Still, very good for what isn’t a great style for me.", "Summer Classic. Not a wheat beer fan but this is one of the rare exceptions. Very well done. Smooth lager like finish to it.", "Bottle, aroma is spicy and fruity, pils like. Taste is similar with a smooth wheat finish", "Draft. Cloudy yellow color with a white head. Yeast and citrus aromas. Wheat, yeast, banana citrus flavors. It’s just another wheat beer to me.", "This is the American Wheat that I tweak my homebrew recipe off of. Have had several side-by-side tastings with this guy. The American Wheat standard.", "Draft. Pours a cloudy golden amber. Aroma is citrus with some cloves. Taste is citrus and sweet malts.", "Definitely European malt and hops. Lemon, grain aroma. Taste is orange with a little lemon and spice. I’m not a wheat beer fan, but this is OK, though the carbonation is a bit high for me.", "On draft. Hazy golden color. Wheat aroma. Slight hint of spices in the flavor. Pretty good beer.", "From bottle. Pours a hazy golden yellow with a medium white head and some sediment. Aroma of fruit and wheat. Taste is sweet, fruity, wheat. Medium mouthfeel. lightly carbonated.", "(Thanks Cory \"BlowOffTube\")\r\n\r\nBottle.\r\n\r\nA- Funky, barnyard, wheat, citrus, yeasty.\r\n\r\nA- Yellow color, hazy liquid, white head.\r\n\r\nT- Funky yeast, wheat, lemon.\r\n\r\nP- Light body, average texture, average carbonation, smooth finish.\r\n\r\nO- Definitely a let down, but then again I had super high expectations. It was the funky yeast aroma and taste that turned me off. I just don’t like this stuff. Had it not been for that, I’d have loved this one. Pretty standard.", "This is the perfect beer to sip in the summer while sitting outside. It’s very light and fruity, and not hoppy. Perfect for someone who doesn’t drink a lot of beer, or doesn’t like IPAs. Definitely recommend drinking it with an orange in it", "The beer that everyone in Michigan seems to love and I.find it drinkable, I am not high on wheat beers. Appearance is a 4 as this is a \"summer beer\" and appear so. This is a starter beer for people wanting to try craft beer. Not hoppy and bitter like an IPA. Citrus. Mildly sweet. Light. Easy to drink. \r\n\r\nThis is a beer for a hot day. Not complex at all, just decent.", "Fruité et levuré avec un blé insistant et machable. Un liquide rafraichissant mais gonflant.", "This is one of my favorite wheat beers. Its got great citrus notes and aromas. Good beer for the summer and good if you don’t like IPAs.", "I LOVE Oberon! I always drink mine with an orange, but that is personal preference. I love the flavor of the orange at the end of the beer. The day Oberon comes out for the summer is an exciting day in my year.", "A great quality beer. A little hoppy in taste but very unique. Ingredients will change over the summer so it might seem like it tastes better in the middle of the summer as opposed to the first batch. Would recommend to people who do not like IPA’s but do like craft beer. A little more main stream in taste than IPA’s and craft beer but still different. Great palate and full taste.", "I am definitely not a wheat ale drinker, however, I was hooked after the first. A great citrus aroma. Rather think head, but is apparent throughout the drink. Bright, golden, clear ale. Carbonation dances on the tongue. Crisp, clean, and lively. The hops come through and play in the mouth even after the ale goes down the tube. Overall, a very enjoyable ale worth having time and again. A pleasure to drink.", "Great ale from bells. Slightly sweet, but not overly so. Slight hint of citrus taste. Fantastic summer beer.", "Wheaty lemongrass and slight earthy barnyard aroma. Taste is exactly what would expect with the aroma. Slight sweetness to it with dry finish. Full flavored and fairly refreshing. \n\n---Rated via Beer Buddy for iPhone", "A light beer that has a hint of fruit that is a nice summer beer. Another one of my favs.", "Has a pale yellow hue, but a nice white foamy head. Nose is weak, grainy/bready, and somewhat citrusy. Taste is not bitter and has a lightly carbonated and creamy body that keeps the wheat taste around for a little longer. Finish is dry and primarily of wheat. Refreshing and a good wheat beer standard, but not very interesting.", "Aroma of malt and grain. Pale amber colour, thick creamy well laced head. Balanced taste of grain and malt with a creamy malt palate.", "Very mellow wheat....a perfect wheat beer to try if you have never tried one....basically another tasty beer from bells.", "A bit weird, but that is the American wheat category in a nutshell. Generally fit in the ’what were they thinking category?’ Have had this in my hands many times over the years, for instance on trips to exotic locales like Michigan, but it never quite made the cup, turns out I was not missing much. Starts out nice, was close to 4/5 for appearance, nice cloudy pale yellow, but spotty retention/lacing. Nose, is fruity, malty, but mainly grainy. Palate is full of citrus, and grain. Meh.", "It ain’t bad. I’d buy this one again. If the grocery store down the damn street keeps carrying it, I’ll pick up a six pack at take it to the party.", "Love Oberon! Never heard of it until I loved to Michigan. Tastes like a summer afternoon.", "12 fl oz bottle from Potsdam, served cool in a tulip glass. \n\n\r\n\r\nApp.: Murky dirty blonde with a nice tight off-white head.\r\n \r\nAroma: A bit tangy, lots of wheat, wet yeast, kinda boring.\r\n \r\nPalate: Medium body, full, silky effervescence.\r\n \r\nFlav.: A little infected, wheat, boiled cereals, light esters, not very enjoyable; dry with limited bitterness and a clean-ish wheat finish.\n\n\r\n\r\nDecidedly meh.", "Golden in color and tastes and smells like summer! Tastes great with out without an orange slice!", "Fruity caramel aroma that is golden orange in coloring. Looks and smells like summer. Taste is mildly fruity that is slick, soft and medium. Looks, smells, and tastes likes summer.", "A nice lightly cloudy golden color on this ale Some spice comes through on the nose. Wheat, grass, and spiced fruit come through on the palate. Fairly complex and very drinkable. Great summertime beer.", "grass, citrus, golden, cloudy, light sweetness, lightly bitter, lightly sour,", "This beer is okay. It does not stick out to me in a positive or negative way.", "Very good beer. Light enough to drink when it’s hot outside, and perfect for a sunny day. I also enjoy this all year round because it has a very nice wheat flavor, but the yeast helps add the citrus.", "Oberon packs a lot of goodness into its cloudy yellow body. It’s as easy on the nose as it is on the eyes with a soft bready aroma and some spicy cloves thrown in for good measure. The flavor has some mild yeast funk, citrusy hops, and candy-like wheat malt. The crisp, lively carbonation keeps the body light and refreshing. Oberon may not be Bell’s boldest or most complex ale, but it’s one of the best examples of an American style pale wheat ale.", "Pours a cloudy golden amber color with a slight white head. Slight citrus aroma. The texture is smooth, light and tasty. Perfect is everyday and very easy to see why it is considered so good.", "12 oz bottle into a shaker. Decanted the pour, leaving most of the yeast in the bottom the bottle, but still some yeast in suspension which is spot on for a german style wheat bear. This feels like a slightly more hoppy version of the summer wheat beers you can find in Bavaria. Smells of citrus and summer! I love this beer on a hot summer day.", "Poured from a bottle. Golden amber with an ivory head. Aroma is grainy with a hint of citrus. Similar taste. Body is light with crisp carbonation. Good, but not a standout.", "This beer had a hint of an unpleasant aroma which I thought resembled canned tuna. Fresh, high-quality canned tuna, but that’s not a smell I want in my beer. Besides that, it was rather typical, if unremarkable, for a wheat beer. Only a mild hop presence. The flavor was slightly muddled, a hint of sweetness and some bitterness...moderate body. As faint as the fishy aroma was, I found it off-putting and it interefered in my ability to enjoy this otherwise middle-of-the-road brew.", "Hazy light orange pour with a frothy white head. Smells wheaty with citrus. Taste is citrus, wheat and some light bitterness.", "A very refreshing citrusy aroma that is orange in color and very pleasant to the nose. An orange wheat in taste and is also very pleasant on the palate. Overall it’s a very drinkable summer ale which is definately a beer that you can have many on a hot day.", "12 oz bottle poured into a shaker. The very clean, light aromas of flowers, grass, lemon, lime, orange (I guess general citrus would be appropriate, although I’m pretty sure I’m picking up the distinct differences), and even peaches give this a true springtime feel. There’s also some pine and a touch of toasted grain underneath. The beer is a very murky apricot flesh color (kinda dull yellow-brown) with a fluffy white head that retains well and leaves a light, but puffy lace jutting out along the sides of the glass (should anything less be expected from a wheat ale?). For a wheat ale, this actually has a significant bitter bite to it, I’d say a medium level bitterness (lighter end of medium) with a medium / medium-light, dull sweetness. The body is medium light and full of lots of fizzy carbonation. The texture is fairly thin and watery, but it’s very crisp and refreshing with a dried citrus peel and grain finish. Some pine appears at the finish too, but disappears at the aftertaste; which is mostly clean except for a refreshing dry citrus peel that doesn’t hang around too long.", "Pours an unfiltered golden orange with little bits of sediment. Fizzy white head settles into a sticky cap that leaves nice lacing on the glass. Aroma is boiled peanuts, citrus rind, fresh cut grass, lemon zest, and some herbal notes that I can’t quite put my finger on. Honestly it has a little bit of a funk to it that I wasn’t expecting. Flavor is lighter than the nose would suggest. Orange peel, coriander, slight hop bitterness on the back end rounded out by some sweet malts. I just ate so I may have to come back to this one later and do the flavor a little more justice. Mouthfeel is great. Perfectly carbonated. Overall a decent summertime brew.", "Light retention and no lacing. Smells of bran cereal, wheat and grains. Tastes of grained cereal, earth and slight citrus zest. Wheaty aftertaste. \n\n---Rated via Beer Buddy for iPhone", "Bottle to glass. Pours a bright orange, slightly hazy. Good looking beer. Aroma is wheat, grain, grass with hints of citrus, hints of yeast. Taste is wheat, grain with orange and spice. Light sweetness. Palate is thin, medium carbination. Enjoyable beer from a style that I?m not typically fond of.", "Tap pours hazy yellow to orangeish gold with white froth. The aroma is nice sweet musty grains. It has a very solid earthy wheat flavor with a moderate amount of grains and spice to go with a bright lightly orange and pearish flavor. Light approachable and easy to enjoy for an American wheat.", "From tap. Beautiful, full orange in glass with just the right amount of head. Great lacing. This is a damn good looking beer. Aroma is constrained. Wheat and orange peels. Some faint grass and black pepper. Taste is wheat beer plus. Citrus notes show through nicely. The hops played well, adding a just the right amount of grassy bitterness. Highly drinkable. Take me to a ballgame and give me a tall pour of this, please.", "Light nose. Light taste and slightly fruity. I generally like bells beers, but this was somewhat average to me.", "Pours a hazy lemon yellow, softly pastel with a finger of white foam that fell fast. Nose is golden wheat with a bit of sweetness on it. Bright lemon zest rounds out the nose. Taste is a bit maltier than I expected. medium light rather than light. The mouthfeel is creamy and has plenty of carbonation to keep that in check. The wheat is crisp and dry. The middle of the beer is juicy with sweet lemon peel and tart lemon too. There is a bit of a sour taste lurking in the shadows that never really steps out but it gives the drink a slight pucker. The middle of the beer is  juicy with  fruit.  Refreshing and crisp with a drying finish.", "bottle, pours a cloudy straw yellow/orange mix with a thin white head. Aroma is orange / citrus, hay, wheat, yeast. Flavor is similar... citrus fruits, wheat, bread. Quite drinkable, tastes similar (but better) than the mass produced \"belgian whites\"", "One of the best wheat beers out there. Probably the best beer to sit and drink in the sun all day long!", "Aroma: Wheat, Mild Oranges, Mild Corriander\n\nAppearance: Golden Straw Hue, Passes Some Light, Thin White Head, Decent Lacing\n\nTaste: Wheat, Mild Oranges, Mildly Veggie\n\nMouthfeel: Average Carbonation, Light to Medium Bodied, Mildly Drying", "Pours hazy orangey yellow. Nose is orange and wheat, some coriander/spices. Taste matches nose, except on the finish there's a metallic note, with a slight bitterness. Good summer beer. \n\n---Rated via Beer Buddy for iPhone", "Bottle. Pours a hazy orange color with a head that fades fast. Taste is orangy with a lemon wheat flavor. Taste is decent flavorful wheat beer", "Aroma is mild with grain and some hops. Taste has grain, sour malts and some syrup. Pretty much like your average lager with some extra depth.", "In a world where shock top and linenkugel are working day and night to make wheat ale the new pale lager, it’s great to see a wheat beer made by a great Brewer that sets the standard a little higher. If you’ve lived your beer life without trying this beer (which is crazy because it practically rains the stuff once the temperature hits 46 for the first time) you need to. It pretty much tastes like summer. It’s like the world’s best lemonade but it’s beer.... And that is why you should go out and buy all of it!", "Pours a cloudy golden color with a small white head and virtually no lacing. Aroma of noble hops and wheat with underlying orange tones. Taste is similar to smell with wheat and citrus being the overlying flavors. Nice crisp mouthfeel that compliments today’s warmer weather well.", "Good ass wheat beer I like it more with a good meal, its a combination u can play with", "From notes. On tap at Dan's on March 28The pour is a foggy golden copper-ish with a medium white head and an orange slice. The lacing is decent but the orange slice kind of takes the cake. The aroma is somewhat wheaty with a nice citrus dominance (the orange slice) and a good maltiness on the back end. The flavor is somewhat similar. There is a nice fruitiness on the front end and then it fades through a good wheaty, somewhat malty note on the way to the back end. There it a light malty hop presence, but for all the crap I've given this beer, it does appear drinkable. Granted, I've had a bit, it seems decent. The mouth feel is light, carbonation is decent, and he aftertaste is all citrus, presumably from the orange slice I've emptied into this glass to help\n\n---Rated via Beer Buddy for iPhone", "Damn good! Refreshing, super smooth, sweet flavor. I’m gonna need more... MOAR!", "Pours cloudy, straw, very little head. Aroma big stone fruit, apricot, peach, wheat malt, fruity esters. Flavor light, wheat malt, apricot and peach as in the aroma, definite fruity esters, enough noble hop bitterness to balance it out. Mouthfeel on the thin side, medium carbonation, crisp, refreshing, smooth, slightly sweet finish. Overall good summer what beer, one of the best I?ve had in this style, all flavors balanced, extremely drinkable .", "12 oz. bottle packaged on 1/17/14 poured into weizen glass. Slightly hazy golden orange color with a sudsy white head that’s gone before you know it. No lacing to speak of, but a fair amount of carbonation rising in the glass. Aroma is yeasty esters, orange peel and a hint of pepper. Flavor is wheat up front that transitions into a citrusy middle and back to a wheaty finish, with some tanginess lurking in the background all the while. Although I’m generally not one for session-type beers, I could see myself putting away several of these without much effort.", "Glad to see Oberon back on the shelves. A great wheat ale. Very wheat citrusy orange aroma. Smooth beyond comparison. A great summer light smooth ale. The wheat taste blends perfectly with the light citrusy hop character. Very summeresque. A great refreshing wheat ale to save us from this long winter. \n\n---Rated via Beer Buddy for iPhone", "First Oberon of the year. Always puts me in a good mood! Beautiful color, even better taste.", "Reviewed from notes.\r\nThe appearance had a hazy pale yellow colored body and left a one finger white head that died within thirty seconds. Some nice ringy lacing was left. Some light slow carbonation was seen rising.\r\nThe smell had some moderate flavors of wheat along with notes of orange and lemon.\r\nThe taste was basically the same with a slight added hops to it and a nice bit of light acceptable sourness to it.\r\nThe palate was about a light with a decent amount of carbonation hitting the tongue, but in a nice and acceptable way for the style.\r\nOverall, this is a good summer beer that is quite drinkable and makes me want to move back to Michigan just so I can have it in the summers.", "bottle. amber with one finger head. it’s not quite as good or flavorful as i remember, but this was definitely one of the first craft beers i ever had, and i still have a special fondness for this. still a solid wheat beer.", "This is my summer beer.\r\n\r\nA big part of Oberon is the presentation. If you drink it straight, it’s an above average wheat beer, but not anything to crow about. But try this: \r\n\r\nPour the beer in a glass. Slice a quarter inch thick piece of an orange, cut it in half, and put it on the lip of the glass. When you sip, try to get the aroma of the orange peel. The blend of fresh orange peel alongside the flavor of the beer is exquisite.\r\n\r\nTry it. Or don’t. More for me.\r\n\r\nBeautiful wheat, cloudy, grainy beer; sediment reminds you that God gave us livers to filter.\r\n\r\nIf I were ever to get a tattoo on my face, it would be of the sun from the Oberon bottle. I love this beer.", "12oz bottle - pours a light orange with white head . Light citrus aromas . Medium thin body , very drinkable . \n\n---Rated via Beer Buddy for iPhone", "Great beer for the summer. Fruity, malty, sweetness. A nice beer to drink by the pool.", "330 ml bottle in Coral Springs FL. Pours cloudly gold and white head. Aroma is citrus, wheat and esters. Taste is a bit bland and citrus. Palate is somewhat metal like. Not great.", "Bottle. Friend/roomate loved this stuff as he was a Michigan homer. I’ve had this numerous times over the last couple years. Pours a crystal clear yellow with huge white head. Taste is slight malty, roasted corn, green pepper and raw corn. Nothing special.", "Yellow, with a thick, foamy white head. Nose is apples. Taste is sweet with a slightly dry finish. Medium body, soft carbonation. Pretty good brew.\n\n---Rated via Beer Buddy for iPhone", "This is generally my summer beer of choice. Bell’s does a great job balancing this beer. Some people complain that it isn’t what it was in prior years, but this is a great beer.", "Golden yellow color, with a white foam head. Aroma is citrus, floral, and spicy hops. Flavor is a mix of wheat and orange. Has a nice, smooth, creamy feel.", "12oz bottle sent from Doug. Pours a golden orange with very little head. Sweet and fruity. I was convinced that this was brewed with honey but after reading the description I guess not.", "Was actually drinking a white winter ale and the scan brought this up. Sweet smelly beer with very mellow flavor.", "Pleasant, sweet aroma of citrus and wheat. Citrus flavors, mainly orange, blended well with various fruit, mixed spices grainy bread, lemon and orange peel and sweet grassy hints. Aggressive carbonation, creamy and very crisp.", "Suprisingly simple aste, almost plane, but somehow it fits all together. Small head.citrus, but just a bit.pale, clear, light sweetness,", "\"pours slightly cloudy golden color with a nice white head and decent lacing. The aroma is wheat, lemon zest, hints of spice. The taste is slightly sweet wheat malt, lemon, hints of tropical fruit, moderately bitter hoppy finish. The mouthfeel is medium body with moderate carbonation, crisp. Overall a nice wheat ale, crisp summer seeion beer. \"", "Lots of fruit in the aroma. Palate a mix of wheat, fruit, and enough hops to make it interesting. A nice long fruity finish. Really well done. \n\n---Rated via Beer Buddy for iPhone", "A: Pours a yellow golden ale with haziness. A less than single finger, fine and loose white head falls nearly immediately to a sheet of the same with a central dissipating cap. No lacing.\r\n\r\nS: Nice and floral. Candied wheat. Slightest of lemon citrus nose. This is a light and airy nose which is not really complex, but nonetheless engaging. Nice.\r\n\r\nT: Citrusy. Overly acidic on the initial. The alcohol is evident, which I did not expect, given the level of it. Floral as well here. The yeast is also a key player, simple yeast flavor. The taste is overall, meh.\r\n\r\nM: Medium to light with higher carb than anticipated. Finish is off dry. \r\n\r\nO: Well, I’m not impressed, but I’m also not disappointed.\r\n\r\nServing type: bottle\r\n\r\n04-17-2011", "Bottle...Pour is golden with a thin white head...Nose is citrus, wheat, yeast, floral...Taste is citrus, spice, wheat, stone fruit...", "Pours a nearly clear golden color with very small particles of vegetable matter suspended in the liquid. A one finger white head rises, then falls just as quickly. Moderately perfumy orange and some notes of moldy yeast. Smooth, slick texture with some mild to moderate scrub. A little bit of funky yeast to go with a watered down Tang orange flavor. Pleasant.", "Pours out a light orange color. Nice aroma that has some spice too it. Overall this is an enjoyable session beer. Light bodied and great for the summer or year round if you live in Florida.", "Everything an American beer should be. Fantastic aroma, perfect color for pale. Smooth taste hides ABV. The best quality over price.", "Bells Oberon Ale is a wheat with character. Moderate orange aroma coming from clear orange pour with a nice frothy head. Taste is yeasty with a definite orange flavor. The swallow is fizzy but not unpleasant. Oberon is one of the better American wheat beers I’ve had with original character.", "Good for a wheat ale. Spicier than most but an overall thin body. Mouthfeel is slick.", "12oz bottle into tulip. Traverse city. \r\n\r\nAppearance: cloudy orange liquid with a white puffy head with good retention. \r\n\r\nAroma: citrus, wheat, some yeast, alcohol. \r\n\r\nTaste: slightly sweet an a little bitter \r\n\r\nPalate: medium body. Oily texture. Short finish. \r\n\r\nOverall: refreshing, but not super interesting. Yeast and citrus are enjoyable.", "From bottle to glass at room temp. Cloudy orange with some sediment. Light citrus wheat beer. Easy drinker, but a big fan of wheat beers.", "4/17/2010. From bottle. Not a big fan of wheat beers, but this one is not bad at all. Malty flavors with hints of citrus and light fruit.", "Bells is always a good choice. This beer isn’t my favorite from Bells, but it is worth a try.", "Bottle. Aroma is mild with grain and some hops. \n\nTaste has grain, sour malts and some syrup. Pretty much like your average lager with some extra depth.", "I can see why they line up for this release every year. Wonderfully crafted wheat beer with nice spice notes. Smooth finish. Just great.", "Bottle. This is a decent wheat beer but it does not compete with the big belgians and germans that dominate the style.", "I had this at Global Brew. Pours cloudy yellowish orange with a white head. Taste citrusy wheat. I thought was pretty good. I would definitely drink this again.\n\n---Rated via Beer Buddy for iPhone", "12oz bottle. Not the biggest wheat beer fan, but this did not disappoint. Light and citrusy", "Bottle. How the heck have I not rated this yet. I must have drank 5 cases since I joined RB. Loads of dank wheat with a good dose of orange zest and a little clove. Standardly good brew.", "From the bottle at a friend?s party. Couldn?t judge appearance. Minimal insight into aroma. Crisp taste with cereal/wheat malt, citrus rind, hop spice. Medium body, creamy texture, above average carbonation, clean finish.", "Tap: Cloudy & pale golden-orange hybrid body with very small amounts of sediment yeast floating about. Thin, wispy white head leaves the top of the beer bare within moments. Aroma is a little muzzled; orange zest, mild clove, some light cooking spices, a touch of grain, and some powerful wheat all the way through. The taste goes right along with the aroma - big wheat backing with citrus and orange peel notes all over, a touch of spicy hops, almost white pepper-like with a dollop of clove (or some kind of earthy, ester-like spice) in the finish. A little grainy. Refreshing and highly drinkable, possibly over-tamed.", "A solid offering from Bell’s. One of the better \"summer beers\" or one you can just have a whole case of. Great drinkability here."]}