{"reviews": ["Bottle. Caramel, brown sugar, nutty coffee, light resiny hops. Chewy with a balancing bitterness. Excellent.", "Cask at GBBF 2007, Earl’s Court on 08/08/2007.  Really liked this; its big on the cereal and malt and also on the piney and…", "Tap, brown, toffee, coffee, plum, lots of hops, complex, oily texture, strong", "Brown with a creamy, sticky head that lingers. Strong toffee & caramel aroma. Taste is intensely sweet with mild sour undertones. Medium body, mild carbonation, slightly watery texture. Closer to a scotch ale than a bIPA. Interesting but not very likeable.", "Just like the other Dogfish Head beers I have had this is one has a strong flavor.  It tastes a lot like a dark beer but then it is an IPA.  It is ok but I am not a huge fan.", "Der Typ \"Indian Brown Ale\" ist schon einmal etwas neues. Es soll auf die Vielseitigkeit des Bieres hingewisen werden und dass von einem Brown Ale und IPA Aromen vorhanden sind. Es dominieren aber natürlich die malzigen Aromen und schaffen eine röstmalzige, karamelliges Basis, welche mit einzielnen Hopfenspitzen gewürzt ist.\nEin interessantes, untypisches Bier, das mich aber nicht vollends überzeugen konnte.", "Pours a very dark red color.  Two fingers mocha colored head.  Okay retention, okay lacing.\n\nYum, smells like a stout.  Dark malt, brown sugar.  Cocoa, coffee.\n\nTaste is stout.  Coffee, cocoa, vanilla, roasty malts. A little more hop than a stout.\n\nMouthfeel is medium bodied.  Thin.  Watery.\n\nOverall, I initially gave it a very high rating.  But it’s less IPAand more stout.  It’s a pretty good stout, but a bad IPA, but add the fact they call it a brown ale....I’ve given it a lower rating than it deserves.  It’s worth a try, and I would buy it again to investigate further.  It is quite good, but, it’s weird.", "Bottle. Single purchased at Super Saver.\nPour was light brown with an off white head. Aroma was nutty, brown sugar, caramel malt, mild roasted coffee. Taste was mild sweet, malty, coffee, nut, chocolate, light pine.", "Backlog, bottle in 12-13. Pours a clear brown red color with medium off white head. Smell is raisin bread, malt, coffee, and chocolate. Flavor is a lot of the same but more fruity and sweet comparatively. Body is light to medium for style. Ok", "Aroma of roast, sugar, booze. Big flavor of coffee, bitter dark chocolate malt, oats, and bread. Rich mouthfeel, lingering aftertaste, very delicious! Amazing palate. I see this one is categorized in a variety of ways, but of all beers I can compare it to, it seems most similar to Founders Porter, just a bit stronger.", "Pours dark brown with ruby tint and a one finger light tan head. Aroma is dried fruit, molasses and some coffee. Taste is raisin and brown sugar, moving to coffee and light roast, with a building hop backbone. Finish is roast and hops. A well done brown ale.", "Very nice and interesting. Refreshing and quite malty in all aspects. Cloudy and really brown.", "Bottle. This was gets a high score for originality. Medium brown in color with a two finger head. Well balanced but does seem to lean more to the hoppy side. Nice beer.", "355ml bottle. Pours rubescent dark brown. Muscovado sugar, figs, damsons, chocolate, cigars, cherry. Medium body. Tasty.", "On keg at Small Bar, Bristol. Pours clear dark brown with a tan head. Aroma: toasted malts, mocha, nutty, chocolate. Taste: light sweet & bitter, moderate roast, earthy, chocolate, toffee. Medium bodied, avearge carb, lightly bitter finish", "Man this is a damn fine beer. It is perfectly balanced hitting you with what you expect from dark beer lovely malt flavours. While this does not punch you in the face with hops like a lot of IPA’s they are their tying it all together.", "12 oz. Not hoppy. Dark pour. Amber finish. Good flavor. Just don't expect it to be hoppy like the ipa name may suggest.", "Cola- brown, amber with a medium, tan head and a malty, cola, dark chocolate nose. Malty with medium carbonation, some lacing, and a dry, dark fruit finish. Some warming.", "Bottle.\r\n\r\nA- Pine, gingerbread, brown sugar, molassess.\r\n\r\nA- Dark red brown color, dark liquid, off white head.\r\n\r\nT- Pine, malty, bready, molasses, citrus, brown sugar, flan.\r\n\r\nP- Medium body, average texture, average carbonation, slightly bitter finish.\r\n\r\nO- Bottle says Dark IPA, RB says Brown Ale, and description says scotch ale, pale ale hybrid. What the hell is this? So many things going on, I'm not really sure what I was drinking. It was okay. My mouth is confused.", "not really a dark ipa, i consider this is a combination of scotch ale and brown ale, not so hoppy, maybe i have a bottle which was bottled over half year. A nice malty beer", "3/17/18\nWith A on St. Patrick’s Day while playing star wars LEGO ok ps2. \n\nDeep, almost opaque brown with a bit of a tan head. \n\nNose is roasty chocolate and coffee malt with a bit of astringent hops. \n\nComplex taste with lots of  roasty malts and caramel malts balanced by big dose of piney, herbal hops. Chocolate/coffee/caramel sweetness initially that turns to a sharp happiness. Pronounced bitterness from both the malt and the hops. \n\nMedium feel with lingering hops. \n\nOverall, this is great! A nice brown ale that almost tastes like a hoppy porter. Very dark tasting with a big hop presence.", "Butelka w Carpe Kraft. Porządny Brown Ale, bardzo stylowy, nie zaskakuje niczym ani na plus, ani na minus. Orzechy, toffi, mleczna czekolada, trochę rodzynek.", "Bottle. Light brown, pretty clear with frothy, medium and quite solid beige head. Good lacing. Chocolate and malty aromas with some vanilla and resins tones, pretty stron and solid. Medium to full body, very smooth and oily mouthfeel. Light sweet start with chocolate and roasted malts flavors, balanced by light bitter / sour finish. Very nice interpretation of this, pretty boring, style.", "Nice good yummy beer. A mans beer. I love dogfish. So crafty. It’s dark but still Bitter and not to Malty\n\n---Rated via Beer Buddy for iPhone", "Shared 12 oz. bottle poured to snifters showing a clear, ruby highlighted, dark brown hue, with a decent layer of tan froth, and dots & dashes of foamy lacing. The nose was toasted, moderately roasted & malty, with mocha, woody, and nutty notes. Medium bodied, with okay carbonation, the taste was similar, contributing moderate roasted & earthy bitterness. Labeled a dark IPA, tasty, but came off more as just an adequately bitter Brown Ale.", "I went into Indian Brown Ale expecting a slightly lighter Black IPA. I found it to be much different than what I had originally perceived, though I wasn't disappointed. This ale pours amber-brown. Toasted grain, malt sugar, and forest-y hops. Flavor is far more malty than I anticipated. Toffee, brown sugar, dark succulent fruit, and bittersweet chocolate. The hops certainly make this more bitter than the average Brown Ale but not by much.", "As brown beers go, this one isn’t bad, I just have trouble squaring the ipa elements it claims.\n\n---Rated via Beer Buddy for iPhone", "~ Aroma หอมกลิ่น Malt คั่วนำมาก่อนเลย ( pack with Roasted malt aroma ) กลิ่น Hop ดูจะโดน Roasted malt กลบไปเสียส่วนมาก ( Hop seen to overwhelm by roasted malt ) \n\n~ Appearance SRM 28 น้ำเบียร์ใสไม่มี sediment ( Clear liquid no sediment ) ฟองละเอียดสีแทนสวยติดขอบแก้ว ( Nice frosty tan head ) \n\n~ Palate ซ่ากำลังดี ( Nice average carbonation ) Body กลางๆ Texture ออก silky และ oily เล็กน้อย ( Medium body with abit silky and oily texture ) \n\n~ Taste ขมกำลังดี ( Medium bitter ) หวานเล็กน้อย ( Slighly sweet ) Balance ดี ( well balance ) after taste กลางๆค่อนไปทางยาวกับความขมที่ทำงานลงตัวเป็นอย่างดีกับความหวาน โดยมีกลิ่น Roasted malt ที่คอยประคองมาตลอดทาง ( Medium to long bitter finish with a hint of roasted malt and brown sugar ) \n\n~ Overall มีความรู้สึกว่า กลิ่น Roasted malt ดูจะกลบกลิ่น hop ไปเสียเยอะ Charactor ของนำตาลทรายแดงมีมาให้สัมผัสได้ตลอดเวลา Balance ดี ใช้ได้เลยครับ", "Nice malty IPA. Lots of nutty flavor with a slight hint of chocolate and maybe a bit of coffee. \n\n---Rated via Beer Buddy for iPhone", "Barwa ciemnobrązowa, piany sporo, jest trwała. Na początku nie bardzo, taki wysycony ściągający koźlak z dominującym posmakiem kawowym. Po ogrzaniu robi się bardzo ciekawie - nuty owocowe od chmieli harmonijnie współgrają z dużą słodowością. Do tego fajna „belgijskość” od dodanego cukru. Na koniec przyjemny, także słodowy posmak. Bardzo dobre piwo.", "355ml bottle at Onlyou, Jimei. Pours brown with a thin off white head. Aroma of chocolate with malt and caramel. Dry bitter finish.", "great head with medium carbonation medium body nice aroma and overall amazing brew", "Pours dark brown, smooth and translucent, cream head, spotted lacing. Aroma of roasted barley, chocolate and brown sugar. Tastes medium roast bitter, roasted barley, chocolate, brown sugar, fruity hops come in the after taste, and balance this ale very well. Medium body, soft carbonation, very easy to drink, lot of lingering roasted taste. Very enjoyable.", "Bottle at Tap Craft Beer Bar, Robertson Quay, Singapore. Poured a clear dark brown with a frothy off white head. The aroma is roasted caramel malt, grassy light fruit hop. The flavour is moderate sweet light bitter with a dry grassy, red berry fruit, nettle, spicy, molasses, woody hop bitter palate. Medium bodied with average to soft carbonation. I'd have preferred a little more carbonation but I guess I'm just a black IPA junkie. Not sure this is a brown Ale tho!!", "From Mar 2007\r\n\r\nPours from 12oz bottle a clear deep brown with a small head of foam that doesn't last long and doesn't leave any lacing.\r\n\r\nThe smell is of roasted malt and some citrus hops.\r\n\r\nThe taste has huge roasted malt up front that smacks you in the face...just as I remember it. ;^) As I take more sips, there's a more than ample infusion of hop bitterness and some dark fruit notes. Man, this is great stuff! So much roastiness and there's some toffee also hitting my taste buds. And just a little bit of warming in the back of my throat that reminds me to sip and take my time with this gem. What a Brown Ale!\r\n\r\nBottom line: This is a top notch example of the style that is a *must* try.", "355ml bottle (Ebrowarium.pl) (5:4:4:2:9=2.4)\n\r\nVery savoury aroma, soy, but also very sweet. Dark red, persistent small tight beige head. Dead palate, slickish from sugars, carbonation does nothing to lift it. Nasty soapy taste, some savoury soy mushroom and sugar mess. Only plus is that it covers the 7.2% behind the mess, but deep down this is a terrible ale.", "Draft in Pittsburgh before the Ed Sheehan show. Pours a dark brown with generous head. Roasted malt, floral hop, brown sugar, caramel. Medium body. Medium light bitter. Nice texture. It's been awhile since I've he this one but it is still good. \n\n---Rated via Beer Buddy for iPhone", "12floz bottle, no date, $1.75 paid as a single, pint glass. Appears a medium-dark brown with some amber glow at the bottom. Head forms a small layer and retains it character. Firmly a brown ale in the nose, aromas of brown sugar and mild roasted malts noted. A fine American brown, resin, tree bark, pine, and faint cocoa flavors comprise this fullish bodied and fairly hoppy dark ale.", "Pours deep cloudy brown with low tan head. Aroma of roasty malt, sugar, citrus. Taste is roasty, mild lingering bitter finish. Light and smooth body with soft carbonation.", "I'm sorry, I just dont agree. All the hops they advertise here get lost on this thick syrupy molasses with a bitter rotten walnut finish. No, not for me. It sounded great, tasted awful. Its almost like it wanted to be a stout, but it just wasn't. I made it bout 7-8 sips in before i called it quits n dumped it. I am a broke ass law student and cant afford to throw away top dollar brew... But life's too short to drink beer u just dont like, even if ya really wanted to. Sorry dogfish, I still love you.", "12oz bottle. Medium reddish brown with a tan head. Chocolate, raisins, toffee, bread, light roast coffee, grassy hops. Medium body. Fresh, mildly bitter finish. Dee-licious.", "12oz bottle. Pours brown with a moderate beige head. Aroma is roast, spice, toffee, chocolate, and a light pine. Taste is similar but with some caramel. Medium body. Moderate carbonation. Slick-creamy mouthfeel.", "UT090917 backlog. On tap at Beavertown Extravaganza 2017, London. Nose is Chocolate. Dark chocolate, mild coffee. Light to medium sweet, medium to heavy bitter. Long hoppy medium to heavy bitter. Medium body, slick, medium carb. 748516", "Keg at Beaverfest. Subtle is how I'd sum this beer up. Less sugar than I expected in aroma, perhaps some burnt sugar. Otherwise malt, coffee and nuts. Light bitter taste whicb grows in strength. Light-medium bodied. Slock with a sticky residue. Abrupt finish. Good but too subtle to have too much impact.", "Poured from a bottle. Dark brown in color but you can see through it a bit. Head is on the beige side. Nose is malt and coffee as well as caramel and a bit of booziness. Some lighter notes that are hard to place as well. Taste leans towards brown/scotch ale. Definite coffee and malts as well as brown sugar and raisin. Toward the end there is a crisper hoppiness. Interesting beer. More dominated by the darker notes than expected.", "Bottle pours a dark brown with a one finger beige head and thick sticky lacing. Aroma is primarily malt. Taste is very rich, heavy malt with a bunch of underlying flavors. Finishes a touch sour with a delicious aftertaste.", "Rich malty. Not as hoppy as IPA. Would definitely try to find this beer again. \n\n---Rated via Beer Buddy for iPhone", "Pours amber, brown with a nice 3-finger tan head and an aroma of malt and brown sugar. Tastes viscous upfront and of semi-sweet malt and brown sugar upfront with a mild hop finish. It’s medium to full bodied with minimal to moderate carbonation.", "Bottle. Hazy dark brown color With medium creamy light brown mostly lastning head. Aroma is roasted malt With notes of chokolade. Sweet chokolade flavor. Creamy palate.", "Bottle. Dark mahogany color. Aroma: dark but not burnt malts, tropical fruits, a little wine and higher alcohols, hops and wood, esters. Taste: malt, coffee, chocolate, biscuit, caramel, fruits, fortified wine, medium hop bitterness.", "It was a bit rich for my taste. The flavors were powerful it just packed a heavier punch than I was wanting or expecting. \n\n---Rated via Beer Buddy for iPhone", "12oz bottle with commonmac. Brown with full white head. Strong smell of dark notes. Sugary, malty, full bodied. More malty than hoppy . Rich. Ok to good.", "Bottle. Pours clear dark brown with reddish tint, large spongy off-white head, coffee-forest berries aroma, medium carbonation, bitter roasted malt/coffee taste with a hint of molasses, thin body, long bitter finish. Nice coffee dominated brew,", "12-ounce bottle pours clear amber-brown with thin tan head and lacing. Aroma: nuts, smoke, caramelized brown sugar. Flavor: molasses, brown sugar, almonds, pine nuts, sour prunes juice, raisins, chocolate, coffee, ash. Mouthfeel: medium-bodied, dry finish, yet somewhat oily.", "Part of a 4 beer flight at TJ Stone , Washington DC in May 2017. Good example of a brown. Heavy on the roast.\n\n---Rated via Beer Buddy for iPhone", "12oz bottle dark auburn color thin off white head aroma is brown sugar and roasted malt taste is the same with a smooth short finish", "Originally rated on 12/31/08. The brewers description of this as part scotch ale, IPA, and brown ale is pretty accurate. Aroma of toasted caramel malts, alcohol, and some floral hints. Flavor is the same as aroma with some nuttiness and a coffee finish. A little on the sweet side but its hearty and filling, I liked it.", "0,33l bottle from Beergium. Dark brown beer with long lasting light beige head. Aroma has sweet dark malts, some caramel and roastiness. Maybe some hints of coffee also. Taste has sweet malts, hops, some roastiness and coffee. Medium body and medium carbonation. Quite ok.", "12oz bottle picked up at The Ale Jail in St. Paul. Consumed in a spiegelau IPA glass. Amber/brown in color with a light tan head. Aroma has traits of hops with toffee, caramel, and an almost cookie like characteristic. Taste has qualities of molasses with toffee and brown sugar. Notes of coffee almost come through which was a little bit unexpected. There is a bitterness present especially at the finish with a residual bit of sugar. Really a strange blend of a lighter coffee stout and a traditional Dogfish Head IPA. Mouthfeel is slightly thin but has some minor oily characteristics. Something a little too unbalanced in this effort for my taste. Pretty decent for a brown ale.", "355ml bottle. Clear, dark brown colour with ruby glimmer and small to average, creamy, half-way lasting, moderately lacing, beige head. Spicy aroma of roasted barley, hints of burnt coffee, burnt caramel, a touch of liquorice, molasses, coffee surrogate on celery basis. Taste is bitter, almost a bit tart, roasty-spicy malty, notes of roasted barley, hints of burnt coffee, burnt caramel, liquorice, a touch of molasses, coffee surrogate, raisin, blueberry, some hop bitterness. Unbalanced, harsh, more burnt than just roasty flavouring material.", "Bottle. It pours a dark brown color with a beige head and lacing. The aroma is toffee, brown sugar, and hops. The taste is burnt sugar, molasses, raisins, and nice hop bitterness. The sweetness is subtle and balanced really nicely with the hop and coffee bitterness.", "7.2%ABV. IPA.\r\n\r\nPoured out dark brown. 32ºSRM.\r\n\r\nNose is dank and moist and nutty and suggesting boiled peanuts. Freshly roasted chestnuts. Maybe hint of wet tobacco leaf.\r\n\r\nMouthfeel is nutty and drip coffee. Palate is Folger’s drip coffee with smoky, slightly sour, bitter, but light without the intensity of serious carmelization. Hops are almost resinous. There is slightly sour middle-hind palate that suggests lemon peel or grapefruit peel with a slightly oily character suggesting citrus oil, which is both tangy but also with a lingering aromatic component to it.\r\n\r\nFinish is medium long with charcoal, resin, sap.\r\n\r\nOverall, would not characterize this as a hoppy brown. The only brown ale component comes through most obviously in the nose and the hind palate with some nutty, dark barley toast like flavors, but over all the OBVIOUS flavor notes are charcoal, burnt twigs, burnt coffee beans of a stout and the aromatics of an IPA.", "Deep brown with small, light brown head. Poor head retention and lacing. Roasted malts aroma, nuts, some sugary-like notes, coffee, cocoa. In overall not that bad, above average, keeps the level.", "Klares braun schöner cremiger schaum; malzig röstmalz im geruch leicht Kaffee leicht hopfen, recht süß malzig etwas Rosine etwas Kaffee röstmalz ein Hauch Kakao herb säuerlicher Abgang wobei sich dann eine leichte hopfennote auf der zunge hält , mir durchgehend etwas zu süß aber nicht übel", "Aroma: Chocolate and coffee with malty backbbone\r\nAppearance: Nice brown color\r\nTaste: Dark coffee/chocolate/molassas\r\nPalate: Medium body with medium carbonation\r\nOverall: A bit harsh for my palate for a brown, but for style rates well", "Piana średnio oczkowa, niezbyt trwała. Barwa brązowa, klarowna. W aromacie karmel, brązowy cukier, zioła i resztki chmielu. W smaku półsłodkie, karmelowe, w tle trochę pikantnych przypraw, orzechów, kawy zbożowej, w kontrze niska, tytoniowa goryczka. Wysycenie średnie, dość pijalne i gładkie w odbiorze.\r\n\n\r\nPrzeciętne Brown Ale, mocno karmelowe i z mało intensywnym zapachem. Gdzieś ten zapowiadany amerykański charakter IPA uleciał w transporcie...", "33,5 cl bottle, bottled 19/11/16. Surprising seems to be the word for this beer. Surprisingly dark beer, dark brown to almost black with a good beige head. The aroma is surprisingly roasty coffee, chocolate, dark malt, dark sugar, a very light pepperness. The taste is like a suckerpunch to the head after the good smell. Sour. Very light body, overly carbonated. Taste has some coffee that was left on the burner all night, sour red fruits kind of riding over everything. Is that the ginger or is it a bad bottle? This is pretty awful. Bad surprise.\r\n\r\nupdate 23.3.2017: Much better. Nutty, malty with a bit of chocolate and a good hop bite in the finish.", "Bottle (as Indian Brown Dark IPA from beergium). Pours dark ruby with light beige head. Aroma is some fruits and malts. Flavor is sweet and bitter, malt, fruits, cocoa, molass, sugar. Finish has some sugar, hops. Alcohol seems mostly covered. Overall: ok.", "Poured from bottle dated 12/5/16 brown with reddish hues and a thin tan head. Aromas of roasted malt chocolate toffee and burnt grain. Taste is malty with oaky sweetness sd nice mouthfeel and a lingering bitter finish.", "Bottle. Black with Reddish tinge. Malty; roast malts, lots of chocolate and coffee, burnt roast, caramelized brown sugar. Hoppy; grassy and earthy hops. Sweet malty with nice bitter hoppy edge. Probably unique. Certainly interesting. An unusual and decent beer. (2008)", "Tap at Dogfish Head, Milton. Colour is clear brown with small white head. Aromas and flavors: Chocolate, some nuts, hops and malts. Pretty good.", "Backlog, ocena przepisana z untappd, w ramach uzupełniania profilu na ratebeer. Kawa, brązowy cukier, resztki chmielu.", "roasty light coffee aroma. dark red/brown in color with nice long lasting head with a tinge of light brown to it. taste is of very dark caramel malts, roasted barley, coffee, and faint hints of chocolate.", "Bottle from Liquor Barn. Aroma of malt, coffee, chocolate and some hops. Tastes rather thin, otherwise nice.", "Started drinking it too cold. It was 10 degrees in my garage. As it warmed, I loved this beer. Chocolate and coffee on the nose. Nothing like a dark IPA, don’t know why it’s named what it is.", "Keg at Barcade, St Marks Place, Manhattan. Dark brown with some translucency. A gorgeous cream-coloured head leaves lots of lacing. Very little aroma: some resin, some soft citrus, some oak. Taste is much more pronounced: the malty sweetness and oaky umami combine with a well-judged fresh hop bitterness. Slight metallic note in the long finish. A mixed bag, but a mixed bag at a high level. Imminently quaffable.", "Aromas of lemon and grapefruit, with wet leaves and hazelnut chocolate. Taste is hazelnut, milk chocolate, raisin skin, grapefruit, then a moderate piney hop bite with some wet leaves.", "Appearance is a deep brown. Aroma is rich malts. Taste is nicely balanced between lightly bitter hops and sweet malts. Overall very good.", "Kólaszínű teste a kitöltést követően egészen feketébe hajlik, kakaóporos, rumos csokoládés, kávés, de leginkább nápolyis aromákkal van szegélyezve. Ízvilága remekül közvetíti a diós, földimogyoró-krémes, étcsokoládé bevonatos, ostyás mondanivalót, éppoly intenzív, mint az illata. Szerkezete jól passzol mindehhez, a közepes test visszafogott szénsavtartalommal párosulva kiváló terep a sötét csemege feltérképezéséhez. Kivételes brown ale, emlékezetes Dogfish Head darab.", "12oz bottle at home. No BB date. dark brown color, small tan head. smells of caramel, spices, plums, marzipan, nutty, hints of exotic fruits. nice smell. full body, light carbonation, soft mouthfeel. tastes nutty, some licorice, spices, bit earthy, marzipan, plums, light raisins, bit milky, hints of cardboard. finishes lightly sweet with notes of spices, raisins and light cardboardish notes. quite decent beer, but also a bit on the heavy side.", "Brown body with off white head. Aromas of malt,bread,esters,pear.Tastes malt,bread,yeast(?).It is sweet at first and bitter athe end of the sip.The body is medium.A nice interpretation of the American Brown Ale style.A very complex,deep beer with character.", "Pours medium to dark brown, medium light brown head. Aroma of chocolate, raisins, sweet malt. Taste is malt forward, sweet, cocoa, some hops. Medium mouthfeel. A nice beer as we slide into cooler weather.", "16 oz pour on draft at Hilton McLean Tysons Corner’s Härth Bar. Clear brownish amebr with beige head. Aromas of malt, caramel, light roast. Tastes of malt, caramel, light cocoa, floral. Medium body with a dry finish.", "The aroma smells a bit like molasses and the appearance is a rich brown. The taste is a little sweet with a nice mild hoppy finish. I have not had many variations of this beer type and found this selection to be fantastic!", "Very good brown ale! Sweet with a little spice. They really mixed this one up and it all blended nicely. The scotch ale comes through wonderfully. High ABV goes unnoticed, maybe the slight sweetness is the reason for that. It’s an easy, enjoyable brew.", "Deep brown beer with a nice, medium head. Aroma of walnut leaves, caramel, raisins, waffles, chocolate. Seems drier in the taste that it actually is with medium carbonation and an interesting, medium bitter walnut finish. The flavours are pretty the same with a solid touch of american hops. And here is a snag because the latter at some point stand out too much in a perfume fashion. Nevertheless, the beer is a really decent brown ale IPA specimen.", "Bottle - average size foamy head, very dark brown color, pretty sweet caramel aroma and flavor, some dark fruit/raisin like flavors in there too, fair size hop balance, sweet finish, good overall \n\n---Rated via Beer Buddy for iPhone", "Aromas a caramelo, malta, notas dulces y ligeramente ahumadas.\n\nDe color rojizo con tonos granates. Corona de espuma abundante de buena retencion. Carbonatacion media.\n\nEn boca, notas a caramelo, maltosa y con final seco y amargo.\n\nAl paladar deja muy buen sabor de boca. Al principio sobresalen las motas a malta, grano y caramelo, para dar paso a un final seco y amargo.\n\nEn general es bastante buena, quizá no tam apegada al estilo por el amargor tan intenso, pero muy rica.", "Pours dark brown. Aroma of rich brown sugar, caramel and molasses. There's little hop aroma to speak of (in this bottle at least - bottled 8 months before drinking). Hops come through nicely in the flavour but again I was expecting a hit of hops. All in all though it is a brilliant brown ale which I would definitely drink again.\n\n---Rated via Beer Buddy for iPhone", "Amber-brown. Thin tan head. \nCaramel, chocolate, coffee, and vanilla aromas. \nMostly sweet and bitter throughout. \nMalty flavors. Syrup, bread. \n\n\n---Rated via Beer Buddy for iPhone", "Bottle. Pours an opaque brown with a fading light beige bubbly head. Aroma is of molasses, ginger, chocolate, nuts, slight bitterness. Taste is of ginger, chocolate, Nutella, grassy, caramel. Light oily mouthfeel, soft to medium carbonation.", "Bottle. Pours dark brown, cola highlights and a low beige head. Big full aroma of caramelised brown sugar, chocolate. Rich and sweet. The flavour is similar, almost too strong in its sweet caramel and molasses, cacao, kinda overpowering any hop notes. The hops do integrate well with bitterness combining well with fizzy carbonation and smooth malt. Decent overall.", "sample from bottle, poured a deep amber to brown colour with a tanned head on top.nose of sweet caramel malts, toffee, light cacao, molasses, nuts, and slight roast. taste is sweet with a sticky mouthfeel.", "On tap at Brewski. A dark hazel hue with chocolate, molasses, and hops on the nose. A tasty brew with a bit more zing on the palate than a standard brown ale, but still a fairly dry finish. Excellent.", "From the bottle the pour is dark brown with and as light passes through a little red. The head is light brown, thick and lingures. The aroma is cream notes of toffee and coffee. The taste is roasted, slightly smoked. Quickly brightens with the hops and finished roasted and bitter. Overall impression is the beer is dark but a good balance of hops that make it feel less heavy but a solid brown.", "355ml bottle from The Perfect Pour. Pours a reddish brown with a medium tan head. Aromas of malt, nuts, hops. Taste is coffee, malt, nuts, sweet up front and bitter to finish.", "chocolate, coffee, nuts, grass, citrus, herbs, red, clear, tan foam, salty, medium bitterness, medium sweetness, lightly sour, medium body, thin feel, average carbonation, bitter and salty finish.", "Pours up a medium dark brown with a moderate tan head. Rich roasted malt aroma with caramel and toffee. Smooth and creamy texture. Full bodied taste with roasted malts and nuts, caramel and toffee. Smooth finish. Not much hop presence. Moderately sweet. Very enjoyable.", "Pours dark nutty brown. Aroma is malty, slight roasted, bread. Taste os malty, roasted, coffee, hoppy balance.", "Bottle 12 oz. Pours dark copper with tan head, good retention. Aroma of coffee, dark fruits, dark sugar, roasted malts, licorice. A bitter taste with some sweetness in the aftertaste. Notes of brown sugar, dark fruits, caramel, alcohol is noticeable. Oily texture and average carbonation.", "(Ancient tasting notes from backlog; 355 ml bottle from Kihoskh; BBD: June 8th 2013 09:19) Poures dark copper with creamy tan head that fades to leave a film and beautiful lace. Aroma has notes of toasted malt with nutty hints. Oily texture, soft carbonation, medium body with a moderately sweet but boozy finish. Flavour is well balanced with initial sweetness and subsequent bitter hoppiness.", "Bottle, 355ml. A dark reddish beer with a small white head. Aroma is of caramel, brown sugar and roasted malt. Taste is moderately bitter with a toasted finish. Medium bodied with some carbonation. Sweet caramel finish with molasses.", "Bottle, 355ml. Sparkling reddish with a frothy to minimal tan head. Aromas of caramel, nuts, dried fruits, brown sugar. Medium to robust bodied with moderate carbonation. Medium sweet, medium to heavy bitter. Deep roasted character into a fruity and alcohol finish. Very pleasant.", "Slightly smokey roasted malt and chocolate aromas from a crystal clear medium brown/cola colored body with a thin white head. Creamy texture with lots of milk and dark chocolate notes and husky grain flavor. A subtle but noticeable molasses and brown sugar taste at the end in the back of the mouth. Nicely balanced earthy bitterness that keeps this really interesting. Finishes with all these flavors lasting long after the final sip. This is anything but a run-of-the-mill brown ale. Tasty, delicious and complex.", "A total miss for me. The hopiness totally overpowered the roasted malty notes one looks for in a brown ale. The overall effect was a bitter, confused mess of a brew. I may end up pouring the rest of the 6-pack down the drain.", "Very malty, quite sweet, plenty of toffee. Thick palate, alcohol noticeable. Really satisfying beer - shame I had to gulp half of it down because of an incorrect TV screen in the airport.", "Well, color me ’old and in the way’, because I’m really not digging this brewer’s mish-mash. They seem proud of the fact that it’s a little bit of this and a little bit of that, but for me, the mixup doesn’t work at all. I like some scotch ales, which can be quite delicious, I drink a lot of IPA’s and the occasional APA, but trying to make a Franken-brew out of spare parts and caramelized brown sugar... yowch! ’DeScriptors: Notes of molasses, coffee, ginger, raisinettes, chocolate’. Uh huh. I don’t like it. Mix up some coffee, molasses, ginger, raisinettes and chocolate, throw in some brown sugar and you get some very odd flavored candy. Not a drain pour, but close.", "First Indian brown ale, nice malts and hops. Good carbonation, full bodied. Will try again", "Pours a clear lovely dark brown. Aroma of roasted malts and brown sugar and caramel. Tastes darker than a traditional brown - rich with caramel and toffee and molasses. Perfect carbonation and just enough hops for balance. Definitely more than 2/3 of the way to a porter. An excellent brown.", "Ar- toasty malts, hints of chocolate and caramel, subtle burnt toast, low hop aroma\n\nAp- pours a clear dark brown, nice tan head, good looking beer\n\nFl- light malt sweetness up front is very well balance with roasty and hop bitterness. Hints of toffee, caramel, toasted almonds, nice bittersweet aftertaste. \n\nMf- full bodied, perfectly carbonated, dry, mild alcohol warming\n\nOv- very nice beer, well balanced and delicious. I want another :)\n\n\n---Rated via Beer Buddy for iPhone", "Bottle. Pours a red brown color with an off white head. Aroma and taste of malts, caramel and fruits with notes of nuts. Hoppy finish.", "From a 12 ounce bottle. Pours dark with minimal head. Aroma is sweet malty and coffee/toffee. Drinks medium to light with slightly bitter coffee hoppy flavor. Drinks like a stout or porter more than a brown.", "I poured it from the bottle into a pint glass.  It pours a dark brown color with a beige head and lacing.  The aroma is toffee, brown sugar, and hops.  The taste is burnt sugar, molasses, raisins, and nice hop bitterness. The sweetness is subtle and balanced really nicely with the hop and coffee bitterness. This is a really nice beer.", "Draft.\r\n\r\nNice appearance, dark brown with beige head. Taste finished with hint of coffee.", "Cask pour at the brewery. Creamy texture, smooth slick, roast chocolate with an underlying bitter bite. Nice to see a brown ale with some snap to it.", "Poured from 12 fl oz bottle. Dark brown with beige head. Toasted malt, mild nuts, hint of caramel and sweet chocolate, subtle hops.", "Pours brown with reddish hue. Aroma of roasted nuts and malts. Earthy taste with medium bitterness.", "Bottle. Pours dark ruby-brown with thin tan head. Raisins and alcohol on the nose. Raisins and molasses with subtle smoked malt notes. Mouthcoating, long finish. \n\n---Rated via Beer Buddy for iPhone", "Bottle. Brown with a reddish tinge, small white head and heavy lacing. Golden syrup, chocolate and earthy hop aromas. Flavours of sweet brown sugar, cola and coffee with an earthy hop finish. Typical brown ale, slightly watery mouthfeel. The sugar was overdone for me. \n\n---Rated via Beer Buddy for iPhone", "On bottle from Kihosk, Copenhagen. Brown color, ok foam. Medium/high aroma intensity; roasty, leather, some hops, malt and dried fruits. Medium/full body & complexity. Good bitterness and balance. Very enjoyable", "Poured from a bottle. Pours a medium dark mahogany brown with a thin tan ring. Nice rich roasted sweet malt aroma. Smooth and creamy texture. Full bodied with roasted malts and nuts. Lingering flavors with a smooth finish. Very enjoyable. Not the best Brown I’ve had but very good.", "Pours dark brown with an off white head. Nose is west coast hops and a touch of roasted malt. Flavor is rich chocolate and roasted malts with a greatfloral hop balance. FFinish is bittersweet and sticky. This is basically a gentle black IPA, not a brown ale.", "Marrom avermelhado, espuma de media formação e persistência. Café espresso, açucar mascavo, torrado, um pouco de frutas secas escuras. Paladar de leve dulçor, médio amargor. Corpo médio, baixa carbonatação. Aftertaste prevalesce o café espresso, dulçor caramelado e torrado, persistente, lupulada. Muito bem equilibrada.", "Floral, spicy hop aroma with notes of chocolate and licorice. Clear brown appearance with a tan head. Flavor is has toasted bread with light roasted notes with notes of caramel. Hop bitterness is high with a spicy floral character. Mouthfeel is medium with a medium carbonation ale. Overall, it's a great tasting American brown ale\n\n---Rated via Beer Buddy for iPhone", "Bottle approx 4 months old. Subdued hop character so more dominated by malt - sweet, raisin, chocolate. Well balanced, mild bitterness. Overall a complex and enjoyable brown ale, would like to try a fresher bottle to compare.", "Shared 12 oz. bottle. Dark brown and clear with a light tan head. Nose is sweet roasted malt, coffee, chocolate, and caramel. Similar flavor, with brown sugar sweetness, a hint of scotch, and mild hop bitterness. Much more personality than the average brown.", "Aroma: malty, hoppy and sweet; very nice; Appearance: dark reddish amber with fluffy head that dissipates quickly; a little lacing; Taste: very malty and smooth; coffee and caramel undertones; only negative is a slight sourness that isn’t entirely pleasant; Palate: heavy body with long, sweet finish; Overall: great beer; would definitely buy again.", "Pours a clear reddish brown with a thin tan head. Sweet malt aroma of caramel and brown sugar with light apricot and hops. Sugary malts up front and floral hops in the finish. Interesting combo of sweet brown ale and a pale ale.", "Cherry cola color with minimal head. Huge aroma of toffee, coffee, toasted malts, raisins, nuts, and caramel. Flavor follows aroma with spurts of piney hops and bittering. Mild carbonation and smooth mouthfeel.", "Bottle from Whole Foods Market in Redwood City, CA. Aroma is raisins, heavy bread, chocolate, burnt sugar. Taste is bitter up front with slight sweetness on the finish. Extremely balanced! Unique concoction and very drinkable.", "Pours a half finger of head on a clear brown body.\r\nThe aroma is toast (almost burnt), wood, brown sugar, caramel and raisins.\r\nThe taste roasted malt, then some pine bitterness, big dose of caramel sweet and a bite of grapefruit to finish.\r\nThe texture is crisper.\r\nIt’s pretty good.", "Bottle bought @ Kihoskh. Pours hazy brown with a small frothy beige head that quickly dissipates while leaving lots of spotty sticky trace on the glass. Smell is malty, grassy and tiny fruity with dark bread, caramel, chocolate fudge, grapefruit juice, moist grass, pine needles, moist soil and lemon zest. Taste is sweet. bitter, malty, grassy, earthy and tiny fruity. Mouthfeel is soft, round, tiny astringent and medium bodied. Finish is sweet and bitter with dark bread, caramel, grapefruit juice, moist grass, pine needles, cocoa powder, moist soil, lemon zest and hints of cardboard. Solid hoppy brown if a bit old with faded hops. Solid but had higher hopes.", "Una gran combinación entre IPA y Brown Ale. Notas a nuez y caramelo en nariz, tiene un amargor moderado, hace sentir el lúpulo sin incomodar. Gran cerveza, peligrosamente bebible.", "I love the smell of coffee and hate the taste of it. This beer is a pint of cold coffee in smell and in taste, and because it’s so strong on the coffee notes, it’s not palatable to someone like me. I can appreciate the craft here, but I can’t drink this beer.", "Dogfish Head Indian Brown Ale can best be described as IPA meets really good brown ale. Dark brown pour with a light tan head that sticks. Aroma is hoppy, nutty and roasty. Taste is nutty caramel flavor with just enough hop kick. IBA hits all the right notes to give a tremendously balanced brew.", "Bottle 12fl.oz. Small light brown head leaving. Dark brown clear color. Aroma is berries, chocolate, leather, sugary leaves and wood. Taste is sweet of berries and sugar. Hops still very present.", "Draught at the Beavertown Brewery taproom on 26-Sep-2015 as part of the Rainbow Project. Good brown colour with a tan coloured bead. Softly carbonated. Flavour of caramel, coffee, malt and hops. A really nice imperial brown ale with a lot of flavour.", "Bottle. Pours very dark brown with a cloudy head. Smells like burnt caramel. Taste a bit of coffee with a dark roast aftertaste. Mouth feel was okay.", "12oz bottle poured right down my gullet. Aromas of brown ale roastiness, chocolate malt, and caramel. Mild to medium bitter. Tasty.", "Keg at craftbeercalling. Pours black with a decent foamy head. Coffee and roasted malts aroma. Strong roasted malts, some chicory and a hint of fresh brewed coffee.", "Pours a dark brown from a bottle. Aroma of espresso and molasses, flavor similar except brown sugar added into the mix. Wish I was tasting those raisinets, that sounds interesting, but I’m just not getting it. Good beer.", "Bottled, poured into glass. A really solid brown ale. Nice nose, big malt body, and a beautiful finish. Very easy drinking but full of flavor. Great stuff. \n\n---Rated via Beer Buddy for iPhone", "Cervesa molt bona, destaquen aromes i gustos a cafè i a caramel mesclats amb un toc de llúpol.\r\nCerveza muy buena, destacan aromas y sabores a café y a caramelo mezclados con un toque de lúpulo.", "Bottle. Aroma is roasted malt with caramel. Appearance dark brown. Taste was balance of mild sweetness with medium roasted bitterness. Palate light to medium with average carbonation. Overall, a nice ale with strong character and mix of styles like the deScription.", "Certainly one of the best brown ales I’ve had. Aroma is barley, malts, and toasted sugar...taste is lots of caramelized sugar, brand flakes...hops too...finish is dry enough with some lingering sweetness and grainy flavor...adequately fizzy...it smells like autumn...", "Keg@magic rock tap\nhazy cocoa brown with thin beige lacing. Chocolate orange nose, moderate body and carbonation, pithy citrus and toasty cocoa& coffee notes, dry but brief finish...more brown ale than iba...not as hopped as expected", "Opaque brown turbidity with no head. Pungent dark chocolate, malt, scotch, caramel, vanilla, roast, and dried fruit aroma. Truly outstanding scent. Light bodied and quite smooth. Absolutely incredible flavour. Initial taste is a relatively sweet malty combination of vanilla, scotch, caramel, and chocolate, whereas the finish consists of roast, dried fruit, mild hops, and a slight lingering sweetness. Incredible.", "Keg at magic rock, pours dark chocolate brown, off white head. Aroma is chocolate malt, roasted toffee, hop spice, citrus hop. Nice balance of different flavours. Very tasty.", "Slikket bajer, dog i en svært kedelig flaske. Ikke imponeret over designet. Duften en smule røget, lidt a la brunt værtshus og læder møbler balsameret med nikotin. Smager let af malt og kaffe, samt jeg tror der er nok sukker i til at de er sponsoreret af Dansukker. Udemærket.", "Bottle - Thanks Martin! Pours a deep clear brown with a white head. Aroma of roasted malts and hops, more than Im used to for the style. A bit of vanilla and coffee on the nose. Taste is coffee, quite bitter, a bit of vanilla. I will never love this style, despite of the heavier use of hops in this one.", "Bottle. Pours brown with a tan head. Aroma of caramel, malts, choko, sugar, quite hoppy, nuts. Light sour notes. Taste is sweet, light hops, coffe, malts. Bitter and malty coffe finish. Texture is sticky, carbonation is Soft,", "Origin: Tap. Vessel: Tulip. Supplier: Small Bar (Bristol). Sour with hint of cherry. Smoky aftertaste.", "On tap at Beavertown Rainbow Project 2015, Tottenham, London. A dark brown/black coloured pour with a medium beige head on top. Roasty, malty, coffee, caramel aroma. Tastes similar, roasty, malty, chocolate, coffee, caramel. Nicely complex, a great effort from Dogfish Head.", "Keg at Rainbow event at Beavertown, London. It pours a clean brown color with medium beige head. Aroma is lightly roasty and grainy with dried leaves. Taste is lightly dry and biscuity with more notes of dried leaves earth and nuts. Medium bodied with good carbonation. Overall, decent", "Medium beige head. Clear deep brown body with carbonation. Syrupy\r\ntoasted sugar aroma with caramelly roasted chocolatey notes, vaguely\r\nperfumy. Dryish cocoa and vanilla taste with caramelly perfumy notes.\r\nMid-bodied. Mild, mealy mouthfeel. Dry caramelly mineraly perfumy\r\naftertaste with resiny notes. It’s nice, drinkable, but a bit odd and\r\nstrange. (0.355l bottle, from Kihoskh, Copenhagen.)", "Bottle from Harvest Market\r\nKind of surprised I haven’t rated this before. \r\nCrystal clear dark brown color with a stingy off white head. big chocolate caramel and molasses with some aged earthy hops to counter. May not be the freshest bottle, but still tastes pretty damn good.", "330ml bottle. Deep brown color. Light head. Malty, chocolate, caramel. Hoppy aftertaste.", "Aroma is roasty malts, brown sugar, toffee, chocolate and hazelnut. Taste is very rich malts, chocolate and caramel. Some chocolate on the tip. Very subtle earthy water flavors with nice added hop presence to balance it out. Excellent beer! Appearance is a deep brown with a medium pearl head that retains very well.", "Flaska från Best of Beer, Ålborg. \nSer ut som coca-cola. \nDoftar nästan cola också, men med lite maltigare ton. \nKolasöt med en besk efterton. \nVäl balanserad men saknar det där lilla extra. \n\n\n---Rated via Beer Buddy for iPhone", "Been 2 bottles of this sitting in beer fridge north for a month or so:\r\nNice smell. Coffee cola appearance. Taste be just fine, thank you. \r\nIs there a 3rd bottle there, in the fridge?", "Brown malts and hoppy aroma. Flavor of toast but not roast. Floral flavor with brown malt and hoppy finish.", "Brown with a large tan head. Aroma is roasted coffee malt with a touch of chocolate. Flavor is a little sweet up front with coffee and chocolate malt fairly prominent. Hops appear in the finish to brighten it up just a bit. Extremely drinkable.\r\n\r\nWife: 4", "Pours a dark Amber , smallish head. Aroma is malty sweetness, medium mouth field. Flavor is malt with mild sweetness, nice brown ale.", "Bottle, thanks SirLimpsalot.\r\n\r\nDark brown with a tan head. Aroma and taste of light nuts, some roasted malt, toffee and some hints of fruit and hops. The body was medium as was the bitterness.", "@ Basunen 15-7-11: ganska lagom doft. Smaken är mycket fin med stora toner av kola och salt toffee. Riktigt gott", "Bottle. Appearance: Deep brown, clear, with a thick mousse like khaki head. \r\nAroma: Roasty, molasses, and dark fruit overpower any hop aromas. \r\nTaste: Roasted malt and bread crust up front, leading into a strong resinous, grassy, citric hop flavor and bitterness. \r\nMouthfeel: Medium body with a moderate carbonation. \r\nFinish: Hop bitterness is prominent in the swallow, but quickly disappears leaving a roastiness that lingers. \r\nOverall: a very well made beer, that definitely has a cross of ABA and IPA", "Pours dark brown with a beige head. Aroma of dark sweet malts, toffee, hazelnut, caramel and some vanilla. The taste is sweet with some weak hoppy notes. Also some bitter nuts, sweet malts, weak raisin, toffee and coffee.", "On tap at the brewpub. A dark brown beer, unclear, and topped by a dark beige head. It’s roasted and lightly piney on the nose, some coffee and a touch of the alcohol. Roasted malts, coffee notes, some brown sugar and a good dash of piney, resiny hops and bitterness. Full body, soft carbonation and semi-dry on the palate. Lasting roasted finish with a fine bitterness. A quite wonderful amalgation of beer styles. I’d say IPA and brown ale, even though the brewery says scotch, IPA and APA. 150621", "Sampler at Mondial de la Biere in Montreal. Brown body with small beige head. Aroma of coffee, brown sugar, chocolate, molasses, dark berries. Taste of roasted malts, moderate amount of hops, herbs, medicinal notes. Lovely.", "From the bottle. Drank from a tulip glass. Aroma of coffee, chocolate, raisin, and earthiness. Nice dark brown in color w/ a beige head that hangs around a bit. I found the taste to be fairly hoppy in the beginning, and more balanced the closer it became to room temp. At that point the malts and darker flavors rushed forward. This is when I really began to enjoy it. This is a very serviceable pour, yet didn’t stand out from any of the other brown ales I’ve tried.", "Pours deep amber with a creamy head that stays present throughout the length of the drink. Aromas of molasses, maple, brown sugar, and wispy notes of pine and spruce. Taste is big toffee malts, maple syrup sweetness, fading to a spicy bitterness at the end. Highly recommended. ---Rated via Beer Buddy for iPhone", "Dark brown ale with caramel, roast & hops on the nose. Gently toasted flavor with a dull bitterness & fairly strong alcohol presence.", "Malty roasted brown aroma and flavor. Nice and full flavor and has quite a bit of hops balancing the malt. Almost a bit chocolate like. Very good hoppy brown. Finishes more bitter than most Browns. \n\n---Rated via Beer Buddy for iPhone", "Nez caramel la scotch, belle dentenlle, un peu de bulle\n\nEn bouche scotch ale mais des que sa rentre c plus relax pale ale", "Bottle (12 fl.oz). Translucent dark brown pour with a medium-sized beige head showing good retention and lacing. Nose is malt-driven with roasty caramel and brown sugary notes and hints of coffee and dark fruits. Palate is smooth and softly carbonated with a medium body and generally sweet malty flavours before a mild-moderate dry hop bitter finish. A lovely Brown Ale.\n\n---Rated via Beer Buddy for iPhone", "Brown color ; thin , beige head. Aroma of coffee , caramel and hop . Great mix of coffee , caramel and citrus hoppy notes in taste . Full body , moderate bitterness . Smooth finish.", "Aroma: caramel, chocolate, coffee, \r\nAppearance: brown, clear, tan head\r\nTaste: medium sweetness, medium bitterness, coffee, roasted malts\r\nPalate: medium body, creamy, soft carbonation, long finish,", "Aromat kakaowy, niemal parterowy. Barwa ciemnej miedzi, prawie brunatna. Ładny lacing, kiepska piana. W smaku trochę kakao, trochę słodyczy. W posmaku wchodzi lekka paloność i goryczka. W odczuciu troszkę zbyt nasycone, ale nadal gładkie i smukłe, świetne piwo.", "Pours a nice copper brow with a thin white heads that drops quickly. Aroma is boozey with scotch notes. Taste is toffee and caramel with a light bitter finish. A traditional English brown.", "Tap into a pint glass at Kip’s pours reddish brown with a small beige head\r\nwhich dissipates quickly leaving a nice lacing. Slightly creamy body, aroma of malt, caramel, and nuts; Flavor of roasted malt, hops, caramel, dark chocolate, and coffee. Finish is slightly bitter.", "Pours brown with almost no head. Aroma of hops, roasted malt and some spices-- slightly acidic. Tastes of roasted malt and caramel.", "Very malty and caramelly with a nice hoppy background that is really pleasant. A very good beer from a very good brewery.", "Tap at Verdugo. Bit spicy, chocolate, light bitterness, smooth. Didn’t write much it seems.", "May 9, 2015. Bottle at home, bottled march 13, 2014. /i>\n\r\nDeep ruby red with dense off-white head. Aroma is nutty, caramel, figs, slight notes of hard gingerbread.\r\nTaste is medium sweet toffee, nuts, light to medium bitterness with a roasted note. Medium bodied, average carbonation. Not a lot of hops but a very solid brown ale.", "12 ounce bottle into signature tulip glass, bottled on 10/15/2014. Pours crystal clear dark reddish brown color with a 1 finger dense khaki head with good retention, that reduces to a small cap that lingers. Nice spotty soapy lacing clings around the glass, with a good amount of streaming carbonation retaining the head. Aromas of big dark chocolate, cocoa, coffee, caramel, brown sugar, toast, dark bread, molasses, light dark fruit, herbal, grass, light pine, and roast/toasted earthiness. Damn nice aromas with good balance and complexity of dark/roasted/bready malt and moderate earthy hop notes; with great strength. Taste of big dark chocolate, cocoa, coffee, caramel, brown sugar, toast, dark bread, molasses, light dark fruit, herbal, grass, pine, and roast/toasted earthiness. Fair amount of herbal/pine bitterness on the finish; with lingering notes of dark chocolate, cocoa, coffee, toast, dark bread, molasses, herbal, grass, light pine, and roast/toasted earthiness on the finish for a while. Incredible complexity, robustness, and balance of dark/roasted/bready malt and earthy hop flavors; with a great malt/bitterness balance and zero cloying flavors after the finish. Medium carbonation and body; with a very smooth, moderately creamy, and lightly sticky/chalky mouthfeel that is nice. Alcohol is very well hidden with only a slight warming present after the finish. Overall this is an awesome hoppy brown ale style. All around great complexity, robustness, and balance of dark/roasted/bready malt and earthy hop flavors; and very smooth to drink. A highly enjoyable offering.", "Very nice brown ale. Not as strong as expected, but nice sweet aroma with good mouth feel and balanced taste. Hops are subtle but provide a tempering of the sweetness.", "Bottled on 1/21/09....Sampled on 5/13/09, poured into a wider wine glass. This beer pours thick with a medium lace. A dark brown-near black color. Medium carbonation, but didn’t produce that much of a head. I can’t stop sipping it! The flavors are outstanding, mainly sweet, but with a slight hoppy aftertaste. Thinking of the Rolling Stone’s song, \"Brown Sugar\", as that is the main theme going on here. It’s almost like a stout. Aroma is oak mixed with the sweets of the malts and sugar. Reminds me of a toned down, affordable version of the DFH Immort Ale, which is like 11% vs. 7.2% here. They only had one left at the local retailer, but I’ll be looking out for more of this in the future.\r\nUPDATE: Bottled on 11/29/07 (sampled on 6/12/09)........Bought a 6-pack of this after loving the first single/sample I tried. I didn’t really notice this until I drank the 4th one, that this may have aged a bit too long. Had a bit more of a sour taste, where that sweet balanced taste I liked maybe had fermented too much. I did notice the hops a little more though, which I guess is a good thing. Still tasted good and sweet, and was totally drinkable, just didn’t seem how I preferred it before. Maybe it was just that this bottle was starting to turn, I dunno. I wouldn’t let this one age much more than a year, just to be safe.", "Lately I’ve really been into Indian Red Ales so maybe I picked this up at the wrong time. I love a good brown, but this combo just didn’t do it for me in the end. It’s a nice beer, but it probably would have been nicer with less of a hop character. Tasty anyways just not my favorite mash-up.", "Old rating. Hazy brown pour. Roasted malts, coffee, caramel, with some hop brightnessz balance isn't entirely in check, but still an interesting decent brown.", "12 pour from refrigerated bottle into a Spiegelau stout glass. Allowed to warm for a bit. Strong last. Moderate lacing and fairly strong retention. Brown or maybe dark ruby. Mostly opaque-- a tiny bit of transparency. Carbonation looks good. Nose is sugary, malty, and a little woody. Mouthfeel is a little weak, but mostly creamy. Taste is awesome. Scotch ale sweetness, brown ale maltiness, and a nice hoppy bitterness at the end. A bit of coffee and molasses. There?s a lot going on-- a bit hard for me to dissect the flavors. Great complexity.", "March Madness 2015 - A nice brown ale but a really sour finish that is overpowering. So much potential but it doesn’t work for me.", "March madness 2015. The aroma is not strong with coffee the most dominant contributor. The ale itself is smooth with good roasted malt notes. The roasted malt and hops work together nicely. The finish is not overly bitter.", "Really decent brown ale with great caramel look, smell, and taste. Off white head sticks around with lacing all the way down. Really enjoyed this Dogfish Head version.", "35 cl bottle @ home. Pours clear reddish brown with a white head that leaves a little lacing. Aroma and flavour are toffee, caramel, and dried fruit - with a slightly dry finish.", "12oz bottle from Mitsuya’s poured into a tulip pint. Pours a dark chocolate brown color with a big beige head. Nice lacing. Sorghum, brown sugar, prune, currants and roasted grain on the nose. Nice creamy mouthfeel. Medium bodied leaning to the sweet side of the palate. As it warms up the fruit really stands out. Really solid brown ale.", "Nose is dark bread/sweet. Flavor is same plus orange marmalade, mild citrus rind, roast, nutty, caramel accents, pine accents. Solid.", "Couleur brune foncé avec un col beige respectable. Aromes de noix,caramel,herbes,café. Respectable mais rien d’incroyable!", "12oz bottle poured into a belgian tulip. The aroma is a malty chocolate and roasty coffee initially, but the chocolate fades. Coffee aromas remain in the form of fresh beans and are joined by earthy grains, brown sugar / molasses, gingersnap cookies, and raisins. The beer is crystal clear, oily, and lightly effervescent with a deep, dark, and rich caramel brown hue. It’s topped by an off-white, soapy head that retains a thick ring, a frothy foamy surface, a leaves a moderate, messy lace. The beer is a balanced, medium bittersweet. It’s smooth with a light, prickly carbonation, and a medium body. Lightly smokey flavors of raisin and cooked brown sugar merge with coffee and a light biscuit biscuit note on the palate. It finishes with a syrupy chocolate, roasted coffee, and cooked brown sugar blend, as well as a light charred note. The aftertaste is lightly astringent as well as cloying with a sticky sugar character, and light flavors of coffee, clean ginger, and bread.", "Relatively unique experience. Not sure if it is a good unique or not. Can clearly get traits from both the malty scotch style and the hoppier IPA/pale ale styles. I typically like the complex brews but this is almost too much to hold together. Definitely not something i can drink often. A rather confusing drink for me. Each sip seemed to taste different so i can’t quite figure this one out.", "E’ dì un bel colore marrone scuro, molto intenso, con riflessi rossastri; la schiuma è poco presente, fine e di colore beige. L’aroma è interessante, complesso, pulito e raffinato. In evidenza cioccolato, caffè, tostature, sentori terrosi, prugne disidratate, zucchero di canna, melassa. Il gusto non si discosta di molto, riproponendo note di tostatura, caffè, leggero cioccolato, uvetta, prugne secche. Ha un corpo medio, una carbonazione contenuta ed è molto gradevole e morbida in bocca, lasciandosi bere molto facilmente. Alcool non pervenuto, appagante retrogusto lungo e morbido di caffè e di cioccolato.", "From bottle. Pours a hazy brown with a beige head and nice lacing on the glass. Aroma has coffee and lightly roasted malts. Taste has a gentle sweetness, roasted malts, just a hint of smoke, coffee. Medium mouthfeel.", "12 oz Bottle. Appearance is dark caramel color with tons of foamy, beige head. Aroma is roasted grains, sugar, raisins, and citrus. Taste is similar with lots of dark fruit sweetness, caramel, followed on a citrus hop bitterness - also very acidic. Palate is light-bodied, thin texture, lively carbonation, and semi-dry finish. I’m not sure what I’m missing with this one, but it just didn’t sit well with me. Too acidic. Flavors contradictory and all over the map. I felt like it was trying to do too much.", "Bottle from cellarbrations super store in hami hill. Pours dark brown with a creamy tan head. Aroma is slight citrus, lemon and toffee. Body is medium\nWith low carbonation. Taste begins quite sweet like molasses which turns into some citrus. Finish is quite big and ends with a coffee bitterness coupled with some nutty hints. Hops come to life as it gets warmer with grapefruit and some mango appearing. Had this back to back with Samuel smiths nut brown. This definetly had much more bolder flavours with more hop character coming through. Nice beer!", "On draft. Nice malty, coffee aroma. Deep brown color, nice tan head with pretty lacing. Don’t really taste the hops, but maybe it’s a subtle edge to the maltiness that balances really well. Creamy. Coffee after taste. Nice beer.", "Roasted malt and coffee flavor. Creamy mouthful and not much of a hops presence. Pretty good brown ale.", "Aroma is an interesting cappuccino up front with some brown sugar and roasted malt when you explore it further. No hops at all in the scent; strange for dogfish head. Very pretty brown color with a light tan head of foam. Tastes roasty, slightly hoppy and sweet. Has a lot in common with a scotch ale but has more brown sugar, rather than malt sweetness. Has an interesting creme brûlée quality about it. This was good; I feel it is a bit overrated. Perhaps the brown ale category isn't packed with great beers so this one dominates. \n\n---Rated via Beer Buddy for iPhone", "Bottle, 355 ml from deli in Brooklyn. Pours brown with small off-white head. Roasted malts, caramel, chocolate, nuts. Sweet. Medium body.", "Brown pour from draft at lumpys in Antioch. Choclate and nutty. I change my mind each sip on how much I like it. Overall it's pretty good", "bottle from kihoskh. rare event that i get to rate a bottle with 2000+ ratings on it. clear dark amber nutty bruwn.aroma is like really good belgian quad, raisins, dark dried fruits, faint nutty note, malts, but also below the complexity a dose of us hops that gives a sweet sawdusty base to the aroma. Really cool aroma. Flavor is also very complex, malts, roasted malts, spices, some undefined raisin like but also sweet flavor, candi suger perhaps, lots of hops, flavor is more brown aleish than quad ish. this is a very, very good brown ale for sure.", "Bottle into snifter. Very dark ruby brown almost black. Thin head. Almost no aroma which is a disappointment. Some mild malty biscuit aroma and taste. Mild sweet caramel notes. Full mouthfeel and flavor. Smooth. Decent beer. \n\n---Rated via Beer Buddy for iPhone", "Bottle: Pours a reddish brown with a beige head. The aroma was caramel and molasses. The creamy taste was well balanced with plenty of malt and hop flavor and slightly sweet at the end.", "Pours a dark clear amber color with some ruby in it. The head is tan and rather thick and foamy and left plenty of lacing around the glass. The aroma is dark fruits, caramel, raisins, mildly bitter chocolate, and some brown sugar. The taste is very rich and very good. You have the typical brown ale flavors such as nuts, caramel, brown sugar, chocolate, some dark fruit, and mild coffee yet on the back end I pick up the hops that are added and some even mild citrus and hop oil resin. This is definitely a world class beer that I highly recommend.", "Pours deep garnet brown with a small light tan head. Aroma of coffee, chocolate, caramel, and toffee. All sorts of roasty malty goodness. Taste is lots of coffee, some bitter chocolate, a bit of toffee, roast, and piney bitterness. Soft full carbonation, medium body, and a dry resinous finish. Delicious.", "Это пиво вкусное. я, конечно, рекомендую его всем, что любит хорошую Craft пива!", "Dark brown/cider color; Medium slightly creamy body; Aroma of malt, caramel, & nuts; Flavor of roasted malt, hops, caramel, dark chocolate, and coffee; Finish is slightly bitter; Nicely balanced; Solid.", "Pours an amber brown color with a khaki head. Malt, caramel, toffee, toast, chocolate and molasses aroma. Chocolate, malt, caramel, toffee, toast, hop, molasses, coffee and dark fruit flavors. Medium body and carbonation with a malt, chocolate and molasses finish.", "Pours a deep reddish brown. Notes of raisin, brown sugar, toffee. Would be too sweet but it finishes nicely dry and hoppy. Flavors are big and clear, and it’s very refreshing and drinkable for the style/abv. Overall a very nice beer, and an old favorite, though it’s not as superlative as I remembered.", "Many thanks to Beerhunter111 for this bottle. Toller karamell-toffee Geruch. Zartbitterschokolade im Antrunk, Walnüsse, schöne feinherbe Noten, zum Hauptteil hin trockener, malziges Karamell ohne zu süß zu sein, frisch floral. Geröstete Karamellschokolade, feinherb. Lang und floral frisch im Nachgeschmack. Toll!", "Pours a deep red brown. Floral and sweet nose. Beautiful balance between the malt and hops. Piney finish. A great beer.", "Growler from the Southern Filling Station. Dark brown, with a small, beige head. Nice malty character of toffee, espresso, oak, and molasses. Sweet and malty, with a light, pleasant bitterness. Medium body, chalet, creamy, and clean. This is one of my gateway beers, but I’ve missed rating until now. It’s better than I remembered, and I remembered it being good.", "Bottle. Dark brown, clear. Chocolate, leather, old coffin, some tobacco, slight hoppy herby nose. Mouthfilling body, quite smooth nice, well bittered though. Some citrus pine hops, but mostly malts in flavour. Vry flavourful, clean brown ale. Easy drink.\n\n-- bb", "A - very dark brown, near black, with mahogany highlights. Large tan head with good duration. \r\n\r\nAroma: medium and dark roasted malts; perhaps a slight hop spiciness. ABV well hidden but with a floral note. \r\n\r\nT: rich malt flavor leading to a lasting malty finish and aftertaste. Hops make their presence known mainly in the clear bitterness of the finish. Higher ABV becomes evident after warming. \r\n\r\nM - full body; medium-light carbonation. \r\n\r\nO - a rich and malty brew, with well hidden higher ABV and a lasting dark malt aftertaste. An East Coast lower-hop Rogue.\r\n[from notes]", "Poured from a 12 oz bottle into a tumbler in late 2013.\r\n\r\nA: Black.\r\n\r\nS: Brown sugar.\r\n\r\nT: Brown sugar, malt, bitterness on back end. Has a familiar Dogfish Head flavor on the back end that seems to be in all of their beers.\r\n\r\nO: I wanted to like this one, but I got some bitterness from it that overwhelmed my palate. It had an aftertaste that I didn’t like too, so I drain poured it. Brown ales are not my friend.", "35,5 cl.bottle. Dark brown colour with an off-white head. Aroma and flavour of roasted malt, caramel, chocolate and fruit. Really nice brown ale.", "Pours a dark black with a slightly off white head into a tulip from bottle. Aroma is very nutty and a little sweet. It?s strong and appealing. Taste is a little dry. nicely roasted tastes. A fair bit of not intense but very present hops make this an interesting beer. Very intense carbonation but light on the mouth.", "Pours clear with an nice healthy head. Not much aroma to speak of. The taste is of caramel and raisins. Sweet, but slightly balanced by slight bitterness.", "One of my favorite beers. The aroma is rich from the crack of the top, and the flavor matches.", "A very dark brown beer with a medium and beige head. The aroma is nicely balanced and complex. Dark chocolate, coffee, sweetness of raisins, some freshness of lemon and bready malts. Taste has bread, dark fruits, some chocolate, nice bitterness, quite dry. Medium bodied, nice and smooth to drink. Complex but balanced beer. Very good.", "Pours the darkest brown, this smells of carmelized goodness. So malty and smooth with rich flavors of roast and molasses. Not usually a fan of Dogfish brews, but this is one of the finest ales.", "355ml bottle from Saveur-Biere\n\n\r\nBottled 07/19/14 - Pours dark brown with a small white head. Aroma of caramely malts, syrup, toffee, coffee and dark chocolate. Taste is sweet, stuffy and malty with some syrup, licorice, toffee and caramely notes. Finish is sweetish, syrupy and malty with some hints of hops, licorice and coffee. A bit too sweet and syrupy for my taste.", "citrus aroma pours a very nice amber-brown color with white head,caramel and citrus taste amazing beer", "Bottle from saveur-biere. Dark brown red color. Clear appearance. Thin brown head. Light sweetness. Aroma is roasted, chocolaty and malty.", "Bottled. Pours a dark brown with a rather minimal tan head. Aroma is of coffee and hops, very pleasant. Taste is very much of coffee and bitter hops with a bit of malty sweetness and dark chocolate. Carbonation is light and it has a rather full body. Finish is long with bitterness followed by sweetness then becoming a bit astringent. A rather complex beer that has a lot going on. To me it tastes like a porter, an IPA, and a Scotch ale were crossed. A very good beer that mixes a few different styles and succeeds mightily at it.", "Bottle. Dark brown. Hoppy, burnt sugar, malty, chocolate finish, smooth texture. A classic brown ale that I often overlook. Extremely well made and balanced. \n\n---Rated via Beer Buddy for iPhone", "A nice brown ale. Dogfish head never seems to fail. Nice coffee and chocolate taste.", "Un intreccio sensazionale tra il caramellato di una scotch ale, il luppolo trionfante e la nocciola e toffee di una brown ale. Risultato: atomico!!", "It’s a great one, like a black IPA it has very strong roasty malts fighting for supremacy with hops. If you’re feeling in a mood for hoppy beer it’s great, and if you’re feeling in the mood for malty beer, it’s great. This is the Dogfish Head brew I would take any time.", "A well rounded brown with all the right stuff. Always will drink. Not as hoppy as a usual DFH offering but a welcome change", "355ml Bottle as a gift from Virginia:\n\r\nMedium to dark copper & clear with a light, tan brown head that’s slightly foamy & about a 0.5cm tall with little initial movement.\r\n\n\r\nSweet & nutty with sugar & caramel coming through. Medium strength malts are there with hints of hops giving the beer a definite American style aroma. Darker fruits/raisins with some further sweetness, hints of chocolate & light bitterness come through as well.\r\n\n\r\nMalty with plenty of hops & even some citrus. Some nutty flavours come through too with sweetness & caramel with some darker fruits too. Definitely not what I was expecting but a very nice taste with some roasted flavours, plenty of chocolate & faint bitterness towards the end as well.\r\n\n\r\nMedium bodied, quite sweet on the palate with a sticky smooth feel that goes down with only a faint hint of alcohol showing. Carbonation was about medium with this one as well and the balance was a good one with the hops & malts working well together from the start.\r\n\n\n\r\nAnother excellent beer from Dogfish Head, I really enjoyed this one. Plenty of hops with some citrus as well which was unexpected but very nice. A great beer.", "In recent months, a beer shelf at Milwaukee’s great Discount Liquor re-filled with Dogfish Head brews after the company’s self-imposed departure from the state. Ahhh, how wonderful the return! This brown ale is pretty darn perfect for a cold November night, with the coffee and chocolate aromas heralding measured sweetness. Not that our town lacks for excellent beer, but thanks for coming back.", "Loved it. Cola colour, off white head reluctantly coaxed out from the low carbonation. Aroma of toffee, coffee, muscovado sugar. Flavours of toasty, caramelised.. Something. Hops are in there, as is bitterness but not certain what or how much.", "Bottle. Brown with medium tan head. Aroma of caramelized sugar, malt, and some hops. Medium/heavy body, heavy caramelized sugar sweetness upfront, moderate hop bitterness, raisins, some boozy notes, and a slight oily finish. Not my favorite offering.", "Indian Brown Ale A cross between a Scotch Ale, an I.P.A, and an American Pale. It has good malts and fresh hops to combine several types in one brewsky. Hints of molasses, coffee, ginger, raisinettes, chocolate", "On draft at dogfish head alehouse in falls church it is a dark cola color with a slight head the aroma is malty and the taste has a black licorice flavor that lingers bitter on the palate", "coffee, chocolate, frothy, brown, medium sweetness, medium bitterness, medium body, slick feel, slick feel, average carbonation, bitter,", "From a bottle. Pours brown with a head. Tastes like dates, earthy, woody, nutty, malty. Light/medium body and low carbonation. Smells like dates, nutty, woody, earthy.", "dark smells that are very subtle like coffee and chocolate,dark, can’t see through in pint glass, medium strong flavor of roasted malts, little chocolate....finishes stronger of coffee, can’ t taste the hops as much as I thought I would...good but nothing stands out as being wonderfully impressive...", "12 oz bottle. Aroma: malty, with leather, toffee, and cherry. Taste/Palate: starts crisp, thick, and sweet, and finishes crisp, bitter, and slightly astringent. One of the best beers to come from Dogfish, IMO. Fantastic!", "Poured from a 12oz bottle. Color is a beautiful dark chestnut brown. Aroma is boozy at first. Taste is sweet, notes of molasses, brown sugar and Cap’n Crunch cereal (yellow box). Overall a really great beer!", "Bottle. Brown pour with a light khaki head. Aroma has notes of brown sugar with nice earthy hops. Flavor is a great balance between hops and malts. Notes of floral hops with dried raisins and toasted sugar. Perfectly balanced. Very cool concept and very well done. Tasty.", "355 ml bottle. Brown with tanned head. Smell is hoppy floral with candi sugar and caramel malty. Somewhat roasted. Taste is sweet caramel malty with candi sugar, roasted malt and hoppy floral and fruity. Taste is more like a black ipa than a crossover brown ale - ipa. Sweet with medium bitterness and low carbonation.", "Super bonne ’indian Brown ale’ avec raison, notes de café,céréales,caramel,avec une touche floral en final .Bonne amertume, très facile a boire,belle intégration des saveurs entres elles,notes de noix d’alcool et de café subtile,mais très réconfortante cette brown ale.. bon choix", "Pours cola brown with a minimal tan head. Hazelnut, coffee, roasted malt, and resinous aromas. Similiar flavors with some chocolate notes. Light to medium body. Smooth mouthfeel. Good hoppy brown ale.", "Been so long since I had this, so I had to have it again, and I’m glad I did. This is a great beer. So many layers of flavor. Chocolate, sweet sugary goodness, nutty, coffee, hops. Yum!", "12oz bottle shared. Poured a medium brown color with off white head. Very nice aroma of roasted malts, hops, and some caramels. Flavor has the bitterness if hops with the roasted malts. Solid flavor and very well balanced.", "\"for some the peet, sweet brown malt, and ipa hop flavors don’t come together, but I think it’s nice. 7% alcohol ensures the body of this beer to be a cut above your average brown ale. 5/09 - more brown sugar than i remember, and even better (fuller) body & flavor. upgrade appearance and flavor 1 point each.  one of the best browns out there.\"", "Decent brown. Had good flavors with slight nut and caramel notes. Very smooth. Deep coloring. Nothing great in scent.", "One of my absolute favorites. Great combo of happiness and rich malty flavor. Roasty, a bit nutty in the middle.", "Brown with a medium off-white head. Nutty aroma, minimal hops presence. Flavor is the same, not a lot of hops. A little coffee and chocolate.", "ポップ感があって、黒っぽい  \nよくで", "Julie says.  .  too hoppy she gives a 2.7. \n\n---Rated via Beer Buddy for iPhone", "Brown color with a ample tan head. Aroma is malty. Taste is malty sweet with a subtle hop finish.", "At Bir&Fud pub in Rome-Italy, on tap. Pours dark brown (almost black) with reddish texture and a decent and compact ivory head. Nose is definitely sweet: cappuccino, chocolate, warm milk. The mouth mirrors practically the aroma with a predominant presence of dark chocolate.", "caramel, nuts, roasty, resin, leather, alcohol, licorice, bread, clove, red, brown, clear, white foam, medium sweetness, medium bitterness, medium body, sticky, creamy, lively, average carbonation,", "355ml bottle. Pours a deep ruby chestnut, verging on black, with a large light beige head, which lasts very well and leaves good lacing. Sweet treacle and toffee notes mix with nutty malt and floral and spice hops to create the aroma. Strong grapefruit and floral hops up front are tempered by treacle sweetness, which builds into the mid-palate, where it plays nicely off savoury, nutty malt. Treacle sweetness and mild floral hops combine in the finish. A very nice brown ale, with a good balance of sweetness and hoppiness.", "Bottle to glass. Pours a very dark brown with minimal head. Aroma is very malty, with hints of raisin. Mouth is very smooth and moderately thick. Taste is sweet, malty, and very well balanced. A great brown.", "Bottle. Clear brown pour with a light frothy tan head. Lots of burnt malts, brown sugar, caramel, some exotic fruits, raisins and biscuits.", "Bottle. Pours a deep chocolate, almost black with a thin brown head. Aroma of molasses and caramel. Taste has a good brown sugar or molasses tsar with a typical IPA finish. Good diversion from your typical IPA. \n\n---Rated via Beer Buddy for iPhone", "12oz bottle. Hazy dark burgundy with a foamy tan head. Flavors are molasses, maple syrup, cocoa powder, caramel and roasted malts with nutty and herbal notes. Medium body, soft carbonation, sticky texture.", "Pours dark brown with a massive head.\r\nNose shows chocolate, toasty and nutty malt with a bit of brown sugar and treacle too. Some soft spicy hops.\r\nSimilar flavours, mainly focusing on the nutty and toasty malt. Again there’s note all that much in terms of hops, just some spicy and earthy notes. A fairly aggressive bitterness though.\r\nNice creamy carbonation.", "12 ounce bottle. Pours reddish brown with a nice beige head. Aroma of malt, caramel, fruit, and grass. Taste is malt, caramel, fruit, spice, chocolate, and grass. Superb.", "Dark brown pour with dark tank head. Strong roasted malt aroma, some chocolate aroma as well. Flavor is caramel malt, some chocolate malt too. Finish is hoppy bitter and roasted malt. As the finish fades there is a lingering roasted malt flavor. Nice beer all around.", "Bottle. Pours a dark reddy brown with a tan head. Slightly nutty, toasty, caramel aroma. Medium body, medium carbonation. Lots of toffee, hazelnut, lemon, pine, coke, light dark fruit, wood... Too much toffee going on for me, still tasty though.", "Really dark brown to black, off white small head, aroma of caramel and molasses, flavours of caramel, malts and spice, creamy body finishing with a mild bitter aftertaste, very good brown ale", "Solid. Aroma of caramel, wine, maybe a bit of cinnamon. Tastes the same with a light sour aftertaste that isn’t overwhelming. The cinnamon taste lingers. Could do without the sour but overall a great showing.", "DATE REVIEWED: August 8, 2014... GLASSWARE: Barley Creek pint... OCCASION: Watching Return of the King with a worthy beer... APPEARANCE: Wow--allows a look through its body only when held to light--glass is black as a Wraith; the head is two-fingered, off-white and thick.. AROMA: wonderfully balanced: hoppy and citric, with raisin and plum, yet toasted with biscuit... the malts predominate, with a hint of roasted nuts and caramel--intense and robust ... PALATE: thick, creamy, and rather soft in ts carbonation--that classic cola mouth feel; slightly bitter at its end ... TASTE: the aroma sets this beer’s flavor, as dense, blanketed hops give way to unsweetened chocolate and toasted rye bread--a wondrously stout yet drinkable brown, that only hints at the alcohol it wields... OVERALL: what a drink with which to welcome crisp fall nights--strong, stern and warming, yet balanced, complex and highly drinkable...another victory for Sam and the guys at DFH...", "Very nice brown ale. Hop heavy but still has a nice dose of roast. Pours mahogany with mocha head and lacing. Medium bitter finish with a light note of dark chocolate. Bottle thanks to the roommate.", "This is a beer that has such a hoppy front with the most flavor on the back. The malt character, the roastyness and all the sweet caramel and smooth flavor just really makes this a favorite of mine. \n\n---Rated via Beer Buddy for iPhone", "Bottle. Brown pour, thin off-white head. Aroma of caramel, bready yeast, spicy and brown sugar. Flavor is quite bitter, spicy and with a decent body. Well balanced. More like a Belgian Dubbel.", "Draft. Aroma is a danker hop with some dry chocolate malt. Appearance is a darker brown, with some tan lacing. Taste is a darker brown ale that ends with lots of dank hops at the end. Palate is dark and hoppy. Overall, a good beer. Will buy again and again. \n\n---Rated via Beer Buddy for iPhone", "355 ml bottle. Pours a deep brown colour with generous tan head. Aroma is molasses, coffee, roasted malts, caramel. Taste is molasses, caramel, malts. Creamy. Pretty good.", "Nice deep brown clear poor with lasting fluffy white head. Aroma of roast and mollases. Taste is bitter sweet with the mollases coming through strongly. Enjoyable beer.", "Bottle, 10C. Clear deep brown with a beige head that laces well. Aroma is malty and spicy with some figs and sultanas. Medium bodied, moderate carbonation. Fairly sweet with enough bitterness that it doesn’t seem that rich. Chocolate, sticky breadcrusts, light spices. Wholesome and harmonious.", "Pours a dark brown with a foamy, long-lasting off-white head. Aroma is sweet brown sugar and caramel. Flavor is caramel malts with a little bit of bitter hops. Quite good.", "Draft. Pours a dark brown. Aroma and taste are brown sugar, caramel, and pine.", "At cellar temperature and into a snifter. Had no idea what to expect of style so a cool temperature seemed apt. Deepest, darkest brown and opaque with a fine, tight bead and a thin pad of sandy cream atop. Big waft of cocoa and rpasted carob dominates the nose with minor licks of tangerine, cola and root beer, burnt toast and burnt, savoury raisins. Creamy mouthfeel, velvety even. Rounded, sumptuous body with a smooth finish. Chocolate malts dominate here as the nose. A tannic, dark berry note in back gives it a fruity element and then it is all dusty cocoa powder, carob and chocolate icecream in the finish. Light rust and blood, a higher, heated alcohol kick and plenty of wood and peanut husks in the aftertaste give it complexity. This is a nice brew. More Brown ale than Scotch ale and by no means showing any inkling of IPA. Great drinking though! (12fl.Oz, Bottled on 05/07/14, The Liquor Shed, Jandakot)", "12 fl. oz. bottle. Pours a dark red brown with a very thin, short lived, light brown head. Aroma of roasted malt, dark chocolate and liquorice. Sweet flavour of roasted malt, brown sugar, dark chocolate and liquorice with a bitter, hoppy finish. Full body with a creamy, oily texture and soft carbonation.", "Agree with the malty and hoppy taste. Didn't get much nose. Nice beer. Smooth on the palate.", "Favorite Dogfish Head so far. Easier to drink than an IPA but still packs a ton of (slightly sweet) flavor.", "Dogfish Head Indian Brown Ale has a very thick, crackly-sounding, beige head, a dark brown (with lighter, ruby-brown highlights), and heavy lacing left behind. The aroma is of sweet, dark bread crust, nuts, and malt. Taste is of a noticeable charred roastiness, sweet brown bread crust, some nut, licorice, and dark-roasted malt. Bitterness is there, and it increases. Mouthfeel is medium, and Dogfish Head Indian Brown Ale finishes semi-dry, not very alcoholic, and easy drinking. RJT", "Brown pour from a 12oz bottle. Slight white head. Roasted malt and slight coffee nose. Big malty beer with some big hops. Quite nice!", "Now this. This my friends is a brown ale. For me, it is right there with Bell’s which I think is about as good a brown ale as it comes.\r\nA deep rubby brown beer with a thick creamy tan head that lingers through my tasting process.\r\nSmells of sweet carmalized roasted malts, coffee and chocolate.\r\nRich roasted, burnt malt taste, sweet. Coffee essence follows and chocolate brings up the rear.\r\nNo distinct flavor in the hops.\r\nThis is a full body beer with some alcohol warming on finish.\r\nThis is an excellent fall beer that compliments both English styles very well and the autumn season itself.\r\nDrink well my friends", "Dog fish head India brown ale from rome. Dark red brown ale, decent off white head. Liquorice and earthy on the nose. Taste is surprisingly sweet with a mild bitterness.", "12 oz. bottle. Appearance: slight khaki brown head, dark brown color/ black, clear, light lacing, film persists. Aroma: roast coffee, bourbon, chocolate, molasses, floral, light fruit, grass, Palate: medium full body, average carbonation, light bitter lasting finish, oily texture. Taste: sweet malt to light fruit sweetness that lasts a bit, then into a subtle bitterness that build to mild bitterness. Overall, very smooth, very drinkable, unique and surprisingly simple.", "Bottle at the hotel in Key Wes, FL. Dark brown body with a medium offwhite head. Hops, caramel, nuts, malt, burnt sugar. Soft carbonation. Delicious \"IBA\"", "355ml bottle from Archive Beer Boutique. Rating from April 2013. Sweetness in the aroma is contrasted by some bitterness in the flavour. Well brewed malty brown ale with a boozy finish.", "355ml bottle from Saveur Biere\r\n\n\r\n\n\r\nColour like a coca cola with a light brown head. Malty aroma with some chocolate. Malty sweet flavour with chocolate, raisins and cocoa. Nice!", "Aromas of caramel, raw maple, milk chocolate, earthy hops, coffee. Clear, dark ruby-brown with a fully lasting beige head. Off-dry, maltiness upfront, savory, earthy nutty flavors, finishes with well-balanced hops. Medium bodied, with cleansing carbonation.", "Dark body, thin tan head. Very sweet aroma with raisins and molasses. Mouthfeel is really smooth. Taste is a bit hollow and there’s not much else besides a slightly bitter IPA aftertaste. It’s very drinkable though but probably better paired with some food. By itself it’s a bit of a letdown for me.", "Tap at brewery. Copper pour with a white head. Citrus, caramel, deal berries, grapefruit a and pine. A nice balance of sweetness, roast, fruitiness and ipa bitterness. A very nice beer", "Bottle from saveur-biere.com. Dark copper to brown body, with a big, creamy, beige head. Aroma of dark chocolate, nuts, caramel, roast, dark berries, citrus, some pine. Taste with about the same aromas, great balance between roasty, sweet, fruity and bitter citric notes and very smooth! Mouthfeel is medium to full, creamy, with a medium carbonation and it finishes roasty, bitter, with dark malt and citric hop notes. Tasty! A really unique brown ale, that also resembles a Black IPA a bit, because of the greatly balanced roast and citrus notes. Very smooth to drink.", "One of my favs. Aroma is brown sugar, pine, and dark fruits. Pours deep mahogany with a nice thick small head. Taste is nice and dark with roast nuts, brown sugar, sweet pine resin, and a nice bitter dark fruits. A truly nice ale.", "Dark brown in color with a mahogany head. Delicious caramel and chocolate on the nose. Great beer that could be drank again and again.", "Bottle. Color brown color with average white head. Aroma malty, roasted, caramel, licorice. Flavor sweet and bitter, caramel, coffee.", "Tap initially (rerated 01/15 from a 10/15 bottle). Pours a dark brown with a nice creamy head. Aroma is sugar, dark fruits (raisins maybe?) malts, and some hops. Flavor is a nice malty roasted sweet flavor with lots of coffee and some hops too. Flavor is hoppy but definitely pronounced maltiness Creamy kind of like a nitro beer. Awesome awesome balance. Really good, this. Similar to a black ipa. DFH does well here.", "Reviewed from notes. \r\nI’ve had this in pint glasses and a couple times in tulips. It’s always the same. \r\nThe appearance was a nice dark brown color with a decent one finger white foamy head that dissipates within about a minute and left some light semi - thick lacing in its wake. \r\nThe smell was awesome as it had a super nice allocation of the Scottish peat - like smokey/roasty malts to the engraving bittersweet citrus hops to delightfully entice my nose to partake in more whiffs to get some light roasty caramel nuttiness about it.\r\nThe taste replicates the smell pretty much exactly the same.\r\nOn the palate, this one sits about a medium. The carbonation seems appropriately made for the style and shows a decent smoothness about it.\r\nOverall, what an absolutely amazing beer - three styles in one and we’ll done. Makes me want to move back East.", "Bottle. Pours dark brown. Nose is powdered chocolate and coffee. Taste is chocolate and bitter coffee.", "I am a big fan of dogfish and they always seem to come out with good stuff! This is complex but still easy to drink!\n\n---Rated via Beer Buddy for iPhone", "Bottle pour. The bottle reviewed has a good 6 months on it, so not exactly fresh. However, the malty scotch ale notes really shine through here. Muted hops, as to be expected, but the roasted backbone is very enjoyable. Coffee and english toffee undertones with a definite sugary feel. Has a caramel note to the aroma. This is a complex, easy drinking yet eminently powerful brown ale. So much going on in here yet nothing is muddled. Would love to try this against a fresh bottle to see how the hopper element sits here but I can say that with 6 months of aging this is a delicious beer.", "Malty. Caramel, toffee and chocolate flavors blended with brown sugar and spice. Notes of dark fruits, ginger root and cinnamon. Good carbonation.", "Great ale. Flavor is a nice malty roast. Aroma is light. Smooth on the palate with a light aftertaste.", "A swell dark leathery murk with an off white head came out of the tap. A dry earthy and smokey chocolate, like raw cocoa nibs accounts for a lot of nose and taste. Everything about this beer is brown. Brown sugar, mud, burnt brownies, cigars. The kind of brown you want to take downtown and pound while making clown sounds. Loved it.", "Pours a dark cola color. Thin off-white head that goes away quickly. Aroma is malty and sugary Flavor is all over the map...malty, roasty, sugary, molasses and a nice bitter balance.", "From BA review on 2-5-12 - \r\nPoured from bottle into pint glass.\r\n\r\nAppearance – Pours a deep-brown color. Upon pouring there is a billowy tan head which forms which slowly fades over time to produce some nice lacing and a very thin persistent foam film on the top of the brew.\r\n\r\nSmell – A huge caramel aroma meets the nose. While overwhelming at first, it gives away a bit, revealing aromas of roasty malt and a bit of nuttiness and some alcohol.\r\n\r\nTaste – A semi-sweet malt flavor first hits, which seems to sweeten over time giving way to a very caramely flavor and some brown sugar. A roasted malt flavor with nice toasted nut and a little bit of of coffee flavors round out the taste, leaving a rather satisfying taste in the mouth.\r\n\r\nMouthfeel – The thicker body suits this beer quite nice. Mixed with the slightly linger carbonation it allows the brew to linger on the tongue; creating a very nice mouthfeel. \r\n\r\nOverall – This is one very nice beer. While not the most potent, the sweet maltiness mixed with the thicker mouthfeel and roasty flavor make this a great brew to sit and sip slowly over a relaxing evening.", "Bottle - Nutty flavor, malt and a little bit of hops on this one. Kind of a woody taste as well. While it does have a high alcohol content, it doesn't taste of alcohol.", "Bottle to tumbler. Pours deep red. Two finger head, nice lacing. Aroma of coffee, dark chocolate, black barley. Tastes nice bitter, with sweetness in the back. Full body, moderate carbonation, slightly creamy. Finishes candied sugar, more coffee and chocolate followed by nice long bitterness.\r\nAwesome stuff!", "Bottle (12 oz): comes in six packs. Very nice brown ale that is a regular in my frig.\n\n\r\n\r\nSmokey taste with a slight scotch finish.\r\n\r\n6/21/14: Dropped the rating slightly after a few more.  The smokey taste is sometimes almost burnt.  Coffee taste also present.", "Flaske, 355 ml. Mahognybrun. Maltet næse. Sødlig opvaskevand. Letristet malt. Brød. Chocolade. Ikke dårlig eller ublanceret, men vil alt for meget på een gang - ofte et problem med Dogfish Head. Kedelig prog-øl.", "Excellent brew. Has a sweet, malty aroma with a slight hint of hops. Great color brown that is as clear as brown can get. The flavor slowly creeps across your toungue and leaves a light bitter finish.", "Draft at Belmont Station. While I despise the IPA label being reassigned to any hoppy beer from red to brown, I am willing to forgive Dogfish Head both due to their brewing excellence and the fact that despite the ’pale’ in IPA it historically most likely resembled the blood-red brown of this beer, Carmel-colored with thick head and dark lace. Alcohol, dark berries, and earthy hops in the nose, thick and slightly-cloying mouthfeel with rich malt, alcohol esters, and back-tongue bitterness in the middle, and eatery-fruity malt and satisfying bitterness at the end, finishing in malt rather than citrus or astringent. Excellent example of a historical IPA, regardless of label.", "Brown in color. Aroma of hops and roasted malt. Interesting mix. Taste is fruity and caramel. Slightely bitter aftertaste", "Dark with slight head. Sweet aroma. Reminds me of a coffee stout. Not quite a true scotch ale, but not bad.", "Bottle shared at the daje reaches 2000 ratings session\n\r\nPours dark brown with a big tanned head. Smell of caramel, burnt sugar, some dusty hops and dark malts. Medium sweet, burnt sugar and caramel, some spices and hints of dark fruits. Moderate bitter finish. A very nice take on the brown ale style", "Americans, they have revitalized so many beers over the years, you’re forgiven if you forget to mention the Brown Ale in all the \"confusion\". A lovely brown with a brown sugar type malt, meeting loads of hops, this is so well balanced and clever, it scares me away from ever daring to try brewing myself. If I had made this, I’d named it after that most amazing of bands, Rolling Stones masterpiece, Brown Sugar.", "Pours a clear, but very dark garnet brown with a full rocky light tan head. Aroma is coffee and bitter chocolate. Taste is big but well balanced, with sweet caramel malt, coffee, chocolate, molasses and a nice hoppiness that is not too bitter. Good effort.", "Brown color with a little bit of foam. Aromas of malt, burned caramel and hazelnut. Taste of caramel, hazelnut, malt and hop bitterness. Couleur brune avec un peu de mousse. Arômes de malt, caramel brûlé et noisette. Saveurs de caramel, noisette, malt et amertume de houblon.", "Nice hoppy aroma. Dark roasty malt and caramel flavors. The big hop flavors work perfectly with the dark malts. Really great beer.", "Interesting brew, hints of alcohol on the nose, some kind of residual sweetness, lively carbonation, nice head, enjoyable brew....like", "On tap at dogfish head Smooth easy drinking brown.  \n\n---Rated via Beer Buddy for iPhone", "Bottle from Kihoskh shared with esp0r and edvard, april 26th 2014. Dark brown body with a small beige head. Aroma of burned malt, fruity hops, chocolate. Taste is light roasted with thick caramelized malt, flowery oand fruity hops, and quite high bitterness.", "Bottle from Sugaya. It pours a rich ruby brown that looks somewhat stout like in the glass butappearance wise I’d say is closer to a Belgian dark ale like a Rochefort 8 or 10. The nose is soft chocolate & toffee with a citrusy hop presence - pretty good. The beer has a medium body & a somewhat syrupy mouthfeel. The taste is quite good, roasty, cacao paste, figs, bitter coffee grinds & playing with these malt flavors are some candy sweetness & citrusy hops. Pretty good but Belgians do it better.", "This dark chocolate colored beer pours a thick tan head that lingers. It has a nutty aroma with a hint of burnt sugar. The taste is reminiscent of the same and with the rich malted barley and high IBU from the dry hops it is nutty, sweet, and bitter all at once. The alcohol is high enough that it really becomes prominent as the beer comes to room temperature, so drink this one quickly.", "Clear medium rubyish brown. Large frothy creamy tan head, partly lasting. Aroma is quite malty. Burnt roasty malty. Molasses. Nutty. Chocolate. Caramel. Coffee. Flavor is dusty cocoa mostly. Earthy hops. Medium body. Dry. Medium creamy. Lightly acidic. Mild bitterness. Roasty dry finish. Complex and still easy drinking. Puts the typical brown ale to shame.", "Sweet malt, chocolate, dark roast, dark fruit, roasty aroma. Caramel, some hops. \r\nMedium body, roast, chocolate, caramel, molasses, hops, a slight bitter finish.", "Pours brown with a dark brown head. Aroma is chocolate, nutty, and caramel. Flavor is bitter with a nice nutty chocolate finish. Great brown.", "pours cola brown with a medium tan head. aroma is malty and bready. Taste is full rich malty caramel. definite coffee notes. slight bitterness and hop presence on the finish. nice fading linger. Really good beer!", "Pint glass, brown with a finger tan head. Smells like molasses, caramel, and brown sugar. Tastes like roast nuts, molasses, and nice caramel malt. Oily, medium mouthfeel. Pretty tasty!\n\n---Rated via Beer Buddy for iPhone", "Another winner from Dogfish Head. Dark brown in color. The hops play off nicely with the caramel. Not over hopped.", "quasi scura nocciola buona schiuma discreta persistenza leggera uva buona secchezza note tostate discreto amaro alcol piuttosto nascosto", "Shared bottles over the course of month during a beer march madness bracket style tournament held by Louisville Dads Beer Club, this style buster came in 3rd of 32 beers with its hoppy aroma, beautiful color, vanilla molasses tobacco vanilla tastes and pleasant finish...as this was a secret competition, we were surprised when this was in the final 4! Well deserved...", "Bottle. Impressive overall. Hoppy aroma. Dark brown color. Very nice balance of hops and caramel. Similar to Samuel Adams Boston Ale, but with more pronounced hop flavors. Slightly bitter finish. Very drinkable; belies its relatively high ABV.", "Wow, very surprised. When they say cross between brown and scotch ale, they mean it. nice caramel, sweetness, alcohol, medium roast malts. A delight to drink.", "sweet nuts aroma,brown, brown foam, light sweetness, lightly bitter, medium body, oily feel, soft carbonation, nice nuts light bitter finish.", "Dark brown coloured. Has an off-white head, mostly lasting. Malty aroma, roasted bread and faint nutty notes. Flavor starts sweet, hazel-nuts, moderate bitter finish. Creamy texture, a bit astringent.", "12oz bottle poured into DFH signature glass. Pours a dark brown, small head that slowly disappeared, Lots of tiny bubbles rising to the top. Great aroma whatever it is, and that what ever it is is how it tastes. Its a little too cold right now but I remember drinking this on the 4th of July before the left Wisconsin for a few years ago, and I remember the taste of nuts jumped out and was delicious. I’m hoping to relive that flavor again, Not thick or thin ale, does that make it a tweener? Overall this seems like a beer you always have on hand as a go to beer when you need it, Really good.", "355 ml bottle from Tanakaya @ Mejiro. Pours dark brown with a thin beige layer of foam. Aroma is quite soft with subdued milky roast and some lenient hops. Feels surprisingly fresh actually. Taste feels hoppy, not so bitter but flavourful, mixed with roasted malts and molasses. Chocolate and nuts. Quite smooth mouthfeel, ending up in a long and dry aftertaste with a lingering roast. Nice beer, could actually drink quite a lot of it and not get tired of it.", "Nice brown color, with a light tan head. Taste of light molasses and caramel, but totally overshadowed by the floral and citrusy hops. Also a little thin on the palate. Not a bad beer, but not great.", "Bottle. Garnet with a beige head. Deep, chocolaty malt aromas. Smooth, malty and a bit tart with a chocolate finish.", "Draught at eataly, Rome. Very hoppy brown ale. Licorice and honey at nose. Cream head, persistent. Dark brown color. Molasses in mouth at first, followed and balanced by a hoppy and bitter end.", "Served on-tap, this pours a dark brown color with a slight beige head. The taste is malty like you would expect brown a brown ale but has a nice bitter bite to it.", "From 355 ml bottle. Pours a clear but deep mahogany brown with some reddish highlights at the edges and a fluffy off-white head. Aromas of caramel, leather, raisins, plums, tobacco and cocoa. Taste starts out with raisins and apple, before a rich roast bitterness in the mid-palate. Caramel, malt, smoke and chocolate at the end. Dry finish with some fruit and spice in the aftertaste. A brown ale that’s a cut above. Great stuff.", "Bière un peu trop foncé et un peu trop caramélisée a mon goût. Selon la description sur la bouteille, je m’attendais a une bière plus houblonnée. Pas mauvais, mais aurait pu être mieux", "Poured from bottle into glass at The Cellar. Served a bit too cold, but pours a rich brown, minimal head that is just off-white. Aroma is soft and malty, caramel, toast, and a touch of hops. Taste is malty with a touch of bitterness. Some caramel, biscuit, and toast.", "From YNWA bottleshop, Dk.\r\nBottled, 150214.\r\nBorwn with beige head. Aroma of malt and bread. Flavor with caramel and some dried fruit.", "3/1/14. \nWith Michelle. \nSingle bottle. \nAt my parents' house. \nI really like the actual taste of this beer but I wouldn't want to drink more than one due to the uniqueness of the overall experience. \n\n---Rated via Beer Buddy for iPhone", "This is everything a full bodied brown ale should be. Nice sweet roasty taste with a roasty but clean finish. Heavy mouthfeel and nice dark color. Almost Perfect.", "Very nice toasty brew very well balanced. Toast and hoppyness make this a nice go to beer.", "Bottle. Very nice dark Brown Body with tan head. Aroma is slightly roasted malts caramel coffee. Taste is caramel cocoa and some malts. Aftertaste is slightly bitter. Very nice one.", "Dunkelbraunes Bier mit geringer Schaumkrone. Geruch nach Kaffee, Karamell. Geschmack sehr röstmalzig, Kaffee, leicht bitterer Abgang.", "Btl pours clear dark reddish brown,with a tan pillowy head. Lingers forever leaving wicked lace on glass. Smells of roasted malt,molasses,raisins,earthy spices,a hint of brown sugar,piney hops with a faint wisp of alcohol.Tastes of sweet caramel malt,latte, chocolate covered raisins,coffee,a little booze and a mild citrus flavor.Medium body, smooth creamy texture, nice,soft carbonation, mild hop bitterness and dry finish. Fantastic brown ale with complex flavors that keep your tongue busy. This is not an average brown. A unique and interesting take on the style, the different malts and sugar meld perfectly with the hops producing a highly drinkable beverage. I like browns and this is one of my favorites.", "(Bottle 22 /02-2014) Low beige head, dark brown color, caramel aroma, soft co2, fit body, rather smooth taste. Bottled 06/08/13.", "This beer is not my ’cup of beer (??!!??)’ ; however, I can still tell that it is a quality brew and those that like this style will love it. It’s very aromatic (I didn’t realize it had an ABV of 7.2 but I guess that’s a selling point), and highly reminiscent of an IPA (I hate IPAs so that explains my skewed rating for which I apologize). Still it has a nice medium body, aspects of coffee and chocolate, and (because it is IPA-like) becomes bitter almost immediately. That intensifies and continues throughout the sip. I think 50 IBUs is 100% higher than my cut-off. Enjoy pale ale drinkers !", "Bottle. At THE Hotel. Sweet roasted malts and brown sugar on the nose. Sweet throughout with some bitter notes in the long dry finish: medium mouth with slightly soft carbonation. Interesting twist on the traditional brown.", "Bottle @ Aarhus tasting. Clear dark reddish brown with an off-white head. Aroma is sweet, malty, caramel, dark fruit and chocolate. Flavor is quite sweet and rather bitter. Dry and rather bitter finish. 050214", "Bottle, 7.2%. Dark brown with small beige head. Aroma is malt, caramel, chocolate, little nut and hop. Flavour is malt, caramel, nuts, chocolare, medium sweet, hop and a little bitter.", "Bottle @ Christers. Pours dark brown with a creamy light brown head. Aroma of roasted malt, caramel, coffee, little hops. Flavor is malty, chocolate, caramel, little dark fruit, little hops. Medium body, lively carbonation. 050214", "Bottle. Nice head with good duration. Color is brown. Aroma and taste are caramel, nuts, roast malt, bitter hops, little flowers and has a bitter finish.", "Draft. Sugar and slight hop in the nose. Bitter burnt sugar and a bit of hop bitterness is most prevalent to me . Not bad.", "Pen & Paper Log (Feb 2011)\r\n\r\nAroma - is sweet, full of raisin, caramel, dark malts, and roast.\r\nAppearance - The body is dark brown with minimal head\r\nTaste - the taste is very rich with caramel malt at the same time it’s hoppy. Rich sugar is also prominent. Alcohol is also evident\r\nPalate - the body is medium to heavy, the texture sticky, the carbonation soft, the finish is full of alcohol and sweetness but also bitterness.\r\n\r\nToo strange to me. Kind of like a Scotch Ale or a Doppelbock, both styles I’m not a big fan of.", "12oz bottle bottled 09/27/13\r\nPours a deep bronze body, slight clarity, holds a beige head.\r\nQuite a pungent aroma; treacle, dark brown sugar, wholemeal bread dough, roast malt huskiness, chocolate, touch of espresso even.\r\nFull bodied yet much leaner than abv would suggest. Reasonably lively carbonation.\r\nPalate continues with dry burnt caramel notes, husky chocolate malt graininess, bit of spiciness (rye?), hint of hop citrus. Moderate bitterness to finish, lingering husky maltiness.\r\nPretty tasty malty ale. Really don’t realise how strong it is until the bottle is finished..", "Looks like a porter. Nice head that dissipates to a ring around the glass. Nutty, syrup malts, slight bitter hop on the nose. Kinda tastes like a sweet porter to me. A pretty good beer.", "Clear brown pour. Chocolate coffee and nut aroma, with a bit of hops too. Taste is coffee and nut, with bitter and very dry hop finish. Gets better as it warms, a bit sweeter too, making it more scotch ale-like. Solid.", "Opaque cola red-black with barely any head or lacing. Smells of raisin, nuts, coffee, burnt malt, a little sour. Taste is same as aroma plus hoppiness, which is nice. Ends on sharp dry note. Body had a little bit of slickness but still crisp. Good brown ale. Definitely wouldn't mind having again but wouldn't rush out to get it either.", "Pours a foamy deep reddish brown with a thin lasting head, malt aroma with a hint of nut. Coffee and burnt caramel flavor on the back of the palette, I really like it.", "Bottle. Frothy off-white good mostly deminishing head. Dark red amber. Moderate malty and hoppy aroma, Burned plastic notes. Moderate bitter harsh not pleasent flavor. Moderate bitter average finish. Oily palate. Big disapointment.", "Smooth and very pleasant to taste, it lacks a bit of power, a peak somewhere during the sip or right afterwards. Perfect body, right appearance.", "Bottle from Gendarmenmarkt Berlin. Brown, coarsely foam, with an almost black, ember color.\r\n\r\nBitter chocolate, burned malts, toffee, almost stoutlike aromas. \r\n\r\nMalty beginning, hints of sweet toffee soon overwhelmed by a more breadish taste of malt going along with a sligthly sweetened chocolate. Hoppy bitterness brings in even more complexity, goes well along with the upcoming coffee flavor. Kicks in late, gives the malt aromas much time to develop. Bitterness adds a floral taste to the beer, which pairs up well with the malty body which dominates throughout.\r\nCoffee aftertaste is very present, staying long on the tongue. Surprisingly it isn’t very bitter, but leaving a smooth dry mouthfeel.\r\nThis is a very interesting and enjoyable beer, reminds me somehow of the \"Schumacher 1838er\", while being a little more aggressive on the hops.", "This is about as good as a brown ale gets in my opinion, complexity along with a smooth delivery great scent and looks its part as a brown ale, I have a feeling I will drink this a few more times :)", "Opened the bottle and the smell of it bursts with caramelized sugar and malt. Tastes sweet but malted and balanced with a crisp hop bite in the front but mid and finish go down smooth like a brown ale. Caramel finish doesnt last long but it is easy drinkin", "355 ml. bottle. Dark brown colour with an uneven, bubbly, tanned head. Sweet and fruity aroma with caramel, toast, resin, grass, citrus, faint liquorice and coffee. Taste is sweet. Medium body with a creamy texture and a soft carbonation. Finishes roasted with a heavy malt presence. An interesting fusion of styles.", "I really like Brown Ales and IPA’s, so I thought, \"This should be good\". Not sure what to think now I am drinking it. Some sweet, charred, hops and other aromas I cannot place. Poured nice, dark with very little off white head. Starts crisp, slightly sweet, charred malt, smoke and ends with a charred, bitter hop, heavy taste. I do like it", "Dark brown body, medium sized light tan head, spotty lacing. Roast, raisin, caramel, nuts, earthy hops, a bit metallic. Medium bodied, carbonation is a bit rough, lingering finish.", "Looks like just another brown ale but packs a nice hop punch to balance the sweet and malt notes.", "Pours dark brown with a thinner khaki head that settles to a ring and leaves some spotty lace. Nose involves nutty chocolate, perfumey herbal hops, some woodsy notes, refreshing floral notes. Quite sweet, fairly bitter. Medium body, fair action, a touch oily, a bit creamy, with a lingering bitter finish. A nice brew, crisp, plenty flavorful yet drinkable.", "Pretty good, almost a porter with its roastiness and coffee aroma but also very typically hopped in true DFH style. I don't usually drink browns but I enjoyed this one. \n\n---Rated via Beer Buddy for iPhone", "Two finger thick brown head black beer. Smell is sweet and metallic. Taste is bitter molasses and espresso. Mouthfeel is smooth with medium carbonation. Overall good but maybe not for me.", "Bottle at cafe tu tu tango, orlando. Clear dark reddsih brown color, smooth beige head. Aroma is roasty, caramel, honey, some coffee. Nice balanced body, roasty, sweet, caramels, suryp. Excellent.", "A nice smokey flavored brown ale from dogfish head. Very bitter an has a nice coffee flavor. Pours a dark brown. Had this at Mott Gaels \n\n---Rated via Beer Buddy for iPhone", "Soapy aroma. Clear brownish pour with a tannish head. Nutty taste. Effervescent mouth feel.", "Bottle. Poured medium brown with thin beige film. Light med carb med bod. Light hop aroma. Nutty malty resin taste. Bleh.", "Brown in color, roasty and hoppy aroma. This beer is full of flavor, caramel and malt and a hops. A very good brown ale, on the hoppier side but not bitter. Medium to light body. Very drinkable\n\n---Rated via Beer Buddy for iPhone", "Dark brown beer with a two-finger beige head that slowly subsides into a thin surface film. Subtle, but pleasant nose of salted nuts, light brown sugar, and a touch of sour yeast. Flavor is much bolder than the aroma with a rich nutty malt explosion up front followed by roasted coffee, semi-sweet chocolate, and leather, which then finishes with a light bitterness that lingers on the palette. This is a flavorful beer with much of the flavors I look for in a brown ale, although it lacks the bit of sweetness that would put it over the top. Still, something I would definitely drink again.", "Drank straight from bottle..nice aroma of nuts, brown sugar..tasted dry but with some bitterness..not bad, but probably wouldn’t buy again.", "12oz bottle at Stark's. Pours a reddy brown color with a bit of head. Full malt flavor and a large hoppiness.", "Pours a dark black with brown head. Has a faint aroma of light malt and some coffee. Taste is a mix of apices, malt, coffee and chocolate with some espresso aftertaste.", "Poured from 12oz bottle, pours a clear dark brown with a red hue and a light brown head, some lacing in the glass, aroma has quite a bit of sweetness on the front end with a little bit of a hop kick, flavor has a nutty and caramel front end with a sweet finish of chocolate, the coffee comes through as well, quite a bit going on, nice mouthfeel, not bad.", "Bottled 12/07/2010\r\n\r\nA: Pours out a ruddy brown with a single finger of tan head. This falls to form a sheet of the same over an ale with excellent clarity where light penetrates. Spotty lacing.\r\n\r\nS: cocoa, soil, hazelnuts, roast malts. There is a hint of astringency on the nose. Fairly earthy in general as a beer.\r\n\r\nT: Nice and roasted coffee and cocoa tones on a malty base layer. Plenty of dusty, woody flavors. I really like the flavor on this one. Finish is long and strong in the coffee flavors.\r\n\r\nM: Medium to thin with lo carb. Wish there was a little more body here. Finish is dry on mouth watering.\r\n\r\nO: Good beer. I can see why so many people have reviewed this beer so well. Although I’m not a big brown ale fan, I feel strongly I will pick this up again.\r\n\r\nServing type: bottle\r\n\r\n07-07-2011", "On tap @ Battle N’ Rum, NYC. Clear but deep dark brown in the glass and it has a nice light lacing beige dense top. Really nice chocolaty sweet aroma with burned cocoa, chocolate paper, soft grass and a swift of vanilla ice cream. Not bad at all. Really round, somewhat sweet and really tasty flavors. It’s soft oily on the mouthfeel and just below average on the carbonation. Sweet chocolate, sweet cocoa, some faint instant coffee hints and a little bit of that vanilla. Nice stuff. 11.06.2013", "12oz beer. What a classic beer. Unfiltered deep brown body. Big rich brown malt, sugary and bold. This is maybe the quintessential American Brown Ale. Robust and big, quality ingredients shine. Malty and restrained like a big Scotch Ale, but hoppy enough to be something different. Ahead of its time. Well done.", "Pours a very dark but clear brown with a brown head. Aroma is malt, caramel, roastiness, licorice with some hints of chocolate and coffee. Taste is high sweet leading to a sweet and hoppy and roasty finish. Great brown.", "Hmmm. Tried again to rate for the first time, was one of my very first craft beers. Poured from 12oz bottle, a little light gets through showing the reddish brown color. Half finger of foam. Did not care for the aroma...it has a roasty note that I can’t quite place. The beer starts like a winter seasonal or porter, but thins out and finishes with a hint of cherry. Easy to drink, but not at the top of my list.", "Love the deep red tone & clear pour. Very complex in both smell & taste. Very caramelized flavors. Easy to pick out the ginger & molasses tones of the flavor. Super excited to have it DogFish Head back in WI!!", "Very dark reddish color. Malty hop caramel smell. Bitter taste. Little citrusy on the back end. Malted caramel on the front. This is my first Dogfish Head. So far good.", "Dark brown, cola coloured pour with a thin light tan head. Brown sugar, coffee and roasted malt on the nose. Taste is roasty, burnt sugar, coffee and chocolate, with nice bitterness cutting through all that at the end.", "Hands down this is my favorite brown ale. Tastes great and even goes well with buttered popcorn and a movie.", "Bottle. Pours clear brown with a decent beige white head that diminishes quickly leaving only a little lace. Aroma is caramel and molasses. Medium sweet and lightly bitter. Average to light carbonation, light body, thin texture and a smooth balanced finish. Quite nice.", "Dark brown pour with a red background color. Tan head that quickly faded. Roasted malts with a coffee background. Taste reminds me of drinking a light porter. Very easy drinker, great beer.", "Dark brown body with beige thick creamy head. Aroma is roasted malts, cacao, vanilla, grass. Palate is soft, little oily and full.bodied. Carbonation is soft and mouthful. Taste has distinct roasty malty taste, with cacao, chocolate and and fruity hops twinkling in there in between. Finish has a milky coffee like consistency. Very interesting ale, and has many flavors that you wouldn’t expect in one ale. Enjoyable.", "Poured a very dark brown colour, nearly like porter except it has a red tint when back lit. Light beige head is one- to two-finger thick and foamy. Retains poorly with curtain lacing. Carbonation low to moderate with small bubbles. Aroma strongly of coffee with a trace of subtle sweet caramel. Taste initially of sweet sugary caramel followed by roasted grain - taste not follow aroma. Medium body. Finished a bit sweet followed by coffee bitterness. Grows on you as you taste more of it. Very nice.", "Nice mild choclatey malting with a good effervescence. Some high fruit notes that go into a mild hoppiness mixed with burnt notes. \n\n---Rated via Beer Buddy for iPhone", "Dark brown, almost black pour with thin beige head and lots of dense, creamy lacing. Creamy mouthfeel, average to low carbonation, clean finish. Nose is ferrous, chocolate, molasses, and smooth roasted malts, very smooth. Very smooth balanced flavor: roasted malts, woodsy bonfire and chocolate, licorice and floral hops. Nice brown ale.", "Good beer, hops come through well, I get flavors of coffee and chocolate. medium light body, well done.", "Nice, dark brown color. Slight hop aroma, but a nice malty flavor. Molasses, raisiny, maybe some darker sugar.", "Exceptionally delicious. Probably the best Brown Ale I have ever had, and I’ve had a few.", "Bottle to glass. Pours a deep brown to black color with a thin light brown head. Aroma is full of roasted malts and nutty characteristics. Flavor is about the same, with lots of toasted malts and light nutty sweetness. Medium in body with a lingering nutty toastiness. Phenomenal brown!", "Nice beer. Looks good, appearance is ok and nice flavours. Good balance and mouthfeel.", "12oz bottle. Pours a clear dark crimson with a two finger beige head. Strong coffee notes on the nose, with molasses, resinous hops, and a faint smell of caramel. The taste also reflects the coffee notes, light cocoa, and molasses up front, with a nice whack of roasted malt in the middle with a plentiful dose of resinous hops, and light citrus notes. Fantastic stuff.", "Dark brew with no head. Smells of roasted malts, alcohol, and freshly dug dirt. Taste is kinda smokey, coffee, earth, bitter, dry, herbal. Too much going on with this to be really enjoyable. It’s like a brown ale gone wrong. That is why I normally don’t waste my money on the overpriced Dogfish but this was a sampler that had been marked down so figured why not. Well now I remember why not to buy Dogfish odd mixes..", "Malty and hoppy. Boring. \n \n B. \n\n\n---Rated via Beer Buddy for iPhone", "FROM NOTES; July 1, ’12\r\nPoured into a snazzy DFH pint. \r\n\r\nA: Not much of a hop profile on the nose, but an interesting combination of dark malts and dark fruits. Some coffee notes with a Lilliputian bitter cocoa note. \r\nA: Pours a crisp dark brown with a tan head that fades into some nice lacing. \r\nT: This beer is very complex. There are chocolate notes, but it is not a sweet beer. It’s a bitter beer, but not over-whelming due to the progression of the hop profile. The finish is a malty/creamy finish. \r\nP: Very creamy with just a bit of hops for this smooth, medium bodied beer.\r\nO: A fantastic brown, its’ complexity keeps the palette guessing while maintaining a nice balance throughout. No one taste dominates another too harshly but tumbles in some sort of complementary way that makes this a beer worth having.", "A: Strong malt note followed by a hop note. \r\nA: looks good. pour is a little thin. Head is creamy light tan. In the glass it looks thin dark brown. \r\nT: Hits with some medium hop flavor which builds into the middle. Finish is malty with a hint of chocolate. Very nice. Flavors clash a little in the front but develop well. Unique. A little thin. \r\nP: A little clash of flavors at the start. Body is light and thin. Finish is good. \r\n\r\nOverall this is a solid beer and it is decently unique. Fun play between hops and malt. Drinks almost like a pale ale but has a chocolate finish.", "Bottled. Pours deep brown with a large, lacing head. Aroma of slightly roasted malt, chocolate and vanilla notes. Sweet flavor that ends up more dry and slightly bitter. Medium bodied, oily text. nd soft carb. An excellent brown.", "Bottle. Thanks to the mother-in-law. Pours deep brown chestnut with a large, creamy, beige head. Aroma has caramel, toasted, citrus, hazelnuts, apricot. Medium carbonation, nice dry and creamy mouthfeel. Flavour has nice caramel, chocolate, hazelnuts. Loads of good citrussy bitterness. Very well balanced.", "12 oz. bottle. It pours a nice dark brown color with a tan head. The aroma is pretty intense with pleasant toasty malts, a little coffee and cocoa and mild notes of raisin in the background. The flavor is really intense with a rich dark fruity thing up front…raisins, plum and then it settles in to a more roasted malt profile with coffee and tobacco. Lots of tobacco in the finish. This was way different than I expected. I’m not getting a whole lot of hops in this one. To me, it’s more of a cross between a strong Scotch Ale and an Imperial Brown Ale. Unique beer and pretty tasty.", "Like most India Ales, this is overbalanced by the hops. The caramelized malt is well done, but the aftertaste leaves a sticky taste, not very pleasant. Good color and aroma, but the taste is somewhat cloying.", "Chestnut coloured with a deep red tinge, medium brownish head. Aroma: Nuts, caramel, melanoids, toffee and biscuit. full bodied and fizzy with refreshing flavors of red fruits with a hoppy finish and a good bitterness and balanced sweetness.", "Caramelized, roasted malts, toasted bread and nuts. Dark red brown, clear w beige head. Same as in aroma. Dried dark fruits. Not any aroma hops as I’d expected, but a nice dark brown tending to a porter.", "Aroma: Caramel. liqurice, coffee, nuts. The beer has a flavour which is burned. The palate is thick and creamy", "With Generous amounts of caramel, liqourice and roasted nuts this bery dark brown ale could just as will qualify as a porter.\n\n---Rated via Beer Buddy for iPhone", "Great and very balanced brown ale. Caramel, chocolate and smoky notes. The aftertaste is long and delightful.", "En Brown ale der balancerer meget tæt på grænsen af en porter. Fortrinlige brændte noter i duften og en dejlig kompleks smag, hvor også bitterhumlen træder frem.", "@ Ölprovning i Klippan 18/10. Tycker doften är ganska tunn, men det finns karamell där. Även smaken är lite tunn, det man hittar mest är karamellmalt och brunt socker, vilket gör den för söt för min smak. Tycker inte alls den är så välhumlad som man skriver att den ska vara.", "Caramel aroma, rich molasses and hops, frothy brown head, gorgeous deep brown color. This is a fantastic brown ale.", "An ’expansive’ brew. If you can’t decide between another IPA or another porter/stout - try one of these. It’s a refreshing difference.", "Bottle from Kihoskh, Copenhagen. Clear deep amber beer with a nice beige head. Malty caramel and chocolate aroma, cocoa powder, vanilla notes, roasted, toffee, hop notes. Hoppy roasted flavor, caramel, chocolate, cream notes, grassy hops, floral, cocoa powder, some licorice. Full bodied snd really tasty.", "Bottle @ Kihoskh, Copenhagen. Pours dark brown with a small creamy head. Roast, caramel, fruit and a hoppy finish. Chewy malty - nuts and caramel. Tasty!", "Oh wow. I know a LOT of people appreciate this brew, but boy is it not to my liking. It has a boozy, caramel/maple candy thing going on that I’m just not digging. Sorry, Dogfish, not buying this one again.", "Sample @ GABF 13. Pours a dark brown beer with a small, off white head on top. Aroma of coffee, roasted malts, toffee. Flavour is quite bitter and roasted. Very dry mouthfeel. Medium long, sweet aftertaste. Very dry finish as well. Nice brew.", "Flaske> Brunr’d klar oel med et taetsiddende skumhoved. Duften er karamelmalt med en diskret surhed og en del humle. Smagen er behagelig typisk amerikansk humlet brown ale. Rigtig god og solid oel.", "Doftar något. Bra brown. Length of toast. För besk för mig dock. På SBWF 2013", "Pours coca cola brown with low off white head\nAromas of pilsner malts, lager yrast, german sausage, barnyard\nTaste has caramel, peated malts, german sausage\n\n\n---Rated via Beer Buddy for iPhone", "Pours dark brown with a tan head. Aroma is rye bread, honey, cloves, cane sugar. Taste is honey, cane sugar, caramel, rye bread, cloves. \n\n---Rated via Beer Buddy for iPhone", "Tasted from bottle. Pours a very dark brown with off white head. Aroma is a pretty robust caramel and some notes of chocolate. At first taste you are hit with a pretty sweet caramel taste. Then you start to get some bitterness but not overpowering. I didn't get much hops aroma but they are definitely there. It's very balanced. Medium bodied. I really like this brown ale. It's very complex for a brown. I say well done. \n\n---Rated via Beer Buddy for iPhone", "This beer is really different, the color is great and the taste outstanding! I have always been a fan of brown ale but this puts the others to shame. Although it tastes sort of like a cross-over type beer because of it’s relation to IPA and others, I find the creativity used here to be wonderful. And as always 7.1% gets the bonus points. Enjoy!", "I love this beer. Not over the top with hops like the IPAs. Wonderful caramel/, coffee flavor that finishes without bitterness on the palate.", "Pours a deep brown color with a light tan head that never seems to disappear. Smells of roasted caramel, sweet and sugary. It tastes slightly like chocolate with an earthy base to it, Im guessing from all the hops. As with any hoppy beer, the flavor hangs around for awhile giving you a nice long taste. Not a bad beer, actually well crafted, just not one of my favorites.", "Pours a beautiful chocolate color. Aroma of brown sugar, coffee, chocolate, nuts and hop fragrances. Tastes sweet with creamy caramel and maple syrup malt tones, and bitter bite from grassy hops. Palate is silky, medium bodied.", "12 oz Bottle. The beer pours to an almost black color with a medium dark tan head. The aroma has a strong coffee caramel smell to it. The taste has a heavy taste to it with a strong malt backbone. Overall a very interesting brown ale.", "12 oz bottle into a pint glass.\r\n\r\nA: Pours a very dark chestnut color. The head is a two finger mocha shade. It has a wonderfully soft texture, and as it fades away, leaves behind plenty of lacing on the glass.\r\n\r\nS: I don’t really pick up a ton of hops...at first. There’s a pleasant wave of brown sugar, nuts, and chocolate at first. Hops build up as it unravels in the glass, revealing both piny and herbal qualities. Maybe even a touch of mint. I must say, the hops are VERY well integrated within the maltier aspects of the aroma.\r\n\r\nT: Aye...this is a bit of a letdown next to the nose. Subdued hops open this up - providing notes of grapefruit, mint, and pine - and roll all the way to the back end, being propped up by caramel, toffee, brown sugar, and faint chocolate. This malt backbone builds up on the finish, slowly but gradually. My problem here is that it seems like a cross between a boring IPA and a boring brown ale - it hybridizes the two styles well enough, but comes off blandly. When people rag on ’balanced’ brews, this is exactly what they’d rag on. Actually, come to think of it, since it’s too sweet, that would make it imbalanced...\r\n\r\nM: It finishes rather sweet, and unfortunately, the hops don’t really dry it out as much as I’d like. Even worse, it lacks the creaminess I like out of most sweetish brews. For that reason, it’s hard to drink. On the plus side, there’s no remote hint of harshness in the feel.\r\n\r\nO: It’s not a bad beer. Nor is it interesting, complex, or subtly executed. Basically this is just another average brown ale, only with a hint of hops. I say it’s well worth a try for those who like this style, but I won’t be back for this one.", "(bottle) pours a clear ruby-brown colour with a frothy off-white head. aroma of heavy liquorice, brown sugar, caramel, roasted malts and a hint of dark chocolate. flavour is mostly the same, grainy roasted malts, chocolate and bread crusts, slightly acrid, with a hint of alcohol and paint thinner in the light-bitter finish. medium to heavy-bodied with average carbonation.", "Good one. Aromas of roasted malts with a hops floral essence in the background. Pours a chocolate brown with an off-white head. Palate has average weight and is a little creamy. Average carbonation. Good blend of flavors and falls in line with the description of a brown ale with an IPA twist. Bitterness is just enough to not distract and leave it as a roasted and malty brown ale.", "Pours brown ruby with a foamy light tan head. Aroma is an unusual mix of cocoa-coffee and hops. Taste is caramel and coffee malt with a hoppy undercurrent. Finish is dry with both sweetness and bitterness. More complex than your average brown ale but I am ambivalent about the hop-touch. Still, a quality beer that I enjoyed. \n\n---Rated via Beer Buddy for iPhone", "Bottle sample at tasting at Beer&Beyond shop. Pours deep brown with a small beige head. Aroma - caramel, licorice, roasted malts, floral notes. Taste - sweetish, dried fruits, dark chocolate, medium bitterness, alcohol is well hidden. Medium-bodied, smooth on palate. Nice.", "This is a very hoppy brown ale. The combo of malt and hippiness just doesn't work for me. I like hops. And I like brown ales. But the mix here seems off.", "Bottle. Dark brown oily pour. Malt chocolate coffee aroma and flavor. Has a nice mouth feel to it. Very solid brown.", "Bottle. Second beer from this brewery and again I am not surprised to find it lives up to expectations. Pours a slick black body with a thin brown head, malty & mocha aroma, grainy choco taste upfront developing to a sugary and caramel finish and coffee like taste on the back of the tongue. Very tasty, didn’t know what to expect with this beer but as a brown ale I find it very interesting with its porter/stout feeling to it. This was the second of two bottles of Dogfish Head I could get in the UK, a great beer to finish on! Very grateful to have gotten them, looking forward to try some more when I get stateside!", "Bottle. Deeeep black pour with a coffee colored head. Burnt sugar, coffee, earthy hops, slight pine, and chocolate scents are wafting in my nostrils. This thing is smooth! Caramel, smooth roasty malts, lingering hops, and a full finish make this a delight. Bring on some more", "Cola brown with a thick, light tan head.\r\nBarley malt, nutty aroma.\r\nTaste is mild coffee, caramel malt.\r\nChocolate...\r\nCreamy, smooth.....a little spice.\r\nExcellent..", "Nice balance of sweet and bitter at the beginning. Tastes of coffee, molasses, toasted caramel, nice and rich. Medium body with soft carbonation. Finishes with a dark chocolate bitterness that fades nice. Extreme brown ale that is outstanding.", "Appearance: opaque brown color with tan head which is extremely dense, the head stays intact\nAroma: Carmel, coffee\nTaste: Carmel, coffee, vanilla, complex\nPalette: bitterness, medium heavy body \nOverall: this reminds me of a stout, it is refreshing and the flavors balance well, it is very different what I expected but am pleasantly surprised \n\n---Rated via Beer Buddy for iPhone", "Had a pint on tap at Alexandria’s. Solid, if a little on the malty side for me. Very nice acidic lift, refreshing. Nice hop presence.", "Appearance: has a very deep amber color that makes it almost opaque except when held up to bright light, looks clear though, pours with a very big tan head that settles into a pretty dense head\r\n\r\nAroma: chocolate, coffee, cereal maybe, roasty\r\n\r\nTaste: coffee, plum, some hops hidden in there, \r\n\r\nPalate: soft c02, heavy mouthfeel, hoppy and coffee aftertaste that isnt real pleasant\r\n\r\nOverall: I’m let down with this beer, the coffee is too overpowering, bad aftertaste", "Dark brown, mild lacing. Malty chocolate aroma and maybe some dark fruit. Taste like a chocolate covered raisan. Very good start to finish. Complex multiple layers off goodness. Very good.", "Pours a veey dark brown with a light tan head that disipates leaving little lacing. Aroma very similar to a stout with malt roasted barley notes. Flavors of the roasted malt, very similar to a scotch ale. Leaves a roasted malt/barley flavor on the tounge. An excellent entey from a great brewer.", "Mild malt body. Opaque dark chocolate color. Coffee notes. Mild hoppiness. Brown sugar?", "Rich, deep molasses aroma with hints of toffee and brown sugar. Almost ebony, with a tan head that holds well. Nice balance of sweet and bitter at the beginning. Tastes of coffee, molasses, toasted caramel, nice and rich. Medium body with soft carbonation. Finishes with a dark chocolate bitterness that fades nice. Extreme brown ale that is outstanding.", "Had from bottle at Bilco's in Napa, CA. Poured with a nice creamy head. Aroma is subtle, with nuts and vanilla in the smell. Taste starts with a bit of hops followed by hazelnut and milk chocolate flavors. Finishes soft. A very enjoyable brown.\n\n---Rated via Beer Buddy for iPhone", "Pours deep mahogany, full finger thick creamy tan head. Aroma is earthy, floral hop, roast, biscuit, caramel. Taste very slight bitter floral hop, big roast flavor, slight sweet caramel. Mouth feel is medium, higher carbonation, balanced finish leans slightly on the dry side. Overall very good beer, lots of flavor, all balanced, would like a little less carbonation.", "Very tasty. Nice robust beer. Dark with a lot of coffee and chocolate flavor. Thick head, not long lasting. Lingering bitter finish. Great body. Nice mouth feel", "(Bottle): Pours a deep dark brown with a sparse ring of tan head. Powerful aromas of heavily roasted malt, coffee, dark chocolate and nuts. Big hop bite is balanced incredibly well with really roasty malt and some mocca/coffee notes. Caramel bouncing around there too. Really powerful and complex but balanced very well. Top notch.", "Bottle. Pours dark brown with toffee colored head. Aroma of nuts and caramel. Taste mixed nuts and malts.", "Pours a deep brown with a thin, tan head. Aromas of caramel and heavy roasted malts. This beer is nutted up. Has an earthy hop character with the malty sweetness coming through in the clutch. I can dig it.", "Bottle at Patrick’s mansion with Taylor Patrick Scott and John-Michael. Pours dark brown. Black with bright white head that stays. Aroma of rich nuts carmel cotton candy. Taste is amber clean tang nuts. Finish is quick and nice.", "Dark brown color with a thin head. Nutty aroma and lots of roast. Really nice creamy mouth. Long bitter chocolate finish. Good roast content. Very nicely balanced.", "Bottle: black with a caramel colored head. Noe of dried stone fruit. Toasty & tart in close succession. Medium bodied with fizz. The toasty notes linger through a dry finish. ~m\n\n--RaucusBacchus", "Pours reddish dark brown, nose issues a powerful aroma of molasses and raisinettes, plenty of lively carbonation, deep middle-palate, and a refreshing bittering hops finish. This is an outstanding New World treatment of the brown ale style, especially to a palate raised on Newcastle brown ale.", "Aroma is of caramel and roasted malt. Appearance is a deep dark ruby/brown. Taste is a sweet caramel, fruity, strong alcohol presence. Hoppy and nutty aftertaste. \n\n---Rated via Beer Buddy", "Excellent dark brown ale. Notes of coffee and brown sugar make this a special brew. Pours a great, thick head. \n\n---Rated via Beer Buddy for iPhone", "Black Forrest cake dipped in coffee. Malty and sweet with caramel undertones...sticky but bitter...the malt tours your palate and then heads to another destination...some cabin in the woods adorned with candy and gingerbread...beware.\n\n---Rated via Beer Buddy for iPhone", "Pours a very dark ruby brown color with a short, tan, creamy head. Coffee and lactose on the nose. Lightly creamy and smooth mouthfeel with just a touch of a carbonation and hop burn. Coffee, cherry, and roasted malts flavors slide through the palate on lactose. Very drinkable brown.", "Not sure how you can call this a brown ale, its way to complex and interesting to be a brown ale! I think of it more as a hoppy scottish ale, and its one of the best around. Crisp but creamy hazelnut coffee with sweet brown sugar and salty hops. Every beer nerd already has their opinion about it, so it wont try and make a general pronoucement to sway people.", "Pours a dark brown with a thin head that quickly dissipates. Smells of faint molasses and coffee. Taste is coffee oriented, not so hoppy. Bubbly mouthfeel. Average beer", "Thanks cards04 for this one. Dark brown body with off white head. Roasted malt aroma. Initially a predomanently roasted malt and coffee aroma, then some interesting hoppy bitterness and sweetness here. Quality.", "Fantastic caramel and chocolate flavor, balanced perfectly with slight hop flavor. Lots of flavor and satisfies the hop lovers and malt lovers.", "Great looking deep dark brown body, nice looking tan head that doesn’t sit around for too long. Immediate to the nose is chocolate, then some coffee, toasted nuts, maybe a little dark fruit and pumpernickel bread. Taste is very much cocoa with some hop bitterness and maybe just a little alcohol. Overall, very nice beer, but almost resembles more of a porter to me.", "Tap. Murky brown with a toasted malt flavor. Medium bitterness with a mild aftertaste. Tasted a little burned. Ok, but not great.", "Surprise! It’s a deep brown color with a small, but noticeable amount of lacing in the head. Nose is lightly roasted, sweet maltiness. Definitely some brown sugar in there. Some hoppiness in the nose, but not of the three c’s variety or as much of them if there are. Taste is way more roasty than I had imagined. Good balance of bitterness with the malty toast. The brown sugar is very apparent, but not too sweet. Flavor lingers long after. Not sure if I am fond of this style in general, but on paper it has all the characteristics I would like.", "18.06.2013, tap @ Blind Tiger Ale House NY:\n\r\nNice creamy mediumlasting head. Aroma is slightly roasted, dark malts, puffed rice, coffee, chocolate, burnt caramel, unripe banana, grass. Taste is roasted dark malts, coffee, hops, burnt caramel, grass, puffed rice, pine needles. Longlasting bitterness, dry mouthfeel. Fair enough, not a favorite.", "12 oz. bottle. Pours a deep dark brown with a nice tan head and pretty good lacing. Looks a lot like a porter. Smell is malt, sugar, caramel, roasted nuts and hops. Flavor is intense roastiness, honey, sweet caramel that fades into a pleasant hop after bite. The flavors hide the above average ABV very well. Wasn’t too big of a brown ale fan until I tasted this one and the Palo Santo. Definitely widened my palate for brown ales considerably. These guys really put out phenomenal beer.", "Pour is very dark brown with tan head with the odor of chocolate and roasted malts. Taste has the same notes with with citrus and a slight espresso note. Very tasty brew and the 7.2% is a nice bonus also.", "Pours a dark brown. White head with nice lacing. aromas of toast, chocolate, coffee, toasted nuts. Coffee and roasted malt flavours. Sweetness too. Chocolate notes. Very nice.", "Nice and dark. Liked it very much, will buy again\r\nReview: http://youtu.be/0G3YvoLNea8", "On draught at Rogue Ales Public House SF. Dark brown color. Aroma of bourbon, dark chocolate, and plum. Taste is roasted malt, chocolate, and raisins. Really full mouthfeel and lingering roasted malt and alcohol finish.", "Near-black pour with a thick cappuccino foam on top. Chocolate is my takeaway from the aroma, but the gf immediately says \"soy sauce!\". First impressions on drinking are definitely stout, with lots of chocolate and coffee notes. The aftertaste includes quite a bit of vaporized alcohol, which can be a plus or minus depending on your context. Thick, smooth mouthfeel, again like a nice dark porter. Poured from a 12 oz bottle into a tulip glass. A little old, I had it about six months from the brewing date printed on the bottle, which may be why my particular impressions of the beer don’t include much hops.", "Bottle. Pours dark brown with a touch of red, tan head. Smells very chocolatey, roasty, coffee. Tastes rich, coffee, nutty, bitter, really smooth, easy, full flavor, quite good.", "Dark brown, with robust foamy off-white head. Aroma of malts, hint of citrus and nuts. Really good flavor, making this very drinkable and enjoyable. Taste is more sweet than bitter.", "Dark brown and ruby, with a thin off white tan head.\nCinnamon,aniseed burnt sugar are all found in the aroma. Very complex nose.\nGood strong malt back bone, brown sugar, dough, but a strong aniseed, burnt malt, caramel and a great hop resin mix this brown all up.\nA wonderful hop bitterness finish the beer off, a nice tartness and malt roast leave you wanting more.\n\n---Rated via Beer Buddy for iPhone", "Very nice balance between caramelization smell and the hops. They blend into a well-characterized smell. A nice 2-finger head formed when poured from the bottle. As I drank it, nice lacing formed on the sides. A much darker brown ale then usual. Wonderful toffee, followed by hops, provide the initial mellow taste. There is a soft alcohol warmth felt. A little bit heaver then many brown ales, but excellent overall. Up to the last drink, foam was present. One of the best browns to date.", "Creamy espresso head. A light coffee the roasted caramely aroma. Silky body light carbonated. Sweet caramel flavor. Not as bitter as I expected. Roasted finish. Great rich but balanced beer.", "Appearance has a dark ruby brown color supporting a nice head leaving fair lace. smell of roasted malts with an aroma I can’t put my finger on. Taste is very clean for a brown ale having the roastiness of the malt and a hop bite in the end. Mouthfeel is medium with good carbonation. Personnally I’m not much into brown ales, but this is a good one."]}