{"reviews": ["Kolor ciemno bursztynowy, klarowny. Piana biała, ogromna, zbudowana z drobnych pęcherzyków charakteryzuje się długim czasem redukcji. Obficie zdobi szkło.\nAromat słodowy, biszkoptowy, z akcentami karmelowymi. Nuty chmielowe mało wyraźne, owocowe.\nSmak przyjemnie goryczkowy z odrobiną słodyczy w tle. Goryczka ma charakter zestu cytrusowego, nie jest imponująco wysoka, jej moc uwalniana jest z czasem.\nWysycenie wysokie, szybko zasyca. Tekstura gładka. Ciało pełne, wysokie. Posmak długi wytrawny.", "It pours a slightly amber gold color with a medium sized white head. I smell citrus, pine, resin and hints of tropical fruit. It is very bitter for an APA, it's really more of an IPA. I taste resin, pine and a dank taste. I thought this was a good beer. I'm dinging my taste & overall rating because it seems to be an IPA and not a APA.", "0,355l can from Beer Republic webshop. Caramel, and biscuity malt. Still quite hoppy on the finish some citrus too. Nice bitter finish.", "Goudkleurig helder bier met een gebroken witte schuimkraag die mooi blijft staan. Geuren zijn van citrus maar ook een beetje karamel. Beide niet heel uitgesproken. Smaak heeft een mooie bitterheid die ondanks het aantal IBU's niet overheerst.", "12oz Dose. Dunkelgelbes fast klares Bier mit festem flachem Schaum. Wenig Aroma. Getreide? Auch im Geschmack unauffällig. Bitternoten, Getreide, angebrannter Karamell. Richt bitteres Finish. Für mich ein enttäuschendes Bier.", "Llauna beer republic. Més West Coast que Apa. Citrica, resinosa, punt dolç. Ben equilibrada. Molt bona", "Turbid golden/amber beer with a slight off-white head. Medium aroma; taste starts medium sweet and ends slightly bitter and dry. Caramel, orange, pine, hops and citrus. 7/4/7/3", "Very nice APA. 6.5% abv really hits the spot. Not overly hoppy but a decent amount. It goes down fairly smooth. I can’t complain. Very nice. Give it a try. Cheers.", "Can from Beer Republic. Clear dark golden, stable, frothy, white head. Aroma of pine, red apple, fried onion, pepper, biscuit, grapefruit peel, pear. Taste has sweetish apple, pear & mango; bitter core of grapefruit, pine and spices over a biscuity malt body. Piney, slightly resinous hoppy finish with red fruits, grapefruit peel, citrus flesh and yeast. Medium body, oily texture, soft carbonation. Exemplary, and very neat.", "Found this at a liquor store. Definitely more of an IPA than a pale, but still good nonetheless. Flavor is bright, crisp and line grapefruit. Not amazing, but a legendary beer regardless. I believe this to be one of the first micro brews put in a can. Decent stuff.", "Dark golden color with high white head. Aroma: caramel, hard candy, citrus hops. Taste: hard candy, citrus notes, high bitterness.  Medium body, moderate carbonation. Okay, good but not great.", "Oskar Blues Dale’s Pale Ale 6.5%. Amber, barley malt aroma, full bodied, barley malt, resinous pine, stewed citrus, marmalade, spices. Gorgeous APA from Longmont, Colorado 🇺🇸", "Fruity and malty nose. Sweeter than expected. Bitter-sweet, piny hoppy finish.", "Creamy off white head left a spotty cover on an amber coloured body.\nFruity & malt aroma.\nMedium bodied, soft with a sharp back.\nPine, resinous, bitter citrus & pithy tastes with a big hoppy finish.\nClass!", "12 oz can poured into a pint glass. Not spectacular, but still, worth trying yourself. Seems like the initial excellent taste kinda quickly dropped off. On balance, a solid APA.", "Can courtesy of Luke, fuck knows where he got it. Clear red amber with a lacy white head. Odd malty aroma. Barley sugar, earthy stone fruit and gravel flavour, not pleasant.", "355ml can from Dunell's in Jersey. Pours dark amber with a white head. Aromas & tastes of orange peel, grapefruit, earth, caramel, grain, toffee, pine & malt. Medium body. Moderate bitter finish. Highly enjoyable old school ale, more IPA than APA", "canned. Clear copper pour with a medium white head. Aroma is mild with grains, earth, straw and caramel. Taste is bitter-sweet with sticky caramel, sticks and twigs. The malt backbone is tried and true producing a decent palate. Finishes bittersweet. Overall: much of this score is for sentimental reasons. I first tried tis back in say 2007 and I loved it then, it blew me away. Each and every time I have revisited it since then it has held up well--Like SNPA. And like SNPA there will always be a place for this beer at my table.", "Not bad..A lol more carmelized, sweet than I was expecting..I was hoping for a more crisper, lighter, dry type of ale..This one definitely has the more feel of a Amber, sticky, candied, but I won't kick it out of bed😉 This beer unfortunately isn't what I thought it would be...", "Mörk bärnsten/rödaktig\nDoft: godis-ish, sockervadd/bränt socker?\nSmak: apelsinzest/bittert", "Dark amber colour, creamy head.\nAroma: hops, orange peel, caramel, grass, toffee, caramelised orange peel, cotton candy.\nTaste: hops, orange peel, caramel, grass, some caramelised fruits.", "Can out of a sampler pack. Pour into pint glass. Dark amber color with  a good head and lots of lacing. Medium body with a very nice balance between malt and hops. Pine and earthy notes. I didn't think this would be this good based on the gas station beer logo on this brew but goes to show you you can't judge a beer by the can it's in. This is a premium example of an APA.", "Some pale ales are okay. This one is not a rebut for taste. Its pretty strong for a pale, but still not worth it.", "(Can) Clear, medium-orange amber body with a medium to large foamy off-white head; slight lacing. Malty caramel aroma, some hops. Medium-plus body, oily mouthfeel, medium creamy carbonation. Flavor malty, mild to medium hoppy; caramel, grain, hint of citrus and honey.", "On tap at Das Beer Garden. Clear amber. Smells of pine hops and caramel malt. Tastes of grapefruit and pine hops with a slight caramel malt backbone. Medium body.  Good, of course.", "Can. Malty aroma and taste, light hoppy notes, medium bitter. Medium body, malty and hoppy bitter finish. Ok.", "Just a little too bitter. A very hoppy and piney American pale. Not terrible, but just okay.", "355 ml can. Hig hops smell, golden color, big head. Astringent taste, full in the mouth and cool", "Birra color ambra dalla bellissima e abbondantissima schiuma morbida e molto persistente. Aroma non molto intenso, in bocca abbiamo ananas, resina, citrico e il classico luppolo ben presente nelle IPA americane. Una buona bevuta.", "355ml can. Pours intense red amber, with fine whitish foam. Aroma is hoppy, piney. Body is average, with low carbonation. Taste is medium bitter, with a clear malty sweetness base. Final is a little thin and short.", "Pours bronzed amber with a fluffy white head. Aroma of pine, licorice. Taste has a nice blend of malts, sweet like a pilsener, lots of hops, nice bite. Palate has mild resin, lots of pine, some citrus. Light but packed with hops. Good.", "Copper color, tan head, and citrus and pine aroma.  Lacing.  Flavor has a slightly sweet malt backbone with a bitter hop evergreen and grapefruit finish.  Has enough hop bitterness to be an IPA.", "The biscuit malt and hop profile mesh well together.   I have been drinking my share of Oskar Blues lately.  Dales’s Pale Ale was the 1st I ever had from the brewery.  Surprised I did not rate until today.", "Schönes Kupfer im Glas, in der Nase hopfig, im Trunk eher dunkle Noten, erdig, Wurzelholz, Karamell, trotzdem lecker.", "fist review great effort good find this is the one that's easily found unbelievable ABV definite malts and not much hops on the nose. It has a nice finish though and seemingly good quality. Bittered by hops and bready from malt. Last one says brewed 9/30 or about 2 month ago", "Pour from can is light amber with nice thick head that lingers and laces well. Malt dominates early that gives into bitter citrus that lacks zip. Light bodied and watery. Balanced and steady but not earth shattering.", "If you appreciate a malt presence in your ale, this should be a ‘go-to’.  The balance is superb.  The mouthfeel is off the charts (in terms of substantial presence).  A wonderful throwback to an earlier era of craft beer.", "Poured from 12 oz. can. Brown with a decent head.  Nice nose with biscuit, hops, roasted malts and a touch of caramel.  Taste is robust with a good balance of hops and malts, slightly on the bitter side.  Yum.  Good mouthfeel.  Lacks a bit of dimension...  but is straightforward...  no fruity vibe as with some other ales that are highly rated (ex: Bell's Two Hearted Ale).  The can could use a graphics update, it does not do justice to the beer contained within.", "Lattina. Sentori il luppolo vanno a dare soddisfazione al naso. La finezza olfattiva è normale e il modo in cui permane è sufficiente. Il manto mantello birroso superiore è caratterizzato da una schiuma che resiste abbastanza. La grandezza delle bollicine è a grana medio-fine. Il liquido è di apparenza velata. Il colore è ambrato. Il corpo è strutturato. L'amaro è carico. La forza gustativa è elevata e la persistenza è buona. Le sensazioni boccali finali risultano di amaro. Il finale è amarognolo. Il retrogusto è intenso. L'aroma in bocca porta i segni di miele, frutta secca, agrumi, pompelmo, spezie e mango.", "Re-rating (previous 3.4) Review based on the BJCP2015 guidelines (style 18B). Can 35.5 cl - batch 149 (BBF unknown - Canned on ??/01/20). AROMA: medium oxidized hop aroma (isovaleric, slight pine). medium-low toffee-like malt background. APPEARANCE: amber color and clear. medium off-white head with good retention. TASTE: medium-low to low hop flavor with a pine character and oxidation (isovaleric). medium-low to low malt background with a toffee-like character. medium to medium-high bitterness with a dry and bitter finish and a slight note of hay. PALATE: medium-light body with medium carbonation. OVERALL: an american pale ale with its color almost at the amber ale range, reflecting its malt flavor. The hops are oxidized.", "Color ambar y con buena espuma. Perfecto balance entre malta y lúpulo. Peligrosamente bebible. De las cervezas que más bebí en 2017-2018. Estuvo durante un año casi imposible de conseguir en España y parece que por suerte ahora la vuelven a traer.", "Can 33 cl from SB. Amber with a nice white head. Malty with caramel notes and medium carbonation. A well balanced beer.", "Poured into a glass from a can. Light nose. Nice amber color with a thin head. Great hop punch. Nicely balanced with malts and bitter hops. Centennial is one of my favorites, and it’s one of four in this brew. Great taste and value. Cheers!", "Can@home, from BeerRepublic. Medium, averagely balanced nuances of slightly bitter and hoppy malts, some caramel. A hint of dry fruits. Distinctive hop profile with nice combination of European and American hops. Medium taste spectrum and medium aftertaste with hoppy caramel malts. Medium/light body with medium carbonation. Overall, good quality and distinctive product that brings America and Europe nicely together. 5 4 8 3 15", "Birra ambrata scarica con sciuma bianca presente, profumi citrici e resinosi, gusto prevalentemente amaro soprattutto nel finale ma ben bilanciato da una buona parte maltosa, ottimo il retrolfatto che riporta aromi di arancia amara e resinoso", "Pours a smooth orangey copper with excellent foam, smells of soft vegetal hops and couch farts. Flavour is good maltiness with some nice piney hops; not working exceptionally well together but still pretty decently mended. Nice full mouthfeel with great oiliness. For a macro pale ale it's all kinds of good, there are better ones out there for sure but perhaps none as ubiquitous as this one.", "Tap @ Oliver twist, Stockholm. Pours an amber colour beer with a medium head. Fruity and hoppy with notes of caramel, dried fruits  and pine. Dry finish.", "355 ml can. Clear bright amber colour, medium head mostly lasting, fair lacing, soft carbonation. Nose is herbal, grapefruit, pale malt. Flavour is light sweet, medium bitter, light caramel, grapefruit, bread. Long lasting and pronounced bitter finish. Very good!", "Can bought at BCL in June 2019, $3.60 CAD.\nAttack: crisp creamy bite\nMids: sweet light bready-grainy barley malt, lvl5-sweetness, light metallic hops\nFinish: subtle bitter hops\nOverall: excellent balanced sweet barley malts, very nice mouthfeel, smooth drinking.", "Lightly malty with toast notes with a big resinous hop profile. Light sweetness is followed by a ponounced yet balaced bitterness.", "Pours a clear, deep amber coloration with a medium, fluffy head. Smells of biscuity, slightly grainy and caramelly malt and floral, citrus hops. Taste follows the nose, with a good balance of biscuity, grainy, caramel malt and floral, citrus hops with notes of tangerine and lime peel, as well as some pine. Finishes with a medium bitterness and some citrus and pine lingering in the aftertaste. Smooth mouthfeel with a medium body and carbonation.\n\nThis seems like a classic East Coast Pale Ale, or rather IPA, really, at 6.5% ABV. Quite a strong malt base with some floral, citrus hops and pine. This is keeping it simple, but is quite expressive and well-balanced, making for a not-too-complex, but rather enjoyable brew.", "Can, 50 cl. Pours a clear golden with a frothy white head. Aroma is malty with some caramel. Taste is burnt toast and dark caramel, coffee, grapefruit. Medium carbonation. Very interesting beer with a nice balance between caramalts and American hops.", "Delivers on  the promise of hops. Has a strong pine and grass taste as well as orange peel. I expected more given the reputation of the brewery.", "Can bought both in Colorado Springs and in sweden. Has a nice hoppy/malty aroma kind of like a darker IPA, taste is a good balance between hops and malt with a little bit of sweetness at the end.", "0.473l can. Clear amber color with nice white/beige head. Aroma of malt, caramel, citrus, hops, honey and pine. Taste is bitter and sweet.", "Can. Clear light black tea body, medium white frothy head with good retention and lots of lacing. Aroma of quince marmalade, apricots, acacia honey and caramel malt. Taste of grapefruit zest, orange jam, bitter herbs and caramel. Lovely.", "can.  Poured  amber-orange with a creamy lasting head. Malty aroma with a hoppy touch.  Medium bodied, lower creamy carbonation, with a dry finish.  Flavour of caramel malt, a bit of a woody, herbal hop note, faintly peppery with some bitter citrus peel. Nice for a mere 6.5% abv.", "(22/08/2019) Pint on tap at Elephant Room, Austin, Texas. Colour is surprisingly dark for a pale ale, almost copper/amber. Aroma of hops, grapefruit, bittersweet malts, spices. Big flavour, grapefruity, juicy, piney, spicy yet quite malty. Medium body. Perfectly balanced bitterness and sweetness. Hops and malts both coexist in harmony in this wonderfully put together ale. Complex taste but easy to drink at the same time. Absolutely delightful.", "Rich color, flavorsome, great head that stays the journey, it has a kick too, as it should,  I buy 12 x can box in Fairways, top class beer in the American pale ale style.", "Can. Hazy golden, off-white lace. Classic West coast, not overwrought, dry, peach and pine finish.", "can - pours a deep gold ale with a massive tight pored white cap that lasts and laces...Aroma is earthy, musty, malty...Flavor is a delight, big chewy malt mix balanced with piney bittering hops , some woodsy- earthy tones, malty but not sweet (great attenuation)...rounded full rich mouth feel....moderate wet finish in balance with bittering appearing at the end...soooo drinkable...sturdy satisfying tasty ale...if this was available all the time in my locale it would be my go to PA and in my bike saddlebags  or back pack all the time...benchmark craft pale ale", "19.2 flOz can for 2$. Copper color, nice head and good carbonisation. big malt flavour, and a strong piney hop flavour. Tastes like brown Sugar or cane Sugar was added. I'll buy this more often.", "From the bootlegger in Paris, trying this can, as usual, at home, in Epalinges. A classical and well built pale ale, like a lot of time, you get a strong resinous note, pine-tree, malty, side of sugar and aromatic with a really tasteful bitterness. You get for the eyes, a nice and classical body, average carbonation, white foam.", "12 oz. can pours a deep gold/ light copper color, yielding a one and a half finger head of rocky foam that leaves a lacing along the glass.  The aroma is hoppy, leaning slightly more toward the citrus side.  The mouthfeel is moderately full with nice carbonation.  The taste is hop forward, though there is a fairly strong malt backbone to stand up to the four hops used.  The hop flavor is balanced, with notes of citrus and a slight piney bite.  Overall, this is a good example of an American Pale Ale.", "Deep gold. Moderate white head. Nose: malts, faint tropical and floral notes. Medium body. Taste: pure hoppy, with a clean malt base on it. Robust bitterness. Nice old school.", "12 oz can. Smells of grapefruit with some tropical notes. Dark orange and clear in color. Malt forward with a nice, slightly citrus, mild bitter hop bite at the end. I like these Pale Ales with a full range of flavors throughout the sip. Nice subtle pithy bitterness at the end. Nicely balanced.", "Utseende Uklar gylden med offwhite skum. Aroma sitrus malt karamell humle. Smak sitrus appelsin brød malt humle. Fruktig og bitter. Boks smakt August 12", "Burk 355 ml från Systembolaget. Bärnstensfärgad med tjockt skum som lägger sig som ett lock på ytan, nära högsta betyg. Doft av humle, aprikos och apelsin. Smak av humle, grapefrukt, bröd, aprikos och kåda. Rejäl beska. Mer IPA än APA enligt mina smaklökar.", "0,355 l can like typical in America. Very good and tasty beer in my mind, tnx", "Pours a slightly hazy amber colour with a lasting foam off-white head. Biscuit malt aroma with a hint of fruit such as pineapple. Taste is biscuits, malts, caramel, very mildly hoppy for the smell. Light biscuit bitterness to finish. Medium palate and light carbonation.", "(12oz can - part of a mix 15-pack \"Canobration\")\nAROMA: soft malt and grain, hint of caramel and wood (almost bourbon-ish)\nAPPEARANCE: light amber/copper, clear, a very nice billowy hint of beige head\nTASTE: malt/grain forward, sweetness (brown sugar), dried/reduced stone fruit, much more intensity than i was expecting, earthy, smokey, herbs/spice, touch soapy and metallic\nPALATE: approaching medium body, crisp and bright upfront, smooth and slick middle, gives way to bitter finish\n\nOVERALL: pretty good. better than i expected. it has a very nice head but the color looks iike a watered down amber or IPA, but it does have a decent punch of flavor, not ultra complex but nice and a little chewy, worthy of a try and even keeping a few around.", "Great hop forward beer with some backdoor fruit. Well balanced, a must try for the IPA drinker. Just what the doctor ordered after a hard day.", "33 cl blik. Helder oranje van kleur, middelfijne romige witte schuimkraag. De geur is citrus en karamel. Smaak is zoet, licht droog karamel, grapefruit, abrikoos en ananas. Medium lichaam, veel koolzuur. Bier loopt uit de blik.", "Nice beer with some fruits and nice aftertaste. Somewhat bland and watery but not too much.  Nice aftertaste.  I am used to the the stronger IPA beers so this is why I am not crazy about this one. Not very juicy still it is a good beer!", "Recently enjoyed a pint of this renowned brew from the famous can (of course) - poured a hearty caramel amber-orange color with a foamy white head, looks more intense than your average pale ale. Earthy and herbal hops on the nose, along with notes of classic cascade hops. Taste is a slightly toasty and caramelized malt with a cascade hop bitterness that builds over the course of the pint. The hop flavor also almost has an English-style flair to it, with subtle fruity and earthy hop notes. Medium-bodied, smooth, but a bit \"chewy\" in the mouthfeel. Although the flavor profile is very true-to-style for an APA, this is distinctly heftier on the palate and I imagine could be pretty filling rather quickly. Overall a nice change-up if you're looking for a stockier rendition of a Sierra Nevada or Kona Fire Rock pale ale.", "Nice amber clear pour with a creamy off white layer of a head. Biscuits, malts, toasted brown bread, ripe fruit like peach or pineapple comes to mind, caramel, very mildly hoppy for the smell. Not overly bitter, halfway medium sweet with a little bit of sour flavors. Medium mouthfeel and the right amount of carbonation. Loving it, more complex than one would expect.", "APA de color ámbar con espuma blanca de retención media. Aroma potente a lúpulos resinosos y herbáceos junto con maltas caramelo y miel. Sabor refrescante y equilibrado. Buen contraste entre el Dulce del cereal y el amargor de los lúpulos. Notas de fruta cítrica y sensación floral y oleosa. Una cerveza compleja pero fácil de beber. Un buen ejemplo de este estilo americano ideal para acompañar una hamburguesa Black Angus.", "Pours deep amber to copper with a thick offwhite head. Aroma is citrusy. Taste is moderately bitter and slightly sweet. There are notes of citrus, toffee, and something like diesel. Medium bodied with moderate carbonation. It’s not bad but I probably won’t buy again.", "Nice IPA, been waiting for this one for a while, part of the LCBO Spring 2018 Beer program, a good IPA.", "Flasche in einem Whole Foods in New York.\nDunkles gelbes und klarer Körper, viel Schaum.\nSchön fruchtiges Aroma (Südfrüchte: Aprikose, Maracuja, Ananas), Hopfen\nGeschmack: Süssliches Malz (Karamell im Gaumen), wird stärker und dominiert. Frucht  im Hintergrund und nicht dominierend (Aprikose, Maracuja)\nWenig Bitter.", "2 month old can from canundrum mix 15\nA: Poured a finely hazed deep burnt orange with a very small head. \nS: Sweet orange, faint pine and caramel.\nT: Strong and bitter taste with leafy, earthy and zesty citrus hops balanced by toasty and lightly sweet malts. Candied orange aftertaste.\nM: Medium body and stiff carbonation. Fairly clean finish.\nO: Good and well balanced, a nice autumn beer but not one I'd seek regularly.", "Amber with a pillowy off white head. Smells of toffee, herbs, piney, dried dark fruits. Soft, good sweet-bitter balance. Dry finish.", "Offers pine and light fruity notes, a solid bitterness - just like we are used it back home. Was as well just a fresh delivery.", "Lovely. Nice amber ale with a pleasant biscuit malt finish. Great depth of flavour.", "Probably my favourite mass market beer. Very well balanced with a strong malt backbone, but enough hop punch to break through. Earthy, full mouth feel raises it above the rest. Cracking stuff.", "From backlog. 0,3 litre Can from Systembolaget Charlottenberg. Cloudy Dark Golden with white head. Malts, hops, Caramel and fruits.", "Can 330 ml at Stockholm Beer and Whisky Festival 2018. Clear amber body with white head. Caramel, malts, fruitiness, hay, bread.", "Ambar, nebulosa, abudante espuma blanquecina. Aroma ligeramente resinoso. En boca es muy equilibrada y agradable con excelente base malteada, acaramelada y un rico contrapunto lupulado cítrico. Final seco y notablemente amargo.", "355 ml can poured into a tulip glass, appearing a slightly hazy dark golden, topped with a generous, soapy head of white froth, which recedes gradually sticking to the glass. Aromas are hoppy, a mix of fruits and florals, although none distinct enough to standout. Tastes are a similar smooth blend if fruity and pine flavours, caramel sweetness, and some breast malt. Ends with a mild bitter and is nicely medium bodied throughout. No standout flavours, but a good all rounder pale ale.", "An almost plain looking Pale Ale with a simple name but \"ohho\". A really good IPA kept simple as it should be. Yet a complex taste spectrum and a great finish. Very good beer!", "Large frothy offwhite head. Excellent lacing. Mostly lasting. Hazy dark-amber body. Aroma: moderate malt, caramel, heavy hoppy, grass, orange. Initial flavor: moderate sweet. Final flavor: light sweet moderate bitter; long duration. Palate: medium body, watery/oily texture body, lively metallic finish. vencida há 33 dias. Dulçor maltado com toques de laranja. Lúpulo com perfil de pinho. The balance is towards the late hops and bitterness, but the malt presence is supportive, not distracting. Moderate to high hop bitterness with a medium to dry finish. Hop flavor and bitterness often lingers into the finish, but the aftertaste should generally be clean and not harsh (appears as flaw). Me lembrou mais IPA que APA. 90s", "Tap at Salhojankadun Pub. Pours deep amber with snow white head. Malts, sweet fruityness, floral hops, caramel, grapefruit, apricot, overaged orange. Medium body, average carbonation,  bitter finnish.\n\nOriginal rating 8-3-8-3-13 from can 355ml at O'Hara's Freehouse 2011-10-22.", "19.2 ounce can (more beers offered this way, please). Juts a terrific pale ale. Amber colored, and you can really taste the bready malts. Citrusy NW hops. Firm bitterness and plenty of hops flavor. This would've passed for an IPA some years ago. As is, it's one of the best APAs out there.", "Amber with thin beige head\r\nAroma is malty grainy \r\nFlava is malty some sweet fruitiness and slight roastones\r\nFeels medium with moderate fizz\r\nFinishes tangy slightly bitter", "Solid pale ale but won’t blow you away. Had found this one in Colorado a few year back but now it’s in the neighborhood.", "Amber pour, beautiful foamy off-white head. Mild soapy floral aroma. Taste of pine, caramel, some citrus, quite floral, nutty...  A perfectly reasonable pale ale.", "Orange, leicht gelbe Farbe mit weißer Schaumkrone. Malziger, fruchtiger, hopfiger Geruch. Geschmacklich malzig, hopfig, fruchtig mit Grapefruit und Citrus, hintenraus trockener. Mittlere Süße mit mittlerer Bitterkeit, leichter bis mittlerer Körper mit spürbarer Kohlensäure. Intensiv und gleichzeitig ausbalanciert.", "5/10/18\r\nAt scholarship dinner with A. \r\nStraight from can from Penn bartender. \r\n\r\nBig hop nose. Very strong and floral. Not getting as much citrus as I'd expect from their description.\r\n\r\nTaste is floral bitter hops and crisp malt. Tons of hop flavor. Pronounced bitterness with a touch of bready sweetness. Nice amount of bready flavor but without the sweetness. Could easily pass for an IPA. \r\n\r\nMed-thin palate. Would have no problem downing several of these. \r\n\r\nOverall, a great, drinkable  pale ale that’s definitely a floral hop showcase. Equally suited for a real review or for slamming at a party.", "Piwo ciemnobursztynowe, raczej klarowne (wytrącają się drobinki białkowe). Piana wysoka, trwała, lepi szkło. W aromacie las, , trawa, karmel, kwiaty. W smaku średnia, trwała kwiatowa goryczka, z wyraźną karmelową kontrą. Wytrawne. Wysycenie średnie.", "Tall can from the ice chest at Liberty on The Drive in Vancouver. A reddish amber beer with generous pale head and a faintly hopped and malted nose. Slightly hop forward on the palate with delicious malt background. Maybe (just maybe) the best pale ale I've yet to try. 4", "355ml can (6.5%) at home on 29 Apr 2018, present from Andrew C (bb 5 Mar 2019): initial floral, pine aroma becoming more fruity on warming, amber, good off-white head, floral, orange, caramel, biscuit flavour, viscous, sweet hoppy finish.", "27-04-18 // can from Getränke Stumpf. Malty body. Fruit aromas of orange, apricot, grapefruit. Moderate bitter. Classic solid Pale Ale.", "Very frothy head over a clear, orangy brown. Smells of citrus fruit. This is a nicely bitter beer, with dark tones of malt in the middle, making it seem like an English pale ale done with that extra citrus kick of American pale les. I can taste citrusy hops, but the finish is a sourer bitter that reminds me of Kent hops such as Goldings. There's a slight alcohol intensity in here too. Carbonation is lively, and I got some after-fizz in my nose. So this is a good APA but still just behind Sierra Nevada PA for me. On the other hand, it tastes closer to the traditional English pale ale for me than Sierra Nevada, which overlaps more with the American IPAs. Not that such distinctions matter: this is a good beer--the second I've had from Oscar Blues, and I liked them both.", "The beer has got a deep amber colour with a small head and medium body. Aroma of hops and pine. Taste of hops, barley, bread, herbs, flowers and Woods. Hoppy finish.", "Elaborado con grandes cantidades de maltas europeas y cuatro tipos de lúpulo americano, ofrece una explosión de aromas a lúpulo, un rico centro de malta y lúpulo, y un final emocionante. Pesa 6.5% de alcohol por volumen.\r\n\r\n¿Por qué exprimir una cerveza tan grande en una pequeña lata?\r\n\r\nPorque pensamos que la diversión al aire libre requiere una gran cerveza. Nuestras latas van donde las cervezas embotelladas no pueden, donde las cervezas enlatadas sin sabor no pertenecen. Y no importa dónde bebas Dale's Pale Ale, podemos protegerlo de la luz y la oxidación mucho mejor que las botellas.\r\n\r\nNorthern Brewer para amargor, Cascade y Columbus para sabor, y una gran adición post-ebullición de Centennial para aroma.", "Creo que estoy gafado con esta cerveza, me encanta todo lo que he probado de Oskar Blues pero ésta la he probado 3 veces en 3 garitos diferentes y siempre me ha pasado lo mismo, gusto metálico, ya no se si es defecto o efecto... el aroma es de lúpulo a tope y es muy bueno aunque ya puedes identificar el \"óxido\" y de gusto a maltas caramelo con buena amargor pero me deja ese regusto metálico exagerado... sigo dándole oportunidades porque tiene buena prensa, pero 3 pinchadas de 3 intentos en diferentes locales en el tiempo...", "Found in a variety pack at ingles in Franklin, NC. Really a well done and easy to drink smooth pale ale. Overall a great after work beer to sit and savor. Best in late summer.", "Very weak aroma of malt and grain. Medium to full body and avg carb. Taste is quite malty, crisp and somewhat metalic. Same follows in the after.", "Canned. A clear amber coloured beer eith a nice white head. Aroma and flavour of malt, fruit, hops, citrus and with a bitter finish.", "1 pint can. Scents of malt and hops. Pours a copper gold with a frothy white head. Hop forward tastes with a leathery finish. Medium carbonation. Very nice and drinkable. I like it.", "A US CLASSIC. Schon mal aus dem Pitcher vernascht. In Atlanta, beim COL. BRUCE HAMPTON Konzert :). That was fun ;)...GetreideHopfenSpass auf Hoppy Wheat Ale Ebene👌 USOldHopFun👽 355ml Dose vom STERKE in Amsterdam.", "0.35 l can, thanks to my family for this one. Pours deep copper with thin and long lasting off-white head. Nose is that of a west coast IPA, a combination of reisonous hops and sweet, honey-biscuity malts. In taste the same notes appear with short, faint bitter finish. Surprisingly heavy for a pale ale and has average carbo. Good one, and it’s close to an IPA in many aspects.", "One of the best Pale Ale's in the world (and I've had hundreds). Nutty, caramel, earthy, smokey taste. Very hoppy nose. No after taste. Great finish. The high mark of pale ales.", "Ottima pale ale subito si identifica come americana, color ambra, bela schiuma persistente. Al naso erbacea e leggero malto. Al palato è godibile con luppolo erbaceo, una buona base maltata e alcol sostiene bene, corpo medio.", "Malty... big malt with a nice hop infusion. Pretty heavy for a PA but very well made ale. Not quite to Sierra Nevada PA level- the gold standard- but pretty good.", "Van 't vat in Kaffee Bazaar te Ieper. U: Troebel oranje-amber met een witte schuimkraag. G: Tropisch fruitig, karamel, nectar, tonen van citrus en hars. S: Tropisch zoet fruit met een stevige hopbitterheid. Wat karamel en veel hars. M: Doordrinker met medium carbonatie.", "Van 't vat. Oranjekleurig bier met witte schuimkraag. Geur: hoppig, licht fruitig, pompelmoes en licht zoet fruitig. Smaak: hopbitter, licht zoet, pompelmoes. Goede koolzuurprikkel. Afdronk: licht bitter, droog.", "Amber pour with off white head. Some malty sweeter notes along with hoppy pine, resin, and citrus. A go-to in our house", "Dale's Pale Ale von der Oskar Blues Brewery aus Colorado, USA. Schicke 0,355l Dose. Trübes Bernstein im Glas, mächtige Schaumkrone, allerdings kurzlebig. Malzbetonter Antrunk, süssliche Zitrusfrüchte im vollmundigen Körper, sehr harmonisch. Super gehopft (65 IBU), hinterlässt leicht trockenes Mundgefühl, die süssbittere Grapefruit bleibt ewig im Rachen hängen. Sehr gut.", "Poured from 330 can to a glass mug. Pleasant hoppy aroma that doesn't seem to massively follow though into the taste. This is by no means a bad beer. It's a pretty typical American pale ale really. Tasty and refreshing without being too offensive on the hop front. Not that dissimilar to Sierra Nevada's pale ale. If anything Dale's is more of an easy drinking beer, not sessionable, but very easy to drink if drank from the 330 cans.", "My treacherous faces-Nose hint of pine maybe orange .Hops are bitter melon,deep heavy citrus and grapefruit peel,resinous,sappy.The flavor is exellent just right for the style.The cat went to the basement.", "Canned 7/25/17. Bought the 1 Pint 3.2 oz can cold. It was recommended by friend at work (Dale). Beautiful amber pour with thick, light carmel head. Aroma and flavor were not as robust as expected. After reading reviews of hikers, perhaps I didn't have enough of a thirst to truly appreciate; don't know if nearly 5 months on the shelf contributed.", "Amber, bit hazy with rich off-white head. Malty aroma with some hoppy notes. Moderate malty sweetness well mixed with good hoppy bitterness, some sourness too. Lasting mild bitter hoppy aftertaste.", "Keg at the Salisbury Arms in Winchmore Hill. This is an ESB, not a pale ale. As an ESB it is good, with a rich sweet taste, a long flavour and a nice malty mouthfeel. That richness was evident (alongside the alcohol) and there is no way we could do more than one pint during the session.", "gyllenbrunt med lett skum. veldig fruktig duft med mango og sitrus i førersetet. Frukt og karamell i smaken. friskt i forhold ti, høy abv.", "Glass at Taphuys Arnhem, Dark orange beer, small head. Aroma is malt, citrus, hops, caramel. Taste is the same, bitter with some sweetness, somewhat long aftertaste, ok.", "This is an excellent beer for a backpacking trip.   It is delicious after hiking 3 miles in the woods.  Put it in a mountain stream to keep it cold.  Just a solid easy drinking and tasty beer", "My favorite beer for golf and doing things on the go. Packs a nice hoppy taste without being overpowering. Why anyone would settle for a flavorless light beer when this is available almost anywhere is beyond me. Grab one and head out! Solid taste and packs quite a punch! Enjoy! \n\n---Rated via Beer Buddy for iPhone", "16 ounce can at the house. 15th anniversary can for my can collection and looks nice. Canned on 05/10/17. White medium head with film on glass. Hazy amber/orange in color. Some floral and pine to the nose. Medium mouth feel and well balanced. Taste some pine and citrus. Pretty smooth on the palate, with light pine after notes. Pretty nice pale ale that is a little thicker and has a little more hops added to this brew that most in this style. Cheers!", "It was good and had that beautiful Pale Ale appearance with great carbonation. That being said, it was a little unbalanced with Hops and uninteresting use of hops for a Pale Ale. I still liked it, but there are better.", "Can. Despite being 6 months out of date, this beer kept up pretty well. Some old dry hops sticking to the palate but it isn't too musty and is overall a fine beer. \r\nRerated. Tap at Bishops Arms Östersund.  3.4 to 3.5. Balances the malts and hops quite nicely", "Just a good pale ale. I’m not a huge fan of IPA’s but this isn’t that bitter and tastes great", "Not impressed at all. I'm a massive fan of American Pale Ales in general but this one felt like a mass-produced approximation of an apa. Aroma promised something that the taste did not deliver. Too sweet, not balanced at all. Weak tasting\n\n---Rated via Beer Buddy for iPhone", "Good beer. Not really my cup of tea. Ok. Little bitter. Needs to be very cold. Wouldn’t drink more than one. \n\n---Rated via Beer Buddy for iPhone", "Can. Clear, orange, frothy, tan foam, medium sweetness, medium bitterness, medium body, oily feel, soft carbonation, & long finish.", "From Oct 2006\r\n\r\noured from 12oz can a hazy reddish gold with a large head of foam\r\n\r\nThe smell is all kinds of hoppy with notes of grapefruit and some grass. There's even a touch of sweetness from the malt in the nose.\r\n\r\nThe taste is big on hops up front with the grapefruit noted in the smell though the grassiness plays a minor role. Midway through there's a good caramel malt sweetness that offsets the hop bitterness nicely creating some really good balance but..the hops take over again near and through the finish.\r\n\r\nOther notes: the body on this pale is really good and the drinkability, despite the 6.5%abv, is very high for me.\r\n\r\nBottom line: This is a great APA! 'nuff said!", "Promising is appearance but generic tasting and not as enjoyable as other more earthy pale ales. As a friend of mine harshly put: \"It's a dishwashing soap with a classical label\".", "Zapach średnio intensywny, słód, cytrusy, owoce tropikalne, sosna, karmel. Kolor pomarańczowy, mętne. Piana średnio obfita, drobna, średnio trwała, lekki lacing. W smaku umiarkowana słodycz, średnia pełnia, słód, cytrusy, trawa, sosna, biszkopt, karmel. Goryczka średnia, wysycenie średnie.", "Una APA cercana a una IPA, color ámbar, sensación alcohólica y mucho lúpulo y caramelo.", "355ml can from Tesco. Pours a amber gold with a thin beige head. Aroma: Caramel malt, peach, mild citrus, pine notes. Complex aroma. Taste: Peach, caramel malt, citrus, mild floral flavours. Thinnish body. Mildly sweet, followed by moderate lingering bitterness. Quite tasty and easy drinking. Potent for a pale ale. Definitely a great pale ale!", "355ml can. Pours amber, clear, with a medium head that diminishes slowly. Aroma is citrus and taste is well balanced with medium bitterness. Light oily texture with medium carbonation. Good beer.", "Pours whiskey colored and mostly translucent with an off white head. Tastes very well balanced with sweet malt and mildly bitter hops. It's medium bodied with minimal carbonation. It becomes ver complex with floral hops, sweet almost honey-like caramel malt, mild bitters, alcohol and a hint of yeast. Nothing like a very well balanced beer, IPA.", "355ml can from Beervana. Pours a hazy orange/amber color with a big white fluffy head that diminishes slowly. Aroma tends toward the hoppy side with citrus, orange, mango, passionfruit and pineapple notes but showing enough sugary hints from the malt. A touch of caramel makes it surprisingly close to an Amber Ale. Taste is extremely well balanced with a high dynamic range of flavors. Moderate bitterness and citrusy character leave enough space for the expression of tropical fruit flavors, bready malts and a tiny bit of apple tartness. Really good. Body is quite robust for a Pale Ale and with the mild carbonation plenty of character is delivered. Not a flawless beer but damn good.", "God humlearoma.\nBitterhed og sødme går hånd i hånd. Meget amerikansk - for sød!", "Can from Tesco, Aldershot. Resin and pine aroma, almost herbal. But low key. Dark amber. Hazy. Bubbly white head, which fades. Medium bitter. However this is kinda short lived. Hoppy, but not real impact to it. Light bodied. A slickness. Fizzy carb. Low key finish. Just generally low key. It's nice enough but a pretty boring representation of the style from a US brewery.", "355ml can into schooner glass. Brewed in Austin, Texas. Golden toffee-coloured beer with towering white head. Nose of sweet malt, fruit and grassy woodlands. Flat mouthfeel, dry fruit bitterness. Finish is earthy and dry with late pepper. Nice beer.", "Sweet, yeasty aroma. Hazy caramel colour. Citrusy front with a sustained bitter finish. Medium body and carbonation. Quite tasty.", "Puszka 330ml. Lekko metnawy miedziany kolor. Piana biala o drobnych pecherzykach,opada dosc szybko. W zapachu owoce tropikalne:dojrzale mango i marakuja,w tle cytrusowe nuty. W smaku solidna cytrusowa goryczka ,ktora przytlacza owocowe nuty. Slodkie elementy ciagna sie po kubkach smakowych przez chwile by zniknac w grejpfrutowym albedo. Wysycenie male.", "Unclear medium deep brown color, with fairly light foam. Nice hops aromas, and light malt. Lots og bitterness.\n\n---Rated via Beer Buddy for iPhone", "Can from Antenna America. Pours bronze with a great lasting creamy beige head. Decent sweet earthy malt aroma, plenty of pine hopping, citrus. Big malt forward flavour, full earthy and caramel toffee sweetness, backed up by punchy piney bitterness. Full slick mouthfeel, aggressive bitterness for the style. First two-thirds were great but that final third wore me down, those big hops got a bit much, and the heavy malts stifled any sessionability.", "Imperial pint can. Grapefruit hop citrus aroma with notes of caramel malt and pine resiny hops. Pours clear copper colored with one finger of tan head that has excellent retention and some lacing. Starts with grapefruit hop citrus flavor with a good caramel malt backbone. Finishes dry and smooth with some pine resiny hop bitterness cutting through but not overpowering the other flavors. Pretty nice pale.", "9/13/2017: This has long been a go to for me.  Currently enjoying a stovetop can at a BYOB bbq joint.  It a got a nice malty backbone with a punchy bitterness that pairs well with the sweet and smoky flavors that i have going on right now.  Good beer for any situation and a staple session beer for me.", "355ml can. Pours clear amber with a white head. Aroma of malt and maple. Dry bitter taste and finish.", "Can from Tesco Aviemore. Raises the question - What is a pale ale anyhow? Nothing about this ale seems pale. Certainly doesn't pour pale. A clear copper gold with loads of bubbles shooting up the glass and a fluffy off-white head. The nose has a light fresh fruity nose with a sweet caramel backbone. A citrusy sweet lime and orange with a prominent floral edge. The flavours have a similar composition to the nose with the sweet caramel front followed with the citrus and floral edges. The beer feels medium to light with a sharp fizz making it very refreshing. It's a sharp sweet fruity and fresh ale that has a building floral bitterness reminding you this drink means business.", "Draft at Growler USA. Pale amber clear, medium bodied. Grapefruit and pine taste, bitter finish.", "Roost restaurant in Greenville ......................................................\n\n---Rated via Beer Buddy for iPhone", "Can’t believe I’ve never rated this beer. Tried it for the first time in 2010 and had it many times since. Aggressive hoppiness, very bitter finish, but the malty backbone keeps you coming back for more.", "Malty and crisp. Great flavor without being too strong. Versatile beer that can be used in many drinking scenarios.\n\n---Rated via Beer Buddy for iPhone", "cracking little beer; a dark yet explosive IPA which hits all the right buttons. doesn’t smell very good so gives off a crappy first impression but makes up for it in spades with the taste.", "Big caramel malt backbone support bright citrusy hops. Very well balanced and great example of an American pale ale.", "Can: fresh hoppy American pale ale. It’s pretty classic. Clean tropical Homs and good malty note. Palate is rich and balanced. Solid pale ale.", "Aroma: Medium toffee, grapefruit, pine.\r\nAppearance: Clear, copper body. Large, small to medium bubbles Good retention. Lacing.\r\nFlavour: Medium toffee, grapefruit, pith, pine, resin. Medium-high bitterness. Dry finish with lingering grapefruit pith. \r\nMouthfeel: Medium body. Medium carbonation.\r\nOverall: A perfect balance. The moment it feel like a component is standing out too far, a complimentary component stands in to take the spotlight for the next few seconds, until another steps in. \r\n\r\n355 ml can, poured. \r\n18B. American Pale Ale", "Can. Opaque amber color, frothy off-white. Appealing, hoppy aroma. Smooth, hoppy flavor with notes of caramel. Medium-full body, medium carbonation. Very nice!", "Earthy bread with light mouth feel. Pours copper with tan head. Very good pale and the abv is excellent for the style", "Earthy in the nose from a copper pour. Light mouth feel. The late late bitterness leaves an off taste otherwise very serviceable.", "Smells bready malt. Bitter but sweet almost floral and oranges. Really good pale ale", "Pours gold with a frothy white head. Aroma of maracuja, citrus. Taste is mildly bitter with noticeable citrus. Body stays light, smooth, but is not watery. Okay", "Powerful aroma of hops, and pours a golden brown colour, clear, with little head. Malty flavoring adds character but makes way for a clean finish that renders this beer a flavorful but refreshing option. Not bad. \n\n---Rated via Beer Buddy for iPhone", "Draft at The Irish Pol. Clear deep orange copper pour with soft beige foam. Toasted caramel malts. Good show of hops. Mandarins. Fuller-body than expected. Bit of a weird aftertaste.", "355 ml can @home,bb 23/03/2018.\r\nCopper,slightly hazy.\r\nSmells of citrus,bread and malt. Taste is malty,swet-ish,citrusy.\r\nLasting bittery finish.", "A little too hoppy for my taste. I've never been a fan of frogs, or rabbits for that matter.\n\n---Rated via Beer Buddy for iPhone", "Can 33cl. Amber with a small white head. Aroma is pine, orange, syrup and hops. Medium body, soft carbonation. Taste is pine, strawberry and spice. Medium bitter, with a bitter end. 07/17", "Best pale ale since Sierra Nevada - nice pale straw color with just the right amount of hops", "caramel, cereal, resin, citrus, amber, clear, frothy, medium sweetness, lightly bitter, medium body, creamy, average carbonation, bitter.\r\nPara mi gusto le sobra 1 gradito de alcohol, lo que la haria mucho mas facil de beber y quizas le faltaba algo de intensidad al lupulo por que llevaba algo mas de un año enlatada, pero aun asi muy buena cerveza, ejemplo clarisimo del estilo.", "very pretty lookin beer, perfect amber with a recurrent head, a bit of bread, cream, biscuits, bitterness subdued, great creamy mf", "Remember trying this when I was younger and hated it, but now that I can buy it at the local tesco for £2 it’s great. Rye and citrus all around. Very well-balanced between smoothness and bitterness. Like a rye-DIPA without the bite. Solid go-to.", "(Oskar Blues Dale’s Pale Ale) Tap at ’t Taphuys, Arnhem.\r\nDeep orange colour on the body, huge and thick, off-white head on top.\r\nAroma has some malts, caramel and a bit of biscuit.\r\nTaste has caramel malts, light citrus, biscuit. Pretty bitter finish.\r\nMedium thin body.\r\nNot bad.", "From bottle (pkgd 2July) in tapered shaker. Pours clear amber w/big off-white head, piney hop aroma. Quite tasty and balanced: caramel against pine, a solid brew", "This thing is crazy pale, but I can see why people are digging it. It leaves a noticeable taste in your mouth but the more you drink the better it tastes.\n\n---Rated via Beer Buddy for iPhone", "Pine and grapefruit aroma, a bit of toast. Pours amber with tan head, pretty dense. Taste is hoppy and resinous up front, classic taste, pine, a slight pithy astringency. The malt pretty dry too, bread crust, and a good fluffy velvety palate. Light bodied but a bit of chewiness from the hops, not quite a \"session\" but nice compromise between PA and IPA.", "355ml can from SystemBolaget. Pours a nice gold amber with creamy white head. Pine and citrus aroma. Strange taste, not so bitter, rather malt with small to absent palate finish. Won’t be remembered", "Citrus pine aroma in a golden amber pour. Restrained hop forward balance with tasty fruity body and crisp clean finish. A benchmark of the style - just like is says on the tin (or can in this case)!", "Data puszkowania: 10/26/16 (US)\r\n\nAROMAT : Intensywny. Karmelowo-ziołowe, czyli sporo Columbus’a i Centennial’a. W tle lekki cytrus\r\n\nSMAK : Dominuje słodowość. Posmak karmelowo-ziołowy z nieco ściągającą cytrusową goryczką. Pijalne.\r\n\nWYGLĄD : Barwa złota, opalizujące. Pian drobna, wysoka (piwo jest lekko przegazowane \r\n\nOGÓLNIE : Trzeba wziąć poprawkę na to, że piwo od wlania zapuszkowania do degustacji czekało ponad 9 miesięcy, nawet jeżeli było w puszce (gdzie proces starzenia się piwa jest wolniejszy niż w butelce) to i tak bardzo dużo staciło na swieżości. I to czuć. W smaku i aromacie. Czuć również, że kiedy to piwo było świeże, musiało być bardzo smaczne.", "I see a good Pale Ale as simple yet fantastic. If it were a cuisine it would be Italian, and this beer is the quality you can only get in Italy.\n\n---Rated via Beer Buddy for iPhone", "Can in the garden, 24th June 17. Pours copper in colour. Aroma is perfume hop, pine, citrus. Taste is clean, bitter hops, perfume, good centennial, rounded, well balanced finish. Lovely.", "Deep clear red with thick tan head. Very definitely doesn’t look like a pale ale! Malty and hoppy aroma, and the first taste is really quite malty, thick, and sweet, before tapering off to a rather harsh hoppiness. Thick bodied. Tasty. NOT a pale ale.", "Robe ambrée/rousse, mousse crémeuse beige. Nez léger de caramel et résine. Attaque amère sur la résine et le pamplemousse. Corps moyen, bonne longueur.", "Draft 0.15l at BeerTemple Amsterdam, The Netherlands. 23.04.2017. Pour it amber color with big white head. Aroma just pinch of orange. Taste of cereal, off note little bit, old hoppy carachter, nothing spectacular, thin feel, light body, average carbonation, astringent finish.", "Aroma of flowers and tropical fruit. Not that bitter, somewhat sweet, medium body.", "0,355 l can from Biervana \r\ncereal, bread, spruce, citrus, amber-orange color, clear and with a frothy tan foam head. \r\nmedium sweetness, medium bitterness, medium - almost full body, oily feel, slick feel, soft carbonation, long finish,", "Bue à la pression. Couleur ambrée, mousse archi onctueuse et crémeuse, et à peu près durable. Nez un peu dur le caramel. Légère en bouche, sans doute trop, et un peu acqueuse. Notes de caramel, un peu, et pas grand chose d’autre. Bof bof.", "Can from Whole Foods Market Fair Lakes\r\nAroma: pine, caramel, citrus\r\nAppearance: clear light amber with an off-white head\r\nTaste: medium sweetness, medium bitterness, \r\nPalate: medium body, sticky, average carbonation, bitter finish\r\nTasty", "From can. Pours amber, clean with big, white head. Caramel, bread and malts, some citrus but not much. Medium to low carbonation, balanced, without surprises.", "Can from online Tescos. Marmalade coloured pour with a long lasting white head. Very citrusy nose with a whisper of vanilla and melted butter. Bags of bitter hops in the flavour, lots of bitter citrus, herb. Bitter hoppy finish. Good.", "355ml can. Pours copper with a small off white head. Very bready, biscuit nose with some notes of pine resin, grapefruit and orange rind. Smooth and thick mouth feel. On the taste. Sweet caramel, bready malt, very oily resinous bitterness. Grapefruit, orange rind and dry apricot. Nice dry, hop oil bitter finish. This is properly good !!", "Aroma: Hops and malt.\r\nAppearance: Amber with slight cloud.\r\nTaste: Good. Higher malt flavor than I expected.\r\nPalate: Medium/lite body with moderate carbonation.\r\nOverall: Very good pale ale.", "12 oz can. Hints of grapefruit on the nose and pours dark amber with an off-white head. The taste is hop forward, again with a citrus and floral backbone with a mild caramel aftertaste. The mouthfeel is flavourful, rich and velvelty with a lingering hoppy taste. This lived up to its reputation as a well crafted brew and is a step above it’s competitors.", "Una pale ale muy trabajada, destacando el toque amargo de lupulo pero sin llegar a ser una ipa, dejando un gusto en paladar muy agradable y equilibrado.", "Can from Maryhill Tesco Express Glasgow. Beer served in 5°C, Duvel Glass. What a huge disappointment, beer is not even near to IPA flavor. Smell and taste is just like some cheap lager, a lot of metallic notes, iron, some malt, moderate bitterness, but harsh and without typical american hops aroma. Maybe this beer was been incorrectly stored, or not all of them are fine, but either way, I will think twice next time, before buying next Oskar Blues beer.", "Can. Pours amber, with big foamy head. Not exactly _pale_. Aroma is mostly dough and bread, along with some alcohol. Probably the most body Ive ever had in a beer which bills itself as a pale ale, rather velvety. Pleasing, bitter finish.", "Can. Clear copper with a fair head. Nice citrus aroma. Zesty hop hit, but with some nice toffee malt too, and a dry finish. A pretty good beer, but the hop heaviness would prevent me from drinking it in quantity.", "Pours amber with a decent head.\r\nMalt and cereal nose with a hint of citrus. \r\nFlavour is dominated by a strong malty backbone. \r\nLong finish. \r\nSolid.", "355ml can. Pours dark orange with a large frothy head. Aroma is orange and toffee. Taste has light orange hop to start. Toffee finish. A bit heavy.", "Not fav but ok not overly hoppy not much after taste wouldn't bother to order if something better. \n\n---Rated via Beer Buddy for iPhone", "Can from Tesco Extra, Longton. Pours golden amber with an off white head. Chewy, well hopped and resinous. Well balanced.", "DOC: 5/10/2017\n\n2015 BJCP Category: 18B American Pale Ale\n\n\r\nAROMA: Strong IPA-level piney/floral hop aroma. Some fruit or berry notes. Firm malt presence creates for confectionery-like sweetness. Clean fermentation. No alcohol. 9/12\n\nAPPEARANCE: Deep amber/copper hue (too dark for style, though); mostly clear. Large white froth retains and laces extremely well. 2/3\n\nFLAVOR: Hops dominate the presentation with piney/resiny flavor at beginning and end. Fruity/floral flavors are present at the apex. Malt base is noticeably sweet with a strong caramel/toffee taste throughout. Palette is big and robust in nearly every way - a little too flamboyant for the style, IMHO. 13/20\n\nMOUTHFEEL: Medium to medium-full body; moderate carbonation. Not quite crisp, not quite sticky; though the hops do linger and leave a dry piney aftertaste. Very efficient for 6.5% ABV. 3/5\n\nOVERALL IMPRESSION: Though a delectable brew, this is entirely too big to be considered an APA. If marketed as a AIPA it’d be nearly World Class. 6/10\n\nTOTAL SCORE: 33/50", "Bue à la pression. APA très très bien faite. Blonde orangée, ronde, houblon/malt bien équilibrés, assez longue en bouche. Finale très agréable sur l’aromatique. Vraiment chouette.", "Pours a murky bronze color. About two fingers bone colored head. Okay retention, light lacing.\n\nAroma is malty, grapefruit, orange peel. Smells juicy and sweet. A touch dank, a touch of smoke.\n\nTaste is malty, sweet. A little orange pith bitterness. There’s a touch of pine, grapefruit. Juicy.\n\nMouthfeel is medium body. A little slick. Good hop bitterness, lingering bitterness. Highly drinkable for a beer this high in ABV.\n\nOverall, this is quite delicious. A great pale ale. I would buy this again, and I would recommend it.", "Klares, dunkles goldgelb mit durchschnittlicher Schaumkrone. Malzig, fruchtig, Grapefruit, Zitrusaromen, Orangen, leicht grasig, bitter.", "Aroma: resin, pine, grapefruit, citrus smell\r\nAppearance: can\r\nTaste: high bitterness, medium sweetness\r\nPalate: medium high carbonation, medium body, slick, strong grapefruit peel retro-olfaction, long bitter finish.\r\nOverall a pretty good beer.", "Originally rated on 1/6/09. O.B. delivers another solid beer again. It pours a slightly hazy copper body, not much head or lace to speak of. Aromas of piney hops and some caramel notes as well. It goes down nice and smooth with a slightly bitter finish. Flavor of pine and some malts. I like that’s its in a can. Although its a pretty good beer, I was more impressed with Southern Star pine belt pale ale to this one, it comes in a 16 oz can, costs less and is a better beer. However this is truer to the APA style than the forementioned and it is still pretty darn good and i would buy it again.", "Lovely looking dark amber colour with medium carbonation, dense fluffy white head and good lacing.\r\n\r\nAroma is equally promising. Caramel and bready malts, orange and pine hops. Taste has initial sweetness with a lovely long bitter finish with decent body and nice hint of booze.\r\n\r\nBeautifully balanced strong pale ale. May lack the hop impact of similar strength IPAs, but very hard to find fault with this. It’s a superb pale ale which as a bonus was amazing value from Tesco.", "Light amber colour with a light tan pillowy head. Aromas of bread, dark biscuit, hay, orange zest, hints of black pepper, herbal and flowery floral overall fruity notes. Fine carbonation, little sweetness with a pronounced bitterness - bit too much for a Pale Ale to my liking. Medium body, medium lasting dry finish.", "On tap at Brody’s. Clear amber pour with a tan head. Notes of bitter orange zest, piney and citrus hops, light sugar. Crisp and refreshing.", "Can. Nose is yeast, honey, caramel, blossom. Taste is malt, resin, pith, caramel, orange. Slick Mouthfeel. Very nice.", "can @ home\r\nclear light amber, cream head\r\nlight caramel, light honey, cream, sweet red orange, pink grapefruit, butterscotch, balsamic notes\r\nSweet malts, light mou, bitter long pleasent aftertaste, red orange peel", "can at beerlovers bar. Pours clear amber, small white head. Smell is bit malty. Taste is malty, mild sweetness. Touch of bitterness. Clean. OK", "4-pack from LCBO. Man these cans are smaller than Trump’s flaccid old man hands. But unlike Trump, this beer has integrity, character & distinction. Beautiful deep brown pour with a thick, mushy cap of foam across the surface. This is the bench mark for a bitter hop-forward American pale ale. If you can’t build on it, why bother brewing it? The hops hang like monkeys on trees, with a rich malt base & surprisingly bitter finish. Boom. Great stuff.", "Just realized I have not reviewed this beer. Pours golden with a beautiful white foamy head. Smells resiny, piney, well balanced. Tastes bitter, hoppy, This is my daily driver beer. Not an IPA, not a heavy ale, the perfect beer for the grill.", "Charakterne, wytrawne, solidne, nie mizdrzące się aromatami tropikalnymi, proste, smaczne piwo.", "Can, 355ml. Clear copper colour with a small white head. Aroma of fresh hops, hay and citrus. Flavour has sweet malt, hop bitterness approaching IPA levels, some herbal citrus in the finish. Moderate carbonation. A decent brew.", "I was beginning to get sceptical of these highly-rated highly-hopped American craft beers. However, Dale’s Pale Ale is a refreshing (literally) change. Hopped to an excellent balance that is fruity and bitter without being overwhelming, lovely and light on the palate. Smells and looks good too, if a little indistinctive. Definitely recommended.", "A nice and tasty hoppy APA, with a bitter ending (slightly too bitter). I wouldn’t mind having more of these.", "Decent drinker. Turning into a go to for me. A bit Sweet and bitter with a pine nose", "Tried in a Can from Tesco. Rich golden amber colour with a thick off white head. Aroma citrus hop and malts a touch fruity. taste light to mid sweet medium bitter to finish. Medium creamy body.", "Caña en el Taxman León 14..04..2017. (r2725). Color ámbar bronce con bastante espuma blanca. Sabores secos herbaceos lupulos viejos y resinosos. Cuerpo ligero algo seco con amargo final resinoso duradero. Bastante buena. Para repetir", "[\"Why have I never reviewed this before?\" part 4]\r\nCan, 355 ml. Pours clear light golden amber with at least two fingers width of frothy, dense off-white head. Loads of visible carb, mostly small bubbles, and a little bit of patchy lacing. Head retains for a long time. Sweet and malty on the nose with a fair bit of cut grass and pine wood (not quite resin) coming through. Light touch of banana esters and quite a bit of clove and vanilla; making me think of a sweeter hefeweizen. Light caramel malt holding it all together. Taste is initially sweet and fruity with some blood orange and citrus, giving way to a fairly wood/earthy malt centre with lots of dense toffee, and finishing on a fairly sharp, slightly medicinal and resinous hoppy bitterness. Finish is long and wet with lingering astringent bitterness in the sides of the mouth. Body is medium, texture is smooth but quite thick, carbonation is a soft; fair bit of weight to it and not the easiest drinking. Good stuff.", "Amber gold color. Aroma of fruits and pine. The flavour starts with some sweetness from malts with some toffee. And changes throug to a hopp bitter end with some smoked flavor.\nWell bodied and medium carbonation.", "Amber hoppy beer. Some nice malts coming through with sweetish hops. Nice smooth texture and amber color. Decent american ale.", "355 ml can from Tesco, London, UK. Colour is amber golden, with a medium, foamy, frothy, creamy white head. Aroma is hops, fruity, malts, spices. Taste is light sweetness, medium bitterness. Medium body, oily feel, average carbonation. Medium bitter finish.", "Can, from Tesco. Deep copper gold, thin but lasting white head and gentle condition. Solid burnt toffee, sweet caramel, a little spiciness and an earthy citrus hop note in the nose, full bodied in the mouth with a delicate earthy sweet toffee note underpinned by a solid hop bitterness that remains insistent but never demanding. Finish allows the sweet toffee to re emerge but theres still a balancing earthy hop bitterness underneath and a fruity retronasal hop resin note.", "Buen aroma frutal y floral.\r\nBuen aspecto con espuma persistente.\r\nEn boca balanceada con fruta madura al principio para terminar con un amargor citrico y frutal muy agradable.", "330ml can from Tesco Gateshead served cool in a 1/2 chalice. Hazy gold with a white head Tropical aroma, similar flavours, but unremittingly sweet: I enjoyed the juicy palate, but yearned for some resinous bite or sharpness", "330ml can. This is new to the UK ..I’ve had this before anyway . A good beer to drink while fishing in a polluted river or in the morning when you’ve given yourself the day off. Drunk direct from the can ,you feel manly , tough and very repressed macho tribal. Damn liberal elites wanna ban free speech, masturbation and drinking pale ale early in the morning. You call this dysfunctional ? I call it liberty. Dales Pale has Gary’s thumb up. Good shit.", "355ml can from Tesco. Sweet pale malt with juicy hops that are gently assertive without edging into aggression. Quite strong, but that’s not really noticeable in the malt. This is like a strong lager with modern hops. It’s quite drinkable - I think the balance is OK. On the whole I think I prefer drinking a strong Euro lager, but there is a place in my life for an occasional one of these.", "Great, resonous, sweet and malty nose, substantial floral and citrus hops, too; well balanced assertive malty and hoppy flavor, earthy and piney with a sweet front end and substantially bitter and quick finish; slick and a bit dry palate; perhaps the best can of beer ever.", "Can from Beergium. Aroma is fruity hops, sweetish caramel malt, touch of orange, pine resin. Flavour is moderate sweet with a bitter finish. Body is medium, nice smoothness. Very drinkable balanced hoppy malty APA!", "From 32gp. Can. In Teku glass. Watching Los Soprano 4x04. Pretty oily, some caramel and piney hops. Ultra drinkable with a really long pleasant aftertaste. After one I want another. Abv well hidden", "From a can. Great example of the style, heaps of hops and dangerously drinkable.", "That’s a thing then. Aroma is a bit stilted but the bitterness and flavours this as are cracking and large.", "Can 0,5. Pours clear golden with medium white head, nice lacing. Aroma of malts, hops, citrus, caramel. Taste of caramel, citrus, floral, grapefruit. Medium body and carbonation.", "12 oz can pours amber with a white head. Aroma of citrus, fruits, caramel and floral. Taste is caramel, grapefruit and spice.", "Pression à La Mise En Bière - De couleur dorée avec une fine mousse blanche crémeuse - Au nez des arômes malté et herbacé, levure assez neutre, houblons floraux, nez léger - En bouche bonne amertume apparait, toujours pascal de houblons floraux, notes herbacées, les malt on de la place pour s’exprimer - Corp léger, amertume moyenne, carbonation correcte, sèche et amère, final amère et herbacé", "On tap at Brother’s Beer. Pours amber. Caramel, biscuit, apple, lemon. Good malty pale ale.", "Si te apetece una pale ale decente y sin arriesgarte esta es la tuya, facil de tragar, con buen cuerpo y con los aromas afrutados justos, muy bien", "Pours a clean amber colour with a big warm creamy head, great retention and some nice foamy lacing. Aromas of an Imperial IPA with the grassiness and caramel malts. Then, I get some rustiness, which seems to disappear after a while. Good. The taste is pretty mild at first with the caramel and then, finally the hops showing late in the finish. This creates a decent bitterness with nice dryness. Feels more like an IIPA than a pale ale.", "Light amber with a white head, some lacing and a spicy, mildly hoppy nose. Mild, malty mouthfeel with a pleasant, caramel, long-lasting, hoppy finish.", "Pas mal, peut-être un peu vieille aussi.\r\nLégèrement alcooleuse. Au nez pas mal de citron et fond légèrement orange.\r\nBouche : assez agrumes, un petit fond malté. Fnale plutôt sèche et longueur vraiment pas mal !", "12 oz can pours amber with a white head. Aroma of citrus, fruits, caramel and floral. Taste is caramel, grapefruit and spice.", "355ml can from LCBO. Pours a fairly big frothy off-white head and has a pale golden appearance. Thick dirty lacing. Aromas of light roasted malts, earthy and herbal hops. Flavours are a mix of malt and hop notes. Earthy hops and slight bitterness. Some subtle caramel as well as bready malt hints. Good balance of sweetness and bitterness. Quite easy to drink and plenty flavourful.", "Can, 0.355l. Clear deep amber color with medium soapy off-white head, good lacing and average sparkling appearance. Aroma of citrus, papaya, passion fruit, pine, herbs and dust. Taste starts with medium sweet toasted and caramel malt, following is grassy with some dried fruity and papery note, mouthfeel is astringent, while finish is heavy bitter. Medium body, creamy texture and lively carbonation in palate. Richer, hoppier and bolder than many IPA’s...", "A classic pale ale and a perennial favorite. Strong aroma of hops, which was surprising for a pale ale (would be more expected of an IPA). Had a very nice brown-amber color when poured into a glass, though honestly I had previously always sipped straight from the can like a heathen. Some light bitterness. They are definitely into this drinking from the can thing, which is cool for camping and stuff I guess. A relatively inexpensive and nice brew.", "Cette cuivrée aux relents de pins et à la belle mousse couleur crème est d’une limpidité sans reproche. La bouche est délicieusement houblonnée, plus aromatique qu’amère, bien qu’un bon petit coup astringent se pointe à la fin. Des notes de toffee, de caramel fournissent un bon tapis sucré à cette pale ale qui peut prétendre à être un parfait exemple du genre. Irréprochable et bien balancée, elle n’est peut-être pas pour tous les goûts, mais les connaisseurs y trouveront solidement leur compte.", "Naranja claro turbio con media corona de espuma de burbuja fina y buena retención; aromas a caramelo , fruta tropical, mango y papaya, ligera resina, miel y flores; en boca entrada media, refrescante, maltosa con amargor equilibrado, notas a malta y florales, retrogusto ligeramente picante, amargo y seco; cuerpo medio pleno con correcto carbónico, cerveza compleja, bien elaborada y perfecta en estilo.", "Draft Third of a Pint at GBBF 2010 (Day 1), Earl’s Court, London Aug 2010 - Dark amber in colour. Exceedingly Hoppy for an APA; piney resinous oily and earthy hops. This special batch had a little twist however - Dry-hopped with Centennial. Assertively hopped and very bitter. Should be classed as an IPA. (2010-08)", "Can. Clear orange/amber colour, rocky, slowly diminishing white head, good lacing. Faint floral and grassy aroma. Light sweet, light to medium bitter taste of caramel, flowers, leading to a grassy bitter finish. Light to medium body, average+ carbonation. Bland and very disappointing.", "Couleur cuivré avec une belle effervescence. Une mousse onctueuse et riche. ça sent la céréale, le sucre, le houblon. Une belle texture en bouche. Une bonne touche de céréale, de sucre avec un bon coté citronné et une amertume fort agréable et persistante!", "Tall cans are a bit much for this type of beer, 2 had me well past halfway there! Has all the bitter/aroma hop balance you’d expect in a pale but with a managable finish to keep it sessionable. Nice colour and consistant through the 4/5 places I had it .", "355ml can from Tesco. \nMedium sized white head disappears quickly, good lacing. Clear amber body. Nose is resin, pine, caramel. Flavour is caramel, resin, grapefruit. Good bitterness on the aftertaste. Medium carbonation, spiky mouthfeel, nice little bit of chew. Very good. \n\n---Rated via Beer Buddy", "Pours clear copper colour with at least 3 finger tall off white head. Aromas of citrus and woody hops with some pine deep down in the glass. Flavour is mildly piny, light malt and a good amount of hop bitterness. The malt has a short finish with the hops going much longer.Medium bodied and very soft feeling on the tongue.", "355ml can. \"Canned on 10/03/16\". Purchased 01/06/17. A classic LCBO two month wait before seeing a shelf may have affected the freshness of the hops, but it’s decent. Pours clear and the colour of honey with a creamy light beige cap. On the nose, British-like caramel malt profile, resinous hops, pineapple, and heavy mineral notes. Taste wise, crisp hard water, caramel malts, light citrus, and metallic hops into more mineral crispness, resinous notes, and citrus pith in the finish. I would LOVE to try this fresh because it almost comes across as a Fuller’s London Pride/American Pale Ale hybrid, and as a fan of both styles I mean that very much as a compliment. Here’s to Ontario’s 100 year old liquor laws! Huzzah!", "It pours copper with amber highlights; the head is off white and foamy. The aroma has notes of: toffee, grapefruit zest, mango, and cereal. The taste is lightly bitter. The palate is light bodied with medium carbonation, and has a short finish. Overall, it’s meh.", "Âmbar escuro de leve turbidez, espuma bege de media formação e persistência. Aroma tendendo ao caramelo, leve amadeirado, nada extraordinário como esperava. Paladar de leve dulçor e amargor. Corpo leve média carbonatação. Final de leve/média persistência, tem um tom amadeirado. Boa mas não correspondeu à nota do RB.", "6.5%ABV. Pale Ale.\r\n\r\nPoured out amber. 12°SRM.\r\n\r\nNose is malty sweet, orange maybe a hint of pine.\r\n\r\nMouthfeel is soapy. Palate has toasted malt with toasted grahams, honey on wheat toast, barley or multigrain toast. Hops are bitter melon, deep heavy grapefruit peel, resinous, sappy.\r\n\r\nFinish is long with a pronounced back of the tongue lingering bitter.\r\n\r\nOverall a big big hoppy ale, whose ginormous grain bill will largely go unnoticed. It’s really what allows you to really appreciate all of that hoppy complexity.\r\n\r\nGoes on Favorites List!", "Can. Pours brown/amber. Aroma of caramel, bread and citrus. Mild sweet with moderate pithy bitterness. Nothing exciting here.", "Draught. Pours a clear amber gold with a medium white head. Aroma is floral hops with some citrus and caramel malt. Taste is caramel up front with citrus underneath and light resin and grain in the finish. Moderate bitterness. Medium body. Somewhat above average carbonation. Oily, slightly sticky mouthfeel.", "Can. Pours a clear brown colour with a fluffy white head, aroma is light and hoppy with hints of fruit, taste is bitter and soft malt with a dry bitter finish finish.", "Pours a slightly hazy amber color with medium beige head. Aroma has caramel, bread, citrus, pine and tropical fruits. Taste has citrus, grass, pine, grapefruit, slightly tropical fruits and lots of caramel and bread/biscuit. Boozy and bitter aftertaste. I expected much more.", "Cannette 355 ml. Couleur cuivrée, mousse beige qui forme une belle dentelle. Arôme de malt sucré et houblon herbeux. En bouche, notes de caramel, malt et un peu de houblon. Amertume moyenne. Bonne", "Pours a deep clear orange with caramel earthy aroma with a hint of pineapple. Fair carbonation. Big sweet malty and hop resin taste. Hint of fruit. Slightly bitter palate with lasting malty flavour. Medium body. A treat.", "Pours a clear orange beer with a light orange head. The aroma is sweet and quite hoppy, and so is the flavour too - the hops is mainly aroma hops, not much bitterness.", "Cor de ouro envelhecido com tonalidade âmbar, translúcida, com pouco brilho e um perlage intenso e persistente; espuma marfim de média/alta formação com alta persistência e bom lacing.\r\nAroma de caramelo ao leite e biscoito; em segundo plano, lúpulo cítrico de toranja.\r\nSabor maltado de biscoito e leve crocância com amargor cítrico de toranja desde o início q evolui para um final seco e de amargor intenso equilibrando a base maltada.\r\nRetrogosto seco e de amargor assertivo e muito persistente. \r\nCorpo e carbonatação médios.\r\nAltíssima drinkabilty.", "Lata de @Cimmeria, Oviedo 17/12/2016. \r\nColor amarillo, sabor caramelo, frutal, lúpulo rica.", "355 ml can from LCBO. Pours a clear golden colour with moderate-sized cream-coloured head. Aroma is resin, grains, caramel and a little floral character. Flavour is resiny, slightly floral hops, grains and a bit of caramel sweetness. Average body and carbonation. Nice.", "While I’m not a huge fan of this bet i can see how it works appeal to some. Not quite aoale ale but also not an ipa. Mary base with a strong assertive hopping. I prefer pales and ipas to be crisp and clean tasting and this was a bit of the mark for me.", "This might be the best beer I have ever tasted.\r\nHeavy hops, accompanied by the usual hops-related aromas.", "My first Oskar Blues product and Dale’s apparently is their bell cow. Can, of course, that is poured into a tulip glass. Presence is a medium amber giving a generous, almost white, foam, which leaves a decent lace sip by sip. I get a whiff of melon and grass. A very nice hoppy intro, just a touch of sweetness, leading to a bitter finish. 6.5% alcohol for an APA, not bad. Good start, OB. I will be back.", "Can from a local Tesco, consumed at home. Dark gold, almost tawny with a loose white head which dissipates quickly. Massive resinous scent with lashes of mango and white grape. Taste is surprisingly bitter with a suggestion of sour. Notes of orange juice and dry Chablis in the finish, but there is also assertion of the biscuity malt. An incredibly intense pale ale, I’d love to try this one again sometime.", "Big foamy off-white head very long lasting.\r\nClear light amber, darker than a usual pale ale.\r\nAroma is citrus hoppy and malty with some caramel.\r\nHoppy bitter taste, citrus, grapefruit,some fruitiness (citrus, tropical) and malty. Bitter aftertaste.", "Can from Tesco. Amber with a foamy white head. Soft fruity aroma, flavour is a little harsh: pine, orange, dry and bitter. Ok", "Clear light amber color with off-white head. Aroma is quite malty and slightly buttery with some orange and earthy hops. Taste starts also slightly malty but then the hops kick in with earthy bitterness and lingers with grapefruit pith. Medium body and carbonation. Overall it’s a really well made, classic pale ale.", "Tastes like a west coast ipa. Harsh pine, orange peel and floral, so many beers like this that I don’t like, must be one of the c hops", "Burk från SB. Klar mörkorange med högt, fluffigt vitbeiget skum. Tydliga inslag av granskott, kåda och apelsinzest i doften, tillsammans med lite bröddeg och honung. Mediumkropp, något lättare. Ligger nära i smaken, med en lite stickande och klibbig beska.", "Can from J’s. Pours a clearish light amber with a finger of foam that dissipates quickly. Lots of pine resin and orange in the nose, bready malt and sourdough bread. Musty orange on the palate, citrus, good malt character. Medium body, well-balanced. Bitter finish with some lingering pine notes.", "Nice Pale Ale, had it from draft at RRT. Golden color, not too heavy and not a bad aftertaste. A pretty good beer that is good for the fall\n\n---Rated via Beer Buddy for iPhone", "Can from a Tesco in Edin. Pours quite a dark amber for a Pale. Clear. Wee off-white head. Fruity and floral aromas. A little melon. Light marmalade. Good amount of resin. Musky. Has a bit of a peppery heat on the nose. Buttery biscuits. Interesting and fairly fresh. Taste has a biscuity sweetness. Oily orange juice and grapefruit pith. Palate is fairly dry with medium-strength bitterness. Medium to light carbonation. Lasting bitter finish. Slick. Pretty punchy pale.", "Can out of my Californian Xmas box. Well, it’s paler than a stout. Not a pale ale but a Crystal-smothered peach bomb all perfumed sponge, bile and throats sweet. The hops cannot be heard above the din of cacophonous batter-sweet peach flan malt sogginess. Bits of menthol and pine. Good looking big lacing head over dark orange beer. Bouquet of vomited Southern Comfort. \r\nMy distaste is easing with the booze. But still.", "1 pint 3.2 fl oz. can. Clear deep copper, firm off-white mostly lasting foam. Aroma of citric/floral/spicy hop and caramel malt. Taste is toasted fruity sweet caramel malt well balanced with generous amounts of floral/herbal citrus hop, fairly bitter finish. Average carbonation, medium bodied, well hopped. Solid. LBW (Lagerboys Be Wary)", "Clear amber beer. Zesty aroma with a hit of malt. Rich malty base, sweet lemony citrus, bitter hop. Aftertaste is sharp and bitter.", "Pours amber with a large head.\r\nNose shows biscuity malt, light spicy, woody and herbal hops.\r\nFlavours include biscuity malt, light spicy hops and an aggressive bitterness. Somewhat metallic.", "Clear orange body with a medium white head. Aroma is caramel, malty, light grapefruit, pine. Taste is medium sweet and medium bitter. Medium body, soft carbonation, oily texture. Well balanced.", "Can from Saveur-Biere.com - Color: clear copper beer with small carbonation and medium white foam. Smell: sweet caramel malt notes, bread and hoppy with resin hint. Fruity. Taste: medium body with caramel malt balanced with resin and fruity hops. Good attenuation and highly drinkable. Very nice balance good association between caramel malt and resin hops. Aftertaste: sweet wet bitterness. Perfect balance.", "Can. Pale copper in colour with medium carbonation. Aromas are of pale and caramel malts, white grapefruit, a bit of kitchen spice and booze. Spicy citrus upfront on the palate, backed by some substantial pale malt flavor. Medium bodied with a solid bitter finish. Very old school APA in terms of the hop-to-malt balance and bitterness level, but with a bit more refinement. Decent.", "Pours clear red golden with good off white head. Aromas of bread and honey with hint of citrus and metallic notes. Smooth carbonation and medium mouth feel. Taste is toffee and Cereal with hint of citrus hops but not much. Medium sweet and light bitterness. An old can but I expected much more...\r\n\r\nNew batch this time. Aroma is similar. Decent carbonation this time. Much more hop bitterness this time which cuts through the malt sweetness. Still not much hop flavour. Score updated", "Can pours a clear orange with a two finger sand head and sticky lacing. Aroma is a wonderful floral woodsy citrus. The flavor is excellent and while initially seems quite muted, is actually just right for the style. Mild bitterness and a solid aftertaste finishes very well.", "On tap at Bar Explosive, Jyväskylä. Pours orange colour. Aroma is fruity, balanced, has mango, pine, lemon, a bit bitterish, lively carbonation.", "Color ámbar claro, translúcido, con capa de espuma de un blanco amarillento de dos dedos de grosor (buena retención). Carbonatación media tirando a baja. Aroma a malta, lúpulo por un tubo y resina de pino. Sabor donde se aprecia la malta, pero prevalecen el lúpulo y ese carácter resinoso que ya se intuye a través del olor. Bastante amarga (casi más una IPA que una American Pale Ale, aunque comprendo por qué la catalogan como American Pale Ale). Muy disfrutable y compleja. Toca muchos ángulos interesantes y a la vez es fácil de beber. Pa repetir, desde luego.", "12/20 malty but still taste good, slight bitterness, probably a bit too much of the malt taste for me\n\n---Rated via Beer Buddy for iPhone", "Orangish color with an off-white head. Aroma has notes of resin hops and orange peel. Flavor with a decent bitterness, mild maltiness, light caramelish hints. Bittery in the final.", "Can 35,5cl\r\n@ Cervezorama 2.0, Madrid, Spain.\r\nA: Hazy amber.\r\nT: Malt, caramel, citrusy, hoppy.", "Can from Beer52. Clear amber and an off-white head and a light fizz. Dusty peppery aroma. Pine, minerals and pepper are the main flavours with caramel and grapefruit behind. Maybe not as full-flavoured or punchy as some examples of the style but does at least feel a little better balanced- the malt is still there behind the hops. Growing and lasting bitterness although again not as bitter as some. Overall not bad, could do with losing some of the minerals.", "Tin from beer52 beer club. Lacks aroma somewhat. Orangey head on pouring. Hops by the bucket load which is major plus points from me. Perhaps a slight metallic tang but bearable. Packs a punch at 6.5%", "The aroma is malt a little bit of floral hops. Appearance is copper/orange with a decent but if carbonation taste is typical American Pale Ale. Nothing mind boggling but not terrible either. Fairly balanced malt and hop profile. Palate: thin/ medium bodied fairly effervescent. Decent lacing and a thin sheet of white head. Overall- decent APA but somewhat overrated. Would not buy again for the 20$ A 6-pack costs in Canada.", "From a 355ml can on 10/9/2016. Pours a deep, quite dark golden with a medium head. Has a light fruity nose. The flavour features lots of sweet citrus and stone fruit followed by some pretty firm hops. Has a medium to full body and average to lively carbonation. A very high quality, flavoursome APA.", "On tap at St Augustine’s, Vancouver. Clear golden pour with an off-white head. Just a fantastic pale ale - nice assertive hops on the nose, bright and fruity, tropical fruits, pear, citrus zest. Flavour is nicely balanced, fruity and hoppy while still very drinkable.", "0.57 l can from ’Saveur Bière’, canned in July 2016. Clear, dark reddish amber with a medium large, frothy, slowly diminishing, off-white head. Sweetish, moderately fruity-resiny aroma of candied orange, strawberry jam, a touch of mango and some pine. Quite sweet and malty, moderately fruity and slightly resiny taste of candied orange, strawberry jam, some caramel, a bit of mango and pine, followed by medium long, moderately bitter, resiny finish. Medium body, slightly oily mouthfeel, soft carbonation. Good old school stuff! Clearly different from today’s standards, but I like it!", "Can at home. Pours hazy amber with a white head. Aroma grass,caramel, pine, old school nose, light fruity. Taste is medium bitter with loads of caramel, light bread, pine, flowery hops, citrus. Old school and bit stale. But decent.", "Out of the can poured a gorgeous light copper, filtered clear, with a frothy off-white head. Really impressive visually. I got moderately-high grassy and citrus hop notes, along with caramel malt, hay and some earthy undertones. Unfortunately I detected an unpleasant buttery aroma/flavour in my sample, which others in my group perceived as a bruised/rotting apple. Will definitely try this again, as there may have been something off with the glassware or this particular batch (I checked, it was canned 3 months prior to consumption). Evidence of a really great beer here. But was hard to ignore what I was perceiving as a slight off-flavour. Will try again.", "Can. Pours amber with a longlasting fluffy white head. Notes of caramel, grapefruit and herbs. A hoppy bitter finish.", "Pours a clear copper colour with a white head. Noses fairly malty, somewhat spicy and just lightly hoppy. Round, spicy malty taste with hints og bitter hops. Your father’s craftbeer", "The aroma is full of hops, malts, flowers, citrus, caramel, pine and dried fruits. The color is copperlike and caramelish. The taste is full of hops, caramel, citrus and pine. A nice beer!", "The quintessential pale ale in my opinion (not Sierra Nevada). Poured from a 16oz can into a pint glass. The head is at 1 finger with fluffy clean white pillowy foam. The color is copper. Bicuity malt on the nose with some citrus mixed in. The flavor is slightly toasty, bready and slightly lemon with a grapefruit finish.", "Tap. Pours clear golden. Quite hoppy. Aroma is floral, citrus, orange, pine, caramel, biscuit. Medium body. Balanced. \n\n---Rated via Beer Buddy for iPhone", "Pours a clear gold color, with a white head. Aroma of hops. Taste of rich mixture of hops and malts. A very nice pale ale, thumbs up.", "Can - pours copper with a big white head. Aroma is floral, caramel, citrus and fruit. Taste is fruity up front with a building hoppy bitterness. Creamy palate.", "Can. Hazy light amber color with tiny white head. Aroma - Fruity, floral, grass. Taste - Medium bitterness, medium sweetness, malty, pine, citrus. Smooth.", "From draft at the rover, poured an Amber colour with a white head. Nose of crisp malts, sweet caramel, citrus, Candy yeast, light floral, mango, and light resinous pine needles. Taste has more pine bitter in the finish, sweet caramel, and a nog hop bitter aftertaste. Enjoyable ipa", "Golden, translucent with medium white head. \nHay, cereal, floral, and citrus aromas. \nMostly bitter with some sweet malt flavors. \nPine and citrus flavors. \nOverall a nice drinkable, hoppy, pale ale. \n\n---Rated via Beer Buddy for iPhone", "330ml can. Amber colour. Medium white head. Hints of malts, hints of sweetness, hints of barley in the aroma. Slightly bitter, malty beginning. Bit sweet but grassy in the middle. Bitter and malty aftertaste. Rather medium bodied lager.", "On tap at St. Augustine’s. Pours a clear golden with a white head. Aroma is candied citruses, caramel. Taste is citruses hoppy bitterness which becomes resiny and quite agressive in aftertaste. Very good IPA.", "355ml can. Clear golden orange with a two finger off white head. Aroma: hoppy, citrus, pine, grapefruit, malt. Taste: hoppy citrus and grapefruit nicely blended with malts. Bitter finish. Moderate carbonation and medium body. Well balanced APA.", "Can from SB. Nose is very hoppy, fresh citrus, pine and grapefruit. Taste is very full and aromatic. The hops and the malt really blend together to create a rich, bready but still fresh taste. The aroma lingers in one's nose along with the bitterness in the back of the mouth. Really a great beer and I really think it tastes its best when drunk straight out of the can or in a wine glass!\n\n---Rated via Beer Buddy for iPhone", "Draft 3/2/16 (Flying Saucer-Addison)-Pours amber with a nice head. Aroma of hops and slight malt. Taste of the same. This medium bodied brew is well balnced and kicks butt.", "Aromas of caramel, pine needles, and melons. Taste is syrupy caramel, pine needles, pineapple, mango, and melons.", "Tap @ Konttori. Pours clear amber, thick creamy white head. Caramel, some hops in the aroma. Malty, caramel, some bitterness in the flavor.", "On-tap in The BrewDog bar in Barcelona with the RBESG guys on 9th July 2016. Amber pour with an off-white crown. The nose was a pleasant combination of malty molasses and citrus fruit notes: the taste was similar. Easy drinking beer in the Barcelona summer heat.", "De tirador a BrewDog Bar Barcelona. Cervesa un pel massa fosca per ser Pale Ale. Bon aroma ben balancejat amb afruitats que recorden al préssec, caramel i resina. En boca es encara més resinosa. Potent en aromes. Molt bona.", "33cl can from brewdog online store. Light hazy dark gold to orange color. Thin white head. Medium bitterness, light sweetness. Medium body. Light sticky finish. Aroma is malty, hops, piney, orange, citric, light herbs, spices.", "This beer is one of my go too beers, light enough for a hot day but no lacking in flavor. To me it is robust like an ipa, but without the dryness after. \n\n---Rated via Beer Buddy for iPhone", "Tap at BrewDog Barcelona. Clear light amber with off white head. Caramel, dried tropical fruits, light grassy and green leaves, creamy dark bread. Medium sweet and bitter. Medium bodied.", "Pours clear copper with a large off-white head. Smells piney and citrusy. Taste is citrus and pine and malty sweetness. Medium-bodied with a supple texture and average mouth-carbonation, Oskar Blues Dale’s Pale Ale finishes with a soft hoppy bite.", "Orange citrus aroma overwhelms but a little caramel sneaks through. The body is big and chewy, really large for the style. A good one for summer but strong enough year-round. Poured from a can (what else?).", "can - great amber color and nice malt and hop aroma. Good malt and hop flavor with an ESB finish.", "12oz can - Pours amber with orange hint. white head. Good smelling brew with citrus fruit and grassy notes, and a bit of roasted malt. Flavor of a sourdough bread, pop of citrus, and hay. Subtle nuttiness, with some slightly sweet cereal grain. Bitter finish.", "Oskar Blues Dale’s Pale Ale is a nice example of the style but not a standout IMHO. Lightly hazy amber pour with a decent head. Low fruity aroma. Taste is malty with a pine background -- not a lot of floral or fruit notes. Dale’s Pale is a decent go to brew.", "Good colour big head great lacing chewy texture good mix of hops brings it to life nice can at home", "This my 2nd favorite summer time active beer in a can behind Shift beer by New Belgium. This beer is a lot more hoppy than Shift. This beer as an awesome hop aroma and finish with a hearty rich middle.", "Finally a Pale Ale not going for full IPA zesty profile. Pours up a light golden color with a nice white head. Malts tastes like an old English ale with a bread skin and sugar background. Quite well balanced into the sweetness of malts. It’s also tea like with some resin and herbal notes to it.", "Pours a golden amber. Moderate lacing. Nose a little piney, hints of citrus. Taste is crisp and clean grains and malts. A quality pale ale.", "On tap. A beer that basks in its middle-of-the-roadness. It’s fine. It’s kinda hoppy. It’s perfectly alright for drinking at a bar or a ballpark or pretty much wherever. It’s not perfect -- it’s too bitter and kinda boring -- but who can knock a beer for not rising above it’s own normalcy?", "Can from Appellation Wines Comely Bank. Pours clear amber. Cinnamon, pine resin, butterscotch. Big flavours, toffee, tropical fruit, bitter, loads of hops, long, spicy finish. Lush.", "Can from offie in Warndon. Been looking for this for ages! Worth the wait. Really good brew. Possibly more an IPA than a pale ale. \n\n---Rated via Beer Buddy for iPhone", "Clear amber, covering lace. \nFull body, moderately flavorful, smooth texture, good carbonation and heat, long palate. \nBitter, dry. \nHoppy in a simple way, malty, non-sweet caramel. \nGood but not my style. \n\n---Rated via Beer Buddy for iPhone", "Great pale ale, would definitely have again. Great taste texture, look, and feel.\n\n---Rated via Beer Buddy for iPhone", "Light earthy floral aroma. Pours clear gold amber with a long lasting thick foamy white head. Smooth medium bodied. Bitter edge on the finish. Earthy. Grassy. Not bad.", "From a can at drinkstore. Big hop aroma for a pale ale but big malt flavours balnce it well. Really good beer.", "Pours dark orange with medium to large head. Aroma: biscuits, oranges, lemon, with a pine tree in the background. Taste is on the malty side, but nicely counterbalanced with pine tree hops. Palate is medium. Very solid, very drinkable, very good.", "Pours clear orange with medium beige head. Aroma is fresh and fruity, some mango, sweet tropical fruits, floral notes, cereals, citrus, hops. Taste is also fruity, citrus, some floral notes, fresh hay, some cedar, light hops. After taste contains more hops, flowers and little bit resin. Very nice and refreshing beer.", "thick, very oily, caramel, light pine, hop is a bit muted. Taste is bitter oily orange peel, grapefruit, some yeast, not very outspoken, light caramel. Bit oily. Okay, nothing exciting, decent standard basic beer for a brewery.", "On the nose has resin, melon, fresh fruit. It has a medium high body of a sweet caramel with a hearthy, meaty feeling to it. So umami. Perfectly balanced with a bitter finish.", "Nice aroma of west coast hops. Piney, good. Taste is hops and golden malt. Pine and resin, but not overly bitter. A smooth finish for a pale ale. Very good. \n\n---Rated via Beer Buddy for iPhone", "A 12 fl oz can with a canned on date of 20th November 2015 and poured into a Mikkeller pint glass. It poured a clear copper colour with a less than two finger slightly off white head that dissipated slowly to a nice puffy layer and left nice stringy lacing. Aromas of a lot of pine and wood with a hint of citrus orange peel zest. Tastes orange citrus with a bitter piney hop in the background and honey caramel malts. Medium bodied with medium carbonation. Overall, this was a decent pale ale and easily drinkable.", "Pours a light hazy brown with a white head. Nose is a mix of sweet, pine, a little bready. Subtly sweet mouthfeel then the hops kick in but mix nicely with the malts. Not overpowering or too bitter. Nice lingering finish. Good pale ale.", "355 ml, can conditioned. Slightly hazy, dark amber, thin head, loads of sediments in the glass. Aroma is piny and spicy, almost peppery. Mouthfeel is fizzy, bitter and dry, long aftertaste. Hops are very present in the taste, and I like it! Can has no date to it, but I think it’s quite fresh. My first Oskar Blues experience. (y)", "Poured into a shaker showing lightly filtered honey brown with sparse white foam. \r\n\r\nThe nose shows sweet tea & biscuits. \r\n\r\nThe palate is well carbonated and light bodied. Lightly sweet with hints of lemon and a moderately bitter finish.", "Keg at Brewdog Clapham. Bready and citrus aromas. Spicey funky hops. Lingering bitterness and strong tight carbonation. Very drinkable at 6.5.", "Sample from can @ Sur & Bitter, Sandnes. Pours golden, with a big, off white head. Aroma is hoppy notes of apricots and tropical notes, some citrusy notes, and sweet malty toffee. Medium to full body, with soft carbonation. Flavour is bitter hops, with pine, citrus and tropical notes of apricots and mango, as well as some malty notes of bread and toffee.", "A completely cleae amber body with a quickly settling head. Nose has citrus fruits, resin, caramel and floral notes. Taste is mildly sweet with a hefty bitterness that stays lingering on the palate. Soft carbonation and palate on the richer side with some stickiness. Decent pale ale but I’m left a bit disappointed.", "Pours clear yellow with a white head. Aroma of grass, citrus and pine. Taste follows nose", "On tap at BBF. Amber colour with white head. Citric and caramel aroma. Sweet, ciric, fruity, caramel and pine taste. Medium body.", "Keg @ Brewdog, Manchester. Bright copper-amber with a thin head. Has a sweetened hoppy character, there’s a dry pale ale fruitiness underpinning this.", "This beer was meant for me. Seriously hopped up Pale Ale that I can session for hours on end. It’s my staple and I highly recommend a pint to anyone who hasn’t tried it. Aroma: almost a little pine, maybe some citrus. Appearance: Golden. Taste: The bomb. How a Pale Ale should taste. The bar against which all others shall be measured. Palate: not heavy, very smooth. Overall: Duh. It’s amazing.", "Can. Golden pour with sweet caramel malts and hops. Bomb pale ale great biscuity malts and resiny hops. Really legit hoppy pale ale. Everything I like in a pale ale.", "Very good ale, just a little sweet for me. One of the better pale ales from a can.", "Poured from draft at Grill Next Door nice copper color with a thin white head. Aromas of caramel malt notes of citrus and floral tones. Nice light sweetness and balanced bitterness of hop in finish.", "Can from Hops & Crafts Exeter,pours golden Amber with a nice white head,aroma of sweet piney hop ,caramel,bread,marmalade & grapefruit,the taste is beautifully balanced piney hop ,grapefruit ,slight pepperiness,marmalade with balancing sweetness,herbal notes & a good malt body ,slowly becoming dry in the finish with more well balanced hop flavours. This is a classic pale ale & absolutely beautifully balanced. Sheer class!!!", "Such a distinct flavor for a pale. My go-to for this style. A nice sweetness in the finish to balance the hops. \n\n---Rated via Beer Buddy for iPhone", "Aroma: herbs, caramel, grapefruit.\r\nAppearance: clear amber color and thin white head.\r\nTaste: medium herbal bitterness, weak citrus notes, caramel, semi-dry.\r\nPalate: medium body and medium carbonation, bitter finish.\r\nOverall: Decent PA, quite drinkable.", "Can.Light amber body with nice white head. Aroma is fruity citruis with some pine. Taste is caramel malts wizjh pines and maybe some honey. Aftertaste is nice bitter perfectly balanced by the caramel swetness. Very nice one.", "I have seen this at stores a lot and finally decided to give it a tree. Not all that impressed. Seems to lack the citrusy flavor of many APAs. Much more on the malty bitter side. Not what I was expecting. Not a bad beer, but very average.", "I give this beer respect by not going for full IPA zesty profile. Malts tastes like an old English ale with a juicy bread skin and sugar background. The hop profile is biting a lot. That’s a bitter beer no doubt. Yet quite interestingly well balanced into the sweetness of malts. It’s also quite tea like with resin and herbal notes to it. Nice.", "Aroma: clean and hoppy with a few malty undertones; Appearance: clear, amber pour with white head that dissipates fairly quickly; good lacing; Taste: distinctive hops but not overwhelming; Palate: very light bodied with medium bitter finish; Overall: very pleasant, lighter beer; would definitely buy again.", "12 oz. can. Pours a clear copper with a creamy and persistent off-white head. Lots of lacing. This is a nice looking beer. Aroma of citrus and pine. Taste is caramel malt, subdued citrus and grapefruit notes, and plenty of piney hops bitterness. High carbonation levels. Light to medium-bodied. Rather rich for a pale ale, it’s almost approaching IPA territory. Regardless of its category, it’s wholly satisfying.", "Ljus bärnsten med stort vitt skum som fäster på glaskanterna. I doften finns en dov fruktighet, örter, blommor, fruktkola (och när den blir varmare lite disktrasa). Fyllig smak med maltsötma, dov fruktighet, örter blommor, fin avslutande beska. Välbalanserad! En riktigt bra pale ale.", "Beautiful deep copper color with white head. Aroma is piney, resinous. Taste is bitter, grassy, a bit of a toasty malt body, but just a bit. Dry overall. Very good!", "Can to snifter. Nose is moderate in citrus, mostly grapefruit. Taste is moderate in caramel, slightly sweet, chewy. Modest hop bitterness and flavor. More like an extra pale ale and very chewy.", "Pours clear clear copper. Aroma is balanced, hoppy with pine. Taste is nice and balanced hoppy but not overwhelming.", "Can. Pours dark copper. Has a big bold taste light body and a big taste of a pale ale. Has a citrus taste and a nice sweet after taste. Great beer", "Copper colored, bit unclear, small off white not very lasting head. Aroma is of caramel malt, tropical fruits and bit pine . Taste is medium sweet caramel malt, tropical fruits, some biscuit, citrus, moderate hoppy aroma and bitterness, dryish finish, bit bready. Medium bodied, soft carbonation, oily. \r\n(can, Bierhalle Deconinck, Vichte)", "Tap@BrewDog, Edinburgh - orange Amber pour with white head and lacing. Sweet fruity and malty with some caramel malty backing, slight toffeeish, mandarin, citrus peel, pretty decent IPA.\n\n---Rated via Beer Buddy for iPhone", "Pours a crystal clear copper color small off white head. Aromas of citrus and woody hops with some fruit deep down in the glass. Flavor is mildly fruity, light malt and a good amount of hop bitterness. The malt has a short finish with the hops going much longer.Light to medium bodied and very soft feeling on the tongue.", "From tap at Mi2 at Cardinal 15.02.16. Clear, dark orange amber. Off-white head. Aroma and taste of pale caramel, mango and citrus. Fine aftertaste.", "On tap at Cardinal, Stavanger. Pours clear amber with little off-white head. Aroma of caramel, grapefruits, resin. Tastes slightly sweet, but bitterness dominates. Distinct bitter finish.", "Chmiele: Northern Brewer na goryczkę, Cascade i Columbus na smak, Centennial na aromat. \n\r\n\r\nKolor: Bursztynowy. Klarowny w pełni. \n\r\n\r\nPiana:  Kremowa, bardzo bujna, średnio oczkowa.\r\nPiana gęsto oblepia ścianki szkła pozostawiając grube firany na krawędziach. \n\r\n\r\nZapach : Hymmm...co tu dużo mówić - znowu się cholernie zawiodłem:( Zapach lekki i mało wyrazisty. Prawie śladowe ilości owoców tropikalnych. Cytrusów tyle co na lekarstwo. Pozostał już tylko karmel i zioła... \n\r\n\r\nSmak: Subtelnie owocowy, bez wyraźnych wskazań na jakieś konkretne owoce. Piwo ma wybitnie ziołową formę.\r\nGoryczka wysoka z ziołową nutą w tle.\r\nPo chwili lekka trawiastość na języku.\r\nW smaku wyczuwalna również metaliczność. Test na skórze potwierdził.\r\nNie powiem, że nie jest pijalne, ale na bank partia z tą datą nie należy do najlepszych. \n\r\n\r\nWysycenie: Bardzo wysokie. \n\r\n\r\nPodsumownie:\r\n\r\nPowoli chyba odpuszczam sobie kupowanie amerykańskich jasnych piw. Nie ma po prostu sensu wydawanie (dość sporych) pieniędzy na nie.\r\nTestowałem już butelki, jak i również puszki.\r\nAromat jest bardzo ulotny, a smak nie tak głęboki jak powinien być.\r\nNiestety musi to być bardzo świeża warka, aby przetrwała trudy dalekiej morskiej podróży.\r\n\r\nBrowar Oskar Blues z Longmont, Colorado szczyci się produkcją piwa w puszkach.\r\nPropaguje ich używanie jako doskonały sposób zabezpieczania piwa przed promieniami słonecznymi oraz ulenieniem.\r\n\r\nNawet puszka w tym przypadku nie pomogła i uczyniła z tego jakby na to nie patrzyć cenionego i bardzo znanego na świecie piwa - zwykłego przeciętniaka.\r\nMoże przyjdzie kiedyś okazja testowania innego, świeżego piwa, wtedy wrażenia będą lepsze.", "Nice lacing, great copper color. Slight bite and not quite smooth, aroma is faint. Above pale ale for the value and everyday drinkability.", "A great go to beer. Pours dark amber, thin head. Possibly a wee bit too carbonated. Loads of hops and bitterness, which persists. For an American pale it has a depth, sweetness and clout which almost tips it into Imperial territory. Punches above its ABV Good stuff.", "This is a beautiful beer in the glass. very prominent hop profile. I would call this an IPA, but these days you might call it an American pale ale. Darker than I expect, it's a nice Amber. Good ratio of sweet bitter and alcohol. Next time I'm looking for an IPA I'll consider this one. Of course if you're drinking it from the can you might be having a different experience. Cheers!", "On tap @ Dorothy 6. Pours a medium orange amber with a thin white head. Not much of an aroma. I found this to be very ordinary and plain. It was fairly smooth and somewhat crisp with a slightly bitter finish. Nothing special here, I’ll be moving on.", "Can from Whole Foods Market in Mountain View, CA. Pours amber with a thick, creamy head that lingers. Aroma is bready, malty, hoppy. Taste is the same. This is really good...incredibly balanced and bready/beefy. A go-to pale ale (akin to Anchor’s Liberty Ale).", "My go-to beer......great balance of malt and hops. Packs a nice finish without overwhelming you. Light enough for beach season, but also robust enough for a wintry day by the fire.", "Can at The Font, Manchester. Pours a hazy amber colour with a fizzy off white head. Aroma of toasted malts, caramel, slight cereal, some grapefruit, a little mango and pine. Taste of toasted malts, caramel then big grapefruit, some orange, slight mango, resin and grassy hops. Medium bodied and soft carbonation. A dry, lingering, toasted, resinous hop bitterness in the finish. More like an IPA than a APA, big grapefruit and resinous hops balanced perfectly with toasted malts and caramel, really smooth for a 6.5 too. Highly anticipated and enjoyed it.", "Can. Hazy amber with plenty of fizz and a decent, off-white, head. Citrus fruit, grassy hops, some strong cereal mlats and a dryish finish. Enjoyable.", "12 oz can served in a mug (from notes).  Revisited with a very fresh (7 days old) can in July 2017.  \r\n\r\nPour is medium-dark amber; surprisingly dark for style, and suggesting a rich PA. Clear with a nice creamy light tan head, about 2 fingers from a rather gentle pour. \r\n\r\nAroma: somewhat vague blend of hops but with a slight off-odor. \r\n\r\nT - Both citrus and pine notes suggest multiple hops {the brewer says \"four kinds of American hops\"}. Quite hoppy for a PA, yet only mild-to-moderate bitterness. Detectable malt contribution here, but balanaced towards the hops. Slight off-note in the aroma was essentially masked by the hops and malt in the taste. Flavor improved with a bit of warming from a cold pour. \r\n\r\nM - medium body; rather full for style. Good carbonation. \r\n\r\nO - Dale’s Pale Ale is easy to recommend for \"no glass\" situations when one needs canned beer and wants one that is hoppy.", "From can, pours light amber color with a frothy beige head. Resiny aromas with a touch of sweet malt. This is a fresh, medium-hopped brew, not over the top bitter. Flavors are balanced with a dose of malt, with a pleasant, lingering, slightly piney finish. Nicely done, rapidly becoming my go-to owing to excellent local distribution.", "Malty, not much hop aroma or taste. Mild bitterness. Too malty and will not buy again. Kinda like coast hopart which is also very malty. Would get at a bar if that all they had. Used to like this beer until I became a hop head. \n\n---Rated via Beer Buddy for iPhone", "12oz can on 09-Oct-2015 at Brewerkz, Stadium, Singapore. Hazy amber colour with a thick white head. Aroma of malt, caramel, pine and tropical fruits. Nice bitterness on the palate. Lots of tropical fruit, citrus, apricot and hops.", "Old note. Canned. Aroma has grassy and citric hops.Unsure about looks since well.. Straight from the can! The taste is light sweet, light-moderate bitter, has biscuit, citrus, grass. Good one.", "Beer 4 of the US tour. The perfect refresher for 29 degree weather in LA. Not an overly hoppy nose but great hoppy flavour coming through. The malt profile is just enough to provide some backbone but also just enough to let the hops shine. This would be a go to summer beer if I could get it back home!", "Poured from a can. Copper orange hue with no haze, foamy white head that sticks nicely as I drink. Mild Carmel sweetness with citrus & pine in the flavor. Some apricot in the nose. Moderate dryness that lingers.", "Can in LA. Lasting creamy white head. Big hoppy aroma, moderate bitterness, it’s an APA not an IPA but it’s close! Fresh, fruity, citrus and some grassy hops. Really nice refreshing summer beer, but the alcohol catches up on this big can. Great APA.", "Poured from 12 ounce can at Southern Culture On The Skids concert at the Southgate House Revival on May 9, 2015. Medium to dark amber hue, nice citrus/hop nose, good bittersweet flavor with lots of fruit and some complexity. Could stand a little stronger hop profile but this is a very flavorful brew.", "I didn't take any extra notes when I tried this beer for the first time but I'm gonna try it again and update my comments.\n\n---Rated via Beer Buddy for iPhone", "Can from craft beer cellar Waterbury dated from August a: light caramel, citrusy, earthy notes app: clear dark cooper white head t/p: med body with moderate long bitter finish. O: glad that I finally got a hold on this classic of the classic. Well done.", "The aroma is full of fresh hops, and some sweet malt. As a pale ale, it has a slightly thin mouthfeel, but has a clean bitter hop finish", "From 12oz can to tulip glass. Pour is a nice red-orange with a thick off white head. Nose is rich hops, malt, bready, pine, touch of caramel. Taste is medium bodied, bitter with sweet notes coming through. Awesome mouthfeel, almost a juicieness to it with several flavors. Awesome beer", "Warning: this does not taste like most pale ales. It is more like an IPA. I guess that’s why i like it since those are my favorite category, I also love that this comes in a can: far more portable and better environmentally.", "Can: Amber in color with a white head and some lacing. The aroma is pine and citrus with a lite bitterness in the taste.", "Can. Pours deep amber. Nose is resiny pine, some fruitiness. Flavor is complex for a pale ale - lots of intriguing full ale flavors - a great smattering of resiny US hop flavors, bright and just a little dank - hops are assertive but blend well with the rich toasty malt background. Finishes hop forward- some pine and a pleasant bitter bite.", "Very IPAey. Tasty hops profile with big flavors and lasting citrus hop aftertaste. Big beer in a small can.", "Six pack of cans. Pours out a clear light golden amber. Frothy light tan head. Lemon-pine aromas and flavor. Decent malt sweetness with notes of pine, citrus, pepper and floral notes. Long bitter finish. This is really an IPA in APA clothing.", "I wouldn’t expect much from a beer in a can, but wow is this an excellent offering from Oskar. Nice mellow ale flavor - good citrus with some hops on the finish.", "Poured from a can. Copper with a foamy, long lasting, off-white head. Aroma is a little malty, some pine notes. Taste is sweet, malty, bready, with some bitterness in the end. Very well balanced flavor profile, great blend of malt and hop flavors. Palate is pretty smooth, some bubbles, medium feel overall. Definitely a solid and flavorful beer. Very enjoyable.", "A hoppy and gentle citrus note this well balanced pale ale. Skeptical about the can at first, but sure opens up the portability of craft beer.", "Light amber pour. Crisp hopped notes with a distinct citrus flavor. Dry to say the least. This is a repeater pale ale..", "Can@Voldby. Pours amber with a white head. Aroma and taste is hops, citrus, some tropical fruits, malt, grape. Medium body. Soft carbonation. Nice dry bitter finish.", "Served on tap at Ian's pizza. Clear light Amber color with a white head. Sweet yeast citrus aroma. Citrus pine orange bitter malt. Not as malty as expected. Medium body.\n\n---Rated via Beer Buddy for iPhone", "Rusty orange colour with thin wispy head. Aroma has some citrus peel. Flavour has caramel malt sweetness. Bitterness is moderate but builds up slowly in the aftertaste.", "Can at home. Piney hoppy nose. Piney and citrus hoppy flavours. Balanced fruity bittersweet taste. Crisp and dry finish. Decent.", "Can @ DØE meeting. Pours golden with white head. Aroma of malt, grassy hops, fruit, bitter citrus, orangepeel, pine. Flavor is rather bitter, malt, hoppy, grass, fruit, citrus, orange, grapefruit, pine, light resinly notes. Medium to full body, average carbonation, lasting bitter finish. Nice and hoppy, full bodied for the ABV . 211015", "4 oz pour on draft at District Commons. Clear golden amber with off-white head. Aromas of biscuit, citrus, light floral. Tastes of toasty notes, biscuit, citrus, floral. Medium body with a dry finish.", "Pours caramel color with off white flufdy head. Aroma is pine, grapefruit, citrus and sweet. Flavor is citrus pine up front followed by caramel and bisket flavors finishes with a bitter caramel flavor. Overall very balanced nice bitterness.", "Can. Lots of citrus and pine. Also some tropical fruits and caramel. Slightly sweet and moderately bitter. Dry and bitter finish.", "Can at America on Tap Saturday\r\nI’m kind of surprised I haven’t rated this before. Rich bready caramel earthy spicy citrus and pine hops to counter, just a great beer.", "deep amber color; bready malt and piney hop aroma; piney hops on a medium bodied, bready malt base; some citrus notes; bitter finish", "Pours a clear golden amber, with a decent sized frothy head. The aromas are resin, pine, tropical fruits, and lightly toasted cereals. The taste is fairly sweet, with a bitter kick in the finish. The mouthfeel is medium, and so is the carbonation. Long aftertaste with resiny flavours.", "can, thanks heaps baerwaldt. pale amber with a light haze and a fluffy head; loads of oranges in the aroma, cottee’s orange mandarin cordial, light pine and other citrus; plenty of bitterness, slightly oily mouthfeel, loads of pine and citrus; delicious", "From a 19.2 ounce can bought at the QT. Pours an orange gold, slightly translucent and an inch of lingering head. Nice carbonation. Faint nose. Beautiful taste. Perfectly hopped. Wonderful beer, especially from a gas station.", "355ml can. Light unclear orange color with white to off white head. Hoppy and malty aroma, pine, citrusy fruity, grassy, caramel. Sweet and bitter taste like aroma. Medium oily body with sot carbonation.", "On tap at Malone’s in East Point, GA. Clear copper pour with a one-finger white head and lots of lacing on the glass leaving rings all the way down marking every sip. Nice biscuit and citrus aroma and taste. Medium slick mouthfeel. Very nice.", "Amber colour. Thick dark cap. Spur aroma. Moderately bitter with sour and fruity notes. Bitter aftertaste.", "Pours a clear copper with a lasting white head that leaves a nice lacing. Aroma is toffee, mango with a slight dustiness. Taste is caramel, citrus, slight hints of pineapple and pine with a long bitter finish that really hits the spot. A real favourite of mine and my go to IPA. This particular can isn’t the freshest (canned in March) which may explain the dusty scent/taste.", "12 oz. can, part of mix six. Pours amber with foamy off white, lasting head. Aroma of hops, citrus and pine. Taste was hoppy at first, citrus and some pine. Long lingering bitter finish.", "Bottle @ home. Pours a clear amber color with orange notes. Has a a large, lasting and creamy off white head and nice lacing. Well balanced hop and malt aroma with intense grapefruit, pine apple, flowery and somewhat spicy hops, caramel, biscuits, bread. Medium bodied, Medium carbonation. Taste is medium bitter, refreshingly crisp and has resinous hoppiness combined with a dry, low to medium sweet, malt backbone. Notes of caramel, toffee, biscuits, rye bread. Hop flavors of grapefruit, blood orange, flowers, pine apple. Assertive, balanced and lasting bitterness with notes of grapefruit. One of my favorite American Pale Ales.", "Can from Head of Steam Newcastle. Robust pale ale, hoppy and rich on biscuity flavours.", "Average American Pale Ale. Was better on nitro than I've had in the past, but nothing remarkable \n\n---Rated via Beer Buddy for iPhone", "Pretty, hazy dark golden beer with a lasting white head. Aroma is floral (it smells a bit like women’s perfume, I got some white rose and lavender there), woody and slightly fruity (orange peel). Dry, moderately bitter and citrusy taste, decent hoppy aftertaste. Palate is surprisingly smooth without being watery, is this a nitro can? Kinda tastes like it and the ridiculous foam retention would speak for this too. Anyway, one of the best beers I’ve had from this style so far, of course nowhere near a solid IPA, for me at least, but sometimes a normal pale ale is just the right thing, and this one is remarkably well executed.", "Pours a dark amber from a can. Not sure why, but this is just middle of the road for me for such a high rating. Nothing really good and nothing really bad about it.", "Small Can. Piwo pakowane w puszce, ale to jest chyba wyjatkowo dobre. Najlepsze puszkowe piwo jakie testowale,. Zapach perfumowy, chmiele dajace aromat dojrzalych rozowych grejfrutow, pomaranczy i liczi. Smak tak samo egzotyczny jak aromat, wiec kilogramy wnet cytrusow, do tego morela suszona i brzoskwinia. Kolor miedziany, lekko mglisty. Pianka srednia ale bardzo trwala, puszysta. Doskonale i niemal perfekcyjne APA, gdyby nie ta puszka, a szkoda", "Klar amber farve med lyst skum. Lukt av sitrus, malt og humle. Smak av sitrus, malt og humle. Vinmonopolet Kvadrat.", "tap. very tasty pale ale! Definitely one of the better ones - pretty close to an IPA - maybe a RIPA even. Loved it. This brewery makes some great stuff", "Slightly foggy bright orange, film of creamy head. Aroma is quite balanced really, with lots of cereal, fruity malts. Of course there are hops (grapefruit first and foremost, resin backup), but for an american ale, it’s remarkably malt-forward. Which is nice! It’s refreshing, drinkable, and has a lot going on. More please!", "Can 33cl. Amber, clear with a offwhite head. Hoppy aroma, and some malt and, caramel. Bitter taste with a soft hoppy end.", "Can. Pours is clear orange with thick white head. Aroma is fruity and floral orange peel, grapefruit, caramel and light honey. Taste is medium bitter, light fruity sweet, some orange notes on tongue. Medium body, creamy texture, soft carbonation. Long bitter finish. Awesome beer.", "Pours clear golden from can. A bit sweet, some citrus and hops. Medium carbonation.", "How : can Appearance : clear golden, medium white head. Aroma : citrus, floral, honey and some herbal tones. Palate : light body, average carbonation.", "Can. Pours a clear golden color. Aroma and taste are sweet with malts followed by pine hops.", "Lukt: Citrus og honning.\n\r\nUtseende: Gyllen honning farge.\n\r\nSkum/kullsyre: Tynt skum, ring langs kant.\n\r\nSmak: Citrus, honning, noe bitter avslutning.\n\r\nHvor: Kjøpt@VP Kvadrat, Nydt@Tasting hos Gorm.\n\r\nMedium: Boks@330ml, ABV@6,5%, Når@09.08.2015", "Floral hoppy aroma. Color dark gold, clear. Taste is piney, malty, with citrus bite at the end. Refreshing after a bike ride.", "355 ml can. Pours a hazy orange with a medium, long lasting, off-white head that laces. Fresh, hoppy aroma of grapefruit and light caramel. Sweet flavour of grapefruit, malt and caramel with a very dry, bitter, hoppy finish. Medium body with an oily texture and soft carbonation. Wow! Best beer I’ve ever had out of a can!", "I'm excited about this one although the price will help me resist....$20/12pack. It has a nice bite as it hits the tongue and mellows quickly before it even hits the palate. The palate keeps a nice even bitter taste though. This is more an IPA than a pale ale, in my opinion. I'd be glad to have this again.\n\n---Rated via Beer Buddy for iPhone", "Can. Orange color. Aroma: malt liquor, citrus, fruits and floral hops. Taste: good malt and hops, citrus and floral, drinkable.", "Pours a light golden with a medium frothy head. Grass, hops, and malt in the aroma with a bit of pine. Taste is lightly sweet a nice long lasting bitter finish. A nice refreshing American pale ale.", "This is my refrigerator beer - nice aroma without being overpowering. Dale's is better than most craft IPAs and never disappointing. \n\n---Rated via Beer Buddy for iPhone", "Pours a glowing, coppery-amber color with a great looking, big, froth head.\r\n\r\nSmells of lemon zest and cakey malts with a whiff of kiwi added, showcasing a pleasant, thoughtful put together hop profile. \r\n\r\nDrinks easy, with a higher carbonation to it, revealing a fitting balance between hops and malts.\r\n\r\nTastes of syrup coated malts, melting together with fruity hops, revealing orange and crisp lemon zest. Lemon invites a prominent dryness to the otherwise very malty beer, giving it an inviting hop character, which then results into a long lasting, lemony dryness. During its finish, the beer reveals a mineralic quality, carried to the tongue by the lively carbonation, while malts and hops are still there, providing an easy agreeable bitterness.\r\n\r\nWell balanced and easy drinkable, while its hop profile is well integrated into the distinct malts and the higher, refreshing carbonation.", "Poured from a 12 OZ can into a pint glass.\r\nThis beer is a clear amber color with a large white head. The taste is really good and is full of malt, hops and citrus. the aroma matches the flavor and it is a medium bodied beer with heavy carbonation. Overall, this is my second favorite beer from Oskar behind Ten Fiddy.", "Orange body with a thick white head. Sweet toffee smell with a taste to match. Smooth & creamy with balanced citrus & lightly fruity bitterness. A refreshing full bodied pale ale.\n\nRated by BrewTom", "Tall can. Pours a clear copper with a tall almost beige head that leaves nice lacing. Nose is of caramel, citrus and generally fruity hops. Taste is moderately sweet and moderately bitter, offers some nice fruity hops again with a good piny bite. Both body and carbonation are moderate. Overall a really good option for camping, especially in big cans like these!", "Draft at Moriarity’s in Philadelphia. Pours clear amber with a 1-finger white head. Mild piney hops aroma. Medium body with a dry finish. Flavor of piney hops with a note of caramel malt in the base.", "Quite malt forward... caramel malts at the fore, with a hoppy bitter finish. Not bad, but it’s got a bit of a weird aftertaste to me. Not really my cup of tea.", "Can. Lots of caramel in both aroma and flavour, American malty character. Other than that classic hoppiness, resiny zesty citrusy. Very good.", "Can kindly shared by Miro, many thanks. Oranfe golden color with medium white head. Citrus hops, caramel malt in aroma. Taste, citrus hops, caramel. Long hoppy bitter finish. Very good.", "Can. Pours amber with a thin off white head. Piney aroma. Big malt up front well balanced with the piney hops. This is a pretty strong pale ale but with the balance is pretty easy drinking. Solid overall.", "I had it straight from the can. Even in the can, you get a nice hop and caramel aroma. The taste is a very nice balance of hops, malt, and brown sugar. It’s nice and smooth. This was very impressive.", "strong grassy caramel aromas, pale gold colour with foamy white head, well as for taste i find it quite sweet, brown sugar flavour, even the hop bitterness is quite sweet, refreshing and quite nice but i was expecting a hop bomb!", "The centennial certainly comes through. Big, bold and fruity. A heavy, sweet core from the malt with punch exotic and citrus fruits from the hops. Great from a can. Perfect for a picnic but I wouldn’t have too many - not a session beer!", "Pours golden with a white head. Aroma is citrus with pine. Flavor is citrus up front with a dry malt backbone and a pine hops finish. Nice crisp, clean, hoppy brew. Classic pale ale.", "It has been quite some years now since I first saw canned American craft beers and I remember being a bit skeptical about them, associating cans with metallic taste and cheaply made, bland beer styles, primarily lager and strong lager for alcoholics. Now I like them a lot, with the cans being lined with polymer in between the beer and the metal eliminating the metallic flavour; the countless craft beer cans are appealing to the eye, practical in use and protect the beer from light and oxygen probably better than a glass bottle does. This Dale’s Pale Ale started the canned craft beer movement with the intention of being able to easily take good beer outdoors on a walk in the Rocky Mountains, so I am happy to be able to taste one. It has a practically clear but eventually hazy, very warm and deep amberish orange colour with vivid fizz, supporting a creamy, moussy, complexely lacing, egg-white head with good retention. Lovely dry-hopped, blossomy and fruity aroma jumps into the nose, of overripe papaja, pink grapefruit, damp pine wood, soap, chicken stock, cookies, rose petals, hint of burnt toast and roasted pine nuts, bitter honey, tulips. Crisp, refreshing onset of redcurrant, mango, pineapple and starfruit, so a touch exotic but not overly so, sweetish with sourish balance further increased by a well-attenuated carbonation; a vague salty accent announces hoppiness, but passes through a soft, very bready, even somewhat biscuity malt flavour; the hoppiness, established by the three classic C-hops Centennial, Columbus and Cascade then blossoms in the finish, resiny, spicy, citrussy, notably piney, with an explicitly drying and bittering effect, very long and very quenching. Exemplary APA, less ’agressive’ than your average modern-day American style IPA with more bready malt sweetness coming through. I would recommend this as a perfect introduction to the APA style, and the can proves its point: the beer was canned fourteen months ago and I am eager to assume it would have been too ’old’ and weak in aroma if it had been simply bottled, but in this vessel, it has kept an unexpectedly large amount of its delicate hop fragrance.  I guess canned IPAs can be stored longer than bottled IPAs then, but I have yet to gain more experience with this.  Time to experiment!", "HOPS very hoppy taste and aroma. From start to finish its pretty smooth with a bit of an after taste that lingers.", "Surprisingly enough coming from a can it’s pretty good! It’s not as good as some pale ales i’ve had, but it comes through. I would buy it again! Check out my full video review of this beer at youtube.com/shaftyfingers", "On tap at Cork and Cask. Pours an amber color with white head. Citrus, piney, hoppy aromas. Piney, citrus hop flavors with a strong caramel backbone. A classic pale ale.", "Can. Poured a clear, sparkly, orange color with small foamy white head. Aromas come out with pine and citrus. Flavor follows the nose exactly and is nice and hoppy with lots of grapefruit present and hints of lemon. Light body, thin and smooth texture, lively carbonation. Super smooth finish with a little bitterness. Awesome beer and crushable. I don’t why it took me so long to try this.", "Can from The Tuckaway, Raymond NH. Aroma is mild bready malts. Appearance is crystal clear copper brown with nice sparkle, 1 finger-width creamy white head with good retention and nice foamy lacing. Taste is rich, malty, moderate sweetness. Palate is medium bodied, velvety creamy texture, with hint of carbonation bite to the tongue and mildly bitter, long finish. Overall, a taste that far exceeds its aroma, with a gorgeous look and nice palate. Not complex, but very good at what it does.", "Bottle. Pour is gold with a thin head, aroma is fruity, sweet. Taste is light fruity, sweet, minimally bitter. Tasty", "Can from systemet in Uddevalla, one of the regulars in Sweden:) Fresh, crisp and hoppy, love it!", "Pours golden amber with thin, quickly dissolving head. Aroma is very faint. Some hops and a little pine, but surprisingly how little there is. Taste is big and bold and makes up for it. Bitter and strong up front, fading after the sip to that subtle citrus sweetness that’s the trademark of a good IPA. Not as good as their Deviant Dale’s tallboy offering, but I like it.", "This pours a semi-clear amber color with a slight off-white head. The aroma is hoppy with a touch of bready malts. The taste has hint of pine, citrus, and grapefruit giving it dry taste. Very tasty and well made, a nice flag ship beer.", "Pours a bronze colour with an offwhite head. Aroma is malts and caramel. Taste is caramel, malt sweetness, grapefruit, slight orange and a hint of bitterness.", "Can; pours clear amber with an off white head; aroma is malty with some pine and citrus fruits; taste is bittersweet with malt, caramel, and some grapefruit and pine notes; finish is dry with a hoppy bitterness; nice APA", "Can. Golden brown with a white foam. Aromas are toasted multigrain with dusty yeast and lemon. Woody pine with grapefruit and herbs. Flavours are tropical fruit with woody pine and bready yeast. Dry to finish. Decent but not great.", "Can. My first from this brewery. Slightly hoppy. Bitterness builds up leaving a gentle bitter aftertaste.. Not as powerful as I expected but a reasonable if not very exciting example of this style.", "ładny cytrusowy aromat, trochę owoców tropikalnych. Piwo mętne, kiepska piana, ciemny bursztyn. W smaku raczej wytrawne, fajna goryczka. Dość krótka ale zdecydowana. Orzeźwiające, bardzo pijalne.", "Drink in can from Ølbutikken. Pours a totally clear golden with a big, white, long lasting head. Aroma is very earthy, old malts, old hops, grass, resin. Taste is sweet and old malty, some hoppy bitterness, medium high carbonation, crisp body. Fine despite being old..", "Can from Systembolaget. Big, thick, white head. Amber body. Smells of citrus, wheat, caramel, metal. Tastes sweet and very bitter, very hoppy, citrus. Mostly bitter aftertaste.", "12fl oz can poured into a pint glass. Deep bronze with a fair amount of off white head. Aroma is honey graham crackers. Flavor is not much different, heavy on the sweet malt. Decent, quaffable. \n\n---Rated via Beer Buddy for iPhone", "From 0,355l can, Pours light hazy golden liquid, medium frothy white head, Aroma: nice malty, toasty, pine, citrus, grapefruit, pineapple, Taste: light to medium sweet, medium bitter, dry, malty, toasty, light caramel, grapefruit, resin, Palate: medium body, creamy to oily texture, average to lively carbonation, long bitter toasty finish, Overall: very good, well balanced, nice toasty body, really bitter, enjoyed.", "Aroma is grapefruit, rich malts , caramel, lemon grass. Taste is grapefruit and sweet malts. Finishes smooth , good session beer. Appearance is caramel slightly hazy body with a thin pearl head that retains fairly poorly.", "Can. Pours a clear dark golden producing a medium fluffy head. Grassy aroma with a solid maltyness as well. Hints of citrus, pine and resin. Taste is well-balanced. Light sweet rounded nicely off with a pleasant bitter finish. \r\nHighly drinkable, crisp on the palate. Medium-light bodied, avg co2.", "Taste this 12.05.’15 @ Bougondisch Kruis, blindtasting with other Ipa’s. Clear amber-copper color, with a darkwhite head. \r\nAroma: sweets, hops, caramel. Medium body. \r\nTaste: little sweet, cheese, yeast, soft fruits, hopbitterness.\r\nNot bad.", "Tropical fruits, malts, resin, bread and herbs in the aroma. Amber with a off-white head. Medium sweet and medium + bitter. Medium body with a average to soft carbonation. Overall quite a nice refreshing APA, but would perhaps like a little bit more fruit sweetness.", "Tap@rattlenhum,nyc. Aroma has tropical fruits, malt, some earthy elements. Taste is somewhat bitter with long nice aftertaste. Flavors of grape, tropical fruits, malt, caramel.", "Can from lescar, sheffield. Rosy amber with lacy white head. Aroma is bready and malty with full and treacley resiny hops. Taste is sweet and bitter in equal measure. Medium carbonation with a nice oily medium body. Very very nice, graphics on the can look garbage though.", "Aroma earth and a bit of spice, taste is, herbs, earthy, clove, and a little citrus hops, pretty good stuff", "DATE TASTED: May 9, 2015... GLASSWARE: Kisatsky Tavern pint... OCCASION: settling in after celebrating Will’s First Holy Communion... APPEARANCE: a handsome two-thirds pint glass of orange amber clarity and one-third thick, pillowed snow-white mountainous head; lacings are legitimate and thick; ... AROMA: definite malty base to build around; some caramel; some grainy, earthy tones; Centennial’s light hops suggest a flower bed...PALATE: a medium-bodied, textured mouthfeel--surprisingly balanced, with ample action at the teeth and the tongue; aftertaste despite its subtle flavors; thick texture with average carbonation... TASTE: some citrus early, but much more floral aspects throughout; again, BIG uncanny balance of malt and hop... OVERALL: at long last, Dale’s Pale Ale is in the books, and rewardingly too; unlike many/most modern American pales, this one packs a malty punch that keeps the pitchiness of the hops in check--a beer worth sipping or sessioning...", "Crisp brilliant and seemingly tightly filtered this delicioss refreshing beer yields a clean whippy head. Texture is biscuity and with a light gentle sappiness. Very fine.", "From can into a pint glass. Pours mostly clear gold copper color with medium sized off-white head. Nose has pine, grapefruit, caramel. Medium-light body, medium carbonation, medium sweetness, light bitterness. Hints of grapefruit on the finish. Drinkable, balanced, nice, a go-to.", "Can, did want to try this for a long time, but’s sadly it wasn’t fresh at all. Pours clear golden with small off-white head. Malty, dank hops, subtle piny notes. Taste is malty, grains, caramel, subtle citrus, fainted hops. Medium bitter finish. Caramel and dank hops.", "From the stovepipe big can now selling for $3-. Nice mix of hops, goes down smooth and easy. I’ve had this a number of times over the past couple years, but now that it comes in this new big can I will probably buy more often. Makes a nice side car when a 6-pack just isn’t enough.", "Look; standing light tan foam, amber golden clear body, fluffy rings as lacing.\r\nAroma; citrus, hops, grass, dust, bread.\r\nTaste; citrus, malts, hops, bread, syrup.\r\nSomewhat sticky. Finishes with hops and roasted malts. Not bad. Quite ok, especially along with grilled meat or hot salty spicy snacks.\r\n[33cl can abv6.5% B@Systembolaget BB260715]", "Can @ ølbutikken. Pours clear amber with an off white head. Aroma is pretty malty with notes of earthyness, sweet resin, caramel and some herby grassy hops. The taste is also very sweet and malty with notes of caramel, sweet resin, weak bitter hops and some oxidation. Would love to try fresh...", "Can. Pours clear dark orange with a thick offwhite head. Aromas of malt, earthy notes, resin, citrus, hops. Taste is malty as fuck, citrus, dry, resin, orange peel, hops. I dont know how old this was, but my guess is pretty fucking old."]}